; ModuleID = 'build/arduino_mkrzero/drivers/watchdog/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.wdt_timeout_cfg = type { %struct.wdt_window, void (%struct.device*, i32)*, i8 }
%struct.wdt_window = type { i32, i32 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.1, i8*, i32 }
%union.anon.1 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.18 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.1 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/watchdog/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/watchdog")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/watchdog")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!26 = distinct !DIGlobalVariable(name: "handled_event", scope: !27, file: !28, line: 56, type: !50, isLocal: true, isDefinition: true)
!27 = distinct !DISubprogram(name: "wdt_callback", scope: !28, file: !28, line: 54, type: !29, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !60, retainedNodes: !182)
!28 = !DIFile(filename: "zephyr/samples/drivers/watchdog/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !59}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !34, line: 378, size: 192, elements: !35)
!34 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!35 = !{!36, !40, !41, !42, !51, !53}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !34, line: 380, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !33, file: !34, line: 382, baseType: !13, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !33, file: !34, line: 384, baseType: !13, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !33, file: !34, line: 386, baseType: !43, size: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !34, line: 351, size: 16, elements: !45)
!45 = !{!46, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !44, file: !34, line: 359, baseType: !47, size: 8)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !48)
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !44, file: !34, line: 364, baseType: !50, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!50 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !34, line: 388, baseType: !52, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !33, file: !34, line: 396, baseType: !54, size: 32, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !34, line: 43, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !58)
!58 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = distinct !DICompileUnit(language: DW_LANG_C99, file: !61, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !134, globals: !180, splitDebugInlining: false, nameTableKind: None)
!61 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/watchdog/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/watchdog")
!62 = !{!63}
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !64, line: 27, baseType: !65, size: 32, elements: !66)
!64 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!67 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!68 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!69 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!70 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!71 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!72 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!73 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!74 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!75 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!76 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!77 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!78 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!79 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!80 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!81 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!82 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!83 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!125 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!126 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!127 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!128 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!129 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!130 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!131 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!132 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!133 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!134 = !{!135, !52, !59, !139, !167, !178}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !136, line: 46, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !138)
!138 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !142, line: 134, size: 128, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !149, !154, !173}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !141, file: !142, line: 135, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !142, line: 113, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{!59, !31, !47}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !141, file: !142, line: 136, baseType: !150, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !142, line: 119, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DISubroutineType(types: !153)
!153 = !{!59, !31}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !141, file: !142, line: 137, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !142, line: 125, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!59, !31, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !142, line: 88, size: 128, elements: !162)
!162 = !{!163, !169, !172}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !161, file: !142, line: 90, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !142, line: 72, size: 64, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !164, file: !142, line: 74, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !65)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !164, file: !142, line: 76, baseType: !167, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !161, file: !142, line: 92, baseType: !170, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !142, line: 85, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !142, line: 104, baseType: !47, size: 8, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !141, file: !142, line: 138, baseType: !174, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !142, line: 132, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DISubroutineType(types: !177)
!177 = !{!59, !31, !59}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !179)
!179 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!180 = !{!181}
!181 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!182 = !{!183, !184}
!183 = !DILocalVariable(name: "wdt_dev", arg: 1, scope: !27, file: !28, line: 54, type: !31)
!184 = !DILocalVariable(name: "channel_id", arg: 2, scope: !27, file: !28, line: 54, type: !59)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !187, file: !257, line: 18, type: !259, isLocal: false, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !196, globals: !254, splitDebugInlining: false, nameTableKind: None)
!188 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/watchdog")
!189 = !{!190}
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !191, line: 121, baseType: !65, size: 32, elements: !192)
!191 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!192 = !{!193, !194, !195}
!193 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!194 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!195 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!196 = !{!22, !52, !24, !197, !199, !201, !202, !59, !204, !205, !207, !208, !209, !210, !211, !213, !225, !47, !226, !167, !37}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !203, line: 214, baseType: !65)
!203 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !212)
!212 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !215, line: 78, size: 32, elements: !216)
!215 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!216 = !{!217, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !214, file: !215, line: 80, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !215, line: 45, size: 32, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !218, file: !215, line: 47, baseType: !47, size: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !218, file: !215, line: 50, baseType: !47, size: 8, offset: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !218, file: !215, line: 53, baseType: !47, size: 8, offset: 16)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !218, file: !215, line: 56, baseType: !47, size: 8, offset: 24)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !214, file: !215, line: 82, baseType: !52, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !191, line: 88, size: 128, elements: !228)
!228 = !{!229, !246, !250}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !227, file: !191, line: 89, baseType: !230, size: 96)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !191, line: 66, size: 96, elements: !231)
!231 = !{!232, !243, !244}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !230, file: !191, line: 67, baseType: !233, size: 32)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !191, line: 51, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !233, file: !191, line: 52, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !233, file: !191, line: 52, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !191, line: 52, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !233, file: !191, line: 53, baseType: !167, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !233, file: !191, line: 54, baseType: !167, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !233, file: !191, line: 55, baseType: !167, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !233, file: !191, line: 56, baseType: !167, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !233, file: !191, line: 57, baseType: !167, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !230, file: !191, line: 75, baseType: !13, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !230, file: !191, line: 76, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !191, line: 35, baseType: !167)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !227, file: !191, line: 93, baseType: !247, size: 32, offset: 96)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 4)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !227, file: !191, line: 94, baseType: !251, offset: 128)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: -1)
!254 = !{!185, !255}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !187, file: !257, line: 18, type: !258, isLocal: true, isDefinition: true)
!257 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !261, line: 16, size: 64, elements: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !261, line: 17, baseType: !37, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !260, file: !261, line: 18, baseType: !47, size: 8, offset: 32)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "_char_out", scope: !267, file: !271, line: 54, type: !272, isLocal: false, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !269, globals: !270, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/watchdog")
!269 = !{!52, !59}
!270 = !{!265}
!271 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DISubroutineType(types: !274)
!274 = !{!59, !59}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !277, file: !1011, line: 202, type: !1012, isLocal: true, isDefinition: true, align: 32)
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !279, globals: !1010, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/watchdog")
!279 = !{!52, !59, !280, !404, !741, !742, !809}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !282, line: 335, baseType: !283)
!282 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 320, size: 288, elements: !284)
!284 = !{!285, !296, !304, !318, !329, !340, !344, !355, !356, !367, !368, !383, !384, !394}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !283, file: !282, line: 321, baseType: !286, size: 16)
!286 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !282, line: 50, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 43, size: 16, elements: !289)
!289 = !{!290, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !288, file: !282, line: 48, baseType: !291, size: 16)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !282, line: 44, size: 16, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !291, file: !282, line: 45, baseType: !211, size: 7, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !291, file: !282, line: 47, baseType: !211, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !288, file: !282, line: 49, baseType: !211, size: 16)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !283, file: !282, line: 322, baseType: !297, size: 16, offset: 16)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 16, elements: !302)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !299, line: 52, baseType: !300)
!299 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!302 = !{!303}
!303 = !DISubrange(count: 2)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !283, file: !282, line: 323, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !282, line: 107, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 94, size: 32, elements: !308)
!308 = !{!309, !317}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !307, file: !282, line: 105, baseType: !310, size: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !282, line: 95, size: 32, elements: !311)
!311 = !{!312, !313, !314, !315, !316}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !310, file: !282, line: 97, baseType: !167, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !310, file: !282, line: 99, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !310, file: !282, line: 100, baseType: !167, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !310, file: !282, line: 102, baseType: !167, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !310, file: !282, line: 103, baseType: !167, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !307, file: !282, line: 106, baseType: !167, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !283, file: !282, line: 324, baseType: !319, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !282, line: 155, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 148, size: 32, elements: !322)
!322 = !{!323, !328}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !321, file: !282, line: 153, baseType: !324, size: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !321, file: !282, line: 149, size: 32, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !324, file: !282, line: 150, baseType: !167, size: 16, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !324, file: !282, line: 151, baseType: !167, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !321, file: !282, line: 154, baseType: !167, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !283, file: !282, line: 325, baseType: !330, size: 8, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !282, line: 194, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 187, size: 8, elements: !333)
!333 = !{!334, !339}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !332, file: !282, line: 192, baseType: !335, size: 8)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !282, line: 188, size: 8, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !335, file: !282, line: 189, baseType: !47, size: 1, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !335, file: !282, line: 190, baseType: !47, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !332, file: !282, line: 193, baseType: !47, size: 8)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !283, file: !282, line: 326, baseType: !341, size: 24, offset: 104)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 24, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 3)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !283, file: !282, line: 327, baseType: !345, size: 8, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !282, line: 215, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 208, size: 8, elements: !348)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !347, file: !282, line: 213, baseType: !350, size: 8)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !282, line: 209, size: 8, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !350, file: !282, line: 210, baseType: !47, size: 1, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !350, file: !282, line: 211, baseType: !47, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !347, file: !282, line: 214, baseType: !47, size: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !283, file: !282, line: 328, baseType: !341, size: 24, offset: 136)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !283, file: !282, line: 329, baseType: !357, size: 8, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !282, line: 236, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 229, size: 8, elements: !360)
!360 = !{!361, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !359, file: !282, line: 234, baseType: !362, size: 8)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !282, line: 230, size: 8, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !362, file: !282, line: 231, baseType: !300, size: 1, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !362, file: !282, line: 232, baseType: !300, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !359, file: !282, line: 235, baseType: !47, size: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !283, file: !282, line: 330, baseType: !341, size: 24, offset: 168)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !283, file: !282, line: 331, baseType: !369, size: 16, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !282, line: 262, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 250, size: 16, elements: !372)
!372 = !{!373, !382}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !371, file: !282, line: 260, baseType: !374, size: 16)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !282, line: 251, size: 16, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !374, file: !282, line: 252, baseType: !211, size: 1, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !374, file: !282, line: 253, baseType: !211, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !374, file: !282, line: 254, baseType: !211, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !374, file: !282, line: 255, baseType: !211, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !374, file: !282, line: 256, baseType: !211, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !374, file: !282, line: 258, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !371, file: !282, line: 261, baseType: !211, size: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !283, file: !282, line: 332, baseType: !297, size: 16, offset: 208)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !283, file: !282, line: 333, baseType: !385, size: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !282, line: 290, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 284, size: 32, elements: !388)
!388 = !{!389, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !387, file: !282, line: 288, baseType: !390, size: 32)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !282, line: 285, size: 32, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !390, file: !282, line: 286, baseType: !167, size: 22, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !387, file: !282, line: 289, baseType: !167, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !283, file: !282, line: 334, baseType: !395, size: 16, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !282, line: 308, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 303, size: 16, elements: !398)
!398 = !{!399, !403}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !397, file: !282, line: 306, baseType: !400, size: 16)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !397, file: !282, line: 304, size: 16, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !400, file: !282, line: 305, baseType: !211, size: 16, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !397, file: !282, line: 307, baseType: !211, size: 16)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !406, line: 928, baseType: !407)
!406 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 899, size: 672, elements: !408)
!408 = !{!409, !433, !457, !483, !508, !524, !525, !543, !544, !561, !572, !573, !588, !608, !609, !621, !633, !643, !644, !661, !663, !674, !675, !687, !699, !700, !711, !727}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !407, file: !406, line: 900, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !406, line: 64, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 43, size: 32, elements: !413)
!413 = !{!414, !432}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !412, file: !406, line: 62, baseType: !415, size: 32)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !412, file: !406, line: 44, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !415, file: !406, line: 45, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !415, file: !406, line: 46, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !415, file: !406, line: 47, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !415, file: !406, line: 48, baseType: !167, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !415, file: !406, line: 49, baseType: !167, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !415, file: !406, line: 50, baseType: !167, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !415, file: !406, line: 51, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !415, file: !406, line: 52, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !415, file: !406, line: 53, baseType: !167, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !415, file: !406, line: 54, baseType: !167, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !415, file: !406, line: 55, baseType: !167, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !415, file: !406, line: 56, baseType: !167, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !415, file: !406, line: 58, baseType: !167, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !415, file: !406, line: 59, baseType: !167, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !415, file: !406, line: 60, baseType: !167, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !412, file: !406, line: 63, baseType: !167, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !407, file: !406, line: 901, baseType: !434, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !406, line: 125, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 104, size: 32, elements: !437)
!437 = !{!438, !456}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !436, file: !406, line: 123, baseType: !439, size: 32)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !406, line: 105, size: 32, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !439, file: !406, line: 106, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !439, file: !406, line: 107, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !439, file: !406, line: 108, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !439, file: !406, line: 109, baseType: !167, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !439, file: !406, line: 110, baseType: !167, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !439, file: !406, line: 111, baseType: !167, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !439, file: !406, line: 112, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !439, file: !406, line: 113, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !439, file: !406, line: 114, baseType: !167, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !439, file: !406, line: 115, baseType: !167, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !439, file: !406, line: 116, baseType: !167, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !439, file: !406, line: 117, baseType: !167, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !439, file: !406, line: 119, baseType: !167, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !439, file: !406, line: 120, baseType: !167, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !439, file: !406, line: 121, baseType: !167, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !436, file: !406, line: 124, baseType: !167, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !407, file: !406, line: 902, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !406, line: 186, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 165, size: 32, elements: !461)
!461 = !{!462, !482}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !460, file: !406, line: 184, baseType: !463, size: 32)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !406, line: 166, size: 32, elements: !464)
!464 = !{!465, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !463, file: !406, line: 167, baseType: !466, size: 1, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !463, file: !406, line: 168, baseType: !466, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !463, file: !406, line: 169, baseType: !466, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !463, file: !406, line: 170, baseType: !466, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !463, file: !406, line: 171, baseType: !466, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !463, file: !406, line: 172, baseType: !466, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !463, file: !406, line: 173, baseType: !466, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !463, file: !406, line: 174, baseType: !466, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !463, file: !406, line: 175, baseType: !466, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !463, file: !406, line: 176, baseType: !466, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !463, file: !406, line: 177, baseType: !466, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !463, file: !406, line: 178, baseType: !466, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !463, file: !406, line: 180, baseType: !466, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !463, file: !406, line: 181, baseType: !466, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !463, file: !406, line: 182, baseType: !466, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !460, file: !406, line: 185, baseType: !167, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !407, file: !406, line: 903, baseType: !484, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !406, line: 247, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 226, size: 32, elements: !488)
!488 = !{!489, !507}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !487, file: !406, line: 245, baseType: !490, size: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !406, line: 227, size: 32, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !490, file: !406, line: 228, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !490, file: !406, line: 229, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !490, file: !406, line: 230, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !490, file: !406, line: 231, baseType: !167, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !490, file: !406, line: 232, baseType: !167, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !490, file: !406, line: 233, baseType: !167, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !490, file: !406, line: 234, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !490, file: !406, line: 235, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !490, file: !406, line: 236, baseType: !167, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !490, file: !406, line: 237, baseType: !167, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !490, file: !406, line: 238, baseType: !167, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !490, file: !406, line: 239, baseType: !167, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !490, file: !406, line: 241, baseType: !167, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !490, file: !406, line: 242, baseType: !167, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !490, file: !406, line: 243, baseType: !167, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !487, file: !406, line: 246, baseType: !167, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !407, file: !406, line: 904, baseType: !509, size: 16, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !406, line: 300, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 287, size: 16, elements: !512)
!512 = !{!513, !523}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !511, file: !406, line: 298, baseType: !514, size: 16)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !511, file: !406, line: 288, size: 16, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !514, file: !406, line: 290, baseType: !211, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !514, file: !406, line: 291, baseType: !211, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !514, file: !406, line: 293, baseType: !211, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !514, file: !406, line: 294, baseType: !211, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !514, file: !406, line: 295, baseType: !211, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !514, file: !406, line: 296, baseType: !211, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !514, file: !406, line: 297, baseType: !211, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !511, file: !406, line: 299, baseType: !211, size: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !407, file: !406, line: 905, baseType: !297, size: 16, offset: 144)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !407, file: !406, line: 906, baseType: !526, size: 16, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !406, line: 352, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 336, size: 16, elements: !529)
!529 = !{!530, !542}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !528, file: !406, line: 350, baseType: !531, size: 16)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !528, file: !406, line: 337, size: 16, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !531, file: !406, line: 339, baseType: !211, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !531, file: !406, line: 340, baseType: !211, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !531, file: !406, line: 341, baseType: !211, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !531, file: !406, line: 342, baseType: !211, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !531, file: !406, line: 343, baseType: !211, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !531, file: !406, line: 344, baseType: !211, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !531, file: !406, line: 345, baseType: !211, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !531, file: !406, line: 346, baseType: !211, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !531, file: !406, line: 348, baseType: !211, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !528, file: !406, line: 351, baseType: !211, size: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !407, file: !406, line: 907, baseType: !297, size: 16, offset: 176)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !407, file: !406, line: 908, baseType: !545, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !406, line: 398, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 381, size: 32, elements: !548)
!548 = !{!549, !560}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !547, file: !406, line: 396, baseType: !550, size: 32)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !406, line: 382, size: 32, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !550, file: !406, line: 384, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !550, file: !406, line: 385, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !550, file: !406, line: 386, baseType: !167, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !550, file: !406, line: 388, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !550, file: !406, line: 389, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !550, file: !406, line: 390, baseType: !167, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !550, file: !406, line: 392, baseType: !167, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !550, file: !406, line: 394, baseType: !167, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !547, file: !406, line: 397, baseType: !167, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !407, file: !406, line: 909, baseType: !562, size: 8, offset: 224)
!562 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !406, line: 433, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 426, size: 8, elements: !565)
!565 = !{!566, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !564, file: !406, line: 431, baseType: !567, size: 8)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !406, line: 427, size: 8, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !567, file: !406, line: 428, baseType: !47, size: 5, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !567, file: !406, line: 430, baseType: !47, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !564, file: !406, line: 432, baseType: !47, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !407, file: !406, line: 910, baseType: !341, size: 24, offset: 232)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !407, file: !406, line: 911, baseType: !574, size: 32, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !406, line: 462, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 448, size: 32, elements: !577)
!577 = !{!578, !587}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !576, file: !406, line: 460, baseType: !579, size: 32)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !406, line: 449, size: 32, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !579, file: !406, line: 451, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !579, file: !406, line: 453, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !579, file: !406, line: 454, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !579, file: !406, line: 455, baseType: !167, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !579, file: !406, line: 457, baseType: !167, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !579, file: !406, line: 459, baseType: !167, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !576, file: !406, line: 461, baseType: !167, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !407, file: !406, line: 912, baseType: !589, size: 16, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !406, line: 520, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 503, size: 16, elements: !592)
!592 = !{!593, !607}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !591, file: !406, line: 518, baseType: !594, size: 16)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !591, file: !406, line: 504, size: 16, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !594, file: !406, line: 506, baseType: !211, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !594, file: !406, line: 507, baseType: !211, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !594, file: !406, line: 508, baseType: !211, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !594, file: !406, line: 509, baseType: !211, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !594, file: !406, line: 510, baseType: !211, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !594, file: !406, line: 511, baseType: !211, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !594, file: !406, line: 512, baseType: !211, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !594, file: !406, line: 513, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !594, file: !406, line: 514, baseType: !211, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !594, file: !406, line: 515, baseType: !211, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !594, file: !406, line: 516, baseType: !211, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !591, file: !406, line: 519, baseType: !211, size: 16)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !407, file: !406, line: 913, baseType: !297, size: 16, offset: 304)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !407, file: !406, line: 914, baseType: !610, size: 32, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !406, line: 559, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 552, size: 32, elements: !613)
!613 = !{!614, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !612, file: !406, line: 557, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !406, line: 553, size: 32, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !615, file: !406, line: 554, baseType: !167, size: 10, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !615, file: !406, line: 555, baseType: !167, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !615, file: !406, line: 556, baseType: !167, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !612, file: !406, line: 558, baseType: !167, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !407, file: !406, line: 915, baseType: !622, size: 32, offset: 352)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !406, line: 585, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 578, size: 32, elements: !625)
!625 = !{!626, !632}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !624, file: !406, line: 583, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !406, line: 579, size: 32, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !627, file: !406, line: 580, baseType: !167, size: 16, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !627, file: !406, line: 581, baseType: !167, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !627, file: !406, line: 582, baseType: !167, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !624, file: !406, line: 584, baseType: !167, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !407, file: !406, line: 916, baseType: !634, size: 8, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !406, line: 610, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 604, size: 8, elements: !637)
!637 = !{!638, !642}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !636, file: !406, line: 608, baseType: !639, size: 8)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !636, file: !406, line: 605, size: 8, elements: !640)
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !639, file: !406, line: 607, baseType: !47, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !636, file: !406, line: 609, baseType: !47, size: 8)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !407, file: !406, line: 917, baseType: !341, size: 24, offset: 392)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !407, file: !406, line: 918, baseType: !645, size: 32, offset: 416)
!645 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !406, line: 639, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 622, size: 32, elements: !648)
!648 = !{!649, !660}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !647, file: !406, line: 637, baseType: !650, size: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !406, line: 623, size: 32, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !650, file: !406, line: 625, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !650, file: !406, line: 626, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !650, file: !406, line: 627, baseType: !167, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !650, file: !406, line: 629, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !650, file: !406, line: 631, baseType: !167, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !650, file: !406, line: 632, baseType: !167, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !650, file: !406, line: 634, baseType: !167, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !650, file: !406, line: 635, baseType: !167, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !647, file: !406, line: 638, baseType: !167, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !407, file: !406, line: 919, baseType: !662, size: 32, offset: 448)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 32, elements: !248)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !407, file: !406, line: 920, baseType: !664, size: 16, offset: 480)
!664 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !406, line: 715, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 706, size: 16, elements: !667)
!667 = !{!668, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !666, file: !406, line: 713, baseType: !669, size: 16)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !666, file: !406, line: 707, size: 16, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !669, file: !406, line: 709, baseType: !211, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !669, file: !406, line: 711, baseType: !211, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !666, file: !406, line: 714, baseType: !211, size: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !407, file: !406, line: 921, baseType: !297, size: 16, offset: 496)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !407, file: !406, line: 922, baseType: !676, size: 32, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !406, line: 739, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 729, size: 32, elements: !679)
!679 = !{!680, !686}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !678, file: !406, line: 737, baseType: !681, size: 32)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !406, line: 730, size: 32, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !681, file: !406, line: 732, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !681, file: !406, line: 733, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !681, file: !406, line: 735, baseType: !167, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !678, file: !406, line: 738, baseType: !167, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !407, file: !406, line: 923, baseType: !688, size: 8, offset: 544)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !406, line: 765, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 756, size: 8, elements: !691)
!691 = !{!692, !698}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !690, file: !406, line: 763, baseType: !693, size: 8)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !690, file: !406, line: 757, size: 8, elements: !694)
!694 = !{!695, !696, !697}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !693, file: !406, line: 759, baseType: !47, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !693, file: !406, line: 761, baseType: !47, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !693, file: !406, line: 762, baseType: !47, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !690, file: !406, line: 764, baseType: !47, size: 8)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !407, file: !406, line: 924, baseType: !341, size: 24, offset: 552)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !407, file: !406, line: 925, baseType: !701, size: 32, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !406, line: 789, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 781, size: 32, elements: !704)
!704 = !{!705, !710}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !703, file: !406, line: 787, baseType: !706, size: 32)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !703, file: !406, line: 782, size: 32, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !706, file: !406, line: 783, baseType: !167, size: 12, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !706, file: !406, line: 785, baseType: !167, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !703, file: !406, line: 788, baseType: !167, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !407, file: !406, line: 926, baseType: !712, size: 32, offset: 608)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !406, line: 820, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 805, size: 32, elements: !715)
!715 = !{!716, !726}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !406, line: 818, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !406, line: 806, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !717, file: !406, line: 807, baseType: !167, size: 2, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !717, file: !406, line: 808, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !717, file: !406, line: 809, baseType: !167, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !717, file: !406, line: 810, baseType: !167, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !717, file: !406, line: 812, baseType: !167, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !717, file: !406, line: 814, baseType: !167, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !717, file: !406, line: 816, baseType: !167, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !406, line: 819, baseType: !167, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !407, file: !406, line: 927, baseType: !728, size: 8, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !406, line: 881, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 872, size: 8, elements: !732)
!732 = !{!733, !740}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !731, file: !406, line: 879, baseType: !734, size: 8)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !406, line: 873, size: 8, elements: !735)
!735 = !{!736, !737, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !734, file: !406, line: 874, baseType: !47, size: 1, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !734, file: !406, line: 875, baseType: !47, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !734, file: !406, line: 876, baseType: !47, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !734, file: !406, line: 877, baseType: !47, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !731, file: !406, line: 880, baseType: !47, size: 8)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !744, line: 290, baseType: !745)
!744 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !744, line: 284, size: 96, elements: !746)
!746 = !{!747, !757, !768, !781, !798}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !745, file: !744, line: 285, baseType: !748, size: 8)
!748 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !744, line: 49, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 43, size: 8, elements: !751)
!751 = !{!752, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !750, file: !744, line: 47, baseType: !753, size: 8)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !750, file: !744, line: 44, size: 8, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !753, file: !744, line: 45, baseType: !47, size: 1, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !750, file: !744, line: 48, baseType: !47, size: 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !745, file: !744, line: 286, baseType: !758, size: 8, offset: 8)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !744, line: 67, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 61, size: 8, elements: !762)
!762 = !{!763, !767}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !761, file: !744, line: 65, baseType: !764, size: 8)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !761, file: !744, line: 62, size: 8, elements: !765)
!765 = !{!766}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !764, file: !744, line: 64, baseType: !47, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !761, file: !744, line: 66, baseType: !47, size: 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !745, file: !744, line: 287, baseType: !769, size: 16, offset: 16)
!769 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !744, line: 89, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 79, size: 16, elements: !772)
!772 = !{!773, !780}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !771, file: !744, line: 87, baseType: !774, size: 16)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !771, file: !744, line: 80, size: 16, elements: !775)
!775 = !{!776, !777, !778, !779}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !774, file: !744, line: 81, baseType: !211, size: 6, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !774, file: !744, line: 83, baseType: !211, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !774, file: !744, line: 85, baseType: !211, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !774, file: !744, line: 86, baseType: !211, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !771, file: !744, line: 88, baseType: !211, size: 16)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !745, file: !744, line: 288, baseType: !782, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !744, line: 214, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 199, size: 32, elements: !785)
!785 = !{!786, !797}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !784, file: !744, line: 212, baseType: !787, size: 32)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !784, file: !744, line: 200, size: 32, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !787, file: !744, line: 201, baseType: !167, size: 4, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !787, file: !744, line: 203, baseType: !167, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !787, file: !744, line: 205, baseType: !167, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !787, file: !744, line: 206, baseType: !167, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !787, file: !744, line: 207, baseType: !167, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !787, file: !744, line: 208, baseType: !167, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !787, file: !744, line: 209, baseType: !167, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !787, file: !744, line: 210, baseType: !167, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !784, file: !744, line: 213, baseType: !167, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !745, file: !744, line: 289, baseType: !799, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !744, line: 268, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 260, size: 32, elements: !802)
!802 = !{!803, !808}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !801, file: !744, line: 266, baseType: !804, size: 32)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !801, file: !744, line: 261, size: 32, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !804, file: !744, line: 262, baseType: !167, size: 4, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !804, file: !744, line: 264, baseType: !167, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !801, file: !744, line: 267, baseType: !167, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !811, line: 513, baseType: !812)
!811 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !811, line: 494, size: 480, elements: !813)
!813 = !{!814, !820, !830, !834, !844, !854, !864, !874, !878, !894, !910, !926, !956, !960, !970, !980, !990, !994}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !812, file: !811, line: 495, baseType: !815, size: 8)
!815 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !811, line: 45, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 43, size: 8, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !817, file: !811, line: 44, baseType: !47, size: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !812, file: !811, line: 496, baseType: !821, size: 8, offset: 8)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !811, line: 61, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 55, size: 8, elements: !824)
!824 = !{!825, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !823, file: !811, line: 59, baseType: !826, size: 8)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !811, line: 56, size: 8, elements: !827)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !826, file: !811, line: 57, baseType: !47, size: 2, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !823, file: !811, line: 60, baseType: !47, size: 8)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !812, file: !811, line: 497, baseType: !831, size: 48, offset: 16)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 48, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 6)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !812, file: !811, line: 498, baseType: !835, size: 8, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !811, line: 86, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 80, size: 8, elements: !838)
!838 = !{!839, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !837, file: !811, line: 84, baseType: !840, size: 8)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !837, file: !811, line: 81, size: 8, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !840, file: !811, line: 82, baseType: !47, size: 3, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !837, file: !811, line: 85, baseType: !47, size: 8)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !812, file: !811, line: 499, baseType: !845, size: 8, offset: 72)
!845 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !811, line: 121, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 115, size: 8, elements: !848)
!848 = !{!849, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !847, file: !811, line: 119, baseType: !850, size: 8)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !811, line: 116, size: 8, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !850, file: !811, line: 117, baseType: !47, size: 3, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !847, file: !811, line: 120, baseType: !47, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !812, file: !811, line: 500, baseType: !855, size: 8, offset: 80)
!855 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !811, line: 156, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 150, size: 8, elements: !858)
!858 = !{!859, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !857, file: !811, line: 154, baseType: !860, size: 8)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !857, file: !811, line: 151, size: 8, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !860, file: !811, line: 152, baseType: !47, size: 3, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !857, file: !811, line: 155, baseType: !47, size: 8)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !812, file: !811, line: 501, baseType: !865, size: 8, offset: 88)
!865 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !811, line: 191, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 185, size: 8, elements: !868)
!868 = !{!869, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !867, file: !811, line: 189, baseType: !870, size: 8)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !811, line: 186, size: 8, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !870, file: !811, line: 187, baseType: !47, size: 3, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !867, file: !811, line: 190, baseType: !47, size: 8)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !812, file: !811, line: 502, baseType: !875, size: 64, offset: 96)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 64, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 8)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !812, file: !811, line: 503, baseType: !879, size: 32, offset: 160)
!879 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !811, line: 232, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 220, size: 32, elements: !882)
!882 = !{!883, !893}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !881, file: !811, line: 230, baseType: !884, size: 32)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !881, file: !811, line: 221, size: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !884, file: !811, line: 222, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !884, file: !811, line: 223, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !884, file: !811, line: 224, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !884, file: !811, line: 225, baseType: !167, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !884, file: !811, line: 226, baseType: !167, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !884, file: !811, line: 227, baseType: !167, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !884, file: !811, line: 228, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !881, file: !811, line: 231, baseType: !167, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !812, file: !811, line: 504, baseType: !895, size: 32, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !811, line: 268, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 256, size: 32, elements: !898)
!898 = !{!899, !909}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !897, file: !811, line: 266, baseType: !900, size: 32)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !811, line: 257, size: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !900, file: !811, line: 258, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !900, file: !811, line: 259, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !900, file: !811, line: 260, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !900, file: !811, line: 261, baseType: !167, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !900, file: !811, line: 262, baseType: !167, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !900, file: !811, line: 263, baseType: !167, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !900, file: !811, line: 264, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !897, file: !811, line: 267, baseType: !167, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !812, file: !811, line: 505, baseType: !911, size: 32, offset: 224)
!911 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !811, line: 304, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 292, size: 32, elements: !914)
!914 = !{!915, !925}
