; ModuleID = 'build/actinius_icarus_bee_ns/jesd216/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.jesd216_param_header = type { i8, i8, i8, i8, [3 x i8], i8 }
%struct.jesd216_bfp = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, [0 x i32] }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "extractor", scope: !27, file: !234, line: 227, type: !281, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !119, globals: !230, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/jesd216/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!29 = !{!30, !101}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "jesd216_mode_type", file: !102, line: 229, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/drivers/flash/jesd216.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!104 = !DIEnumerator(name: "JESD216_MODE_044", value: 0)
!105 = !DIEnumerator(name: "JESD216_MODE_088", value: 1)
!106 = !DIEnumerator(name: "JESD216_MODE_111", value: 2)
!107 = !DIEnumerator(name: "JESD216_MODE_112", value: 3)
!108 = !DIEnumerator(name: "JESD216_MODE_114", value: 4)
!109 = !DIEnumerator(name: "JESD216_MODE_118", value: 5)
!110 = !DIEnumerator(name: "JESD216_MODE_122", value: 6)
!111 = !DIEnumerator(name: "JESD216_MODE_144", value: 7)
!112 = !DIEnumerator(name: "JESD216_MODE_188", value: 8)
!113 = !DIEnumerator(name: "JESD216_MODE_222", value: 9)
!114 = !DIEnumerator(name: "JESD216_MODE_444", value: 10)
!115 = !DIEnumerator(name: "JESD216_MODE_44D4D", value: 11)
!116 = !DIEnumerator(name: "JESD216_MODE_888", value: 12)
!117 = !DIEnumerator(name: "JESD216_MODE_8D8D8D", value: 13)
!118 = !DIEnumerator(name: "JESD216_MODE_LIMIT", value: 14)
!119 = !{!120, !121, !137, !138, !139, !224, !179, !101, !226, !228}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jesd216_bfp", file: !102, line: 133, size: 288, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dw1", scope: !122, file: !102, line: 134, baseType: !120, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dw2", scope: !122, file: !102, line: 135, baseType: !120, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dw3", scope: !122, file: !102, line: 136, baseType: !120, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dw4", scope: !122, file: !102, line: 137, baseType: !120, size: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "dw5", scope: !122, file: !102, line: 138, baseType: !120, size: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dw6", scope: !122, file: !102, line: 139, baseType: !120, size: 32, offset: 160)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dw7", scope: !122, file: !102, line: 140, baseType: !120, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "dw8", scope: !122, file: !102, line: 141, baseType: !120, size: 32, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dw9", scope: !122, file: !102, line: 142, baseType: !120, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dw10", scope: !122, file: !102, line: 143, baseType: !134, offset: 288)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: -1)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!138 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flash_driver_api", file: !142, line: 129, size: 224, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/drivers/flash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !181, !186, !191, !203, !216, !218}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !141, file: !142, line: 130, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_read", file: !142, line: 71, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{!138, !149, !176, !137, !179}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !153)
!152 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!153 = !{!154, !158, !159, !160, !169, !170}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !152, line: 380, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !151, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !151, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !151, file: !152, line: 386, baseType: !161, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !163)
!163 = !{!164, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !162, file: !152, line: 359, baseType: !165, size: 8)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !166)
!166 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !162, file: !152, line: 364, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!168 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !152, line: 388, baseType: !137, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !151, file: !152, line: 396, baseType: !171, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !152, line: 43, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !175)
!175 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !177, line: 36, baseType: !178)
!177 = !DIFile(filename: "zephyr/lib/libc/minimal/include/sys/types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !180, line: 214, baseType: !32)
!180 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !141, file: !142, line: 131, baseType: !182, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_write", file: !142, line: 82, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!138, !149, !176, !13, !179}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !141, file: !142, line: 132, baseType: !187, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_erase", file: !142, line: 93, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!138, !149, !176, !179}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "get_parameters", scope: !141, file: !142, line: 133, baseType: !192, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_get_parameters", file: !142, line: 96, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !149}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flash_parameters", file: !142, line: 57, size: 64, elements: !199)
!199 = !{!200, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "write_block_size", scope: !198, file: !142, line: 58, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "erase_value", scope: !198, file: !142, line: 59, baseType: !165, size: 8, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "page_layout", scope: !141, file: !142, line: 135, baseType: !204, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_pages_layout", file: !142, line: 120, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !149, !208, !215}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flash_pages_layout", file: !142, line: 35, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pages_count", scope: !211, file: !142, line: 36, baseType: !179, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pages_size", scope: !211, file: !142, line: 37, baseType: !179, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sfdp_read", scope: !141, file: !142, line: 138, baseType: !217, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_sfdp_read", file: !142, line: 125, baseType: !146)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "read_jedec_id", scope: !141, file: !142, line: 139, baseType: !219, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_read_jedec_id", file: !142, line: 127, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{!138, !149, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !225)
!225 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !227)
!227 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!230 = !{!25, !231, !274, !276}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "addr_bytes", scope: !233, file: !234, line: 53, type: !270, isLocal: true, isDefinition: true)
!233 = distinct !DISubprogram(name: "summarize_dw1", scope: !234, file: !234, line: 45, type: !235, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !252)
!234 = !DIFile(filename: "zephyr/samples/drivers/jesd216/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237, !250}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jesd216_param_header", file: !102, line: 31, size: 64, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !249}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "id_lsb", scope: !239, file: !102, line: 32, baseType: !165, size: 8)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rev_minor", scope: !239, file: !102, line: 33, baseType: !165, size: 8, offset: 8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rev_major", scope: !239, file: !102, line: 34, baseType: !165, size: 8, offset: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "len_dw", scope: !239, file: !102, line: 35, baseType: !165, size: 8, offset: 24)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ptp", scope: !239, file: !102, line: 36, baseType: !246, size: 24, offset: 32)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 24, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 3)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "id_msb", scope: !239, file: !102, line: 37, baseType: !165, size: 8, offset: 56)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!252 = !{!253, !254, !255, !256, !258, !261, !269}
!253 = !DILocalVariable(name: "php", arg: 1, scope: !233, file: !234, line: 45, type: !237)
!254 = !DILocalVariable(name: "bfp", arg: 2, scope: !233, file: !234, line: 46, type: !250)
!255 = !DILocalVariable(name: "dw1", scope: !233, file: !234, line: 48, type: !120)
!256 = !DILocalVariable(name: "mode", scope: !257, file: !234, line: 73, type: !179)
!257 = distinct !DILexicalBlock(scope: !233, file: !234, line: 73, column: 2)
!258 = !DILocalVariable(name: "tag", scope: !259, file: !234, line: 74, type: !155)
!259 = distinct !DILexicalBlock(scope: !260, file: !234, line: 73, column: 62)
!260 = distinct !DILexicalBlock(scope: !257, file: !234, line: 73, column: 2)
!261 = !DILocalVariable(name: "cmd", scope: !262, file: !234, line: 77, type: !264)
!262 = distinct !DILexicalBlock(scope: !263, file: !234, line: 76, column: 12)
!263 = distinct !DILexicalBlock(scope: !259, file: !234, line: 76, column: 7)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jesd216_instr", file: !102, line: 250, size: 24, elements: !265)
!265 = !{!266, !267, !268}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "instr", scope: !264, file: !102, line: 251, baseType: !165, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mode_clocks", scope: !264, file: !102, line: 252, baseType: !165, size: 8, offset: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "wait_states", scope: !264, file: !102, line: 253, baseType: !165, size: 8, offset: 16)
!269 = !DILocalVariable(name: "rc", scope: !262, file: !234, line: 78, type: !138)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, elements: !272)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!272 = !{!273}
!273 = !DISubrange(count: 4)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "bsersz", scope: !233, file: !234, line: 63, type: !270, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "mode_tags", scope: !27, file: !234, line: 31, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 352, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 11)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 544, elements: !285)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "dw_extractor", file: !234, line: 28, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!285 = !{!286}
!286 = !DISubrange(count: 17)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "_char_out", scope: !289, file: !294, line: 54, type: !295, isLocal: false, isDefinition: true)
!289 = distinct !DICompileUnit(language: DW_LANG_C99, file: !290, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !292, globals: !293, splitDebugInlining: false, nameTableKind: None)
!290 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!291 = !{!30}
!292 = !{!137, !138}
!293 = !{!287}
!294 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{!138, !138}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !300, file: !357, line: 65, type: !358, isLocal: true, isDefinition: true, align: 32)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !302, globals: !352, splitDebugInlining: false, nameTableKind: None)
!301 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!302 = !{!137, !138, !303, !120, !314}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !305, file: !304, line: 167, baseType: !313)
!304 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !304, file: !304, line: 134, type: !306, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !300, retainedNodes: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !120}
!308 = !{!309, !310, !312}
!309 = !DILocalVariable(name: "time_us", arg: 1, scope: !305, file: !304, line: 134, type: !120)
!310 = !DILocalVariable(name: "delay_cycles", scope: !305, file: !304, line: 168, type: !311)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!312 = !DILocalVariable(name: "cycles", scope: !305, file: !304, line: 171, type: !120)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !316, line: 1928, baseType: !317)
!316 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 1909, size: 11360, elements: !318)
!318 = !{!319, !325, !326, !327, !328, !332, !333, !334, !335, !337, !338, !342, !343, !344, !345, !346, !350, !351}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !317, file: !316, line: 1910, baseType: !320, size: 8192)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 8192, elements: !323)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !120)
!323 = !{!324}
!324 = !DISubrange(count: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !317, file: !316, line: 1911, baseType: !321, size: 32, offset: 8192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !317, file: !316, line: 1912, baseType: !321, size: 32, offset: 8224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !317, file: !316, line: 1913, baseType: !321, size: 32, offset: 8256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !317, file: !316, line: 1914, baseType: !329, size: 1984, offset: 8288)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 1984, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 62)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !317, file: !316, line: 1915, baseType: !322, size: 32, offset: 10272)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !317, file: !316, line: 1916, baseType: !321, size: 32, offset: 10304)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !317, file: !316, line: 1917, baseType: !322, size: 32, offset: 10336)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !317, file: !316, line: 1918, baseType: !336, size: 96, offset: 10368)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 96, elements: !247)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !317, file: !316, line: 1919, baseType: !322, size: 32, offset: 10464)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !317, file: !316, line: 1920, baseType: !339, size: 256, offset: 10496)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 256, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !317, file: !316, line: 1921, baseType: !322, size: 32, offset: 10752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !317, file: !316, line: 1922, baseType: !321, size: 32, offset: 10784)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !317, file: !316, line: 1923, baseType: !322, size: 32, offset: 10816)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !317, file: !316, line: 1924, baseType: !322, size: 32, offset: 10848)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !317, file: !316, line: 1925, baseType: !347, size: 416, offset: 10880)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 416, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 13)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !317, file: !316, line: 1926, baseType: !322, size: 32, offset: 11296)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !317, file: !316, line: 1927, baseType: !322, size: 32, offset: 11328)
!352 = !{!298, !353}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !305, file: !304, line: 161, type: !355, isLocal: true, isDefinition: true, align: 128)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 48, elements: !247)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!357 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !360, line: 51, size: 64, elements: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = !{!362, !369}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !359, file: !360, line: 60, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = !DISubroutineType(types: !365)
!365 = !{!138, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !360, line: 48, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !359, file: !360, line: 65, baseType: !366, size: 32, offset: 32)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !372, file: !411, line: 27, type: !438, isLocal: true, isDefinition: true)
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !374, retainedTypes: !386, globals: !408, splitDebugInlining: false, nameTableKind: None)
!373 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!374 = !{!375, !30}
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !376, line: 27, baseType: !32, size: 32, elements: !377)
!376 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385}
!378 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!379 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!380 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!381 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!382 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!383 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!384 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!385 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!386 = !{!137, !387, !138, !24, !391, !407, !120, !226}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !388, line: 46, baseType: !389)
!388 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !390)
!390 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !393, line: 54, size: 96, elements: !394)
!393 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !{!395, !402, !406}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !392, file: !393, line: 55, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !397, line: 33, baseType: !398)
!397 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !397, line: 29, size: 32, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !397, line: 30, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !392, file: !393, line: 60, baseType: !403, size: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !375}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !392, file: !393, line: 65, baseType: !403, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!408 = !{!370, !409, !415, !417, !428, !430}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !372, file: !411, line: 44, type: !412, isLocal: true, isDefinition: true)
!411 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !413, line: 43, elements: !414)
!413 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = !{}
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !372, file: !411, line: 49, type: !412, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !372, file: !411, line: 36, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 128, elements: !426)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !376, line: 114, size: 128, elements: !421)
!421 = !{!422, !423, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !420, file: !376, line: 115, baseType: !375, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !420, file: !376, line: 141, baseType: !165, size: 8, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !420, file: !376, line: 149, baseType: !120, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !420, file: !376, line: 156, baseType: !120, size: 32, offset: 96)
!426 = !{!427}
!427 = !DISubrange(count: 1)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !372, file: !411, line: 40, type: !419, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !372, file: !411, line: 28, type: !432, isLocal: true, isDefinition: true)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !397, line: 40, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !397, line: 35, size: 64, elements: !434)
!434 = !{!435, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !433, file: !397, line: 36, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !433, file: !397, line: 37, baseType: !436, size: 32, offset: 32)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 32, elements: !426)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !440, line: 22, baseType: !178)
!440 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!442 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !445, file: !472, line: 50, type: !459, isLocal: true, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !374, retainedTypes: !447, globals: !469, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!447 = !{!174, !387, !179, !138, !137, !120, !226, !448, !407, !459, !460}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !450, line: 45, size: 64, elements: !451)
!450 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !{!452, !458}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !449, file: !450, line: 46, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !397, line: 33, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !397, line: 29, size: 32, elements: !455)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !454, file: !397, line: 30, baseType: !457, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !449, file: !450, line: 48, baseType: !120, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !138)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !450, line: 38, size: 64, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !461, file: !450, line: 39, baseType: !453, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !461, file: !450, line: 41, baseType: !465, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !450, line: 35, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !459}
!469 = !{!470, !474, !482, !443, !484, !494}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "latency_lock", scope: !445, file: !472, line: 44, type: !473, isLocal: true, isDefinition: true)
!472 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !413, line: 43, elements: !414)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !445, file: !472, line: 46, type: !476, isLocal: true, isDefinition: true)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !397, line: 40, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !397, line: 35, size: 64, elements: !478)
!478 = !{!479, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !477, file: !397, line: 36, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !477, file: !397, line: 37, baseType: !480, size: 32, offset: 32)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "latency_subs", scope: !445, file: !472, line: 52, type: !476, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !445, file: !472, line: 39, type: !486, isLocal: true, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, elements: !492)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 35, size: 96, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !487, file: !472, line: 36, baseType: !375, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !487, file: !472, line: 37, baseType: !165, size: 8, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !487, file: !472, line: 38, baseType: !439, size: 32, offset: 64)
!492 = !{!493}
!493 = !DISubrange(count: 0)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !445, file: !472, line: 48, type: !459, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !498, file: !505, line: 47, type: !518, isLocal: true, isDefinition: true)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !500, retainedTypes: !501, globals: !502, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!500 = !{!375}
!501 = !{!179, !138}
!502 = !{!503, !496, !515}
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "cpus_states", scope: !498, file: !505, line: 50, type: !506, isLocal: true, isDefinition: true)
!505 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 32, elements: !426)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !376, line: 114, size: 128, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !509, file: !376, line: 115, baseType: !375, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !509, file: !376, line: 141, baseType: !165, size: 8, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !509, file: !376, line: 149, baseType: !120, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !509, file: !376, line: 156, baseType: !120, size: 32, offset: 96)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !498, file: !505, line: 55, type: !517, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 8, elements: !426)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, elements: !492)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "static_regions", scope: !521, file: !528, line: 62, type: !660, isLocal: true, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !523, globals: !524, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!523 = !{!179, !138, !120, !137}
!524 = !{!525, !519}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !527, file: !528, line: 198, type: !647, isLocal: true, isDefinition: true)
!527 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !528, file: !528, line: 175, type: !529, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !521, retainedNodes: !644)
!528 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = !DISubroutineType(types: !530)
!530 = !{null, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !533, line: 245, size: 1024, elements: !534)
!533 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !{!535, !600, !613, !614, !615, !616, !622, !639}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !532, file: !533, line: 247, baseType: !536, size: 384)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !533, line: 57, size: 384, elements: !537)
!537 = !{!538, !566, !574, !575, !576, !587, !588, !589}
!538 = !DIDerivedType(tag: DW_TAG_member, scope: !536, file: !533, line: 60, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !536, file: !533, line: 60, size: 64, elements: !540)
!540 = !{!541, !557}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !539, file: !533, line: 61, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !543, line: 49, baseType: !544)
!543 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !543, line: 37, size: 64, elements: !545)
!545 = !{!546, !552}
!546 = !DIDerivedType(tag: DW_TAG_member, scope: !544, file: !543, line: 38, baseType: !547, size: 32)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !544, file: !543, line: 38, size: 32, elements: !548)
!548 = !{!549, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !547, file: !543, line: 39, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !543, line: 40, baseType: !550, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, scope: !544, file: !543, line: 42, baseType: !553, size: 32, offset: 32)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !544, file: !543, line: 42, size: 32, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !553, file: !543, line: 43, baseType: !550, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !553, file: !543, line: 44, baseType: !550, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !539, file: !533, line: 62, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !559, line: 49, size: 64, elements: !560)
!559 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !558, file: !559, line: 50, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 64, elements: !564)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!564 = !{!565}
!565 = !DISubrange(count: 2)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !536, file: !533, line: 68, baseType: !567, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !569, line: 233, baseType: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 231, size: 64, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !570, file: !569, line: 232, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !543, line: 48, baseType: !544)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !536, file: !533, line: 71, baseType: !165, size: 8, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !536, file: !533, line: 74, baseType: !165, size: 8, offset: 104)
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !536, file: !533, line: 90, baseType: !577, size: 16, offset: 112)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !536, file: !533, line: 90, size: 16, elements: !578)
!578 = !{!579, !586}
!579 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !533, line: 91, baseType: !580, size: 16)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !533, line: 91, size: 16, elements: !581)
!581 = !{!582, !585}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !580, file: !533, line: 96, baseType: !583, size: 8)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !584)
!584 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !580, file: !533, line: 97, baseType: !165, size: 8, offset: 8)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !577, file: !533, line: 100, baseType: !224, size: 16)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !536, file: !533, line: 107, baseType: !120, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !536, file: !533, line: 127, baseType: !137, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !536, file: !533, line: 131, baseType: !590, size: 192, offset: 192)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !569, line: 244, size: 192, elements: !591)
!591 = !{!592, !593, !599}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !590, file: !569, line: 245, baseType: !542, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !590, file: !569, line: 246, baseType: !594, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !569, line: 242, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !598}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !590, file: !569, line: 249, baseType: !389, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !532, file: !533, line: 250, baseType: !601, size: 288, offset: 384)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !602, line: 25, size: 288, elements: !603)
!602 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !601, file: !602, line: 26, baseType: !120, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !601, file: !602, line: 27, baseType: !120, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !601, file: !602, line: 28, baseType: !120, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !601, file: !602, line: 29, baseType: !120, size: 32, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !601, file: !602, line: 30, baseType: !120, size: 32, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !601, file: !602, line: 31, baseType: !120, size: 32, offset: 160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !601, file: !602, line: 32, baseType: !120, size: 32, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !601, file: !602, line: 33, baseType: !120, size: 32, offset: 224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !601, file: !602, line: 34, baseType: !120, size: 32, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !532, file: !533, line: 253, baseType: !137, size: 32, offset: 672)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !532, file: !533, line: 256, baseType: !568, size: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !532, file: !533, line: 294, baseType: !138, size: 32, offset: 768)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !532, file: !533, line: 300, baseType: !617, size: 96, offset: 800)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !533, line: 149, size: 96, elements: !618)
!618 = !{!619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !617, file: !533, line: 153, baseType: !22, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !617, file: !533, line: 162, baseType: !179, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !617, file: !533, line: 168, baseType: !179, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !532, file: !533, line: 325, baseType: !623, size: 32, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !625, line: 5073, size: 160, elements: !626)
!625 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!626 = !{!627, !636, !637}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !624, file: !625, line: 5074, baseType: !628, size: 96)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !629, line: 56, size: 96, elements: !630)
!629 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!630 = !{!631, !634, !635}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !628, file: !629, line: 57, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !629, line: 57, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !628, file: !629, line: 58, baseType: !137, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !628, file: !629, line: 59, baseType: !179, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !624, file: !625, line: 5075, baseType: !568, size: 64, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !624, file: !625, line: 5076, baseType: !638, offset: 160)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !413, line: 43, elements: !414)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !532, file: !533, line: 343, baseType: !640, size: 64, offset: 928)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !602, line: 60, size: 64, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !640, file: !602, line: 63, baseType: !120, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !640, file: !602, line: 66, baseType: !120, size: 32, offset: 32)
!644 = !{!645, !646}
!645 = !DILocalVariable(name: "thread", arg: 1, scope: !527, file: !528, line: 175, type: !531)
!646 = !DILocalVariable(name: "region_num", scope: !527, file: !528, line: 200, type: !165)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, elements: !492)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !649, line: 52, size: 96, elements: !650)
!649 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !648, file: !649, line: 53, baseType: !22, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !648, file: !649, line: 54, baseType: !179, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !648, file: !649, line: 55, baseType: !654, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !655, line: 304, baseType: !656)
!655 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !655, line: 301, size: 32, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !656, file: !655, line: 302, baseType: !224, size: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !656, file: !655, line: 303, baseType: !224, size: 16, offset: 16)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 96, elements: !426)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !664, file: !718, line: 39, type: !165, isLocal: true, isDefinition: true)
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !666, globals: !709, splitDebugInlining: false, nameTableKind: None)
!665 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!666 = !{!667, !137, !138, !695}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !669, line: 1495, baseType: !670)
!669 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 1474, size: 448, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !685}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !670, file: !669, line: 1476, baseType: !321, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !670, file: !669, line: 1477, baseType: !322, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !670, file: !669, line: 1478, baseType: !322, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !670, file: !669, line: 1479, baseType: !322, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !670, file: !669, line: 1480, baseType: !322, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !670, file: !669, line: 1481, baseType: !322, size: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !670, file: !669, line: 1482, baseType: !322, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !670, file: !669, line: 1483, baseType: !322, size: 32, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !670, file: !669, line: 1484, baseType: !322, size: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !670, file: !669, line: 1485, baseType: !322, size: 32, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !670, file: !669, line: 1486, baseType: !322, size: 32, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !670, file: !669, line: 1487, baseType: !684, size: 32, offset: 352)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 32, elements: !426)
!685 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !669, line: 1488, baseType: !686, size: 64, offset: 384)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !670, file: !669, line: 1488, size: 64, elements: !687)
!687 = !{!688, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !686, file: !669, line: 1489, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 64, elements: !564)
!690 = !DIDerivedType(tag: DW_TAG_member, scope: !686, file: !669, line: 1490, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !686, file: !669, line: 1490, size: 64, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !691, file: !669, line: 1491, baseType: !322, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !691, file: !669, line: 1492, baseType: !322, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !698, line: 27, size: 128, elements: !699)
!698 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!699 = !{!700, !701, !702}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !697, file: !698, line: 29, baseType: !120, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !698, line: 31, baseType: !155, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !697, file: !698, line: 37, baseType: !703, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !655, line: 298, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !655, line: 289, size: 64, elements: !705)
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !704, file: !655, line: 291, baseType: !165, size: 5, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !704, file: !655, line: 293, baseType: !165, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !704, file: !655, line: 295, baseType: !120, size: 32, offset: 32)
!709 = !{!662, !710}
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !664, file: !712, line: 31, type: !713, isLocal: true, isDefinition: true)
!712 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 160, elements: !426)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !712, line: 21, size: 160, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !714, file: !712, line: 22, baseType: !138, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !714, file: !712, line: 23, baseType: !697, size: 128, offset: 32)
!718 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !721, file: !728, line: 21, type: !295, isLocal: true, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !723, globals: !727, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!723 = !{!724, !138, !137}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !726, line: 22, baseType: !138)
!726 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !{!719}
!728 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !731, file: !736, line: 13, type: !755, isLocal: true, isDefinition: true)
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !733, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!733 = !{!734, !729}
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "mpu_config", scope: !731, file: !736, line: 37, type: !737, isLocal: false, isDefinition: true)
!736 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !698, line: 41, size: 64, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !738, file: !698, line: 43, baseType: !120, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !738, file: !698, line: 45, baseType: !742, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !698, line: 27, size: 128, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !744, file: !698, line: 29, baseType: !120, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !744, file: !698, line: 31, baseType: !155, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !744, file: !698, line: 37, baseType: !749, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !655, line: 298, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !655, line: 289, size: 64, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !750, file: !655, line: 291, baseType: !165, size: 5, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !750, file: !655, line: 293, baseType: !165, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !750, file: !655, line: 295, baseType: !120, size: 32, offset: 32)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 256, elements: !564)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_bee_init", scope: !758, file: !854, line: 39, type: !855, isLocal: true, isDefinition: true, align: 32)
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !760, retainedTypes: !772, globals: !853, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!760 = !{!761, !767}
!761 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !762, line: 506, baseType: !32, size: 32, elements: !763)
!762 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!763 = !{!764, !765, !766}
!764 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!765 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!766 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!767 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !762, line: 512, baseType: !32, size: 32, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!770 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!771 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!772 = !{!773, !842, !847, !808, !767, !761, !852, !137}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !762, line: 523, size: 288, elements: !776)
!776 = !{!777, !798, !804, !809, !813, !814, !815, !819, !838}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !775, file: !762, line: 524, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DISubroutineType(types: !780)
!780 = !{!138, !781, !796, !797}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !784)
!784 = !{!785, !786, !787, !788, !794, !795}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !152, line: 380, baseType: !155, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !783, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !783, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !783, file: !152, line: 386, baseType: !789, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !790, file: !152, line: 359, baseType: !165, size: 8)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !790, file: !152, line: 364, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !783, file: !152, line: 388, baseType: !137, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !783, file: !152, line: 396, baseType: !171, size: 32, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !762, line: 237, baseType: !165)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !762, line: 257, baseType: !120)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !775, file: !762, line: 530, baseType: !799, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{!138, !781, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !762, line: 229, baseType: !120)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !775, file: !762, line: 532, baseType: !805, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!138, !781, !808, !803}
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !762, line: 216, baseType: !120)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !775, file: !762, line: 535, baseType: !810, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DISubroutineType(types: !812)
!812 = !{!138, !781, !808}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !775, file: !762, line: 537, baseType: !810, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !775, file: !762, line: 539, baseType: !810, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !775, file: !762, line: 541, baseType: !816, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{!138, !781, !796, !761, !767}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !775, file: !762, line: 544, baseType: !820, size: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{!138, !781, !823, !168}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !762, line: 478, size: 96, elements: !825)
!825 = !{!826, !832, !837}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !824, file: !762, line: 482, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !397, line: 33, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !397, line: 29, size: 32, elements: !829)
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !828, file: !397, line: 30, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !824, file: !762, line: 485, baseType: !833, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !762, line: 464, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !781, !823, !808}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !824, file: !762, line: 493, baseType: !808, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !775, file: !762, line: 547, baseType: !839, size: 32, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{!120, !781}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !762, line: 428, size: 32, elements: !845)
!845 = !{!846}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !844, file: !762, line: 434, baseType: !808, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !762, line: 441, size: 32, elements: !850)
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !849, file: !762, line: 447, baseType: !808, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!853 = !{!756}
!854 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !360, line: 51, size: 64, elements: !857)
!857 = !{!858, !862}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !856, file: !360, line: 60, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DISubroutineType(types: !861)
!861 = !{!138, !781}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !856, file: !360, line: 65, baseType: !781, size: 32, offset: 32)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "__device_dts_ord_48", scope: !865, file: !1068, line: 733, type: !1171, isLocal: false, isDefinition: true, align: 32)
!865 = distinct !DICompileUnit(language: DW_LANG_C99, file: !866, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !867, retainedTypes: !985, globals: !1064, splitDebugInlining: false, nameTableKind: None)
!866 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/jesd216")
!867 = !{!868, !874, !30, !879, !884, !888, !892, !896, !902, !906, !950, !957, !976}
!868 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !869, line: 23, baseType: !32, size: 32, elements: !870)
!869 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!870 = !{!871, !872, !873}
!871 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!872 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!873 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !869, line: 48, baseType: !32, size: 32, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!877 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!878 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !880, line: 167, baseType: !32, size: 32, elements: !881)
!880 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!881 = !{!882, !883}
!882 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!883 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !880, line: 107, baseType: !32, size: 32, elements: !885)
!885 = !{!886, !887}
!886 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!887 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !880, line: 208, baseType: !32, size: 32, elements: !889)
!889 = !{!890, !891}
!890 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!891 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!892 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !880, line: 261, baseType: !32, size: 32, elements: !893)
!893 = !{!894, !895}
!894 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!895 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !880, line: 237, baseType: !32, size: 32, elements: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!899 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!900 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!901 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !880, line: 152, baseType: !32, size: 32, elements: !903)
!903 = !{!904, !905}
!904 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!905 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !316, line: 71, baseType: !138, size: 32, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949}
!908 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!909 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!910 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!911 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!912 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!913 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!914 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!915 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!916 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!917 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!918 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!919 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!920 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!921 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!922 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!923 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!924 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!925 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!926 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!927 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!928 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!929 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!930 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!931 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!932 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!933 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!934 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!935 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!936 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!937 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!938 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!939 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!940 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!941 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!942 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!943 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!944 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!945 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!946 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!947 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!948 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!949 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!950 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !951, line: 44, baseType: !32, size: 32, elements: !952)
!951 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!952 = !{!953, !954, !955, !956}
!953 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!954 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!955 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!956 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !958, line: 54, baseType: !32, size: 32, elements: !959)
!958 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975}
!960 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!961 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!962 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!963 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!964 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!965 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!966 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!967 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!968 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!969 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!970 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!971 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!972 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!973 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!974 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!975 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!976 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !977, line: 53, baseType: !32, size: 32, elements: !978)
!977 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!978 = !{!979, !980, !981, !982, !983, !984}
!979 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!980 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!981 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!982 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!983 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!984 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!985 = !{!868, !137, !138, !986, !1028, !1029, !1030, !1031, !387, !120, !226, !168, !1032, !223, !459, !1033, !1063, !179}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !316, line: 923, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 883, size: 10464, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1009, !1010, !1011, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !988, file: !316, line: 884, baseType: !322, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !988, file: !316, line: 885, baseType: !322, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !988, file: !316, line: 886, baseType: !322, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !988, file: !316, line: 887, baseType: !322, size: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !988, file: !316, line: 888, baseType: !995, size: 896, offset: 128)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 896, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 28)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !988, file: !316, line: 889, baseType: !322, size: 32, offset: 1024)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !988, file: !316, line: 890, baseType: !322, size: 32, offset: 1056)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !988, file: !316, line: 891, baseType: !322, size: 32, offset: 1088)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !988, file: !316, line: 892, baseType: !322, size: 32, offset: 1120)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !988, file: !316, line: 893, baseType: !995, size: 896, offset: 1152)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !988, file: !316, line: 894, baseType: !322, size: 32, offset: 2048)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !988, file: !316, line: 895, baseType: !322, size: 32, offset: 2080)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !988, file: !316, line: 896, baseType: !1006, size: 960, offset: 2112)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 960, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 30)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !988, file: !316, line: 897, baseType: !322, size: 32, offset: 3072)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !988, file: !316, line: 898, baseType: !322, size: 32, offset: 3104)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !988, file: !316, line: 899, baseType: !1012, size: 3008, offset: 3136)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 3008, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 94)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !988, file: !316, line: 900, baseType: !322, size: 32, offset: 6144)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !988, file: !316, line: 901, baseType: !322, size: 32, offset: 6176)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !988, file: !316, line: 902, baseType: !322, size: 32, offset: 6208)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !988, file: !316, line: 903, baseType: !321, size: 32, offset: 6240)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !988, file: !316, line: 904, baseType: !329, size: 1984, offset: 6272)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !988, file: !316, line: 905, baseType: !321, size: 32, offset: 8256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !988, file: !316, line: 907, baseType: !321, size: 32, offset: 8288)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !988, file: !316, line: 910, baseType: !321, size: 32, offset: 8320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !988, file: !316, line: 911, baseType: !321, size: 32, offset: 8352)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !988, file: !316, line: 913, baseType: !321, size: 32, offset: 8384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !988, file: !316, line: 917, baseType: !321, size: 32, offset: 8416)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !988, file: !316, line: 919, baseType: !329, size: 1984, offset: 8448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !988, file: !316, line: 920, baseType: !322, size: 32, offset: 10432)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !880, line: 146, baseType: !884)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !880, line: 164, baseType: !902)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !669, line: 485, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 468, size: 28704, elements: !1036)
!1036 = !{!1037, !1041, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1058, !1062}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1035, file: !669, line: 470, baseType: !1038, size: 512)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 512, elements: !1039)
!1039 = !{!1040}
!1040 = !DISubrange(count: 16)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1035, file: !669, line: 471, baseType: !1042, size: 512, offset: 512)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 512, elements: !1039)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1035, file: !669, line: 472, baseType: !1038, size: 512, offset: 1024)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1035, file: !669, line: 473, baseType: !1042, size: 512, offset: 1536)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1035, file: !669, line: 474, baseType: !1038, size: 512, offset: 2048)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1035, file: !669, line: 475, baseType: !1042, size: 512, offset: 2560)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1035, file: !669, line: 476, baseType: !1038, size: 512, offset: 3072)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1035, file: !669, line: 477, baseType: !1042, size: 512, offset: 3584)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1035, file: !669, line: 478, baseType: !1038, size: 512, offset: 4096)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1035, file: !669, line: 479, baseType: !1042, size: 512, offset: 4608)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !1035, file: !669, line: 480, baseType: !1038, size: 512, offset: 5120)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1035, file: !669, line: 481, baseType: !1042, size: 512, offset: 5632)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !1035, file: !669, line: 482, baseType: !1054, size: 3968, offset: 6144)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 3968, elements: !1056)
!1055 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !165)
!1056 = !{!1057}
!1057 = !DISubrange(count: 496)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1035, file: !669, line: 483, baseType: !1059, size: 18560, offset: 10112)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 18560, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 580)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1035, file: !669, line: 484, baseType: !322, size: 32, offset: 28672)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !951, line: 56, baseType: !137)
!1064 = !{!1065, !1115, !1156, !863, !1161, !1186, !1188, !1205, !1207, !1217, !1220, !1235, !1273, !1287}
