; ModuleID = 'build/actinius_icarus_bee_ns/minimal/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !111, file: !173, line: 65, type: !174, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !166, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!113 = !{!102, !103, !114, !119, !126}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !116, file: !115, line: 167, baseType: !125)
!115 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !115, file: !115, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!120 = !{!121, !122, !124}
!121 = !DILocalVariable(name: "time_us", arg: 1, scope: !116, file: !115, line: 134, type: !119)
!122 = !DILocalVariable(name: "delay_cycles", scope: !116, file: !115, line: 168, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!124 = !DILocalVariable(name: "cycles", scope: !116, file: !115, line: 171, type: !119)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !128, line: 1928, baseType: !129)
!128 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 1909, size: 11360, elements: !130)
!130 = !{!131, !137, !138, !139, !140, !144, !145, !146, !147, !151, !152, !156, !157, !158, !159, !160, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !129, file: !128, line: 1910, baseType: !132, size: 8192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !119)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !129, file: !128, line: 1911, baseType: !133, size: 32, offset: 8192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !129, file: !128, line: 1912, baseType: !133, size: 32, offset: 8224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !129, file: !128, line: 1913, baseType: !133, size: 32, offset: 8256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !129, file: !128, line: 1914, baseType: !141, size: 1984, offset: 8288)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1984, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 62)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !129, file: !128, line: 1915, baseType: !134, size: 32, offset: 10272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !129, file: !128, line: 1916, baseType: !133, size: 32, offset: 10304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !129, file: !128, line: 1917, baseType: !134, size: 32, offset: 10336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !129, file: !128, line: 1918, baseType: !148, size: 96, offset: 10368)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !129, file: !128, line: 1919, baseType: !134, size: 32, offset: 10464)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !129, file: !128, line: 1920, baseType: !153, size: 256, offset: 10496)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !129, file: !128, line: 1921, baseType: !134, size: 32, offset: 10752)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !129, file: !128, line: 1922, baseType: !133, size: 32, offset: 10784)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !129, file: !128, line: 1923, baseType: !134, size: 32, offset: 10816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !129, file: !128, line: 1924, baseType: !134, size: 32, offset: 10848)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !129, file: !128, line: 1925, baseType: !161, size: 416, offset: 10880)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !129, file: !128, line: 1926, baseType: !134, size: 32, offset: 11296)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !129, file: !128, line: 1927, baseType: !134, size: 32, offset: 11328)
!166 = !{!109, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !116, file: !115, line: 161, type: !169, isLocal: true, isDefinition: true, align: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !149)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !177)
!176 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !{!178, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !176, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !175, file: !176, line: 65, baseType: !182, size: 32, offset: 32)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !188, file: !230, line: 27, type: !259, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !202, globals: !227, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!190 = !{!191, !30}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !192, line: 27, baseType: !32, size: 32, elements: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!195 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!196 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!197 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!198 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!199 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!200 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!201 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!202 = !{!102, !203, !103, !24, !207, !223, !119, !225}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !204, line: 46, baseType: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !206)
!206 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !209, line: 54, size: 96, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !218, !222}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !208, file: !209, line: 55, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !214)
!213 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !213, line: 30, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !208, file: !209, line: 60, baseType: !219, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !191}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !208, file: !209, line: 65, baseType: !219, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !226)
!226 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!227 = !{!186, !228, !234, !236, !249, !251}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !188, file: !230, line: 44, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!232 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !{}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !188, file: !230, line: 49, type: !231, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !188, file: !230, line: 36, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 128, elements: !247)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !240)
!240 = !{!241, !242, !245, !246}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !239, file: !192, line: 115, baseType: !191, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !239, file: !192, line: 141, baseType: !243, size: 8, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !244)
!244 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !239, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !239, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !188, file: !230, line: 40, type: !238, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !188, file: !230, line: 28, type: !253, isLocal: true, isDefinition: true)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !255)
!255 = !{!256, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !254, file: !213, line: 36, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !254, file: !213, line: 37, baseType: !257, size: 32, offset: 32)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !247)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !261, line: 22, baseType: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!263 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!264 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !267, file: !298, line: 50, type: !285, isLocal: true, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !269, globals: !295, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!269 = !{!270, !203, !272, !103, !102, !119, !225, !274, !223, !285, !286}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !271)
!271 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !276, line: 45, size: 64, elements: !277)
!276 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = !{!278, !284}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !275, file: !276, line: 46, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !213, line: 30, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !275, file: !276, line: 48, baseType: !119, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !276, line: 38, size: 64, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !287, file: !276, line: 39, baseType: !279, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !287, file: !276, line: 41, baseType: !291, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !276, line: 35, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !285}
!295 = !{!296, !300, !308, !265, !310, !320}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "latency_lock", scope: !267, file: !298, line: 44, type: !299, isLocal: true, isDefinition: true)
!298 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !267, file: !298, line: 46, type: !302, isLocal: true, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !303, file: !213, line: 36, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !303, file: !213, line: 37, baseType: !306, size: 32, offset: 32)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "latency_subs", scope: !267, file: !298, line: 52, type: !302, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !267, file: !298, line: 39, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, elements: !318)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 35, size: 96, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !298, line: 36, baseType: !191, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !313, file: !298, line: 37, baseType: !243, size: 8, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !313, file: !298, line: 38, baseType: !260, size: 32, offset: 64)
!318 = !{!319}
!319 = !DISubrange(count: 0)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !267, file: !298, line: 48, type: !285, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !324, file: !331, line: 47, type: !345, isLocal: true, isDefinition: true)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !326, retainedTypes: !327, globals: !328, splitDebugInlining: false, nameTableKind: None)
!325 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!326 = !{!191}
!327 = !{!272, !103}
!328 = !{!329, !322, !341}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "cpus_states", scope: !324, file: !331, line: 50, type: !332, isLocal: true, isDefinition: true)
!331 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 32, elements: !247)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !192, line: 115, baseType: !191, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !335, file: !192, line: 141, baseType: !243, size: 8, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !335, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !335, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !324, file: !331, line: 55, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 8, elements: !247)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, elements: !318)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "static_regions", scope: !348, file: !355, line: 62, type: !487, isLocal: true, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !350, globals: !351, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!350 = !{!272, !103, !119, !102}
!351 = !{!352, !346}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !354, file: !355, line: 198, type: !474, isLocal: true, isDefinition: true)
!354 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !355, file: !355, line: 175, type: !356, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !348, retainedNodes: !471)
!355 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !DISubroutineType(types: !357)
!357 = !{null, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !360, line: 245, size: 1024, elements: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = !{!362, !427, !440, !441, !442, !443, !449, !466}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !359, file: !360, line: 247, baseType: !363, size: 384)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !360, line: 57, size: 384, elements: !364)
!364 = !{!365, !393, !401, !402, !403, !414, !415, !416}
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !360, line: 60, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !360, line: 60, size: 64, elements: !367)
!367 = !{!368, !384}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !366, file: !360, line: 61, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !370, line: 49, baseType: !371)
!370 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !370, line: 37, size: 64, elements: !372)
!372 = !{!373, !379}
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !371, file: !370, line: 38, baseType: !374, size: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !371, file: !370, line: 38, size: 32, elements: !375)
!375 = !{!376, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !374, file: !370, line: 39, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !374, file: !370, line: 40, baseType: !377, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !371, file: !370, line: 42, baseType: !380, size: 32, offset: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !371, file: !370, line: 42, size: 32, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !380, file: !370, line: 43, baseType: !377, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !380, file: !370, line: 44, baseType: !377, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !366, file: !360, line: 62, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !386, line: 49, size: 64, elements: !387)
!386 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !385, file: !386, line: 50, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !391)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!391 = !{!392}
!392 = !DISubrange(count: 2)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !363, file: !360, line: 68, baseType: !394, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !396, line: 233, baseType: !397)
!396 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 231, size: 64, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !397, file: !396, line: 232, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !370, line: 48, baseType: !371)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !363, file: !360, line: 71, baseType: !243, size: 8, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !363, file: !360, line: 74, baseType: !243, size: 8, offset: 104)
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !360, line: 90, baseType: !404, size: 16, offset: 112)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !360, line: 90, size: 16, elements: !405)
!405 = !{!406, !413}
!406 = !DIDerivedType(tag: DW_TAG_member, scope: !404, file: !360, line: 91, baseType: !407, size: 16)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !360, line: 91, size: 16, elements: !408)
!408 = !{!409, !412}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !407, file: !360, line: 96, baseType: !410, size: 8)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !411)
!411 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !407, file: !360, line: 97, baseType: !243, size: 8, offset: 8)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !404, file: !360, line: 100, baseType: !171, size: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !363, file: !360, line: 107, baseType: !119, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !363, file: !360, line: 127, baseType: !102, size: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !363, file: !360, line: 131, baseType: !417, size: 192, offset: 192)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !396, line: 244, size: 192, elements: !418)
!418 = !{!419, !420, !426}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !417, file: !396, line: 245, baseType: !369, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !417, file: !396, line: 246, baseType: !421, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !396, line: 242, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !417, file: !396, line: 249, baseType: !205, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !359, file: !360, line: 250, baseType: !428, size: 288, offset: 384)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !429, line: 25, size: 288, elements: !430)
!429 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !428, file: !429, line: 26, baseType: !119, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !428, file: !429, line: 27, baseType: !119, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !428, file: !429, line: 28, baseType: !119, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !428, file: !429, line: 29, baseType: !119, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !428, file: !429, line: 30, baseType: !119, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !428, file: !429, line: 31, baseType: !119, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !428, file: !429, line: 32, baseType: !119, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !428, file: !429, line: 33, baseType: !119, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !428, file: !429, line: 34, baseType: !119, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !359, file: !360, line: 253, baseType: !102, size: 32, offset: 672)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !359, file: !360, line: 256, baseType: !395, size: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !359, file: !360, line: 294, baseType: !103, size: 32, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !359, file: !360, line: 300, baseType: !444, size: 96, offset: 800)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !360, line: 149, size: 96, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !444, file: !360, line: 153, baseType: !22, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !444, file: !360, line: 162, baseType: !272, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !444, file: !360, line: 168, baseType: !272, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !359, file: !360, line: 325, baseType: !450, size: 32, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !452, line: 5073, size: 160, elements: !453)
!452 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = !{!454, !463, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !451, file: !452, line: 5074, baseType: !455, size: 96)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !456, line: 56, size: 96, elements: !457)
!456 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !{!458, !461, !462}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !455, file: !456, line: 57, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !456, line: 57, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !455, file: !456, line: 58, baseType: !102, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !455, file: !456, line: 59, baseType: !272, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !451, file: !452, line: 5075, baseType: !395, size: 64, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !451, file: !452, line: 5076, baseType: !465, offset: 160)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !359, file: !360, line: 343, baseType: !467, size: 64, offset: 928)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !429, line: 60, size: 64, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !467, file: !429, line: 63, baseType: !119, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !467, file: !429, line: 66, baseType: !119, size: 32, offset: 32)
!471 = !{!472, !473}
!472 = !DILocalVariable(name: "thread", arg: 1, scope: !354, file: !355, line: 175, type: !358)
!473 = !DILocalVariable(name: "region_num", scope: !354, file: !355, line: 200, type: !243)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, elements: !318)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !476, line: 52, size: 96, elements: !477)
!476 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !475, file: !476, line: 53, baseType: !22, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !475, file: !476, line: 54, baseType: !272, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !475, file: !476, line: 55, baseType: !481, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !482, line: 304, baseType: !483)
!482 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 301, size: 32, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !483, file: !482, line: 302, baseType: !171, size: 16)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !483, file: !482, line: 303, baseType: !171, size: 16, offset: 16)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 96, elements: !247)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !491, file: !547, line: 39, type: !243, isLocal: true, isDefinition: true)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !493, globals: !538, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!493 = !{!494, !102, !103, !522}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !496, line: 1495, baseType: !497)
!496 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 1474, size: 448, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !512}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !497, file: !496, line: 1476, baseType: !133, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !497, file: !496, line: 1477, baseType: !134, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !497, file: !496, line: 1478, baseType: !134, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !497, file: !496, line: 1479, baseType: !134, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !497, file: !496, line: 1480, baseType: !134, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !497, file: !496, line: 1481, baseType: !134, size: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !497, file: !496, line: 1482, baseType: !134, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !497, file: !496, line: 1483, baseType: !134, size: 32, offset: 224)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !497, file: !496, line: 1484, baseType: !134, size: 32, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !497, file: !496, line: 1485, baseType: !134, size: 32, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !497, file: !496, line: 1486, baseType: !134, size: 32, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !497, file: !496, line: 1487, baseType: !511, size: 32, offset: 352)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !247)
!512 = !DIDerivedType(tag: DW_TAG_member, scope: !497, file: !496, line: 1488, baseType: !513, size: 64, offset: 384)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !497, file: !496, line: 1488, size: 64, elements: !514)
!514 = !{!515, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !513, file: !496, line: 1489, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !391)
!517 = !DIDerivedType(tag: DW_TAG_member, scope: !513, file: !496, line: 1490, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !513, file: !496, line: 1490, size: 64, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !518, file: !496, line: 1491, baseType: !134, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !518, file: !496, line: 1492, baseType: !134, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !525, line: 27, size: 128, elements: !526)
!525 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!526 = !{!527, !528, !531}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !524, file: !525, line: 29, baseType: !119, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !525, line: 31, baseType: !529, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !524, file: !525, line: 37, baseType: !532, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !482, line: 298, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !482, line: 289, size: 64, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !533, file: !482, line: 291, baseType: !243, size: 5, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !533, file: !482, line: 293, baseType: !243, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !533, file: !482, line: 295, baseType: !119, size: 32, offset: 32)
!538 = !{!489, !539}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !491, file: !541, line: 31, type: !542, isLocal: true, isDefinition: true)
!541 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 160, elements: !247)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !541, line: 21, size: 160, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !543, file: !541, line: 22, baseType: !103, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !543, file: !541, line: 23, baseType: !524, size: 128, offset: 32)
!547 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !550, file: !557, line: 21, type: !106, isLocal: true, isDefinition: true)
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !552, globals: !556, splitDebugInlining: false, nameTableKind: None)
!551 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!552 = !{!553, !103, !102}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !555, line: 22, baseType: !103)
!555 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!556 = !{!548}
!557 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !560, file: !565, line: 13, type: !584, isLocal: true, isDefinition: true)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !562, splitDebugInlining: false, nameTableKind: None)
!561 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!562 = !{!563, !558}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "mpu_config", scope: !560, file: !565, line: 37, type: !566, isLocal: false, isDefinition: true)
!565 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !525, line: 41, size: 64, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !567, file: !525, line: 43, baseType: !119, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !567, file: !525, line: 45, baseType: !571, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !525, line: 27, size: 128, elements: !574)
!574 = !{!575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !573, file: !525, line: 29, baseType: !119, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !573, file: !525, line: 31, baseType: !529, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !573, file: !525, line: 37, baseType: !578, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !482, line: 298, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !482, line: 289, size: 64, elements: !580)
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !579, file: !482, line: 291, baseType: !243, size: 5, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !579, file: !482, line: 293, baseType: !243, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !579, file: !482, line: 295, baseType: !119, size: 32, offset: 32)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 256, elements: !391)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_bee_init", scope: !587, file: !688, line: 39, type: !689, isLocal: true, isDefinition: true, align: 32)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !589, retainedTypes: !601, globals: !687, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!589 = !{!590, !596}
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !591, line: 506, baseType: !32, size: 32, elements: !592)
!591 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!592 = !{!593, !594, !595}
!593 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!594 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!595 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !591, line: 512, baseType: !32, size: 32, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!599 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!600 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!601 = !{!602, !676, !681, !642, !596, !590, !686, !102}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !591, line: 523, size: 288, elements: !605)
!605 = !{!606, !632, !638, !643, !647, !648, !649, !653, !672}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !604, file: !591, line: 524, baseType: !607, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!103, !610, !630, !631}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !613, line: 378, size: 192, elements: !614)
!613 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!614 = !{!615, !616, !617, !618, !625, !626}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !612, file: !613, line: 380, baseType: !529, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !612, file: !613, line: 382, baseType: !13, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !612, file: !613, line: 384, baseType: !13, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !612, file: !613, line: 386, baseType: !619, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !613, line: 351, size: 16, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !620, file: !613, line: 359, baseType: !243, size: 8)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !620, file: !613, line: 364, baseType: !624, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!624 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !612, file: !613, line: 388, baseType: !102, size: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !612, file: !613, line: 396, baseType: !627, size: 32, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !613, line: 43, baseType: !270)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !591, line: 237, baseType: !243)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !591, line: 257, baseType: !119)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !604, file: !591, line: 530, baseType: !633, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DISubroutineType(types: !635)
!635 = !{!103, !610, !636}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !591, line: 229, baseType: !119)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !604, file: !591, line: 532, baseType: !639, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DISubroutineType(types: !641)
!641 = !{!103, !610, !642, !637}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !591, line: 216, baseType: !119)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !604, file: !591, line: 535, baseType: !644, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DISubroutineType(types: !646)
!646 = !{!103, !610, !642}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !604, file: !591, line: 537, baseType: !644, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !604, file: !591, line: 539, baseType: !644, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !604, file: !591, line: 541, baseType: !650, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DISubroutineType(types: !652)
!652 = !{!103, !610, !630, !590, !596}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !604, file: !591, line: 544, baseType: !654, size: 32, offset: 224)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DISubroutineType(types: !656)
!656 = !{!103, !610, !657, !624}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !591, line: 478, size: 96, elements: !659)
!659 = !{!660, !666, !671}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !658, file: !591, line: 482, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !662, file: !213, line: 30, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !658, file: !591, line: 485, baseType: !667, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !591, line: 464, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !610, !657, !642}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !658, file: !591, line: 493, baseType: !642, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !604, file: !591, line: 547, baseType: !673, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{!119, !610}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !591, line: 428, size: 32, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !678, file: !591, line: 434, baseType: !642, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !591, line: 441, size: 32, elements: !684)
!684 = !{!685}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !683, file: !591, line: 447, baseType: !642, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!687 = !{!585}
!688 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !691)
!691 = !{!692, !696}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !690, file: !176, line: 60, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DISubroutineType(types: !695)
!695 = !{!103, !610}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !690, file: !176, line: 65, baseType: !610, size: 32, offset: 32)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "__device_dts_ord_48", scope: !699, file: !903, line: 733, type: !1006, isLocal: false, isDefinition: true, align: 32)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !701, retainedTypes: !819, globals: !899, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/minimal")
!701 = !{!702, !708, !30, !713, !718, !722, !726, !730, !736, !740, !784, !791, !810}
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !703, line: 23, baseType: !32, size: 32, elements: !704)
!703 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !{!705, !706, !707}
!705 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!706 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!707 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !703, line: 48, baseType: !32, size: 32, elements: !709)
!709 = !{!710, !711, !712}
!710 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!711 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!712 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 167, baseType: !32, size: 32, elements: !715)
!714 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = !{!716, !717}
!716 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!717 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 107, baseType: !32, size: 32, elements: !719)
!719 = !{!720, !721}
!720 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!721 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 208, baseType: !32, size: 32, elements: !723)
!723 = !{!724, !725}
!724 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!725 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 261, baseType: !32, size: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!729 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 237, baseType: !32, size: 32, elements: !731)
!731 = !{!732, !733, !734, !735}
!732 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!733 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!734 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!735 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 152, baseType: !32, size: 32, elements: !737)
!737 = !{!738, !739}
!738 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!739 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!740 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 71, baseType: !103, size: 32, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!742 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!743 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!744 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!745 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!746 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!747 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!748 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!749 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!750 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!751 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!752 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!753 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!754 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!755 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!756 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!757 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!758 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!759 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!760 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!761 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!762 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!763 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!764 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!765 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!766 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!767 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!768 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!769 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!770 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!771 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!772 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!773 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!774 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!775 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!776 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!777 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!778 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!779 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!780 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!781 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!782 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!783 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!784 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !785, line: 44, baseType: !32, size: 32, elements: !786)
!785 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!786 = !{!787, !788, !789, !790}
!787 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!788 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!789 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!790 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !792, line: 54, baseType: !32, size: 32, elements: !793)
!792 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!794 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!795 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!796 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!797 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!798 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!799 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!800 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!801 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!802 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!803 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!804 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!805 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!806 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!807 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!808 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!809 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!810 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !811, line: 53, baseType: !32, size: 32, elements: !812)
!811 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = !{!813, !814, !815, !816, !817, !818}
!813 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!814 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!815 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!816 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!817 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!818 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!819 = !{!702, !102, !103, !820, !862, !863, !864, !865, !203, !119, !225, !624, !866, !867, !285, !868, !898, !272}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !128, line: 923, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 883, size: 10464, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !832, !833, !834, !835, !836, !837, !838, !839, !843, !844, !845, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !822, file: !128, line: 884, baseType: !134, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !822, file: !128, line: 885, baseType: !134, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !822, file: !128, line: 886, baseType: !134, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !822, file: !128, line: 887, baseType: !134, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !822, file: !128, line: 888, baseType: !829, size: 896, offset: 128)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 28)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !822, file: !128, line: 889, baseType: !134, size: 32, offset: 1024)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !822, file: !128, line: 890, baseType: !134, size: 32, offset: 1056)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !822, file: !128, line: 891, baseType: !134, size: 32, offset: 1088)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !822, file: !128, line: 892, baseType: !134, size: 32, offset: 1120)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !822, file: !128, line: 893, baseType: !829, size: 896, offset: 1152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !822, file: !128, line: 894, baseType: !134, size: 32, offset: 2048)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !822, file: !128, line: 895, baseType: !134, size: 32, offset: 2080)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !822, file: !128, line: 896, baseType: !840, size: 960, offset: 2112)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 960, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 30)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !822, file: !128, line: 897, baseType: !134, size: 32, offset: 3072)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !822, file: !128, line: 898, baseType: !134, size: 32, offset: 3104)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !822, file: !128, line: 899, baseType: !846, size: 3008, offset: 3136)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3008, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 94)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !822, file: !128, line: 900, baseType: !134, size: 32, offset: 6144)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !822, file: !128, line: 901, baseType: !134, size: 32, offset: 6176)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !822, file: !128, line: 902, baseType: !134, size: 32, offset: 6208)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !822, file: !128, line: 903, baseType: !133, size: 32, offset: 6240)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !822, file: !128, line: 904, baseType: !141, size: 1984, offset: 6272)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !822, file: !128, line: 905, baseType: !133, size: 32, offset: 8256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !822, file: !128, line: 907, baseType: !133, size: 32, offset: 8288)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !822, file: !128, line: 910, baseType: !133, size: 32, offset: 8320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !822, file: !128, line: 911, baseType: !133, size: 32, offset: 8352)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !822, file: !128, line: 913, baseType: !133, size: 32, offset: 8384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !822, file: !128, line: 917, baseType: !133, size: 32, offset: 8416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !822, file: !128, line: 919, baseType: !141, size: 1984, offset: 8448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !822, file: !128, line: 920, baseType: !134, size: 32, offset: 10432)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !714, line: 146, baseType: !718)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !714, line: 164, baseType: !736)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !496, line: 485, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 468, size: 28704, elements: !871)
!871 = !{!872, !876, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !893, !897}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !870, file: !496, line: 470, baseType: !873, size: 512)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 16)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !870, file: !496, line: 471, baseType: !877, size: 512, offset: 512)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !874)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !870, file: !496, line: 472, baseType: !873, size: 512, offset: 1024)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !870, file: !496, line: 473, baseType: !877, size: 512, offset: 1536)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !870, file: !496, line: 474, baseType: !873, size: 512, offset: 2048)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !870, file: !496, line: 475, baseType: !877, size: 512, offset: 2560)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !870, file: !496, line: 476, baseType: !873, size: 512, offset: 3072)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !870, file: !496, line: 477, baseType: !877, size: 512, offset: 3584)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !870, file: !496, line: 478, baseType: !873, size: 512, offset: 4096)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !870, file: !496, line: 479, baseType: !877, size: 512, offset: 4608)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !870, file: !496, line: 480, baseType: !873, size: 512, offset: 5120)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !870, file: !496, line: 481, baseType: !877, size: 512, offset: 5632)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !870, file: !496, line: 482, baseType: !889, size: 3968, offset: 6144)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 3968, elements: !891)
!890 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !243)
!891 = !{!892}
!892 = !DISubrange(count: 496)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !870, file: !496, line: 483, baseType: !894, size: 18560, offset: 10112)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 18560, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 580)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !870, file: !496, line: 484, baseType: !134, size: 32, offset: 28672)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !785, line: 56, baseType: !102)
!899 = !{!900, !950, !991, !697, !996, !1021, !1023, !1040, !1042, !1052, !1055, !1070, !1108, !1122}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "on", scope: !902, file: !903, line: 549, type: !260, isLocal: true, isDefinition: true)
!902 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !903, file: !903, line: 547, type: !904, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !699, retainedNodes: !906)
!903 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!904 = !DISubroutineType(types: !905)
!905 = !{null, !708}
!906 = !{!907, !908, !911}
!907 = !DILocalVariable(name: "start_mode", arg: 1, scope: !902, file: !903, line: 547, type: !708)
!908 = !DILocalVariable(name: "err", scope: !909, file: !903, line: 553, type: !103)
!909 = distinct !DILexicalBlock(scope: !910, file: !903, line: 552, column: 31)
!910 = distinct !DILexicalBlock(scope: !902, file: !903, line: 552, column: 6)
!911 = !DILocalVariable(name: "mgr", scope: !909, file: !903, line: 554, type: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !914, line: 154, size: 224, elements: !915)
!914 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!915 = !{!916, !928, !929, !945, !947, !948, !949}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !913, file: !914, line: 158, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !919)
!919 = !{!920, !927}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !918, file: !213, line: 36, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !924)
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !923, file: !213, line: 30, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !918, file: !213, line: 37, baseType: !921, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !913, file: !914, line: 163, baseType: !917, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !913, file: !914, line: 166, baseType: !930, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !914, line: 133, size: 96, elements: !933)
!933 = !{!934, !943, !944}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !932, file: !914, line: 135, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !914, line: 129, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !912, !939}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !914, line: 101, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !912, !103}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !932, file: !914, line: 138, baseType: !935, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !932, file: !914, line: 143, baseType: !935, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !913, file: !914, line: 169, baseType: !946, offset: 160)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !913, file: !914, line: 172, baseType: !103, size: 32, offset: 160)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !913, file: !914, line: 175, baseType: !171, size: 16, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !913, file: !914, line: 178, baseType: !171, size: 16, offset: 208)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "cli", scope: !902, file: !903, line: 550, type: !952, isLocal: true, isDefinition: true)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !914, line: 273, size: 128, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !952, file: !914, line: 280, baseType: !922, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !952, file: !914, line: 283, baseType: !956, size: 96, offset: 32)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !957, line: 138, size: 96, elements: !958)
!957 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!958 = !{!959, !988, !989}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !956, file: !957, line: 149, baseType: !960, size: 32)
!960 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !957, line: 139, size: 32, elements: !961)
!961 = !{!962, !983}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !960, file: !957, line: 145, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !452, line: 5397, size: 128, elements: !965)
!965 = !{!966, !981, !982}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !964, file: !452, line: 5399, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !370, line: 48, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !370, line: 37, size: 64, elements: !969)
!969 = !{!970, !976}
!970 = !DIDerivedType(tag: DW_TAG_member, scope: !968, file: !370, line: 38, baseType: !971, size: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !968, file: !370, line: 38, size: 32, elements: !972)
!972 = !{!973, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !971, file: !370, line: 39, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !971, file: !370, line: 40, baseType: !974, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, scope: !968, file: !370, line: 42, baseType: !977, size: 32, offset: 32)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !968, file: !370, line: 42, size: 32, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !977, file: !370, line: 43, baseType: !974, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !977, file: !370, line: 44, baseType: !974, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !964, file: !452, line: 5405, baseType: !32, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !964, file: !452, line: 5408, baseType: !103, size: 32, offset: 96)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !960, file: !957, line: 148, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !957, line: 98, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{null, null}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !956, file: !957, line: 165, baseType: !134, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !956, file: !957, line: 174, baseType: !990, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_48", scope: !699, file: !903, line: 733, type: !993, isLocal: false, isDefinition: true, align: 16)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 80, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 5)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_48", scope: !699, file: !903, line: 733, type: !998, isLocal: true, isDefinition: true, align: 32)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !1000)
!1000 = !{!1001, !1020}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !999, file: !176, line: 60, baseType: !1002, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!103, !1005}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !613, line: 378, size: 192, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1018, !1019}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1007, file: !613, line: 380, baseType: !529, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1007, file: !613, line: 382, baseType: !13, size: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1007, file: !613, line: 384, baseType: !13, size: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1007, file: !613, line: 386, baseType: !1013, size: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !613, line: 351, size: 16, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1014, file: !613, line: 359, baseType: !243, size: 8)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1014, file: !613, line: 364, baseType: !624, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1007, file: !613, line: 388, baseType: !102, size: 32, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1007, file: !613, line: 396, baseType: !627, size: 32, offset: 160)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !999, file: !176, line: 65, baseType: !1005, size: 32, offset: 32)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !699, file: !903, line: 79, type: !260, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "data", scope: !699, file: !903, line: 702, type: !1025, isLocal: true, isDefinition: true)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !903, line: 69, size: 640, elements: !1026)
!1026 = !{!1027, !1029}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1025, file: !903, line: 70, baseType: !1028, size: 448)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 448, elements: !391)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1025, file: !903, line: 71, baseType: !1030, size: 192, offset: 448)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 192, elements: !391)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !903, line: 52, size: 96, elements: !1032)
!1032 = !{!1033, !1038, !1039}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1031, file: !903, line: 53, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !785, line: 72, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !1005, !898, !102}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1031, file: !903, line: 54, baseType: !102, size: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !903, line: 55, baseType: !119, size: 32, offset: 64)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_48", scope: !699, file: !903, line: 733, type: !1014, isLocal: true, isDefinition: true, align: 8)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "d", scope: !1044, file: !903, line: 476, type: !1050, isLocal: true, isDefinition: true)
!1044 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !903, file: !903, line: 474, type: !904, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !699, retainedNodes: !1045)
!1045 = !{!1046, !1047, !1048, !1049}
!1046 = !DILocalVariable(name: "mode", arg: 1, scope: !1044, file: !903, line: 474, type: !708)
!1047 = !DILocalVariable(name: "type", scope: !1044, file: !903, line: 486, type: !862)
!1048 = !DILocalVariable(name: "isr_mode", scope: !1044, file: !903, line: 500, type: !624)
!1049 = !DILocalVariable(name: "key", scope: !1044, file: !903, line: 501, type: !103)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !714, line: 177, baseType: !713)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "target_type", scope: !1044, file: !903, line: 477, type: !1054, isLocal: true, isDefinition: true)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
