; ModuleID = 'build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct._slist*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_consumer_sub", scope: !27, file: !114, line: 11, type: !123, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !299, !332, !336, !341, !346}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "consumer_sub", scope: !27, file: !114, line: 11, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !117)
!116 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !{!118, !120, !166}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !115, file: !116, line: 91, baseType: !119, size: 8)
!119 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !115, file: !116, line: 93, baseType: !121, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !125)
!124 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!125 = !{!126, !147, !152, !155, !156, !159, !160, !161, !162, !163}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !123, file: !124, line: 4206, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !129, file: !128, line: 232, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !134)
!133 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !135)
!135 = !{!136, !142}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !133, line: 38, baseType: !137, size: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !133, line: 38, size: 32, elements: !138)
!138 = !{!139, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !137, file: !133, line: 39, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !133, line: 40, baseType: !140, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !133, line: 42, baseType: !143, size: 32, offset: 32)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !133, line: 42, size: 32, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !143, file: !133, line: 43, baseType: !140, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !133, line: 44, baseType: !140, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !123, file: !124, line: 4208, baseType: !148, size: 32, offset: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !150)
!149 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !148, file: !149, line: 52, baseType: !22, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !123, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !154, line: 214, baseType: !32)
!154 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !123, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !123, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !123, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !123, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !123, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !123, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !165)
!165 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !115, file: !116, line: 96, baseType: !167, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !174)
!174 = !{!175, !179, !181, !182, !187, !280, !294}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !173, file: !116, line: 35, baseType: !176, size: 16)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !178)
!178 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !173, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !173, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !173, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DISubroutineType(types: !186)
!186 = !{!119, !13, !153}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !173, file: !116, line: 56, baseType: !188, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !190)
!190 = !{!191, !192, !278, !279}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !189, file: !124, line: 2722, baseType: !127, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !189, file: !124, line: 2724, baseType: !193, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 896, elements: !196)
!195 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!196 = !{!197, !242, !255, !256, !257, !258, !273}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !194, file: !195, line: 247, baseType: !198, size: 384)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !199)
!199 = !{!200, !214, !216, !217, !218, !229, !230, !231}
!200 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !195, line: 60, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !195, line: 60, size: 64, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !201, file: !195, line: 61, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !134)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !201, file: !195, line: 62, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !206, file: !207, line: 50, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, elements: !212)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!212 = !{!213}
!213 = !DISubrange(count: 2)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !198, file: !195, line: 68, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !198, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !198, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !195, line: 90, baseType: !219, size: 16, offset: 112)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !195, line: 90, size: 16, elements: !220)
!220 = !{!221, !228}
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !195, line: 91, baseType: !222, size: 16)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !195, line: 91, size: 16, elements: !223)
!223 = !{!224, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !222, file: !195, line: 96, baseType: !225, size: 8)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !226)
!226 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !222, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !219, file: !195, line: 100, baseType: !177, size: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !198, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !198, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !198, file: !195, line: 131, baseType: !232, size: 192, offset: 192)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !233)
!233 = !{!234, !235, !241}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !232, file: !128, line: 245, baseType: !204, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !232, file: !128, line: 246, baseType: !236, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !232, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !194, file: !195, line: 250, baseType: !243, size: 288, offset: 384)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !243, file: !244, line: 26, baseType: !108, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !243, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !243, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !243, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !243, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !243, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !243, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !243, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !243, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !194, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !194, file: !195, line: 256, baseType: !127, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !194, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !194, file: !195, line: 325, baseType: !259, size: 32, offset: 800)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !261)
!261 = !{!262, !271, !272}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !260, file: !124, line: 5074, baseType: !263, size: 96)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !264, line: 56, size: 96, elements: !265)
!264 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!265 = !{!266, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !263, file: !264, line: 57, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !264, line: 57, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !263, file: !264, line: 58, baseType: !102, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !263, file: !264, line: 59, baseType: !153, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !260, file: !124, line: 5075, baseType: !127, size: 64, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !260, file: !124, line: 5076, baseType: !148, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !194, file: !195, line: 343, baseType: !274, size: 64, offset: 832)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !274, file: !244, line: 63, baseType: !108, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !274, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !189, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !189, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !173, file: !116, line: 61, baseType: !281, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !283, line: 40, baseType: !284)
!283 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !283, line: 35, size: 64, elements: !285)
!285 = !{!286, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !284, file: !283, line: 36, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !283, line: 33, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !283, line: 29, size: 32, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !283, line: 30, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !284, file: !283, line: 37, baseType: !287, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !173, file: !116, line: 67, baseType: !295, size: 32, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_k_thread_data_consumer_thread_id", scope: !27, file: !114, line: 25, type: !301, isLocal: false, isDefinition: true, align: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !124, line: 620, size: 384, elements: !302)
!302 = !{!303, !304, !312, !313, !318, !319, !320, !321, !322, !323, !325, !329}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !301, file: !124, line: 621, baseType: !193, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !301, file: !124, line: 622, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !307, line: 44, baseType: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !309, line: 47, size: 8, elements: !310)
!309 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !309, line: 48, baseType: !158, size: 8)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !301, file: !124, line: 623, baseType: !32, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !301, file: !124, line: 624, baseType: !314, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !307, line: 46, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !102, !102, !102}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !301, file: !124, line: 625, baseType: !102, size: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !301, file: !124, line: 626, baseType: !102, size: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !301, file: !124, line: 627, baseType: !102, size: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !301, file: !124, line: 628, baseType: !103, size: 32, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !301, file: !124, line: 629, baseType: !108, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !301, file: !124, line: 630, baseType: !324, size: 32, offset: 288)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !301, file: !124, line: 631, baseType: !326, size: 32, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DISubroutineType(types: !328)
!328 = !{null}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !301, file: !124, line: 632, baseType: !330, size: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "consumer_thread_id", scope: !27, file: !114, line: 25, type: !334, isLocal: false, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !195, line: 347, baseType: !193)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_consumer_sub", scope: !27, file: !114, line: 11, type: !338, isLocal: true, isDefinition: true, align: 32)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 16)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "_k_thread_stack_consumer_thread_id", scope: !27, file: !114, line: 25, type: !343, isLocal: false, isDefinition: true, align: 64)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 4096, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 512)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "_k_thread_obj_consumer_thread_id", scope: !27, file: !114, line: 25, type: !194, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_zbus_mutex_processed_data_chan", scope: !350, file: !356, line: 15, type: !366, isLocal: true, isDefinition: true, align: 32)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !352, globals: !353, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration")
!352 = !{!104, !102, !103, !108, !109}
!353 = !{!348, !354, !510, !512, !514, !516, !518, !523, !531}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "processed_data_chan", scope: !350, file: !356, line: 15, type: !357, isLocal: false, isDefinition: true, align: 32)
!356 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !468, !481}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !358, file: !116, line: 35, baseType: !176, size: 16)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !358, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !358, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !358, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !358, file: !116, line: 56, baseType: !365, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !367)
!367 = !{!368, !387, !466, !467}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !366, file: !124, line: 2722, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !370, file: !128, line: 232, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !375)
!375 = !{!376, !382}
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !133, line: 38, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !133, line: 38, size: 32, elements: !378)
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !377, file: !133, line: 39, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !133, line: 40, baseType: !380, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !133, line: 42, baseType: !383, size: 32, offset: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !133, line: 42, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !383, file: !133, line: 43, baseType: !380, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !133, line: 44, baseType: !380, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !366, file: !124, line: 2724, baseType: !388, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 896, elements: !390)
!390 = !{!391, !431, !443, !444, !445, !446, !461}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !389, file: !195, line: 247, baseType: !392, size: 384)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !393)
!393 = !{!394, !405, !407, !408, !409, !418, !419, !420}
!394 = !DIDerivedType(tag: DW_TAG_member, scope: !392, file: !195, line: 60, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !195, line: 60, size: 64, elements: !396)
!396 = !{!397, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !395, file: !195, line: 61, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !374)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !395, file: !195, line: 62, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !400, file: !207, line: 50, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 64, elements: !212)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !392, file: !195, line: 68, baseType: !406, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !392, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !392, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !392, file: !195, line: 90, baseType: !410, size: 16, offset: 112)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !195, line: 90, size: 16, elements: !411)
!411 = !{!412, !417}
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !410, file: !195, line: 91, baseType: !413, size: 16)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !195, line: 91, size: 16, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !413, file: !195, line: 96, baseType: !225, size: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !413, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !410, file: !195, line: 100, baseType: !177, size: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !392, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !392, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !392, file: !195, line: 131, baseType: !421, size: 192, offset: 192)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !422)
!422 = !{!423, !424, !430}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !421, file: !128, line: 245, baseType: !398, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !421, file: !128, line: 246, baseType: !425, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !421, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !389, file: !195, line: 250, baseType: !432, size: 288, offset: 384)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !432, file: !244, line: 26, baseType: !108, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !432, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !432, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !432, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !432, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !432, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !432, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !432, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !432, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !389, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !389, file: !195, line: 256, baseType: !369, size: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !389, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !389, file: !195, line: 325, baseType: !447, size: 32, offset: 800)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !449)
!449 = !{!450, !456, !457}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !448, file: !124, line: 5074, baseType: !451, size: 96)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !264, line: 56, size: 96, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !451, file: !264, line: 57, baseType: !267, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !451, file: !264, line: 58, baseType: !102, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !451, file: !264, line: 59, baseType: !153, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !448, file: !124, line: 5075, baseType: !369, size: 64, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !448, file: !124, line: 5076, baseType: !458, size: 32, offset: 160)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !458, file: !149, line: 52, baseType: !22, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !389, file: !195, line: 343, baseType: !462, size: 64, offset: 832)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !462, file: !244, line: 63, baseType: !108, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !462, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !366, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !366, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !358, file: !116, line: 61, baseType: !469, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !283, line: 40, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !283, line: 35, size: 64, elements: !472)
!472 = !{!473, !480}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !471, file: !283, line: 36, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !283, line: 33, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !283, line: 29, size: 32, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !283, line: 30, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !471, file: !283, line: 37, baseType: !474, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !358, file: !116, line: 67, baseType: !482, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !487)
!487 = !{!488, !489, !504}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !486, file: !116, line: 91, baseType: !119, size: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !486, file: !116, line: 93, baseType: !490, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !492, file: !124, line: 4206, baseType: !369, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !492, file: !124, line: 4208, baseType: !458, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !492, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !492, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !492, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !492, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !492, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !492, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !492, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !492, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !486, file: !116, line: 96, baseType: !505, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "filter_lis", scope: !350, file: !356, line: 38, type: !486, isLocal: false, isDefinition: true, align: 32)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_state_change_sub", scope: !350, file: !356, line: 40, type: !492, isLocal: false, isDefinition: true, align: 32)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "state_change_sub", scope: !350, file: !356, line: 40, type: !486, isLocal: false, isDefinition: true, align: 32)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "_runtime_observers_processed_data_chan", scope: !350, file: !356, line: 15, type: !470, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_state_change_sub", scope: !350, file: !356, line: 40, type: !520, isLocal: true, isDefinition: true, align: 32)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 160, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 20)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "_zbus_message_processed_data_chan", scope: !350, file: !356, line: 15, type: !525, isLocal: true, isDefinition: true)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !526, line: 11, size: 96, elements: !527)
!526 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !525, file: !526, line: 12, baseType: !103, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !525, file: !526, line: 13, baseType: !103, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !525, file: !526, line: 14, baseType: !103, size: 32, offset: 64)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "_zbus_observers_processed_data_chan", scope: !350, file: !356, line: 15, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 64, elements: !212)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "_zbus_mutex_raw_data_chan", scope: !536, file: !541, line: 11, type: !551, isLocal: true, isDefinition: true, align: 32)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !538, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration")
!538 = !{!534, !539, !695, !697, !699, !720, !724, !726, !728, !731, !733, !740, !745, !747}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "raw_data_chan", scope: !536, file: !541, line: 11, type: !542, isLocal: false, isDefinition: true, align: 32)
!541 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !653, !666}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !543, file: !116, line: 35, baseType: !176, size: 16)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !543, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !543, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !543, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !543, file: !116, line: 56, baseType: !550, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !552)
!552 = !{!553, !572, !651, !652}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !551, file: !124, line: 2722, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !555, file: !128, line: 232, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !560)
!560 = !{!561, !567}
!561 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !133, line: 38, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !133, line: 38, size: 32, elements: !563)
!563 = !{!564, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !562, file: !133, line: 39, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !133, line: 40, baseType: !565, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !133, line: 42, baseType: !568, size: 32, offset: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !133, line: 42, size: 32, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !568, file: !133, line: 43, baseType: !565, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !568, file: !133, line: 44, baseType: !565, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !551, file: !124, line: 2724, baseType: !573, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 896, elements: !575)
!575 = !{!576, !616, !628, !629, !630, !631, !646}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !574, file: !195, line: 247, baseType: !577, size: 384)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !578)
!578 = !{!579, !590, !592, !593, !594, !603, !604, !605}
!579 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !195, line: 60, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !195, line: 60, size: 64, elements: !581)
!581 = !{!582, !584}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !580, file: !195, line: 61, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !559)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !580, file: !195, line: 62, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !585, file: !207, line: 50, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 64, elements: !212)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !577, file: !195, line: 68, baseType: !591, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !577, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !577, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!594 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !195, line: 90, baseType: !595, size: 16, offset: 112)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !195, line: 90, size: 16, elements: !596)
!596 = !{!597, !602}
!597 = !DIDerivedType(tag: DW_TAG_member, scope: !595, file: !195, line: 91, baseType: !598, size: 16)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !595, file: !195, line: 91, size: 16, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !598, file: !195, line: 96, baseType: !225, size: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !598, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !595, file: !195, line: 100, baseType: !177, size: 16)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !577, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !577, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !577, file: !195, line: 131, baseType: !606, size: 192, offset: 192)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !607)
!607 = !{!608, !609, !615}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !606, file: !128, line: 245, baseType: !583, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !606, file: !128, line: 246, baseType: !610, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !606, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !574, file: !195, line: 250, baseType: !617, size: 288, offset: 384)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !617, file: !244, line: 26, baseType: !108, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !617, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !617, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !617, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !617, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !617, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !617, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !617, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !617, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !574, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !574, file: !195, line: 256, baseType: !554, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !574, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !574, file: !195, line: 325, baseType: !632, size: 32, offset: 800)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !634)
!634 = !{!635, !641, !642}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !633, file: !124, line: 5074, baseType: !636, size: 96)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !264, line: 56, size: 96, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !636, file: !264, line: 57, baseType: !267, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !636, file: !264, line: 58, baseType: !102, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !636, file: !264, line: 59, baseType: !153, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !633, file: !124, line: 5075, baseType: !554, size: 64, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !633, file: !124, line: 5076, baseType: !643, size: 32, offset: 160)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !643, file: !149, line: 52, baseType: !22, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !574, file: !195, line: 343, baseType: !647, size: 64, offset: 832)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !647, file: !244, line: 63, baseType: !108, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !647, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !551, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !551, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !543, file: !116, line: 61, baseType: !654, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !283, line: 40, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !283, line: 35, size: 64, elements: !657)
!657 = !{!658, !665}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !656, file: !283, line: 36, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !283, line: 33, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !283, line: 29, size: 32, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !661, file: !283, line: 30, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !656, file: !283, line: 37, baseType: !659, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !543, file: !116, line: 67, baseType: !667, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !672)
!672 = !{!673, !674, !689}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !671, file: !116, line: 91, baseType: !119, size: 8)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !671, file: !116, line: 93, baseType: !675, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !677, file: !124, line: 4206, baseType: !554, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !677, file: !124, line: 4208, baseType: !643, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !677, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !677, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !677, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !677, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !677, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !677, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !677, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !677, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !671, file: !116, line: 96, baseType: !690, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "_zbus_mutex_state_chan", scope: !536, file: !541, line: 14, type: !551, isLocal: true, isDefinition: true, align: 32)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "state_chan", scope: !536, file: !541, line: 14, type: !542, isLocal: false, isDefinition: true, align: 32)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "_k_thread_data_produce_thread_id", scope: !536, file: !541, line: 43, type: !701, isLocal: false, isDefinition: true, align: 32)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !124, line: 620, size: 384, elements: !702)
!702 = !{!703, !704, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !701, file: !124, line: 621, baseType: !573, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !701, file: !124, line: 622, baseType: !705, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !307, line: 44, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !309, line: 47, size: 8, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !707, file: !309, line: 48, baseType: !158, size: 8)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !701, file: !124, line: 623, baseType: !32, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !701, file: !124, line: 624, baseType: !314, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !701, file: !124, line: 625, baseType: !102, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !701, file: !124, line: 626, baseType: !102, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !701, file: !124, line: 627, baseType: !102, size: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !701, file: !124, line: 628, baseType: !103, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !701, file: !124, line: 629, baseType: !108, size: 32, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !701, file: !124, line: 630, baseType: !324, size: 32, offset: 288)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !701, file: !124, line: 631, baseType: !326, size: 32, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !701, file: !124, line: 632, baseType: !330, size: 32, offset: 352)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "produce_thread_id", scope: !536, file: !541, line: 43, type: !722, isLocal: false, isDefinition: true)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !195, line: 347, baseType: !573)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "_runtime_observers_raw_data_chan", scope: !536, file: !541, line: 11, type: !655, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "_runtime_observers_state_chan", scope: !536, file: !541, line: 14, type: !655, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "_k_thread_stack_produce_thread_id", scope: !536, file: !541, line: 43, type: !730, isLocal: false, isDefinition: true, align: 64)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 4096, elements: !344)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "_k_thread_obj_produce_thread_id", scope: !536, file: !541, line: 43, type: !574, isLocal: false, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "_zbus_message_raw_data_chan", scope: !536, file: !541, line: 11, type: !735, isLocal: true, isDefinition: true)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !526, line: 11, size: 96, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !735, file: !526, line: 12, baseType: !103, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !735, file: !526, line: 13, baseType: !103, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !735, file: !526, line: 14, baseType: !103, size: 32, offset: 64)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "_zbus_observers_raw_data_chan", scope: !536, file: !541, line: 11, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 32, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 1)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "_zbus_message_state_chan", scope: !536, file: !541, line: 14, type: !119, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "_zbus_observers_state_chan", scope: !536, file: !541, line: 14, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 64, elements: !212)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !752, file: !767, line: 18, type: !768, isLocal: false, isDefinition: true)
!752 = distinct !DICompileUnit(language: DW_LANG_C99, file: !753, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !754, globals: !766, splitDebugInlining: false, nameTableKind: None)
!753 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration")
!754 = !{!22, !102, !24, !755, !757, !759, !153, !103, !760, !761, !763, !764, !157, !765, !177, !330}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!766 = !{!750}
!767 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !770, line: 16, size: 64, elements: !771)
!770 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !769, file: !770, line: 17, baseType: !330, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !769, file: !770, line: 18, baseType: !164, size: 8, offset: 32)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "_char_out", scope: !776, file: !780, line: 54, type: !781, isLocal: false, isDefinition: true)
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !778, globals: !779, splitDebugInlining: false, nameTableKind: None)
!777 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration")
!778 = !{!102, !103}
!779 = !{!774}
!780 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!103, !103}
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !786, file: !1516, line: 202, type: !1517, isLocal: true, isDefinition: true, align: 32)
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !788, globals: !1515, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/runtime_obs_registration")
!788 = !{!102, !103, !789, !911, !1250, !1251, !1318}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !791, line: 335, baseType: !792)
!791 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 320, size: 288, elements: !793)
!793 = !{!794, !805, !811, !825, !836, !847, !851, !862, !863, !874, !875, !890, !891, !901}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !792, file: !791, line: 321, baseType: !795, size: 16)
!795 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !791, line: 50, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 43, size: 16, elements: !798)
!798 = !{!799, !804}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !797, file: !791, line: 48, baseType: !800, size: 16)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !791, line: 44, size: 16, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !800, file: !791, line: 45, baseType: !177, size: 7, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !800, file: !791, line: 47, baseType: !177, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !797, file: !791, line: 49, baseType: !177, size: 16)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !792, file: !791, line: 322, baseType: !806, size: 16, offset: 16)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 16, elements: !212)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !808, line: 52, baseType: !809)
!808 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !164)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !792, file: !791, line: 323, baseType: !812, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !791, line: 107, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 94, size: 32, elements: !815)
!815 = !{!816, !824}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !814, file: !791, line: 105, baseType: !817, size: 32)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !814, file: !791, line: 95, size: 32, elements: !818)
!818 = !{!819, !820, !821, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !817, file: !791, line: 97, baseType: !108, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !817, file: !791, line: 99, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !817, file: !791, line: 100, baseType: !108, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !817, file: !791, line: 102, baseType: !108, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !817, file: !791, line: 103, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !814, file: !791, line: 106, baseType: !108, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !792, file: !791, line: 324, baseType: !826, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !791, line: 155, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 148, size: 32, elements: !829)
!829 = !{!830, !835}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !828, file: !791, line: 153, baseType: !831, size: 32)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !828, file: !791, line: 149, size: 32, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !831, file: !791, line: 150, baseType: !108, size: 16, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !831, file: !791, line: 151, baseType: !108, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !828, file: !791, line: 154, baseType: !108, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !792, file: !791, line: 325, baseType: !837, size: 8, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !791, line: 194, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 187, size: 8, elements: !840)
!840 = !{!841, !846}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !839, file: !791, line: 192, baseType: !842, size: 8)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !791, line: 188, size: 8, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !842, file: !791, line: 189, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !842, file: !791, line: 190, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !839, file: !791, line: 193, baseType: !164, size: 8)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !792, file: !791, line: 326, baseType: !848, size: 24, offset: 104)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 24, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 3)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !792, file: !791, line: 327, baseType: !852, size: 8, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !791, line: 215, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 208, size: 8, elements: !855)
!855 = !{!856, !861}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !854, file: !791, line: 213, baseType: !857, size: 8)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !791, line: 209, size: 8, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !857, file: !791, line: 210, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !857, file: !791, line: 211, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !854, file: !791, line: 214, baseType: !164, size: 8)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !792, file: !791, line: 328, baseType: !848, size: 24, offset: 136)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !792, file: !791, line: 329, baseType: !864, size: 8, offset: 160)
!864 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !791, line: 236, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 229, size: 8, elements: !867)
!867 = !{!868, !873}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !866, file: !791, line: 234, baseType: !869, size: 8)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !866, file: !791, line: 230, size: 8, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !869, file: !791, line: 231, baseType: !809, size: 1, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !869, file: !791, line: 232, baseType: !809, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !866, file: !791, line: 235, baseType: !164, size: 8)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !792, file: !791, line: 330, baseType: !848, size: 24, offset: 168)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !792, file: !791, line: 331, baseType: !876, size: 16, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !791, line: 262, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 250, size: 16, elements: !879)
!879 = !{!880, !889}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !878, file: !791, line: 260, baseType: !881, size: 16)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !791, line: 251, size: 16, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !881, file: !791, line: 252, baseType: !177, size: 1, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !881, file: !791, line: 253, baseType: !177, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !881, file: !791, line: 254, baseType: !177, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !881, file: !791, line: 255, baseType: !177, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !881, file: !791, line: 256, baseType: !177, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !881, file: !791, line: 258, baseType: !177, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !878, file: !791, line: 261, baseType: !177, size: 16)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !792, file: !791, line: 332, baseType: !806, size: 16, offset: 208)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !792, file: !791, line: 333, baseType: !892, size: 32, offset: 224)
!892 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !791, line: 290, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 284, size: 32, elements: !895)
!895 = !{!896, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !894, file: !791, line: 288, baseType: !897, size: 32)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !894, file: !791, line: 285, size: 32, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !897, file: !791, line: 286, baseType: !108, size: 22, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !894, file: !791, line: 289, baseType: !108, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !792, file: !791, line: 334, baseType: !902, size: 16, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !791, line: 308, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !791, line: 303, size: 16, elements: !905)
!905 = !{!906, !910}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !904, file: !791, line: 306, baseType: !907, size: 16)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !904, file: !791, line: 304, size: 16, elements: !908)
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !907, file: !791, line: 305, baseType: !177, size: 16, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !904, file: !791, line: 307, baseType: !177, size: 16)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !913, line: 928, baseType: !914)
!913 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !913, line: 899, size: 672, elements: !915)
!915 = !{!916, !940, !964, !990, !1015, !1031, !1032, !1050, !1051, !1068, !1079, !1080, !1095, !1115, !1116, !1128, !1140, !1150, !1151, !1168, !1172, !1183, !1184, !1196, !1208, !1209, !1220, !1236}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !914, file: !913, line: 900, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !913, line: 64, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !913, line: 43, size: 32, elements: !920)
!920 = !{!921, !939}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !919, file: !913, line: 62, baseType: !922, size: 32)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !919, file: !913, line: 44, size: 32, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !922, file: !913, line: 45, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !922, file: !913, line: 46, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !922, file: !913, line: 47, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !922, file: !913, line: 48, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !922, file: !913, line: 49, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !922, file: !913, line: 50, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !922, file: !913, line: 51, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !922, file: !913, line: 52, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !922, file: !913, line: 53, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !922, file: !913, line: 54, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !922, file: !913, line: 55, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !922, file: !913, line: 56, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !922, file: !913, line: 58, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !922, file: !913, line: 59, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !922, file: !913, line: 60, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !919, file: !913, line: 63, baseType: !108, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !914, file: !913, line: 901, baseType: !941, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !913, line: 125, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !913, line: 104, size: 32, elements: !944)
!944 = !{!945, !963}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !943, file: !913, line: 123, baseType: !946, size: 32)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !943, file: !913, line: 105, size: 32, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !946, file: !913, line: 106, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !946, file: !913, line: 107, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !946, file: !913, line: 108, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !946, file: !913, line: 109, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !946, file: !913, line: 110, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !946, file: !913, line: 111, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !946, file: !913, line: 112, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !946, file: !913, line: 113, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !946, file: !913, line: 114, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !946, file: !913, line: 115, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !946, file: !913, line: 116, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !946, file: !913, line: 117, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !946, file: !913, line: 119, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
