; ModuleID = './build/rtc_set_alarm.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !2, file: !3, line: 51, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !53, globals: !89, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!4 = !{!5, !17, !37, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!10 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!11 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!12 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!13 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!14 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!15 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!16 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 186, baseType: !18, size: 32, elements: !19)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!20 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!21 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!22 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!23 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!24 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!25 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!26 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!27 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!28 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!29 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!30 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!31 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!32 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!33 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!34 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!35 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!36 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 176, baseType: !18, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!40 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!41 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!42 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!43 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 98, baseType: !18, size: 32, elements: !46)
!45 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!48 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!49 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!50 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!51 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!52 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!53 = !{!54, !88}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !56, line: 276, baseType: !57)
!56 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 260, size: 525312, elements: !58)
!58 = !{!59, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !79, !83, !87}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !57, file: !56, line: 261, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 79, baseType: !18)
!64 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !57, file: !56, line: 262, baseType: !60, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !57, file: !56, line: 263, baseType: !60, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !57, file: !56, line: 264, baseType: !60, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !57, file: !56, line: 265, baseType: !60, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !57, file: !56, line: 266, baseType: !60, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !57, file: !56, line: 267, baseType: !60, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !57, file: !56, line: 268, baseType: !60, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !57, file: !56, line: 269, baseType: !60, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !57, file: !56, line: 270, baseType: !60, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !57, file: !56, line: 271, baseType: !75, size: 32, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !57, file: !56, line: 272, baseType: !60, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !57, file: !56, line: 273, baseType: !80, size: 523904, offset: 384)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 16372)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !57, file: !56, line: 274, baseType: !84, size: 512, offset: 524288)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !57, file: !56, line: 275, baseType: !84, size: 512, offset: 524800)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!89 = !{!0}
!90 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_name", scope: !94, file: !95, line: 46, type: !164, isLocal: true, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !96, retainedTypes: !150, globals: !155, splitDebugInlining: false, nameTableKind: None)
!95 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!96 = !{!97, !105, !115, !119, !123, !142, !146}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 387, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!101 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!102 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!103 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!104 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 846, baseType: !18, size: 32, elements: !107)
!106 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!107 = !{!108, !109, !110, !111, !112, !113, !114}
!108 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!109 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!110 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!111 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!112 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!113 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!114 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 397, baseType: !18, size: 32, elements: !116)
!116 = !{!117, !118}
!117 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!118 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 857, baseType: !18, size: 32, elements: !120)
!120 = !{!121, !122}
!121 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!122 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 87, baseType: !18, size: 32, elements: !125)
!124 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!126 = !DIEnumerator(name: "GPT_DIVIDE_1", value: 0)
!127 = !DIEnumerator(name: "GPT_DIVIDE_2", value: 1)
!128 = !DIEnumerator(name: "GPT_DIVIDE_3", value: 2)
!129 = !DIEnumerator(name: "GPT_DIVIDE_4", value: 3)
!130 = !DIEnumerator(name: "GPT_DIVIDE_5", value: 4)
!131 = !DIEnumerator(name: "GPT_DIVIDE_6", value: 5)
!132 = !DIEnumerator(name: "GPT_DIVIDE_7", value: 6)
!133 = !DIEnumerator(name: "GPT_DIVIDE_8", value: 7)
!134 = !DIEnumerator(name: "GPT_DIVIDE_9", value: 8)
!135 = !DIEnumerator(name: "GPT_DIVIDE_10", value: 9)
!136 = !DIEnumerator(name: "GPT_DIVIDE_11", value: 10)
!137 = !DIEnumerator(name: "GPT_DIVIDE_12", value: 11)
!138 = !DIEnumerator(name: "GPT_DIVIDE_13", value: 12)
!139 = !DIEnumerator(name: "GPT_DIVIDE_16", value: 13)
!140 = !DIEnumerator(name: "GPT_DIVIDE_32", value: 14)
!141 = !DIEnumerator(name: "GPT_DIVIDE_64", value: 15)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 380, baseType: !18, size: 32, elements: !143)
!143 = !{!144, !145}
!144 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!145 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 82, baseType: !18, size: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!149 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!150 = !{!61, !88, !151}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !98, line: 371, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !88}
!155 = !{!156, !92}
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_handle", scope: !94, file: !95, line: 47, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 48, elements: !162)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 43, baseType: !161)
!161 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !{!163}
!163 = !DISubrange(count: 6)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 192, elements: !162)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !170, file: !171, line: 48, type: !387, isLocal: false, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !172, retainedTypes: !315, globals: !330, splitDebugInlining: false, nameTableKind: None)
!171 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!172 = !{!173, !146, !232, !238, !105, !142, !115}
!173 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 1170, baseType: !18, size: 32, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!175 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!176 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!177 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!178 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!179 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!180 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!181 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!182 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!183 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!184 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!185 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!186 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!187 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!188 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!189 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!190 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!191 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!192 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!193 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!194 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!195 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!196 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!197 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!198 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!199 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!200 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!201 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!202 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!203 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!204 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!205 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!206 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!207 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!208 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!209 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!210 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!211 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!212 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!213 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!214 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!215 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!216 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!217 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!218 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!219 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!220 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!221 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!222 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!223 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!224 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!225 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!226 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!227 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!228 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!229 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!230 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!231 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 75, baseType: !18, size: 32, elements: !233)
!233 = !{!234, !235, !236, !237}
!234 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!235 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!236 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!237 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !56, line: 44, baseType: !7, size: 32, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!240 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!241 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!242 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!243 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!244 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!245 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!246 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!247 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!248 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!249 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!250 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!251 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!252 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!253 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!254 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!255 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!256 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!257 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!258 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!259 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!260 = !DIEnumerator(name: "KP_IRQn", value: 10)
!261 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!262 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!263 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!264 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!265 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!266 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!267 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!268 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!269 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!270 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!271 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!272 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!273 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!274 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!275 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!276 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!277 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!278 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!279 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!280 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!281 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!282 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!283 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!284 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!285 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!286 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!287 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!288 = !DIEnumerator(name: "SF_IRQn", value: 38)
!289 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!290 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!291 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!292 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!293 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!294 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!295 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!296 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!297 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!298 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!299 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!300 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!301 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!302 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!303 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!304 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!305 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!306 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!307 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!308 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!309 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!310 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!311 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!312 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!313 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!314 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!315 = !{!61, !316, !88}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !56, line: 1272, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1262, size: 288, elements: !319)
!319 = !{!320, !321, !322, !323, !325, !326, !327, !328, !329}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !318, file: !56, line: 1263, baseType: !60, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !318, file: !56, line: 1264, baseType: !60, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !318, file: !56, line: 1265, baseType: !60, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !318, file: !56, line: 1266, baseType: !324, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !318, file: !56, line: 1267, baseType: !60, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !318, file: !56, line: 1268, baseType: !60, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !318, file: !56, line: 1269, baseType: !60, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !318, file: !56, line: 1270, baseType: !60, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !318, file: !56, line: 1271, baseType: !60, size: 32, offset: 256)
!330 = !{!168, !331, !340, !346, !362, !385}
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !170, file: !171, line: 49, type: !333, isLocal: false, isDefinition: true)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !56, line: 1260, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1256, size: 96, elements: !336)
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !335, file: !56, line: 1257, baseType: !324, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !335, file: !56, line: 1258, baseType: !60, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !335, file: !56, line: 1259, baseType: !60, size: 32, offset: 64)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "flag", scope: !342, file: !171, line: 88, type: !91, isLocal: true, isDefinition: true)
!342 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !171, file: !171, line: 86, type: !343, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !170, retainedNodes: !345)
!343 = !DISubroutineType(types: !344)
!344 = !{null}
!345 = !{}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !170, file: !171, line: 51, type: !348, isLocal: false, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 768, elements: !162)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !124, line: 116, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 111, size: 128, elements: !351)
!351 = !{!352, !354, !360, !361}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !350, file: !124, line: 112, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !98, line: 400, baseType: !115)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !350, file: !124, line: 113, baseType: !355, size: 64, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !124, line: 109, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 106, size: 64, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !356, file: !124, line: 107, baseType: !151, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !356, file: !124, line: 108, baseType: !88, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !350, file: !124, line: 114, baseType: !91, size: 8, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !350, file: !124, line: 115, baseType: !91, size: 8, offset: 104)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !170, file: !171, line: 52, type: !364, isLocal: false, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !124, line: 134, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 125, size: 4256, elements: !366)
!366 = !{!367, !378, !379, !380, !381, !382, !383, !384}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !365, file: !124, line: 126, baseType: !368, size: 4096)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 4096, elements: !376)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !124, line: 123, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 118, size: 128, elements: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !370, file: !124, line: 119, baseType: !355, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !370, file: !124, line: 120, baseType: !61, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !370, file: !124, line: 121, baseType: !91, size: 8, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !370, file: !124, line: 122, baseType: !91, size: 8, offset: 104)
!376 = !{!377}
!377 = !DISubrange(count: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !365, file: !124, line: 127, baseType: !61, size: 32, offset: 4096)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !365, file: !124, line: 128, baseType: !61, size: 32, offset: 4128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !365, file: !124, line: 129, baseType: !61, size: 32, offset: 4160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !365, file: !124, line: 130, baseType: !61, size: 32, offset: 4192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !365, file: !124, line: 131, baseType: !91, size: 8, offset: 4224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !365, file: !124, line: 132, baseType: !91, size: 8, offset: 4232)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !365, file: !124, line: 133, baseType: !91, size: 8, offset: 4240)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !170, file: !171, line: 53, type: !61, isLocal: false, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 192, elements: !162)
!388 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !391, file: !392, line: 64, type: !492, isLocal: false, isDefinition: true)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !393, retainedTypes: !487, globals: !491, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!393 = !{!394, !446, !453, !457, !463, !467, !476, !481}
!394 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 339, baseType: !18, size: 32, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!396 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!397 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!398 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!399 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!400 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!401 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!402 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!403 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!404 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!405 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!406 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!407 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!408 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!409 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!410 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!411 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!412 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!413 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!414 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!415 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!416 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!417 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!418 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!419 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!420 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!421 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!422 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!423 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!424 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!425 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!426 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!427 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!428 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!429 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!430 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!431 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!432 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!433 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!434 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!435 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!436 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!437 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!438 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!439 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!440 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!441 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!442 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!443 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!444 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!445 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 224, baseType: !7, size: 32, elements: !448)
!447 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!448 = !{!449, !450, !451, !452}
!449 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!450 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!451 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!452 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 210, baseType: !18, size: 32, elements: !454)
!454 = !{!455, !456}
!455 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!456 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 233, baseType: !7, size: 32, elements: !458)
!458 = !{!459, !460, !461, !462}
!459 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!460 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!461 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!462 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 217, baseType: !18, size: 32, elements: !464)
!464 = !{!465, !466}
!465 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!466 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 415, baseType: !18, size: 32, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475}
!469 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!470 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!471 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!472 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!473 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!474 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!475 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!476 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 427, baseType: !18, size: 32, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!479 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!480 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 242, baseType: !18, size: 32, elements: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!484 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!485 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!486 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!487 = !{!88, !488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !447, line: 213, baseType: !453)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !447, line: 220, baseType: !463)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !447, line: 247, baseType: !481)
!491 = !{!389}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !56, line: 1554, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1522, size: 29440, elements: !495)
!495 = !{!496, !510, !514, !523, !524, !533, !534, !543, !544, !554, !555, !564, !565, !574, !575, !584, !585, !594, !598, !607, !608, !617, !618, !627, !636, !637, !648, !652, !661, !662}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !494, file: !56, line: 1523, baseType: !497, size: 256)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 256, elements: !508)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !56, line: 1400, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1395, size: 128, elements: !500)
!500 = !{!501, !502, !503, !504}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !499, file: !56, line: 1396, baseType: !60, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !499, file: !56, line: 1397, baseType: !60, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !499, file: !56, line: 1398, baseType: !60, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !499, file: !56, line: 1399, baseType: !505, size: 32, offset: 96)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 32, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 4)
!508 = !{!509}
!509 = !DISubrange(count: 2)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !494, file: !56, line: 1524, baseType: !511, size: 1792, offset: 256)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1792, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !494, file: !56, line: 1525, baseType: !515, size: 256, offset: 2048)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 256, elements: !508)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !56, line: 1409, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1404, size: 128, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !517, file: !56, line: 1405, baseType: !60, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !517, file: !56, line: 1406, baseType: !60, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !517, file: !56, line: 1407, baseType: !60, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !517, file: !56, line: 1408, baseType: !505, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !494, file: !56, line: 1526, baseType: !511, size: 1792, offset: 2304)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !494, file: !56, line: 1527, baseType: !525, size: 256, offset: 4096)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 256, elements: !508)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !56, line: 1417, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1412, size: 128, elements: !528)
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !527, file: !56, line: 1413, baseType: !60, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !527, file: !56, line: 1414, baseType: !60, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !527, file: !56, line: 1415, baseType: !60, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !527, file: !56, line: 1416, baseType: !505, size: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !494, file: !56, line: 1528, baseType: !511, size: 1792, offset: 4352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !494, file: !56, line: 1529, baseType: !535, size: 256, offset: 6144)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 256, elements: !508)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !56, line: 1426, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1421, size: 128, elements: !538)
!538 = !{!539, !540, !541, !542}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !537, file: !56, line: 1422, baseType: !60, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !537, file: !56, line: 1423, baseType: !60, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !537, file: !56, line: 1424, baseType: !60, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !537, file: !56, line: 1425, baseType: !505, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !494, file: !56, line: 1530, baseType: !511, size: 1792, offset: 6400)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !494, file: !56, line: 1531, baseType: !545, size: 256, offset: 8192)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 256, elements: !508)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !56, line: 1432, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1429, size: 128, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !547, file: !56, line: 1430, baseType: !60, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !547, file: !56, line: 1431, baseType: !551, size: 96, offset: 32)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 96, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 12)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !494, file: !56, line: 1532, baseType: !511, size: 1792, offset: 8448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !494, file: !56, line: 1533, baseType: !556, size: 256, offset: 10240)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 256, elements: !508)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !56, line: 1440, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1435, size: 128, elements: !559)
!559 = !{!560, !561, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !558, file: !56, line: 1436, baseType: !60, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !558, file: !56, line: 1437, baseType: !60, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !558, file: !56, line: 1438, baseType: !60, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !558, file: !56, line: 1439, baseType: !505, size: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !494, file: !56, line: 1534, baseType: !511, size: 1792, offset: 10496)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !494, file: !56, line: 1535, baseType: !566, size: 256, offset: 12288)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 256, elements: !508)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !56, line: 1448, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1443, size: 128, elements: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !568, file: !56, line: 1444, baseType: !60, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !568, file: !56, line: 1445, baseType: !60, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !568, file: !56, line: 1446, baseType: !60, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !568, file: !56, line: 1447, baseType: !505, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !494, file: !56, line: 1536, baseType: !511, size: 1792, offset: 12544)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !494, file: !56, line: 1537, baseType: !576, size: 256, offset: 14336)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 256, elements: !508)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !56, line: 1455, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1450, size: 128, elements: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !578, file: !56, line: 1451, baseType: !60, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !578, file: !56, line: 1452, baseType: !60, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !578, file: !56, line: 1453, baseType: !60, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !578, file: !56, line: 1454, baseType: !505, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !494, file: !56, line: 1538, baseType: !511, size: 1792, offset: 14592)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !494, file: !56, line: 1539, baseType: !586, size: 512, offset: 16384)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 512, elements: !506)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !56, line: 1463, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1458, size: 128, elements: !589)
!589 = !{!590, !591, !592, !593}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !588, file: !56, line: 1459, baseType: !60, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !588, file: !56, line: 1460, baseType: !60, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !588, file: !56, line: 1461, baseType: !60, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !588, file: !56, line: 1462, baseType: !505, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !494, file: !56, line: 1540, baseType: !595, size: 1536, offset: 16896)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1536, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !494, file: !56, line: 1541, baseType: !599, size: 256, offset: 18432)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 256, elements: !508)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !56, line: 1471, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1466, size: 128, elements: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !601, file: !56, line: 1467, baseType: !60, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !601, file: !56, line: 1468, baseType: !60, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !601, file: !56, line: 1469, baseType: !60, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !601, file: !56, line: 1470, baseType: !505, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !494, file: !56, line: 1542, baseType: !511, size: 1792, offset: 18688)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !494, file: !56, line: 1543, baseType: !609, size: 256, offset: 20480)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 256, elements: !508)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !56, line: 1480, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1475, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !611, file: !56, line: 1476, baseType: !60, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !611, file: !56, line: 1477, baseType: !60, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !611, file: !56, line: 1478, baseType: !60, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !611, file: !56, line: 1479, baseType: !505, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !494, file: !56, line: 1544, baseType: !511, size: 1792, offset: 20736)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !494, file: !56, line: 1545, baseType: !619, size: 256, offset: 22528)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 256, elements: !508)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !56, line: 1489, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1484, size: 128, elements: !622)
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !621, file: !56, line: 1485, baseType: !60, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !621, file: !56, line: 1486, baseType: !60, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !621, file: !56, line: 1487, baseType: !60, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !621, file: !56, line: 1488, baseType: !505, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !494, file: !56, line: 1546, baseType: !628, size: 256, offset: 22784)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 256, elements: !508)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !56, line: 1497, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1492, size: 128, elements: !631)
!631 = !{!632, !633, !634, !635}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !630, file: !56, line: 1493, baseType: !60, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !630, file: !56, line: 1494, baseType: !60, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !630, file: !56, line: 1495, baseType: !60, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !630, file: !56, line: 1496, baseType: !505, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !494, file: !56, line: 1547, baseType: !595, size: 1536, offset: 23040)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !494, file: !56, line: 1548, baseType: !638, size: 896, offset: 24576)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 896, elements: !646)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !56, line: 1505, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1500, size: 128, elements: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !640, file: !56, line: 1501, baseType: !60, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !640, file: !56, line: 1502, baseType: !60, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !640, file: !56, line: 1503, baseType: !60, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !640, file: !56, line: 1504, baseType: !505, size: 32, offset: 96)
!646 = !{!647}
!647 = !DISubrange(count: 7)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !494, file: !56, line: 1549, baseType: !649, size: 1152, offset: 25472)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1152, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 144)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !494, file: !56, line: 1550, baseType: !653, size: 512, offset: 26624)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 512, elements: !506)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !56, line: 1513, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1508, size: 128, elements: !656)
!656 = !{!657, !658, !659, !660}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !655, file: !56, line: 1509, baseType: !60, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !655, file: !56, line: 1510, baseType: !60, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !655, file: !56, line: 1511, baseType: !60, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !655, file: !56, line: 1512, baseType: !505, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !494, file: !56, line: 1551, baseType: !595, size: 1536, offset: 27136)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !494, file: !56, line: 1552, baseType: !663, size: 768, offset: 28672)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 768, elements: !162)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !56, line: 1519, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1516, size: 128, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !665, file: !56, line: 1517, baseType: !60, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !665, file: !56, line: 1518, baseType: !551, size: 96, offset: 32)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !671, file: !672, line: 101, type: !864, isLocal: true, isDefinition: true)
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !775, globals: !785, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!673 = !{!674, !681, !696, !702, !708, !713, !718, !725, !741, !747, !751, !756, !763, !771}
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 180, baseType: !18, size: 32, elements: !675)
!675 = !{!676, !677, !678, !679, !680}
!676 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!677 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!678 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!679 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!680 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !682, line: 189, baseType: !18, size: 32, elements: !683)
!682 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!684 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!685 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!686 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!687 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!688 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!689 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!690 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!691 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!692 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!693 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!694 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!695 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 355, baseType: !7, size: 32, elements: !698)
!697 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!698 = !{!699, !700, !701}
!699 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!700 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!701 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !682, line: 206, baseType: !7, size: 32, elements: !703)
!703 = !{!704, !705, !706, !707}
!704 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!705 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!706 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!707 = !DIEnumerator(name: "VDMA_OK", value: 0)
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !672, line: 65, baseType: !18, size: 32, elements: !709)
!709 = !{!710, !711, !712}
!710 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!711 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!712 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !672, line: 77, baseType: !18, size: 32, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIEnumerator(name: "UART_FLOWCONTROL_NONE", value: 0)
!716 = !DIEnumerator(name: "UART_FLOWCONTROL_SOFTWARE", value: 1)
!717 = !DIEnumerator(name: "UART_FLOWCONTROL_HARDWARE", value: 2)
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 345, baseType: !7, size: 32, elements: !719)
!719 = !{!720, !721, !722, !723, !724}
!720 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!721 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!722 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!723 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!724 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 302, baseType: !18, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!727 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!728 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!729 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!730 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!731 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!732 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!733 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!734 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!735 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!736 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!737 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!738 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!739 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!740 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 321, baseType: !18, size: 32, elements: !742)
!742 = !{!743, !744, !745, !746}
!743 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!744 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!745 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!746 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!747 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 330, baseType: !18, size: 32, elements: !748)
!748 = !{!749, !750}
!749 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!750 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!751 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 337, baseType: !18, size: 32, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!754 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!755 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !757, line: 101, baseType: !7, size: 32, elements: !758)
!757 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!758 = !{!759, !760, !761, !762}
!759 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!760 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!761 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!762 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !764, line: 152, baseType: !7, size: 32, elements: !765)
!764 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!765 = !{!766, !767, !768, !769, !770}
!766 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!767 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!768 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!769 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!770 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!771 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !682, line: 222, baseType: !7, size: 32, elements: !772)
!772 = !{!773, !774}
!773 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!774 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!775 = !{!88, !776, !61, !777}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !779, line: 96, baseType: !780)
!779 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 93, size: 64, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !780, file: !779, line: 94, baseType: !91, size: 8)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !780, file: !779, line: 95, baseType: !784, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !106, line: 186, baseType: !674)
!785 = !{!786, !789, !791, !793, !795, !799, !808, !822, !669, !824, !837, !842, !856, !862}
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !671, file: !672, line: 92, type: !788, isLocal: true, isDefinition: true)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !506)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "g_uart_restore_init", scope: !671, file: !672, line: 93, type: !91, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !671, file: !672, line: 94, type: !788, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !671, file: !672, line: 95, type: !505, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "g_uart_flowcontrol_status", scope: !671, file: !672, line: 96, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 128, elements: !506)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_flowcontrol_t", file: !672, line: 81, baseType: !713)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "g_uart_sw_flowcontrol_config", scope: !671, file: !672, line: 97, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 96, elements: !506)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_sw_flowcontrol_config_t", file: !672, line: 87, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 83, size: 24, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "xon", scope: !803, file: !672, line: 84, baseType: !159, size: 8)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !803, file: !672, line: 85, baseType: !159, size: 8, offset: 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "escape_character", scope: !803, file: !672, line: 86, baseType: !159, size: 8, offset: 16)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "g_uart_config", scope: !671, file: !672, line: 98, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 512, elements: !506)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !697, line: 378, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 373, size: 128, elements: !813)
!813 = !{!814, !816, !818, !820}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !812, file: !697, line: 374, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !697, line: 317, baseType: !725)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !812, file: !697, line: 375, baseType: !817, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !697, line: 326, baseType: !741)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !812, file: !697, line: 376, baseType: !819, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !697, line: 333, baseType: !747)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !812, file: !697, line: 377, baseType: !821, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !697, line: 341, baseType: !751)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "g_uart_irq_pending_status", scope: !671, file: !672, line: 99, type: !788, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !671, file: !672, line: 102, type: !826, isLocal: true, isDefinition: true)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 256, elements: !506)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !672, line: 74, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 71, size: 64, elements: !829)
!829 = !{!830, !836}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !828, file: !672, line: 72, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !697, line: 410, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !835, !88}
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !697, line: 359, baseType: !696)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !828, file: !672, line: 73, baseType: !88, size: 32, offset: 32)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !671, file: !672, line: 103, type: !839, isLocal: true, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 512, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 8)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !671, file: !672, line: 104, type: !844, isLocal: true, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 896, elements: !506)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !697, line: 390, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 382, size: 224, elements: !847)
!847 = !{!848, !850, !851, !852, !853, !854, !855}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !846, file: !697, line: 383, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !846, file: !697, line: 384, baseType: !61, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !846, file: !697, line: 385, baseType: !61, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !846, file: !697, line: 386, baseType: !849, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !846, file: !697, line: 387, baseType: !61, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !846, file: !697, line: 388, baseType: !61, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !846, file: !697, line: 389, baseType: !61, size: 32, offset: 192)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !671, file: !672, line: 105, type: !858, isLocal: true, isDefinition: true)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 416, elements: !860)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!860 = !{!861}
!861 = !DISubrange(count: 13)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !671, file: !672, line: 90, type: !91, isLocal: true, isDefinition: true)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 128, elements: !506)
!865 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !672, line: 69, baseType: !708)
!867 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!868 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !871, file: !872, line: 53, type: !956, isLocal: false, isDefinition: true)
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !873, retainedTypes: !884, globals: !940, splitDebugInlining: false, nameTableKind: None)
!872 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!873 = !{!173, !238, !681, !674, !874}
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !779, line: 46, baseType: !18, size: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883}
!876 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!877 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!878 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!879 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!880 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!881 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!882 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!883 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !56, line: 588, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 542, size: 800, elements: !888)
!888 = !{!889, !895, !900, !906, !907, !912, !917, !918, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !887, file: !56, line: 547, baseType: !890, size: 32)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !887, file: !56, line: 543, size: 32, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !890, file: !56, line: 544, baseType: !324, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !890, file: !56, line: 545, baseType: !60, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !890, file: !56, line: 546, baseType: !60, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !887, file: !56, line: 551, baseType: !896, size: 32, offset: 32)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !887, file: !56, line: 548, size: 32, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !896, file: !56, line: 549, baseType: !60, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !896, file: !56, line: 550, baseType: !60, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !887, file: !56, line: 556, baseType: !901, size: 32, offset: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !887, file: !56, line: 552, size: 32, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !901, file: !56, line: 553, baseType: !324, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !901, file: !56, line: 554, baseType: !60, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !901, file: !56, line: 555, baseType: !60, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !887, file: !56, line: 557, baseType: !60, size: 32, offset: 96)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !887, file: !56, line: 561, baseType: !908, size: 32, offset: 128)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !887, file: !56, line: 558, size: 32, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !908, file: !56, line: 559, baseType: !60, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !908, file: !56, line: 560, baseType: !60, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !887, file: !56, line: 565, baseType: !913, size: 32, offset: 160)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !887, file: !56, line: 562, size: 32, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !913, file: !56, line: 563, baseType: !324, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !913, file: !56, line: 564, baseType: !60, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !887, file: !56, line: 566, baseType: !60, size: 32, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !887, file: !56, line: 570, baseType: !919, size: 32, offset: 224)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !887, file: !56, line: 567, size: 32, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !919, file: !56, line: 568, baseType: !60, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !919, file: !56, line: 569, baseType: !60, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !887, file: !56, line: 571, baseType: !60, size: 32, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !887, file: !56, line: 572, baseType: !60, size: 32, offset: 288)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !887, file: !56, line: 573, baseType: !60, size: 32, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !887, file: !56, line: 574, baseType: !60, size: 32, offset: 352)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !887, file: !56, line: 575, baseType: !324, size: 32, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !887, file: !56, line: 576, baseType: !60, size: 32, offset: 416)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !887, file: !56, line: 577, baseType: !60, size: 32, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !887, file: !56, line: 578, baseType: !60, size: 32, offset: 480)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !887, file: !56, line: 579, baseType: !60, size: 32, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !887, file: !56, line: 580, baseType: !60, size: 32, offset: 544)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !887, file: !56, line: 581, baseType: !60, size: 32, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !887, file: !56, line: 582, baseType: !60, size: 32, offset: 608)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !887, file: !56, line: 583, baseType: !60, size: 32, offset: 640)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !887, file: !56, line: 584, baseType: !60, size: 32, offset: 672)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !887, file: !56, line: 585, baseType: !60, size: 32, offset: 704)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !887, file: !56, line: 586, baseType: !324, size: 32, offset: 736)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !887, file: !56, line: 587, baseType: !60, size: 32, offset: 768)
!940 = !{!869, !941, !946, !952}
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !871, file: !872, line: 54, type: !943, isLocal: false, isDefinition: true)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 128, elements: !506)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !106, line: 1237, baseType: !173)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !871, file: !872, line: 55, type: !948, isLocal: false, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 128, elements: !506)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !56, line: 125, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !56, line: 123, baseType: !238)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !871, file: !872, line: 57, type: !954, isLocal: false, isDefinition: true)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 128, elements: !506)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 128, elements: !506)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "g_i2c_tx_dma_channel", scope: !960, file: !961, line: 47, type: !1074, isLocal: false, isDefinition: true)
!960 = distinct !DICompileUnit(language: DW_LANG_C99, file: !961, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !962, globals: !1007, splitDebugInlining: false, nameTableKind: None)
!961 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_i2c_master_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!962 = !{!963, !173, !973, !983, !1000}
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !682, line: 137, baseType: !18, size: 32, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972}
!965 = !DIEnumerator(name: "PDMA_START_CHANNEL", value: 1)
!966 = !DIEnumerator(name: "PDMA_MSDC1", value: 1)
!967 = !DIEnumerator(name: "PDMA_MSDC2", value: 2)
!968 = !DIEnumerator(name: "PDMA_I2C0_TX", value: 3)
!969 = !DIEnumerator(name: "PDMA_I2C0_RX", value: 4)
!970 = !DIEnumerator(name: "PDMA_I2C1_TX", value: 5)
!971 = !DIEnumerator(name: "PDMA_I2C1_RX", value: 6)
!972 = !DIEnumerator(name: "PDMA_END_CHANNEL", value: 7)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !974, line: 132, baseType: !18, size: 32, elements: !975)
!974 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_i2c_master_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!975 = !{!976, !977, !978, !979, !980, !981, !982}
!976 = !DIEnumerator(name: "I2C_FREQUENCY_50K", value: 50)
!977 = !DIEnumerator(name: "I2C_FREQUENCY_100K", value: 100)
!978 = !DIEnumerator(name: "I2C_FREQUENCY_200K", value: 200)
!979 = !DIEnumerator(name: "I2C_FREQUENCY_300K", value: 300)
!980 = !DIEnumerator(name: "I2C_FREQUENCY_400K", value: 400)
!981 = !DIEnumerator(name: "I2C_FREQUENCY_1M", value: 1000)
!982 = !DIEnumerator(name: "I2C_FREQUENCY_MAX", value: 1001)
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !974, line: 142, baseType: !18, size: 32, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!985 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_POLLING", value: 0)
!986 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_DMA", value: 1)
!987 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_POLLING", value: 2)
!988 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_DMA", value: 3)
!989 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_POLLING", value: 4)
!990 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_DMA", value: 5)
!991 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_POLLING", value: 6)
!992 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA", value: 7)
!993 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_POLLING", value: 8)
!994 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA", value: 9)
!995 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_POLLING", value: 10)
!996 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA", value: 11)
!997 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA_EXTEND", value: 12)
!998 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA_EXTEND", value: 13)
!999 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA_EXTEND", value: 14)
!1000 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !974, line: 162, baseType: !7, size: 32, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006}
!1002 = !DIEnumerator(name: "I2C_TRANSACTION_UNKNOWN_ERROR", value: -4)
!1003 = !DIEnumerator(name: "I2C_TRANSACTION_ACK_ERROR", value: -3)
!1004 = !DIEnumerator(name: "I2C_TRANSACTION_NACK_ERROR", value: -2)
!1005 = !DIEnumerator(name: "I2C_TRANSACTION_TIMEOUT_ERROR", value: -1)
!1006 = !DIEnumerator(name: "I2C_TRANSACTION_SUCCESS", value: 0)
!1007 = !{!1008, !958, !1072, !1077, !1079}
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "i2c_master_register", scope: !960, file: !961, line: 46, type: !1010, isLocal: false, isDefinition: true)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1011, size: 128, elements: !506)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2C_REGISTER_T", file: !56, line: 1885, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1833, size: 960, elements: !1015)
!1015 = !{!1016, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "DATA_PORT", scope: !1014, file: !56, line: 1834, baseType: !1017, size: 16)
!1017 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !62, line: 36, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !64, line: 57, baseType: !1020)
!1020 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1014, file: !56, line: 1835, baseType: !1017, size: 16, offset: 16)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "SLAVE_ADDR", scope: !1014, file: !56, line: 1836, baseType: !1017, size: 16, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1014, file: !56, line: 1837, baseType: !1017, size: 16, offset: 48)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_MASK", scope: !1014, file: !56, line: 1838, baseType: !1017, size: 16, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1014, file: !56, line: 1839, baseType: !1017, size: 16, offset: 80)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_STAT", scope: !1014, file: !56, line: 1840, baseType: !1017, size: 16, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1014, file: !56, line: 1841, baseType: !1017, size: 16, offset: 112)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "CONTROL", scope: !1014, file: !56, line: 1842, baseType: !1017, size: 16, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1014, file: !56, line: 1843, baseType: !1017, size: 16, offset: 144)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN", scope: !1014, file: !56, line: 1844, baseType: !1017, size: 16, offset: 160)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1014, file: !56, line: 1845, baseType: !1017, size: 16, offset: 176)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSAC_LEN", scope: !1014, file: !56, line: 1846, baseType: !1017, size: 16, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !1014, file: !56, line: 1847, baseType: !1017, size: 16, offset: 208)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "DELAY_LEN", scope: !1014, file: !56, line: 1848, baseType: !1017, size: 16, offset: 224)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !1014, file: !56, line: 1849, baseType: !1017, size: 16, offset: 240)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "TIMING", scope: !1014, file: !56, line: 1850, baseType: !1017, size: 16, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !1014, file: !56, line: 1851, baseType: !1017, size: 16, offset: 272)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "START", scope: !1014, file: !56, line: 1852, baseType: !1017, size: 16, offset: 288)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !1014, file: !56, line: 1853, baseType: !1017, size: 16, offset: 304)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !1014, file: !56, line: 1854, baseType: !1041, size: 32, offset: 320)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 32, elements: !508)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "CLOCK_DIV", scope: !1014, file: !56, line: 1855, baseType: !1017, size: 16, offset: 352)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !1014, file: !56, line: 1856, baseType: !1017, size: 16, offset: 368)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_STAT", scope: !1014, file: !56, line: 1857, baseType: !1017, size: 16, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !1014, file: !56, line: 1858, baseType: !1017, size: 16, offset: 400)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_THRESH", scope: !1014, file: !56, line: 1859, baseType: !1017, size: 16, offset: 416)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !1014, file: !56, line: 1860, baseType: !1017, size: 16, offset: 432)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_ADDR_CLR", scope: !1014, file: !56, line: 1861, baseType: !1017, size: 16, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED15", scope: !1014, file: !56, line: 1862, baseType: !1017, size: 16, offset: 464)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED16", scope: !1014, file: !56, line: 1863, baseType: !1041, size: 32, offset: 480)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "IO_CONFIG", scope: !1014, file: !56, line: 1864, baseType: !1017, size: 16, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED17", scope: !1014, file: !56, line: 1865, baseType: !1017, size: 16, offset: 528)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED18", scope: !1014, file: !56, line: 1866, baseType: !1041, size: 32, offset: 544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "HS", scope: !1014, file: !56, line: 1867, baseType: !1017, size: 16, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED19", scope: !1014, file: !56, line: 1868, baseType: !1017, size: 16, offset: 592)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED20", scope: !1014, file: !56, line: 1869, baseType: !1041, size: 32, offset: 608)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "SOFTRESET", scope: !1014, file: !56, line: 1870, baseType: !1017, size: 16, offset: 640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED21", scope: !1014, file: !56, line: 1871, baseType: !1017, size: 16, offset: 656)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED22", scope: !1014, file: !56, line: 1872, baseType: !1060, size: 96, offset: 672)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 96, elements: !162)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "SPARE", scope: !1014, file: !56, line: 1873, baseType: !1017, size: 16, offset: 768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED23", scope: !1014, file: !56, line: 1874, baseType: !1017, size: 16, offset: 784)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGSTAT", scope: !1014, file: !56, line: 1875, baseType: !1017, size: 16, offset: 800)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED24", scope: !1014, file: !56, line: 1876, baseType: !1017, size: 16, offset: 816)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGCTRL", scope: !1014, file: !56, line: 1877, baseType: !1017, size: 16, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED25", scope: !1014, file: !56, line: 1878, baseType: !1017, size: 16, offset: 848)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN_AUX", scope: !1014, file: !56, line: 1879, baseType: !1017, size: 16, offset: 864)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED26", scope: !1014, file: !56, line: 1880, baseType: !1017, size: 16, offset: 880)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED27", scope: !1014, file: !56, line: 1881, baseType: !1041, size: 32, offset: 896)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "TIMEOUT", scope: !1014, file: !56, line: 1882, baseType: !1017, size: 16, offset: 928)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED28", scope: !1014, file: !56, line: 1883, baseType: !1017, size: 16, offset: 944)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "g_i2c_rx_dma_channel", scope: !960, file: !961, line: 48, type: !1074, isLocal: false, isDefinition: true)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 128, elements: !506)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_channel_t", file: !682, line: 147, baseType: !963)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "g_i2c_pdn_table", scope: !960, file: !961, line: 49, type: !943, isLocal: false, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "g_i2c_source_clock_table", scope: !960, file: !961, line: 52, type: !1081, isLocal: false, isDefinition: true)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !506)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "EINT_REGISTER", scope: !1084, file: !1085, line: 55, type: !1175, isLocal: false, isDefinition: true)
!1084 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1085, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1086, retainedTypes: !1141, globals: !1147, splitDebugInlining: false, nameTableKind: None)
!1085 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_eint.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!1086 = !{!1087, !1094, !1129, !238, !1136}
!1087 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1088, line: 204, baseType: !7, size: 32, elements: !1089)
!1088 = !DIFile(filename: "../../../../../driver/chip/inc/hal_eint.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/rtc_set_alarm/GCC")
!1089 = !{!1090, !1091, !1092, !1093}
!1090 = !DIEnumerator(name: "HAL_EINT_STATUS_ERROR_EINT_NUMBER", value: -3)
!1091 = !DIEnumerator(name: "HAL_EINT_STATUS_INVALID_PARAMETER", value: -2)
