; ModuleID = './build/irrx_receive_pwd_data.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.hal_irrx_rc5_code_t = type { i8, [2 x i32] }
%struct.hal_irrx_pwd_config_t = type { i8, i32 }
%struct._IOT_IRRX_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !{!26, !27}
!26 = !DIEnumerator(name: "LOW_HAL_IRRX_MODE_RC5", value: 0)
!27 = !DIEnumerator(name: "LOW_HAL_IRRX_MODE_PWD", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 176, baseType: !24, size: 32, elements: !29)
!29 = !{!30, !31}
!30 = !DIEnumerator(name: "HAL_IRRX_IDLE", value: 0)
!31 = !DIEnumerator(name: "HAL_IRRX_BUSY", value: 1)
!32 = !{!33, !38, !41, !37, !42, !43}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "low_hal_irrx_callback_t", file: !23, line: 87, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PUINT8", file: !39, line: 84, baseType: !40)
!39 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PUINT32", file: !39, line: 86, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !39, line: 59, baseType: !18)
!44 = !{!45}
!45 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_irrx_running_status_t", file: !6, line: 179, baseType: !28)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!48 = distinct !DIGlobalVariable(name: "s_low_hal_irrx_rc5_callback", scope: !49, file: !50, line: 90, type: !140, isLocal: true, isDefinition: true)
!49 = distinct !DICompileUnit(language: DW_LANG_C99, file: !50, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !51, retainedTypes: !97, globals: !136, splitDebugInlining: false, nameTableKind: None)
!50 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_irrx.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!51 = !{!16, !22, !52}
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !53, line: 47, baseType: !7, size: 32, elements: !54)
!53 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!55 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!56 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!57 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!58 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!59 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!60 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!61 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!62 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!63 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!64 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!65 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!66 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!67 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!68 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!69 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!70 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!71 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!72 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!73 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!74 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!75 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!76 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!77 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!78 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!79 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!80 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!81 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!82 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!83 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!84 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!85 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!86 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!87 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!88 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!89 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!90 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!91 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!92 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!93 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!94 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!95 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!96 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!97 = !{!98, !104, !133, !134}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "P_IOT_IRRX_TypeDef", file: !17, line: 513, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_IRRX_TypeDef", file: !17, line: 483, size: 928, elements: !101)
!101 = !{!102, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "IRH", scope: !100, file: !17, line: 484, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !39, line: 62, baseType: !24)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "IRM", scope: !100, file: !17, line: 485, baseType: !103, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "IRL", scope: !100, file: !17, line: 486, baseType: !103, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "IRCFGH", scope: !100, file: !17, line: 487, baseType: !103, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "IRCFGL", scope: !100, file: !17, line: 488, baseType: !103, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "IRTHD", scope: !100, file: !17, line: 489, baseType: !103, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "IRCLR", scope: !100, file: !17, line: 490, baseType: !103, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "RESV0", scope: !100, file: !17, line: 491, baseType: !103, size: 32, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "IR_INTCLR", scope: !100, file: !17, line: 492, baseType: !103, size: 32, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "RESV1", scope: !100, file: !17, line: 493, baseType: !103, size: 32, offset: 288)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "RESV2", scope: !100, file: !17, line: 494, baseType: !103, size: 32, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "RESV3", scope: !100, file: !17, line: 495, baseType: !103, size: 32, offset: 352)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA0", scope: !100, file: !17, line: 496, baseType: !103, size: 32, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA1", scope: !100, file: !17, line: 497, baseType: !103, size: 32, offset: 416)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA2", scope: !100, file: !17, line: 498, baseType: !103, size: 32, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA3", scope: !100, file: !17, line: 499, baseType: !103, size: 32, offset: 480)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA4", scope: !100, file: !17, line: 500, baseType: !103, size: 32, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA5", scope: !100, file: !17, line: 501, baseType: !103, size: 32, offset: 544)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA6", scope: !100, file: !17, line: 502, baseType: !103, size: 32, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA7", scope: !100, file: !17, line: 503, baseType: !103, size: 32, offset: 608)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA8", scope: !100, file: !17, line: 504, baseType: !103, size: 32, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA9", scope: !100, file: !17, line: 505, baseType: !103, size: 32, offset: 672)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA10", scope: !100, file: !17, line: 506, baseType: !103, size: 32, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA11", scope: !100, file: !17, line: 507, baseType: !103, size: 32, offset: 736)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA12", scope: !100, file: !17, line: 508, baseType: !103, size: 32, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA13", scope: !100, file: !17, line: 509, baseType: !103, size: 32, offset: 800)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA14", scope: !100, file: !17, line: 510, baseType: !103, size: 32, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA15", scope: !100, file: !17, line: 511, baseType: !103, size: 32, offset: 864)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "CHK_DATA16", scope: !100, file: !17, line: 512, baseType: !103, size: 32, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !53, line: 95, baseType: !52)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!136 = !{!137, !138}
!137 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "s_low_hal_irrx_pwd_callback", scope: !49, file: !50, line: 91, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "irrx_user_callback_t", file: !23, line: 92, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 89, size: 64, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !141, file: !23, line: 90, baseType: !33, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !141, file: !23, line: 91, baseType: !37, size: 32, offset: 32)
!145 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!146 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!147 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !150, file: !151, line: 43, type: !155, isLocal: true, isDefinition: true)
!150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !151, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !152, globals: !160, splitDebugInlining: false, nameTableKind: None)
!151 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!152 = !{!134, !104, !153, !159}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !156, line: 48, baseType: !157)
!156 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !158, line: 79, baseType: !24)
!158 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!160 = !{!148, !161}
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !150, file: !151, line: 44, type: !155, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !165, file: !166, line: 54, type: !155, isLocal: false, isDefinition: true)
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !167, retainedTypes: !191, globals: !198, splitDebugInlining: false, nameTableKind: None)
!166 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!167 = !{!168, !174}
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !169, line: 71, baseType: !24, size: 32, elements: !170)
!169 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!170 = !{!171, !172, !173}
!171 = !DIEnumerator(name: "UART_PORT0", value: 0)
!172 = !DIEnumerator(name: "UART_PORT1", value: 1)
!173 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!174 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !175, line: 129, baseType: !24, size: 32, elements: !176)
!175 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!177 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!178 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!179 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!180 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!181 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!182 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!183 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!184 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!185 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!186 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!187 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!188 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!189 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!190 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!191 = !{!134, !155, !192, !194, !43, !196, !104}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !39, line: 113, baseType: !195)
!195 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!198 = !{!163}
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !201, file: !202, line: 51, type: !281, isLocal: false, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !203, retainedTypes: !250, globals: !280, splitDebugInlining: false, nameTableKind: None)
!202 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!203 = !{!204, !215, !234, !241}
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !205, line: 163, baseType: !7, size: 32, elements: !206)
!205 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214}
!207 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!208 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!209 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!210 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!211 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!212 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!213 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!214 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !205, line: 186, baseType: !24, size: 32, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!217 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!218 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!219 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!220 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!221 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!222 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!223 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!224 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!225 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!226 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!227 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!228 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!229 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!230 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!231 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!232 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!233 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !205, line: 176, baseType: !24, size: 32, elements: !235)
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!237 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!238 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!239 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!240 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 99, baseType: !24, size: 32, elements: !243)
!242 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!243 = !{!244, !245, !246, !247, !248, !249}
!244 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!245 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!246 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!247 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!248 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!249 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!250 = !{!251, !37}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !253, line: 72, baseType: !254)
!253 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !253, line: 56, size: 525312, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !270, !271, !275, !279}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !254, file: !253, line: 57, baseType: !154, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !254, file: !253, line: 58, baseType: !154, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !254, file: !253, line: 59, baseType: !154, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !254, file: !253, line: 60, baseType: !154, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !254, file: !253, line: 61, baseType: !154, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !254, file: !253, line: 62, baseType: !154, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !254, file: !253, line: 63, baseType: !154, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !254, file: !253, line: 64, baseType: !154, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !254, file: !253, line: 65, baseType: !154, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !254, file: !253, line: 66, baseType: !154, size: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !254, file: !253, line: 67, baseType: !267, size: 32, offset: 320)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 32, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 1)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !254, file: !253, line: 68, baseType: !154, size: 32, offset: 352)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !254, file: !253, line: 69, baseType: !272, size: 523904, offset: 384)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 523904, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 16372)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !254, file: !253, line: 70, baseType: !276, size: 512, offset: 524288)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 512, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 16)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !254, file: !253, line: 71, baseType: !276, size: 512, offset: 524800)
!280 = !{!199}
!281 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !282)
!282 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !285, file: !286, line: 53, type: !376, isLocal: false, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !287, retainedTypes: !296, globals: !375, splitDebugInlining: false, nameTableKind: None)
!286 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!287 = !{!288, !52}
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !289, line: 152, baseType: !7, size: 32, elements: !290)
!289 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!290 = !{!291, !292, !293, !294, !295}
!291 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!292 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!293 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!294 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!295 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!296 = !{!297, !37, !155, !298, !300, !336}
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !53, line: 97, baseType: !133)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !156, line: 44, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !158, line: 77, baseType: !7)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !302, line: 378, baseType: !303)
!302 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !302, line: 363, size: 28704, elements: !304)
!304 = !{!305, !309, !313, !314, !315, !316, !317, !318, !319, !320, !324, !331, !335}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !303, file: !302, line: 365, baseType: !306, size: 256)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 256, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 8)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !303, file: !302, line: 366, baseType: !310, size: 768, offset: 256)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 768, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 24)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !303, file: !302, line: 367, baseType: !306, size: 256, offset: 1024)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !303, file: !302, line: 368, baseType: !310, size: 768, offset: 1280)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !303, file: !302, line: 369, baseType: !306, size: 256, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !303, file: !302, line: 370, baseType: !310, size: 768, offset: 2304)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !303, file: !302, line: 371, baseType: !306, size: 256, offset: 3072)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !303, file: !302, line: 372, baseType: !310, size: 768, offset: 3328)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !303, file: !302, line: 373, baseType: !306, size: 256, offset: 4096)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !303, file: !302, line: 374, baseType: !321, size: 1792, offset: 4352)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 1792, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 56)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !303, file: !302, line: 375, baseType: !325, size: 1920, offset: 6144)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 1920, elements: !329)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !156, line: 24, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !158, line: 43, baseType: !18)
!329 = !{!330}
!330 = !DISubrange(count: 240)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !303, file: !302, line: 376, baseType: !332, size: 20608, offset: 8064)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 20608, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 644)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !303, file: !302, line: 377, baseType: !154, size: 32, offset: 28672)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !302, line: 418, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !302, line: 395, size: 1120, elements: !339)
!339 = !{!340, !342, !343, !344, !345, !346, !347, !351, !352, !353, !354, !355, !356, !357, !358, !362, !363, !364, !368, !372, !374}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !338, file: !302, line: 397, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !338, file: !302, line: 398, baseType: !154, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !338, file: !302, line: 399, baseType: !154, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !338, file: !302, line: 400, baseType: !154, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !338, file: !302, line: 401, baseType: !154, size: 32, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !338, file: !302, line: 402, baseType: !154, size: 32, offset: 160)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !338, file: !302, line: 403, baseType: !348, size: 96, offset: 192)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 96, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 12)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !338, file: !302, line: 404, baseType: !154, size: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !338, file: !302, line: 405, baseType: !154, size: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !338, file: !302, line: 406, baseType: !154, size: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !338, file: !302, line: 407, baseType: !154, size: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !338, file: !302, line: 408, baseType: !154, size: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !338, file: !302, line: 409, baseType: !154, size: 32, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !338, file: !302, line: 410, baseType: !154, size: 32, offset: 480)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !338, file: !302, line: 411, baseType: !359, size: 64, offset: 512)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 64, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 2)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !338, file: !302, line: 412, baseType: !341, size: 32, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !338, file: !302, line: 413, baseType: !341, size: 32, offset: 608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !338, file: !302, line: 414, baseType: !365, size: 128, offset: 640)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 128, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 4)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !338, file: !302, line: 415, baseType: !369, size: 160, offset: 768)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 160, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 5)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !338, file: !302, line: 416, baseType: !373, size: 160, offset: 928)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 160, elements: !370)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !338, file: !302, line: 417, baseType: !154, size: 32, offset: 1088)
!375 = !{!283}
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 6144, elements: !385)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !286, line: 50, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !286, line: 47, size: 64, elements: !379)
!379 = !{!380, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !378, file: !286, line: 48, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !297}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !378, file: !286, line: 49, baseType: !155, size: 32, offset: 32)
!385 = !{!386}
!386 = !DISubrange(count: 96)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !389, file: !390, line: 77, type: !459, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !391, retainedTypes: !442, globals: !444, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!391 = !{!392, !400, !406, !422, !428, !432, !168, !174, !437}
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !393, line: 345, baseType: !7, size: 32, elements: !394)
!393 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!394 = !{!395, !396, !397, !398, !399}
!395 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!396 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!397 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!398 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!399 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !401, line: 109, baseType: !24, size: 32, elements: !402)
!401 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!402 = !{!403, !404, !405}
!403 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!404 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!405 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !393, line: 302, baseType: !24, size: 32, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!408 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!409 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!410 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!411 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!412 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!413 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!414 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!415 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!416 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!417 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!418 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!419 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!420 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!421 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !393, line: 321, baseType: !24, size: 32, elements: !423)
!423 = !{!424, !425, !426, !427}
!424 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!425 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!426 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!427 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !393, line: 330, baseType: !24, size: 32, elements: !429)
!429 = !{!430, !431}
!430 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!431 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !393, line: 337, baseType: !24, size: 32, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!435 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!436 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !393, line: 355, baseType: !7, size: 32, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!440 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!441 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!442 = !{!24, !37, !18, !443, !327}
!443 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!444 = !{!387, !445}
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "func_tbl", scope: !447, file: !390, line: 536, type: !457, isLocal: true, isDefinition: true)
!447 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !390, file: !390, line: 534, type: !448, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !389, retainedNodes: !455)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !454}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !175, line: 197, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DISubroutineType(types: !453)
!453 = !{null}
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !401, line: 113, baseType: !400)
!455 = !{!456}
!456 = !DILocalVariable(name: "uart_port", arg: 1, scope: !447, file: !390, line: 534, type: !454)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 64, elements: !360)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 1024, elements: !360)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !390, line: 75, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 68, size: 512, elements: !462)
!462 = !{!463, !464, !476, !477, !488, !489}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !461, file: !390, line: 69, baseType: !282, size: 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !461, file: !390, line: 70, baseType: !465, size: 128, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !393, line: 378, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 373, size: 128, elements: !467)
!467 = !{!468, !470, !472, !474}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !466, file: !393, line: 374, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !393, line: 317, baseType: !406)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !466, file: !393, line: 375, baseType: !471, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !393, line: 326, baseType: !422)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !466, file: !393, line: 376, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !393, line: 333, baseType: !428)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !466, file: !393, line: 377, baseType: !475, size: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !393, line: 341, baseType: !432)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !461, file: !390, line: 71, baseType: !282, size: 8, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !461, file: !390, line: 72, baseType: !478, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !390, line: 66, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 63, size: 64, elements: !480)
!480 = !{!481, !487}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !479, file: !390, line: 64, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !393, line: 410, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !486, !37}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !393, line: 359, baseType: !437)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !479, file: !390, line: 65, baseType: !37, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !461, file: !390, line: 73, baseType: !282, size: 8, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !461, file: !390, line: 74, baseType: !490, size: 224, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !393, line: 390, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 382, size: 224, elements: !492)
!492 = !{!493, !495, !496, !497, !498, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !491, file: !393, line: 383, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !491, file: !393, line: 384, baseType: !155, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !491, file: !393, line: 385, baseType: !155, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !491, file: !393, line: 386, baseType: !494, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !491, file: !393, line: 387, baseType: !155, size: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !491, file: !393, line: 388, baseType: !155, size: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !491, file: !393, line: 389, baseType: !155, size: 32, offset: 192)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !503, file: !504, line: 59, type: !155, isLocal: false, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !505, globals: !558, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!505 = !{!506, !514, !539}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !302, line: 656, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !302, line: 650, size: 128, elements: !509)
!509 = !{!510, !511, !512, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !508, file: !302, line: 652, baseType: !154, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !508, file: !302, line: 653, baseType: !154, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !508, file: !302, line: 654, baseType: !154, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !508, file: !302, line: 655, baseType: !341, size: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !302, line: 418, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !302, line: 395, size: 1120, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !516, file: !302, line: 397, baseType: !341, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !516, file: !302, line: 398, baseType: !154, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !516, file: !302, line: 399, baseType: !154, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !516, file: !302, line: 400, baseType: !154, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !516, file: !302, line: 401, baseType: !154, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !516, file: !302, line: 402, baseType: !154, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !516, file: !302, line: 403, baseType: !348, size: 96, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !516, file: !302, line: 404, baseType: !154, size: 32, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !516, file: !302, line: 405, baseType: !154, size: 32, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !516, file: !302, line: 406, baseType: !154, size: 32, offset: 352)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !516, file: !302, line: 407, baseType: !154, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !516, file: !302, line: 408, baseType: !154, size: 32, offset: 416)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !516, file: !302, line: 409, baseType: !154, size: 32, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !516, file: !302, line: 410, baseType: !154, size: 32, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !516, file: !302, line: 411, baseType: !359, size: 64, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !516, file: !302, line: 412, baseType: !341, size: 32, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !516, file: !302, line: 413, baseType: !341, size: 32, offset: 608)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !516, file: !302, line: 414, baseType: !365, size: 128, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !516, file: !302, line: 415, baseType: !369, size: 160, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !516, file: !302, line: 416, baseType: !373, size: 160, offset: 928)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !516, file: !302, line: 417, baseType: !154, size: 32, offset: 1088)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !253, line: 72, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !253, line: 56, size: 525312, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !541, file: !253, line: 57, baseType: !154, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !541, file: !253, line: 58, baseType: !154, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !541, file: !253, line: 59, baseType: !154, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !541, file: !253, line: 60, baseType: !154, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !541, file: !253, line: 61, baseType: !154, size: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !541, file: !253, line: 62, baseType: !154, size: 32, offset: 160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !541, file: !253, line: 63, baseType: !154, size: 32, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !541, file: !253, line: 64, baseType: !154, size: 32, offset: 224)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !541, file: !253, line: 65, baseType: !154, size: 32, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !541, file: !253, line: 66, baseType: !154, size: 32, offset: 288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !541, file: !253, line: 67, baseType: !267, size: 32, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !541, file: !253, line: 68, baseType: !154, size: 32, offset: 352)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !541, file: !253, line: 69, baseType: !272, size: 523904, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !541, file: !253, line: 70, baseType: !276, size: 512, offset: 524288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !541, file: !253, line: 71, baseType: !276, size: 512, offset: 524800)
!558 = !{!501, !559}
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !503, file: !504, line: 61, type: !154, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "heap_end", scope: !563, file: !564, line: 66, type: !569, isLocal: true, isDefinition: true)
!563 = distinct !DISubprogram(name: "_sbrk_r", scope: !564, file: !564, line: 63, type: !565, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !760, retainedNodes: !764)
!564 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!565 = !DISubroutineType(types: !566)
!566 = !{!567, !570, !759}
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !568, line: 123, baseType: !569)
!568 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !572, line: 377, size: 1920, elements: !573)
!572 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!573 = !{!574, !575, !648, !649, !650, !651, !652, !653, !654, !657, !678, !682, !683, !684, !685, !695, !708, !709, !714, !733, !734, !741, !742, !758}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !571, file: !572, line: 381, baseType: !7, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !571, file: !572, line: 386, baseType: !576, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !572, line: 292, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !572, line: 186, size: 832, elements: !579)
!579 = !{!580, !581, !582, !583, !585, !586, !591, !592, !593, !594, !598, !604, !611, !615, !616, !617, !618, !622, !624, !625, !626, !628, !634, !647}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !578, file: !572, line: 187, baseType: !40, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !578, file: !572, line: 188, baseType: !7, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !578, file: !572, line: 189, baseType: !7, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !578, file: !572, line: 190, baseType: !584, size: 16, offset: 96)
!584 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !578, file: !572, line: 191, baseType: !584, size: 16, offset: 112)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !578, file: !572, line: 192, baseType: !587, size: 64, offset: 128)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !572, line: 122, size: 64, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !587, file: !572, line: 123, baseType: !40, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !587, file: !572, line: 124, baseType: !7, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !578, file: !572, line: 193, baseType: !7, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !578, file: !572, line: 196, baseType: !570, size: 32, offset: 224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !578, file: !572, line: 200, baseType: !37, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !578, file: !572, line: 202, baseType: !595, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{!7, !570, !37, !569, !7}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !578, file: !572, line: 204, baseType: !599, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DISubroutineType(types: !601)
!601 = !{!7, !570, !37, !602, !7}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !578, file: !572, line: 207, baseType: !605, size: 32, offset: 352)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !570, !37, !608, !7}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !609, line: 116, baseType: !610)
!609 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!610 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !578, file: !572, line: 208, baseType: !612, size: 32, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{!7, !570, !37}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !578, file: !572, line: 211, baseType: !587, size: 64, offset: 416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !578, file: !572, line: 212, baseType: !40, size: 32, offset: 480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !578, file: !572, line: 213, baseType: !7, size: 32, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !578, file: !572, line: 216, baseType: !619, size: 24, offset: 544)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 3)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !578, file: !572, line: 217, baseType: !623, size: 8, offset: 568)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !268)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !578, file: !572, line: 220, baseType: !587, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !578, file: !572, line: 223, baseType: !7, size: 32, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !578, file: !572, line: 224, baseType: !627, size: 32, offset: 672)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !609, line: 46, baseType: !610)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !578, file: !572, line: 231, baseType: !629, size: 32, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !572, line: 35, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !631, line: 34, baseType: !632)
!631 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !631, line: 33, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !578, file: !572, line: 233, baseType: !635, size: 64, offset: 736)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !609, line: 170, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !609, line: 162, size: 64, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !636, file: !609, line: 164, baseType: !7, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !636, file: !609, line: 169, baseType: !640, size: 32, offset: 32)
!640 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !636, file: !609, line: 165, size: 32, elements: !641)
!641 = !{!642, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !640, file: !609, line: 167, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !644, line: 116, baseType: !7)
!644 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !640, file: !609, line: 168, baseType: !646, size: 32)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32, elements: !366)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !578, file: !572, line: 234, baseType: !7, size: 32, offset: 800)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !571, file: !572, line: 386, baseType: !576, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !571, file: !572, line: 386, baseType: !576, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !571, file: !572, line: 388, baseType: !7, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !571, file: !572, line: 390, baseType: !569, size: 32, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !571, file: !572, line: 392, baseType: !7, size: 32, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !571, file: !572, line: 394, baseType: !7, size: 32, offset: 224)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !571, file: !572, line: 395, baseType: !655, size: 32, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !572, line: 45, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !571, file: !572, line: 397, baseType: !658, size: 32, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !572, line: 349, size: 128, elements: !660)
!660 = !{!661, !674, !675, !676}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !659, file: !572, line: 352, baseType: !662, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !572, line: 52, size: 192, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !663, file: !572, line: 54, baseType: !662, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !663, file: !572, line: 55, baseType: !7, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !663, file: !572, line: 55, baseType: !7, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !663, file: !572, line: 55, baseType: !7, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !663, file: !572, line: 55, baseType: !7, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !663, file: !572, line: 56, baseType: !671, size: 32, offset: 160)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 32, elements: !268)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !572, line: 22, baseType: !673)
!673 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !659, file: !572, line: 353, baseType: !7, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !659, file: !572, line: 354, baseType: !662, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !659, file: !572, line: 355, baseType: !677, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !571, file: !572, line: 399, baseType: !679, size: 32, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !570}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !571, file: !572, line: 401, baseType: !7, size: 32, offset: 352)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !571, file: !572, line: 404, baseType: !7, size: 32, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !571, file: !572, line: 405, baseType: !569, size: 32, offset: 416)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !571, file: !572, line: 407, baseType: !686, size: 32, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !572, line: 324, size: 192, elements: !688)
!688 = !{!689, !691, !692, !693}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !687, file: !572, line: 325, baseType: !690, size: 48)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 48, elements: !620)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !687, file: !572, line: 326, baseType: !690, size: 48, offset: 48)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !687, file: !572, line: 327, baseType: !195, size: 16, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !687, file: !572, line: 330, baseType: !694, size: 64, offset: 128)
!694 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !571, file: !572, line: 408, baseType: !696, size: 32, offset: 480)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !572, line: 60, size: 288, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !697, file: !572, line: 62, baseType: !7, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !697, file: !572, line: 63, baseType: !7, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !697, file: !572, line: 64, baseType: !7, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !697, file: !572, line: 65, baseType: !7, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !697, file: !572, line: 66, baseType: !7, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !697, file: !572, line: 67, baseType: !7, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !697, file: !572, line: 68, baseType: !7, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !697, file: !572, line: 69, baseType: !7, size: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !697, file: !572, line: 70, baseType: !7, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !571, file: !572, line: 409, baseType: !569, size: 32, offset: 512)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !571, file: !572, line: 412, baseType: !710, size: 32, offset: 544)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !7}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !571, file: !572, line: 416, baseType: !715, size: 32, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !572, line: 90, size: 1120, elements: !717)
!717 = !{!718, !719, !720, !724}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !716, file: !572, line: 91, baseType: !715, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !716, file: !572, line: 92, baseType: !7, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !716, file: !572, line: 93, baseType: !721, size: 1024, offset: 64)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 1024, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !716, file: !572, line: 94, baseType: !725, size: 32, offset: 1088)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !572, line: 79, size: 2112, elements: !727)
!727 = !{!728, !730, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !726, file: !572, line: 80, baseType: !729, size: 1024)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, elements: !722)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !726, file: !572, line: 81, baseType: !729, size: 1024, offset: 1024)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !726, file: !572, line: 83, baseType: !672, size: 32, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !726, file: !572, line: 86, baseType: !672, size: 32, offset: 2080)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !571, file: !572, line: 417, baseType: !716, size: 1120, offset: 608)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !571, file: !572, line: 420, baseType: !735, size: 96, offset: 1728)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !572, line: 296, size: 96, elements: !736)
!736 = !{!737, !739, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !735, file: !572, line: 298, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !735, file: !572, line: 299, baseType: !7, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !735, file: !572, line: 300, baseType: !576, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !571, file: !572, line: 421, baseType: !576, size: 32, offset: 1824)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !571, file: !572, line: 422, baseType: !743, size: 32, offset: 1856)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !572, line: 359, size: 640, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !752, !753, !754, !755, !756, !757}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !744, file: !572, line: 362, baseType: !569, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !744, file: !572, line: 363, baseType: !635, size: 64, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !744, file: !572, line: 364, baseType: !635, size: 64, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !744, file: !572, line: 365, baseType: !635, size: 64, offset: 160)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !744, file: !572, line: 366, baseType: !751, size: 64, offset: 224)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 64, elements: !307)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !744, file: !572, line: 367, baseType: !7, size: 32, offset: 288)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !744, file: !572, line: 368, baseType: !635, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !744, file: !572, line: 369, baseType: !635, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !744, file: !572, line: 370, baseType: !635, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !744, file: !572, line: 371, baseType: !635, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !744, file: !572, line: 372, baseType: !635, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !571, file: !572, line: 423, baseType: !569, size: 32, offset: 1888)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !644, line: 46, baseType: !24)
!760 = distinct !DICompileUnit(language: DW_LANG_C99, file: !761, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !762, globals: !763, splitDebugInlining: false, nameTableKind: None)
!761 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!762 = !{!569, !567}
!763 = !{!561}
!764 = !{!765, !766, !767, !768}
!765 = !DILocalVariable(name: "r", arg: 1, scope: !563, file: !564, line: 63, type: !570)
!766 = !DILocalVariable(name: "nbytes", arg: 2, scope: !563, file: !564, line: 63, type: !759)
!767 = !DILocalVariable(name: "prev_heap_end", scope: !563, file: !564, line: 67, type: !569)
!768 = !DILocalVariable(name: "stack", scope: !563, file: !564, line: 68, type: !569)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !771, file: !776, line: 4, type: !782, isLocal: false, isDefinition: true)
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !773, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!773 = !{!769, !774, !780}
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !771, file: !776, line: 5, type: !777, isLocal: false, isDefinition: true)
!776 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 88, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 11)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !771, file: !776, line: 6, type: !777, isLocal: false, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 248, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 31)
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !787, retainedTypes: !793, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!787 = !{!788}
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 1209, baseType: !24, size: 32, elements: !790)
!789 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!790 = !{!791, !792}
!791 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!792 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!793 = !{!794, !796}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !39, line: 116, baseType: !24)
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !798, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !799, retainedTypes: !877, splitDebugInlining: false, nameTableKind: None)
!798 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!799 = !{!800}
!800 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !801, line: 150, baseType: !24, size: 32, elements: !802)
!801 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876}
!803 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!804 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!805 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!806 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!807 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!808 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!809 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!810 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!811 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!812 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!813 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!814 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!815 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!816 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!817 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!818 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!819 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!820 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!821 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!822 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!823 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!824 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!825 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!826 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!827 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!828 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!829 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!830 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!831 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!832 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!833 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!834 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!835 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!836 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!837 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!838 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!839 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!840 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!841 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!842 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!843 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!844 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!845 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!846 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!847 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!848 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!849 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!850 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!851 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!852 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!853 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!854 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!855 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!856 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!857 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!858 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!859 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!860 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!861 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!862 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!863 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!864 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!865 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!866 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!867 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!868 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!869 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!870 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!871 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!872 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!873 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!874 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!875 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!876 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!877 = !{!794, !104}
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !880, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!880 = !{!881, !906}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !302, line: 418, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !302, line: 395, size: 1120, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !883, file: !302, line: 397, baseType: !341, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !883, file: !302, line: 398, baseType: !154, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !883, file: !302, line: 399, baseType: !154, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !883, file: !302, line: 400, baseType: !154, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !883, file: !302, line: 401, baseType: !154, size: 32, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !883, file: !302, line: 402, baseType: !154, size: 32, offset: 160)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !883, file: !302, line: 403, baseType: !348, size: 96, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !883, file: !302, line: 404, baseType: !154, size: 32, offset: 288)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !883, file: !302, line: 405, baseType: !154, size: 32, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !883, file: !302, line: 406, baseType: !154, size: 32, offset: 352)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !883, file: !302, line: 407, baseType: !154, size: 32, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !883, file: !302, line: 408, baseType: !154, size: 32, offset: 416)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !883, file: !302, line: 409, baseType: !154, size: 32, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !883, file: !302, line: 410, baseType: !154, size: 32, offset: 480)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !883, file: !302, line: 411, baseType: !359, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !883, file: !302, line: 412, baseType: !341, size: 32, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !883, file: !302, line: 413, baseType: !341, size: 32, offset: 608)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !883, file: !302, line: 414, baseType: !365, size: 128, offset: 640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !883, file: !302, line: 415, baseType: !369, size: 160, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !883, file: !302, line: 416, baseType: !373, size: 160, offset: 928)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !883, file: !302, line: 417, baseType: !154, size: 32, offset: 1088)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !302, line: 378, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !302, line: 363, size: 28704, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !908, file: !302, line: 365, baseType: !306, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !908, file: !302, line: 366, baseType: !310, size: 768, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !908, file: !302, line: 367, baseType: !306, size: 256, offset: 1024)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !908, file: !302, line: 368, baseType: !310, size: 768, offset: 1280)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !908, file: !302, line: 369, baseType: !306, size: 256, offset: 2048)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !908, file: !302, line: 370, baseType: !310, size: 768, offset: 2304)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !908, file: !302, line: 371, baseType: !306, size: 256, offset: 3072)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !908, file: !302, line: 372, baseType: !310, size: 768, offset: 3328)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !908, file: !302, line: 373, baseType: !306, size: 256, offset: 4096)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !908, file: !302, line: 374, baseType: !321, size: 1792, offset: 4352)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !908, file: !302, line: 375, baseType: !325, size: 1920, offset: 6144)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !908, file: !302, line: 376, baseType: !332, size: 20608, offset: 8064)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !908, file: !302, line: 377, baseType: !154, size: 32, offset: 28672)
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !925, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!925 = !{!926, !800}
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !927, line: 55, baseType: !24, size: 32, elements: !928)
!927 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956}
!929 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!930 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!931 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!932 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!933 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!934 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!935 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!936 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!937 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!938 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!939 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!940 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!941 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!942 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!943 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!944 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!945 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!946 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!947 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!948 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!949 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!950 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!951 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!952 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!953 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!954 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!955 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!956 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!958 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !961, retainedTypes: !1025, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!961 = !{!962, !969, !926, !1000, !1006, !1010, !1014, !1020}
!962 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !963, line: 233, baseType: !7, size: 32, elements: !964)
!963 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!964 = !{!965, !966, !967, !968}
!965 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!966 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!967 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!968 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !401, line: 249, baseType: !24, size: 32, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!971 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!972 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!973 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!974 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!975 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!976 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!977 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!978 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!979 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!980 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!981 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!982 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!983 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!984 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!985 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!986 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!987 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!988 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!989 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!990 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!991 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!992 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!993 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!994 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!995 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!996 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!997 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!998 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!999 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!1000 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !963, line: 224, baseType: !7, size: 32, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005}
!1002 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!1003 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!1004 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!1005 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !963, line: 217, baseType: !24, size: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!1009 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!1010 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !963, line: 210, baseType: !24, size: 32, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!1013 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !963, line: 242, baseType: !24, size: 32, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!1017 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!1018 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!1019 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1021, line: 57, baseType: !24, size: 32, elements: !1022)
!1021 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!1022 = !{!1023, !1024}
!1023 = !DIEnumerator(name: "eDirection_IN", value: 0)
!1024 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!1025 = !{!1026, !37, !1027, !327, !1028, !1029}
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !927, line: 87, baseType: !926)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !963, line: 220, baseType: !1006)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !963, line: 247, baseType: !1014)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !1021, line: 60, baseType: !1020)
!1030 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1031, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1032, retainedTypes: !1033, splitDebugInlining: false, nameTableKind: None)
!1031 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irrx_receive_pwd_data/GCC")
!1032 = !{!400, !406, !422, !428, !432, !969, !12}
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_irrx_callback_t", file: !6, line: 198, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !1038, !37}
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_irrx_event_t", file: !6, line: 173, baseType: !12)
!1039 = !{!"Ubuntu clang version 14.0.6"}
!1040 = !{i32 7, !"Dwarf Version", i32 2}
!1041 = !{i32 2, !"Debug Info Version", i32 3}
!1042 = !{i32 1, !"wchar_size", i32 4}
!1043 = !{i32 1, !"min_enum_size", i32 4}
!1044 = !{i32 1, !"branch-target-enforcement", i32 0}
!1045 = !{i32 1, !"sign-return-address", i32 0}
!1046 = !{i32 1, !"sign-return-address-all", i32 0}
!1047 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!1048 = !{i32 7, !"frame-pointer", i32 2}
!1049 = distinct !DISubprogram(name: "halGPIO_ConfDirection", scope: !786, file: !786, line: 54, type: !1050, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !785, retainedNodes: !1053)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!1052, !104, !43}
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !39, line: 56, baseType: !7)
!1053 = !{!1054, !1055, !1056, !1058}
!1054 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1049, file: !786, line: 54, type: !104)
!1055 = !DILocalVariable(name: "outEnable", arg: 2, scope: !1049, file: !786, line: 54, type: !43)
!1056 = !DILocalVariable(name: "no", scope: !1049, file: !786, line: 57, type: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !39, line: 60, baseType: !195)
!1058 = !DILocalVariable(name: "remainder", scope: !1049, file: !786, line: 58, type: !1057)
!1059 = !DILocation(line: 0, scope: !1049)
!1060 = !DILocation(line: 59, column: 19, scope: !1049)
!1061 = !DILocation(line: 60, column: 17, scope: !1049)
!1062 = !DILocation(line: 61, column: 5, scope: !1049)
!1063 = !DILocation(line: 65, column: 27, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !786, line: 65, column: 17)
!1065 = distinct !DILexicalBlock(scope: !1049, file: !786, line: 61, column: 17)
!1066 = !DILocation(line: 0, scope: !1064)
!1067 = !DILocation(line: 65, column: 17, scope: !1065)
!1068 = !DILocation(line: 66, column: 21, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1064, file: !786, line: 65, column: 33)
!1070 = !DILocation(line: 67, column: 73, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !786, line: 66, column: 38)
!1072 = distinct !DILexicalBlock(scope: !1069, file: !786, line: 66, column: 21)
!1073 = !DILocation(line: 67, column: 69, scope: !1071)
!1074 = !DILocation(line: 67, column: 66, scope: !1071)
!1075 = !DILocation(line: 68, column: 17, scope: !1071)
!1076 = !DILocation(line: 68, column: 28, scope: !1072)
!1077 = !DILocation(line: 69, column: 77, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !786, line: 68, column: 45)
!1079 = distinct !DILexicalBlock(scope: !1072, file: !786, line: 68, column: 28)
