; ModuleID = 'build/96b_nitrogen/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !167, file: !206, line: 27, type: !234, isLocal: true, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !181, globals: !203, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!169 = !{!170, !30}
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !171, line: 27, baseType: !32, size: 32, elements: !172)
!171 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180}
!173 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!174 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!175 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!176 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!177 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!178 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!179 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!180 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!181 = !{!102, !182, !103, !24, !186, !202, !137, !163}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !183, line: 46, baseType: !184)
!183 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !185)
!185 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !188, line: 54, size: 96, elements: !189)
!188 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = !{!190, !197, !201}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !187, file: !188, line: 55, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !192, line: 30, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !187, file: !188, line: 60, baseType: !198, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !170}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !187, file: !188, line: 65, baseType: !198, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!203 = !{!165, !204, !209, !211, !224, !226}
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !167, file: !206, line: 44, type: !207, isLocal: true, isDefinition: true)
!206 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!208 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !167, file: !206, line: 49, type: !207, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !167, file: !206, line: 36, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !222)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !171, line: 114, size: 128, elements: !215)
!215 = !{!216, !217, !220, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !214, file: !171, line: 115, baseType: !170, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !214, file: !171, line: 141, baseType: !218, size: 8, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !219)
!219 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !214, file: !171, line: 149, baseType: !137, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !214, file: !171, line: 156, baseType: !137, size: 32, offset: 96)
!222 = !{!223}
!223 = !DISubrange(count: 1)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !167, file: !206, line: 40, type: !213, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !167, file: !206, line: 28, type: !228, isLocal: true, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !192, line: 40, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !192, line: 35, size: 64, elements: !230)
!230 = !{!231, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !229, file: !192, line: 36, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !229, file: !192, line: 37, baseType: !232, size: 32, offset: 32)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 32, elements: !222)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !236, line: 22, baseType: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!238 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!239 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !242, file: !271, line: 50, type: !258, isLocal: true, isDefinition: true)
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !244, globals: !268, splitDebugInlining: false, nameTableKind: None)
!243 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!244 = !{!245, !182, !120, !103, !102, !137, !163, !247, !202, !258, !259}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !246)
!246 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !249, line: 45, size: 64, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251, !257}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !248, file: !249, line: 46, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !192, line: 30, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !248, file: !249, line: 48, baseType: !137, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !249, line: 38, size: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !260, file: !249, line: 39, baseType: !252, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !260, file: !249, line: 41, baseType: !264, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !249, line: 35, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !258}
!268 = !{!269, !273, !281, !240, !283, !293}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "latency_lock", scope: !242, file: !271, line: 44, type: !272, isLocal: true, isDefinition: true)
!271 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !242, file: !271, line: 46, type: !275, isLocal: true, isDefinition: true)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !192, line: 40, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !192, line: 35, size: 64, elements: !277)
!277 = !{!278, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !276, file: !192, line: 36, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !276, file: !192, line: 37, baseType: !279, size: 32, offset: 32)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "latency_subs", scope: !242, file: !271, line: 52, type: !275, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !242, file: !271, line: 39, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, elements: !291)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !271, line: 35, size: 96, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !286, file: !271, line: 36, baseType: !170, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !286, file: !271, line: 37, baseType: !218, size: 8, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !286, file: !271, line: 38, baseType: !235, size: 32, offset: 64)
!291 = !{!292}
!292 = !DISubrange(count: 0)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !242, file: !271, line: 48, type: !258, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !297, file: !304, line: 47, type: !318, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !299, retainedTypes: !300, globals: !301, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!299 = !{!170}
!300 = !{!120, !103}
!301 = !{!302, !295, !314}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "cpus_states", scope: !297, file: !304, line: 50, type: !305, isLocal: true, isDefinition: true)
!304 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 32, elements: !222)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !171, line: 114, size: 128, elements: !309)
!309 = !{!310, !311, !312, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !171, line: 115, baseType: !170, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !308, file: !171, line: 141, baseType: !218, size: 8, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !308, file: !171, line: 149, baseType: !137, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !308, file: !171, line: 156, baseType: !137, size: 32, offset: 96)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !297, file: !304, line: 55, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 8, elements: !222)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, elements: !291)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "static_regions", scope: !321, file: !328, line: 62, type: !456, isLocal: true, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !323, globals: !324, splitDebugInlining: false, nameTableKind: None)
!322 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!323 = !{!120, !103, !137, !102}
!324 = !{!325, !319}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !327, file: !328, line: 198, type: !444, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !328, file: !328, line: 175, type: !329, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !321, retainedNodes: !441)
!328 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = !DISubroutineType(types: !330)
!330 = !{null, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !333, line: 245, size: 1024, elements: !334)
!333 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!334 = !{!335, !400, !413, !414, !415, !416, !422, !436}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !332, file: !333, line: 247, baseType: !336, size: 384)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !333, line: 57, size: 384, elements: !337)
!337 = !{!338, !366, !374, !375, !376, !387, !388, !389}
!338 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !333, line: 60, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !333, line: 60, size: 64, elements: !340)
!340 = !{!341, !357}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !339, file: !333, line: 61, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !343, line: 49, baseType: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !343, line: 37, size: 64, elements: !345)
!345 = !{!346, !352}
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !343, line: 38, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !343, line: 38, size: 32, elements: !348)
!348 = !{!349, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !347, file: !343, line: 39, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !343, line: 40, baseType: !350, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !343, line: 42, baseType: !353, size: 32, offset: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !343, line: 42, size: 32, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !353, file: !343, line: 43, baseType: !350, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !343, line: 44, baseType: !350, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !339, file: !333, line: 62, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !359, line: 49, size: 64, elements: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !358, file: !359, line: 50, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 64, elements: !364)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!364 = !{!365}
!365 = !DISubrange(count: 2)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !336, file: !333, line: 68, baseType: !367, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !369, line: 233, baseType: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 231, size: 64, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !370, file: !369, line: 232, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !343, line: 48, baseType: !344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !336, file: !333, line: 71, baseType: !218, size: 8, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !336, file: !333, line: 74, baseType: !218, size: 8, offset: 104)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !333, line: 90, baseType: !377, size: 16, offset: 112)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !333, line: 90, size: 16, elements: !378)
!378 = !{!379, !386}
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !333, line: 91, baseType: !380, size: 16)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !333, line: 91, size: 16, elements: !381)
!381 = !{!382, !385}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !380, file: !333, line: 96, baseType: !383, size: 8)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !384)
!384 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !380, file: !333, line: 97, baseType: !218, size: 8, offset: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !377, file: !333, line: 100, baseType: !151, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !336, file: !333, line: 107, baseType: !137, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !336, file: !333, line: 127, baseType: !102, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !336, file: !333, line: 131, baseType: !390, size: 192, offset: 192)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !369, line: 244, size: 192, elements: !391)
!391 = !{!392, !393, !399}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !390, file: !369, line: 245, baseType: !342, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !390, file: !369, line: 246, baseType: !394, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !369, line: 242, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !390, file: !369, line: 249, baseType: !184, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !332, file: !333, line: 250, baseType: !401, size: 288, offset: 384)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !402, line: 25, size: 288, elements: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !401, file: !402, line: 26, baseType: !137, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !401, file: !402, line: 27, baseType: !137, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !401, file: !402, line: 28, baseType: !137, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !401, file: !402, line: 29, baseType: !137, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !401, file: !402, line: 30, baseType: !137, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !401, file: !402, line: 31, baseType: !137, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !401, file: !402, line: 32, baseType: !137, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !401, file: !402, line: 33, baseType: !137, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !401, file: !402, line: 34, baseType: !137, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !332, file: !333, line: 253, baseType: !102, size: 32, offset: 672)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !332, file: !333, line: 256, baseType: !368, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !332, file: !333, line: 294, baseType: !103, size: 32, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !332, file: !333, line: 300, baseType: !417, size: 96, offset: 800)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !333, line: 149, size: 96, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !417, file: !333, line: 153, baseType: !22, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !417, file: !333, line: 162, baseType: !120, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !417, file: !333, line: 168, baseType: !120, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !332, file: !333, line: 325, baseType: !423, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !425, line: 5073, size: 160, elements: !426)
!425 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !{!427, !433, !434}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !424, file: !425, line: 5074, baseType: !428, size: 96)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !428, file: !113, line: 57, baseType: !116, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !428, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !428, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !424, file: !425, line: 5075, baseType: !368, size: 64, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !424, file: !425, line: 5076, baseType: !435, offset: 160)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !332, file: !333, line: 343, baseType: !437, size: 64, offset: 928)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !402, line: 60, size: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !437, file: !402, line: 63, baseType: !137, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !437, file: !402, line: 66, baseType: !137, size: 32, offset: 32)
!441 = !{!442, !443}
!442 = !DILocalVariable(name: "thread", arg: 1, scope: !327, file: !328, line: 175, type: !331)
!443 = !DILocalVariable(name: "region_num", scope: !327, file: !328, line: 200, type: !218)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, elements: !291)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !446, line: 52, size: 96, elements: !447)
!446 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !{!448, !449, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !445, file: !446, line: 53, baseType: !22, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !445, file: !446, line: 54, baseType: !120, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !445, file: !446, line: 55, baseType: !451, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !452, line: 151, baseType: !453)
!452 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 149, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !453, file: !452, line: 150, baseType: !137, size: 32)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 96, elements: !222)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !460, file: !496, line: 39, type: !218, isLocal: true, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !462, globals: !495, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!462 = !{!463, !102, !103, !481, !218}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !465, line: 1226, baseType: !466)
!465 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 1213, size: 352, elements: !467)
!467 = !{!468, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !466, file: !465, line: 1215, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !466, file: !465, line: 1216, baseType: !470, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !466, file: !465, line: 1217, baseType: !470, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !466, file: !465, line: 1218, baseType: !470, size: 32, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !466, file: !465, line: 1219, baseType: !470, size: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !466, file: !465, line: 1220, baseType: !470, size: 32, offset: 160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !466, file: !465, line: 1221, baseType: !470, size: 32, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !466, file: !465, line: 1222, baseType: !470, size: 32, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !466, file: !465, line: 1223, baseType: !470, size: 32, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !466, file: !465, line: 1224, baseType: !470, size: 32, offset: 288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !466, file: !465, line: 1225, baseType: !470, size: 32, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !484, line: 27, size: 96, elements: !485)
!484 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!485 = !{!486, !487, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !483, file: !484, line: 29, baseType: !137, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !484, line: 31, baseType: !488, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !483, file: !484, line: 37, baseType: !491, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !452, line: 146, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !452, line: 141, size: 32, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !492, file: !452, line: 143, baseType: !137, size: 32)
!495 = !{!458}
!496 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !499, file: !506, line: 21, type: !128, isLocal: true, isDefinition: true)
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !501, globals: !505, splitDebugInlining: false, nameTableKind: None)
!500 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!501 = !{!502, !103, !102}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !504, line: 22, baseType: !103)
!504 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !{!497}
!506 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !509, file: !514, line: 13, type: !531, isLocal: true, isDefinition: true)
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !511, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!511 = !{!512, !507}
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "mpu_config", scope: !509, file: !514, line: 37, type: !515, isLocal: false, isDefinition: true)
!514 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !484, line: 41, size: 64, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !516, file: !484, line: 43, baseType: !137, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !516, file: !484, line: 45, baseType: !520, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !484, line: 27, size: 96, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !522, file: !484, line: 29, baseType: !137, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !522, file: !484, line: 31, baseType: !488, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !522, file: !484, line: 37, baseType: !527, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !452, line: 146, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !452, line: 141, size: 32, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !528, file: !452, line: 143, baseType: !137, size: 32)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 192, elements: !364)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !534, file: !690, line: 93, type: !691, isLocal: true, isDefinition: true, align: 32)
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !536, globals: !685, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!536 = !{!537, !218, !102, !103, !609, !137, !610, !646, !657}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !539, line: 882, baseType: !540)
!539 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 850, size: 19456, elements: !541)
!541 = !{!542, !546, !547, !548, !552, !553, !555, !556, !557, !561, !562, !563, !567, !568, !572, !573, !577, !578, !582, !583, !584, !585, !586, !587, !591, !592, !594, !595, !599}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !540, file: !539, line: 851, baseType: !543, size: 960)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 960, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 30)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !540, file: !539, line: 852, baseType: !470, size: 32, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !540, file: !539, line: 853, baseType: !470, size: 32, offset: 992)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !540, file: !539, line: 854, baseType: !549, size: 1088, offset: 1024)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1088, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 34)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !540, file: !539, line: 855, baseType: !470, size: 32, offset: 2112)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !540, file: !539, line: 856, baseType: !554, size: 64, offset: 2144)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 64, elements: !364)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !540, file: !539, line: 857, baseType: !470, size: 32, offset: 2208)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !540, file: !539, line: 858, baseType: !470, size: 32, offset: 2240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !540, file: !539, line: 859, baseType: !558, size: 3904, offset: 2272)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 3904, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 122)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !540, file: !539, line: 860, baseType: !470, size: 32, offset: 6176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !540, file: !539, line: 861, baseType: !470, size: 32, offset: 6208)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !540, file: !539, line: 862, baseType: !564, size: 1952, offset: 6240)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1952, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 61)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !540, file: !539, line: 863, baseType: !470, size: 32, offset: 8192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !540, file: !539, line: 864, baseType: !569, size: 288, offset: 8224)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 288, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 9)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !540, file: !539, line: 865, baseType: !469, size: 32, offset: 8512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !540, file: !539, line: 866, baseType: !574, size: 1696, offset: 8544)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1696, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 53)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !540, file: !539, line: 867, baseType: !470, size: 32, offset: 10240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !540, file: !539, line: 868, baseType: !579, size: 96, offset: 10272)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 96, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 3)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !540, file: !539, line: 869, baseType: !470, size: 32, offset: 10368)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !540, file: !539, line: 870, baseType: !554, size: 64, offset: 10400)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !540, file: !539, line: 871, baseType: !470, size: 32, offset: 10464)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !540, file: !539, line: 872, baseType: !470, size: 32, offset: 10496)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !540, file: !539, line: 873, baseType: !470, size: 32, offset: 10528)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !540, file: !539, line: 875, baseType: !588, size: 352, offset: 10560)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 352, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 11)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !540, file: !539, line: 876, baseType: !470, size: 32, offset: 10912)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !540, file: !539, line: 878, baseType: !593, size: 256, offset: 10944)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 256, elements: !159)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !540, file: !539, line: 879, baseType: !470, size: 32, offset: 11200)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !540, file: !539, line: 880, baseType: !596, size: 7200, offset: 11232)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 7200, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 225)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !540, file: !539, line: 881, baseType: !600, size: 1024, offset: 18432)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 1024, elements: !159)
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !539, line: 258, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 252, size: 128, elements: !604)
!604 = !{!605, !606, !607, !608}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !603, file: !539, line: 253, baseType: !470, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !603, file: !539, line: 254, baseType: !470, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !603, file: !539, line: 255, baseType: !470, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !603, file: !539, line: 257, baseType: !469, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !465, line: 468, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 445, size: 1120, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !639, !643, !645}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !612, file: !465, line: 447, baseType: !469, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !612, file: !465, line: 448, baseType: !470, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !612, file: !465, line: 449, baseType: !470, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !612, file: !465, line: 450, baseType: !470, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !612, file: !465, line: 451, baseType: !470, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !612, file: !465, line: 452, baseType: !470, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !612, file: !465, line: 453, baseType: !621, size: 96, offset: 192)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 96, elements: !623)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !218)
!623 = !{!624}
!624 = !DISubrange(count: 12)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !612, file: !465, line: 454, baseType: !470, size: 32, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !612, file: !465, line: 455, baseType: !470, size: 32, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !612, file: !465, line: 456, baseType: !470, size: 32, offset: 352)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !612, file: !465, line: 457, baseType: !470, size: 32, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !612, file: !465, line: 458, baseType: !470, size: 32, offset: 416)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !612, file: !465, line: 459, baseType: !470, size: 32, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !612, file: !465, line: 460, baseType: !470, size: 32, offset: 480)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !612, file: !465, line: 461, baseType: !554, size: 64, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !612, file: !465, line: 462, baseType: !469, size: 32, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !612, file: !465, line: 463, baseType: !469, size: 32, offset: 608)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !612, file: !465, line: 464, baseType: !636, size: 128, offset: 640)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 128, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 4)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !612, file: !465, line: 465, baseType: !640, size: 160, offset: 768)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 160, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 5)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !612, file: !465, line: 466, baseType: !644, size: 160, offset: 928)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !641)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !612, file: !465, line: 467, baseType: !470, size: 32, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !648, file: !647, line: 167, baseType: !656)
!647 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!648 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !647, file: !647, line: 134, type: !649, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !534, retainedNodes: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !137}
!651 = !{!652, !653, !655}
!652 = !DILocalVariable(name: "time_us", arg: 1, scope: !648, file: !647, line: 134, type: !137)
!653 = !DILocalVariable(name: "delay_cycles", scope: !648, file: !647, line: 168, type: !654)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!655 = !DILocalVariable(name: "cycles", scope: !648, file: !647, line: 171, type: !137)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !539, line: 2140, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 2119, size: 10880, elements: !660)
!660 = !{!661, !663, !664, !668, !669, !674, !675, !676, !677, !681, !682, !683, !684}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !659, file: !539, line: 2120, baseType: !662, size: 8192)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 8192, elements: !110)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !659, file: !539, line: 2121, baseType: !469, size: 32, offset: 8192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !659, file: !539, line: 2122, baseType: !665, size: 2048, offset: 8224)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 2048, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !659, file: !539, line: 2123, baseType: !470, size: 32, offset: 10272)
!669 = !DIDerivedType(tag: DW_TAG_member, scope: !659, file: !539, line: 2125, baseType: !670, size: 32, offset: 10304)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !659, file: !539, line: 2125, size: 32, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !670, file: !539, line: 2126, baseType: !470, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !670, file: !539, line: 2127, baseType: !470, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !659, file: !539, line: 2130, baseType: !470, size: 32, offset: 10336)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !659, file: !539, line: 2131, baseType: !470, size: 32, offset: 10368)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !659, file: !539, line: 2133, baseType: !470, size: 32, offset: 10400)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !659, file: !539, line: 2135, baseType: !678, size: 320, offset: 10432)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 320, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 10)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !659, file: !539, line: 2136, baseType: !470, size: 32, offset: 10752)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !659, file: !539, line: 2137, baseType: !469, size: 32, offset: 10784)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !659, file: !539, line: 2138, baseType: !470, size: 32, offset: 10816)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !659, file: !539, line: 2139, baseType: !470, size: 32, offset: 10848)
!685 = !{!532, !686}
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !648, file: !647, line: 161, type: !688, isLocal: true, isDefinition: true, align: 128)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 48, elements: !580)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!690 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !693, line: 51, size: 64, elements: !694)
!693 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !{!695, !702}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !692, file: !693, line: 60, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{!103, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !693, line: 48, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !692, file: !693, line: 65, baseType: !699, size: 32, offset: 32)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "__device_dts_ord_34", scope: !705, file: !930, line: 733, type: !1034, isLocal: false, isDefinition: true, align: 32)
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !707, retainedTypes: !840, globals: !926, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/sys_heap")
!707 = !{!708, !714, !30, !719, !724, !731, !737, !743, !752, !756, !805, !812, !831}
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !709, line: 23, baseType: !32, size: 32, elements: !710)
!709 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!710 = !{!711, !712, !713}
!711 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!712 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!713 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!714 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !709, line: 48, baseType: !32, size: 32, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!717 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!718 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 167, baseType: !32, size: 32, elements: !721)
!720 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !{!722, !723}
!722 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!723 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 107, baseType: !32, size: 32, elements: !725)
!725 = !{!726, !727, !728, !729, !730}
!726 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!727 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!728 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!729 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!730 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 208, baseType: !32, size: 32, elements: !732)
!732 = !{!733, !734, !735, !736}
!733 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!734 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!735 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!736 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 261, baseType: !32, size: 32, elements: !738)
!738 = !{!739, !740, !741, !742}
!739 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!740 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!741 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!742 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 237, baseType: !32, size: 32, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !751}
!745 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!746 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!747 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!748 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!749 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!750 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!751 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 152, baseType: !32, size: 32, elements: !753)
!753 = !{!754, !755}
!754 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!755 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 71, baseType: !103, size: 32, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804}
!758 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!759 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!760 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!761 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!762 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!763 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!764 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!765 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!766 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!767 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!768 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!769 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!770 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!771 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!772 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!773 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!774 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!775 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!776 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!777 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!778 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!779 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!780 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!781 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!782 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!783 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!784 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!785 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!786 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!787 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!788 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!789 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!790 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!791 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!792 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!793 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!794 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!795 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!796 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!797 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!798 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!799 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!800 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!801 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!802 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!803 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!804 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !806, line: 44, baseType: !32, size: 32, elements: !807)
!806 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!807 = !{!808, !809, !810, !811}
!808 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!809 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!810 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!811 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!812 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !813, line: 54, baseType: !32, size: 32, elements: !814)
!813 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!815 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!816 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!817 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!818 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!819 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!820 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!821 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!822 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!823 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!824 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!825 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!826 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!827 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!828 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!829 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!830 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !832, line: 53, baseType: !32, size: 32, elements: !833)
!832 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !{!834, !835, !836, !837, !838, !839}
!834 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!835 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!836 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!837 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!838 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!839 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!840 = !{!708, !102, !103, !841, !889, !890, !891, !892, !182, !137, !163, !893, !609, !894, !258, !895, !925, !120}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !539, line: 837, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 804, size: 11008, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !856, !857, !858, !859, !860, !861, !865, !866, !867, !871, !872, !873, !874, !875, !876, !877, !881, !882, !886, !887, !888}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !843, file: !539, line: 805, baseType: !470, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !843, file: !539, line: 806, baseType: !470, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !843, file: !539, line: 807, baseType: !470, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !843, file: !539, line: 808, baseType: !470, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !843, file: !539, line: 809, baseType: !470, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !843, file: !539, line: 810, baseType: !470, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !843, file: !539, line: 811, baseType: !470, size: 32, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !843, file: !539, line: 812, baseType: !853, size: 1824, offset: 224)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1824, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 57)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !843, file: !539, line: 813, baseType: !470, size: 32, offset: 2048)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !843, file: !539, line: 814, baseType: !470, size: 32, offset: 2080)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !843, file: !539, line: 815, baseType: !469, size: 32, offset: 2112)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !843, file: !539, line: 816, baseType: !470, size: 32, offset: 2144)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !843, file: !539, line: 817, baseType: !470, size: 32, offset: 2176)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !843, file: !539, line: 818, baseType: !862, size: 3968, offset: 2208)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 3968, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 124)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !843, file: !539, line: 819, baseType: !470, size: 32, offset: 6176)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !843, file: !539, line: 820, baseType: !470, size: 32, offset: 6208)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !843, file: !539, line: 821, baseType: !868, size: 2016, offset: 6240)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 2016, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 63)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !843, file: !539, line: 822, baseType: !469, size: 32, offset: 8256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !843, file: !539, line: 824, baseType: !469, size: 32, offset: 8288)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !843, file: !539, line: 825, baseType: !469, size: 32, offset: 8320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !843, file: !539, line: 826, baseType: !469, size: 32, offset: 8352)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !843, file: !539, line: 828, baseType: !469, size: 32, offset: 8384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !843, file: !539, line: 829, baseType: !469, size: 32, offset: 8416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !843, file: !539, line: 831, baseType: !878, size: 1984, offset: 8448)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1984, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 62)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !843, file: !539, line: 832, baseType: !470, size: 32, offset: 10432)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !843, file: !539, line: 833, baseType: !883, size: 224, offset: 10464)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 224, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 7)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !843, file: !539, line: 834, baseType: !470, size: 32, offset: 10688)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !843, file: !539, line: 835, baseType: !593, size: 256, offset: 10720)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !843, file: !539, line: 836, baseType: !470, size: 32, offset: 10976)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !720, line: 146, baseType: !724)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !720, line: 164, baseType: !752)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!893 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !465, line: 426, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 411, size: 28704, elements: !898)
!898 = !{!899, !901, !905, !906, !907, !908, !909, !910, !911, !912, !916, !920, !924}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !897, file: !465, line: 413, baseType: !900, size: 256)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 256, elements: !159)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !897, file: !465, line: 414, baseType: !902, size: 768, offset: 256)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 768, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 24)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !897, file: !465, line: 415, baseType: !900, size: 256, offset: 1024)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !897, file: !465, line: 416, baseType: !902, size: 768, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !897, file: !465, line: 417, baseType: !900, size: 256, offset: 2048)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !897, file: !465, line: 418, baseType: !902, size: 768, offset: 2304)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !897, file: !465, line: 419, baseType: !900, size: 256, offset: 3072)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !897, file: !465, line: 420, baseType: !902, size: 768, offset: 3328)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !897, file: !465, line: 421, baseType: !900, size: 256, offset: 4096)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !897, file: !465, line: 422, baseType: !913, size: 1792, offset: 4352)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 1792, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 56)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !897, file: !465, line: 423, baseType: !917, size: 1920, offset: 6144)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1920, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 240)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !897, file: !465, line: 424, baseType: !921, size: 20608, offset: 8064)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 20608, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 644)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !897, file: !465, line: 425, baseType: !470, size: 32, offset: 28672)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !806, line: 56, baseType: !102)
!926 = !{!927, !977, !1018, !703, !1024, !1050, !1052, !1069, !1071, !1081, !1084, !1099, !1102, !1139, !1153}
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "on", scope: !929, file: !930, line: 549, type: !235, isLocal: true, isDefinition: true)
!929 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !930, file: !930, line: 547, type: !931, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !705, retainedNodes: !933)
!930 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!931 = !DISubroutineType(types: !932)
!932 = !{null, !714}
!933 = !{!934, !935, !938}
!934 = !DILocalVariable(name: "start_mode", arg: 1, scope: !929, file: !930, line: 547, type: !714)
!935 = !DILocalVariable(name: "err", scope: !936, file: !930, line: 553, type: !103)
!936 = distinct !DILexicalBlock(scope: !937, file: !930, line: 552, column: 31)
!937 = distinct !DILexicalBlock(scope: !929, file: !930, line: 552, column: 6)
!938 = !DILocalVariable(name: "mgr", scope: !936, file: !930, line: 554, type: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !941, line: 154, size: 224, elements: !942)
!941 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!942 = !{!943, !955, !956, !972, !974, !975, !976}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !940, file: !941, line: 158, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !192, line: 40, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !192, line: 35, size: 64, elements: !946)
!946 = !{!947, !954}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !945, file: !192, line: 36, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !951)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !192, line: 30, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !945, file: !192, line: 37, baseType: !948, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !940, file: !941, line: 163, baseType: !944, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !940, file: !941, line: 166, baseType: !957, size: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !941, line: 133, size: 96, elements: !960)
!960 = !{!961, !970, !971}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !959, file: !941, line: 135, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !941, line: 129, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !939, !966}
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !941, line: 101, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !939, !103}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !959, file: !941, line: 138, baseType: !962, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !959, file: !941, line: 143, baseType: !962, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !940, file: !941, line: 169, baseType: !973, offset: 160)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !940, file: !941, line: 172, baseType: !103, size: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !941, line: 175, baseType: !151, size: 16, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !940, file: !941, line: 178, baseType: !151, size: 16, offset: 208)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "cli", scope: !929, file: !930, line: 550, type: !979, isLocal: true, isDefinition: true)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !941, line: 273, size: 128, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !979, file: !941, line: 280, baseType: !949, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !979, file: !941, line: 283, baseType: !983, size: 96, offset: 32)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !984, line: 138, size: 96, elements: !985)
!984 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!985 = !{!986, !1015, !1016}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !983, file: !984, line: 149, baseType: !987, size: 32)
!987 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !984, line: 139, size: 32, elements: !988)
!988 = !{!989, !1010}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !987, file: !984, line: 145, baseType: !990, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !425, line: 5397, size: 128, elements: !992)
!992 = !{!993, !1008, !1009}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !991, file: !425, line: 5399, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !343, line: 48, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !343, line: 37, size: 64, elements: !996)
!996 = !{!997, !1003}
!997 = !DIDerivedType(tag: DW_TAG_member, scope: !995, file: !343, line: 38, baseType: !998, size: 32)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !343, line: 38, size: 32, elements: !999)
!999 = !{!1000, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !998, file: !343, line: 39, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !998, file: !343, line: 40, baseType: !1001, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, scope: !995, file: !343, line: 42, baseType: !1004, size: 32, offset: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !343, line: 42, size: 32, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1004, file: !343, line: 43, baseType: !1001, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1004, file: !343, line: 44, baseType: !1001, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !991, file: !425, line: 5405, baseType: !32, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !991, file: !425, line: 5408, baseType: !103, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !987, file: !984, line: 148, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !984, line: 98, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, null}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !984, line: 165, baseType: !470, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !983, file: !984, line: 174, baseType: !1017, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_34", scope: !705, file: !930, line: 733, type: !1020, isLocal: false, isDefinition: true, align: 16)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 80, elements: !641)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !1023, line: 43, baseType: !245)
!1023 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_34", scope: !705, file: !930, line: 733, type: !1026, isLocal: true, isDefinition: true, align: 32)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !693, line: 51, size: 64, elements: !1028)
!1028 = !{!1029, !1049}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1027, file: !693, line: 60, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!103, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !1023, line: 378, size: 192, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1046, !1047}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1035, file: !1023, line: 380, baseType: !488, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1035, file: !1023, line: 382, baseType: !13, size: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1035, file: !1023, line: 384, baseType: !13, size: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1035, file: !1023, line: 386, baseType: !1041, size: 32, offset: 96)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 32)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !1023, line: 351, size: 16, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1042, file: !1023, line: 359, baseType: !218, size: 8)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1042, file: !1023, line: 364, baseType: !893, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1035, file: !1023, line: 388, baseType: !102, size: 32, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1035, file: !1023, line: 396, baseType: !1048, size: 32, offset: 160)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1027, file: !693, line: 65, baseType: !1033, size: 32, offset: 32)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !705, file: !930, line: 79, type: !235, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "data", scope: !705, file: !930, line: 702, type: !1054, isLocal: true, isDefinition: true)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !930, line: 69, size: 640, elements: !1055)
!1055 = !{!1056, !1058}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1054, file: !930, line: 70, baseType: !1057, size: 448)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 448, elements: !364)
