; ModuleID = './build/rtc_set_alarm.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct._IOT_RTC_CTRL_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._IOT_RTC_BACKUP_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.hal_rtc_time_t = type { i8, i8, i8, i8, i8, i8, i8 }

!41 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!42 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!43 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!44 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!45 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!46 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!47 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!48 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!49 = !{!5, !12, !50, !52, !54, !56, !8}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !9, line: 113, baseType: !53)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !9, line: 59, baseType: !55)
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!58 = !{!21}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !61, file: !62, line: 51, type: !143, isLocal: false, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !63, retainedTypes: !111, globals: !142, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!63 = !{!64, !76, !95, !102}
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 163, baseType: !66, size: 32, elements: !67)
!65 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75}
!68 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!69 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!70 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!71 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!72 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!73 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!74 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!75 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 186, baseType: !7, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!78 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!79 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!80 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!81 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!82 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!83 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!84 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!85 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!86 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!87 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!88 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!89 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!90 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!91 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!92 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!93 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!94 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 176, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101}
!97 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!98 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!99 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!100 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!101 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 99, baseType: !7, size: 32, elements: !104)
!103 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!106 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!107 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!108 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!109 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!110 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!111 = !{!112, !141}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !114, line: 72, baseType: !115)
!114 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 56, size: 525312, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !131, !132, !136, !140}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !115, file: !114, line: 57, baseType: !11, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !115, file: !114, line: 58, baseType: !11, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !115, file: !114, line: 59, baseType: !11, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !115, file: !114, line: 60, baseType: !11, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !115, file: !114, line: 61, baseType: !11, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !115, file: !114, line: 62, baseType: !11, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !115, file: !114, line: 63, baseType: !11, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !115, file: !114, line: 64, baseType: !11, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !115, file: !114, line: 65, baseType: !11, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !115, file: !114, line: 66, baseType: !11, size: 32, offset: 288)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !115, file: !114, line: 67, baseType: !128, size: 32, offset: 320)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 1)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !115, file: !114, line: 68, baseType: !11, size: 32, offset: 352)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !115, file: !114, line: 69, baseType: !133, size: 523904, offset: 384)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 523904, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 16372)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !115, file: !114, line: 70, baseType: !137, size: 512, offset: 524288)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 16)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !115, file: !114, line: 71, baseType: !137, size: 512, offset: 524800)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!142 = !{!59}
!143 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !144)
!144 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !147, file: !148, line: 53, type: !284, isLocal: false, isDefinition: true)
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !203, globals: !283, splitDebugInlining: false, nameTableKind: None)
!148 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!149 = !{!150, !158}
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 152, baseType: !66, size: 32, elements: !152)
!151 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!154 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!155 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!156 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!157 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !159, line: 47, baseType: !66, size: 32, elements: !160)
!159 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!161 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!162 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!163 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!164 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!165 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!166 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!167 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!168 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!169 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!170 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!171 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!172 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!173 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!174 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!175 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!176 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!177 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!178 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!179 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!180 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!181 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!182 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!183 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!184 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!185 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!186 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!187 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!188 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!189 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!190 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!191 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!192 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!193 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!194 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!195 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!196 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!197 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!198 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!199 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!200 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!201 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!202 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!203 = !{!204, !141, !12, !206, !208, !244}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !159, line: 97, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !159, line: 95, baseType: !158)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 44, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 77, baseType: !66)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !210, line: 378, baseType: !211)
!210 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 363, size: 28704, elements: !212)
!212 = !{!213, !217, !221, !222, !223, !224, !225, !226, !227, !228, !232, !239, !243}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !211, file: !210, line: 365, baseType: !214, size: 256)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !211, file: !210, line: 366, baseType: !218, size: 768, offset: 256)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 24)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !211, file: !210, line: 367, baseType: !214, size: 256, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !211, file: !210, line: 368, baseType: !218, size: 768, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !211, file: !210, line: 369, baseType: !214, size: 256, offset: 2048)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !211, file: !210, line: 370, baseType: !218, size: 768, offset: 2304)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !211, file: !210, line: 371, baseType: !214, size: 256, offset: 3072)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !211, file: !210, line: 372, baseType: !218, size: 768, offset: 3328)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !211, file: !210, line: 373, baseType: !214, size: 256, offset: 4096)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !211, file: !210, line: 374, baseType: !229, size: 1792, offset: 4352)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1792, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 56)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !211, file: !210, line: 375, baseType: !233, size: 1920, offset: 6144)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 1920, elements: !237)
!234 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 43, baseType: !55)
!237 = !{!238}
!238 = !DISubrange(count: 240)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !211, file: !210, line: 376, baseType: !240, size: 20608, offset: 8064)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 20608, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 644)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !211, file: !210, line: 377, baseType: !11, size: 32, offset: 28672)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !247)
!247 = !{!248, !250, !251, !252, !253, !254, !255, !259, !260, !261, !262, !263, !264, !265, !266, !270, !271, !272, !276, !280, !282}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !246, file: !210, line: 397, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !246, file: !210, line: 398, baseType: !11, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !246, file: !210, line: 399, baseType: !11, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !246, file: !210, line: 400, baseType: !11, size: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !246, file: !210, line: 401, baseType: !11, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !246, file: !210, line: 402, baseType: !11, size: 32, offset: 160)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !246, file: !210, line: 403, baseType: !256, size: 96, offset: 192)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 96, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 12)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !246, file: !210, line: 404, baseType: !11, size: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !246, file: !210, line: 405, baseType: !11, size: 32, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !246, file: !210, line: 406, baseType: !11, size: 32, offset: 352)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !246, file: !210, line: 407, baseType: !11, size: 32, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !246, file: !210, line: 408, baseType: !11, size: 32, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !246, file: !210, line: 409, baseType: !11, size: 32, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !246, file: !210, line: 410, baseType: !11, size: 32, offset: 480)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !246, file: !210, line: 411, baseType: !267, size: 64, offset: 512)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 64, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 2)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !246, file: !210, line: 412, baseType: !249, size: 32, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !246, file: !210, line: 413, baseType: !249, size: 32, offset: 608)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !246, file: !210, line: 414, baseType: !273, size: 128, offset: 640)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 128, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 4)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !246, file: !210, line: 415, baseType: !277, size: 160, offset: 768)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 160, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 5)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !246, file: !210, line: 416, baseType: !281, size: 160, offset: 928)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !278)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !246, file: !210, line: 417, baseType: !11, size: 32, offset: 1088)
!283 = !{!145}
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 6144, elements: !293)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !148, line: 50, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 47, size: 64, elements: !287)
!287 = !{!288, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !286, file: !148, line: 48, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !204}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !286, file: !148, line: 49, baseType: !12, size: 32, offset: 32)
!293 = !{!294}
!294 = !DISubrange(count: 96)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "FRE_DET_CR", scope: !297, file: !298, line: 44, type: !10, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !299, retainedTypes: !352, globals: !397, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_rtc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!299 = !{!300, !306, !158, !311, !343, !348}
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 399, baseType: !66, size: 32, elements: !302)
!301 = !DIFile(filename: "../../../../../driver/chip/inc/hal_rtc.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "HAL_RTC_STATUS_ERROR", value: -2)
!304 = !DIEnumerator(name: "HAL_RTC_STATUS_INVALID_PARAM", value: -1)
!305 = !DIEnumerator(name: "HAL_RTC_STATUS_OK", value: 0)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_HAL_RET_T", file: !307, line: 365, baseType: !55, size: 8, elements: !308)
!307 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687_cm4_hw_memmap.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!308 = !{!309, !310}
!309 = !DIEnumerator(name: "HAL_RET_SUCCESS", value: 0)
!310 = !DIEnumerator(name: "HAL_RET_FAIL", value: 1)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 249, baseType: !7, size: 32, elements: !313)
!312 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!314 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!315 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!316 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!317 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!318 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!319 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!320 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!321 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!322 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!323 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!324 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!325 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!326 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!327 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!328 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!329 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!330 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!331 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!332 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!333 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!334 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!335 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!336 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!337 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!338 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!339 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!340 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!341 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!342 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !344, line: 210, baseType: !7, size: 32, elements: !345)
!344 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!345 = !{!346, !347}
!346 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!347 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !344, line: 217, baseType: !7, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!351 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!352 = !{!205, !353, !10, !355, !8}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !344, line: 220, baseType: !348)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "P_IOT_RTC_CTRL_TypeDef", file: !307, line: 733, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_RTC_CTRL_TypeDef", file: !307, line: 694, size: 1216, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PWRCHK1", scope: !357, file: !307, line: 695, baseType: !17, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PWRCHK2", scope: !357, file: !307, line: 696, baseType: !17, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_KEY", scope: !357, file: !307, line: 697, baseType: !17, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PROT1", scope: !357, file: !307, line: 698, baseType: !17, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PROT2", scope: !357, file: !307, line: 699, baseType: !17, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PROT3", scope: !357, file: !307, line: 700, baseType: !17, size: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PROT4", scope: !357, file: !307, line: 701, baseType: !17, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_CTL", scope: !357, file: !307, line: 702, baseType: !17, size: 32, offset: 224)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_LPD_CTL", scope: !357, file: !307, line: 703, baseType: !17, size: 32, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_XOSC_CFG", scope: !357, file: !307, line: 704, baseType: !17, size: 32, offset: 288)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_DEBNCE", scope: !357, file: !307, line: 705, baseType: !17, size: 32, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PMU_EN", scope: !357, file: !307, line: 706, baseType: !17, size: 32, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PAD_CTL", scope: !357, file: !307, line: 707, baseType: !17, size: 32, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RESV0", scope: !357, file: !307, line: 708, baseType: !17, size: 32, offset: 416)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_WAVEOUT", scope: !357, file: !307, line: 709, baseType: !17, size: 32, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_YEA", scope: !357, file: !307, line: 710, baseType: !17, size: 32, offset: 480)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_MON", scope: !357, file: !307, line: 711, baseType: !17, size: 32, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_DOM", scope: !357, file: !307, line: 712, baseType: !17, size: 32, offset: 544)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_DOW", scope: !357, file: !307, line: 713, baseType: !17, size: 32, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_HOU", scope: !357, file: !307, line: 714, baseType: !17, size: 32, offset: 608)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_MIN", scope: !357, file: !307, line: 715, baseType: !17, size: 32, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_SEC", scope: !357, file: !307, line: 716, baseType: !17, size: 32, offset: 672)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RESV1", scope: !357, file: !307, line: 717, baseType: !17, size: 32, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_YEAR", scope: !357, file: !307, line: 718, baseType: !17, size: 32, offset: 736)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_MON", scope: !357, file: !307, line: 719, baseType: !17, size: 32, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_DOM", scope: !357, file: !307, line: 720, baseType: !17, size: 32, offset: 800)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_DOW", scope: !357, file: !307, line: 721, baseType: !17, size: 32, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_HOUR", scope: !357, file: !307, line: 722, baseType: !17, size: 32, offset: 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_MIN", scope: !357, file: !307, line: 723, baseType: !17, size: 32, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_SEC", scope: !357, file: !307, line: 724, baseType: !17, size: 32, offset: 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_CTL", scope: !357, file: !307, line: 725, baseType: !17, size: 32, offset: 960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RIP_CTL", scope: !357, file: !307, line: 726, baseType: !17, size: 32, offset: 992)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RIP_CNTH", scope: !357, file: !307, line: 727, baseType: !17, size: 32, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RIP_CNTL", scope: !357, file: !307, line: 728, baseType: !17, size: 32, offset: 1056)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RESV2", scope: !357, file: !307, line: 729, baseType: !17, size: 32, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TIMER_CTL", scope: !357, file: !307, line: 730, baseType: !17, size: 32, offset: 1120)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TIMER_CNTH", scope: !357, file: !307, line: 731, baseType: !17, size: 32, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TIMER_CNTL", scope: !357, file: !307, line: 732, baseType: !17, size: 32, offset: 1184)
!397 = !{!295, !398, !404}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "s_hal_rtc_alarm_callback", scope: !297, file: !298, line: 45, type: !400, isLocal: true, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_rtc_alarm_callback_t", file: !301, line: 423, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !141}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "s_hal_rtc_user_data", scope: !297, file: !298, line: 46, type: !141, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !408, file: !409, line: 77, type: !477, isLocal: true, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !410, retainedTypes: !460, globals: !462, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!410 = !{!411, !419, !424, !440, !446, !450, !26, !32, !455}
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 345, baseType: !66, size: 32, elements: !413)
!412 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!413 = !{!414, !415, !416, !417, !418}
!414 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!415 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!416 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!417 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!418 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 109, baseType: !7, size: 32, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!422 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!423 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 302, baseType: !7, size: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!426 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!427 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!428 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!429 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!430 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!431 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!432 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!433 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!434 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!435 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!436 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!437 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!438 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!439 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 321, baseType: !7, size: 32, elements: !441)
!441 = !{!442, !443, !444, !445}
!442 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!443 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!444 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!445 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 330, baseType: !7, size: 32, elements: !447)
!447 = !{!448, !449}
!448 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!449 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 337, baseType: !7, size: 32, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!453 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!454 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 355, baseType: !66, size: 32, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!458 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!459 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!460 = !{!7, !141, !55, !461, !235}
!461 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!462 = !{!406, !463}
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "func_tbl", scope: !465, file: !409, line: 536, type: !475, isLocal: true, isDefinition: true)
!465 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !409, file: !409, line: 534, type: !466, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !473)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !472}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !33, line: 197, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DISubroutineType(types: !471)
!471 = !{null}
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !312, line: 113, baseType: !419)
!473 = !{!474}
!474 = !DILocalVariable(name: "uart_port", arg: 1, scope: !465, file: !409, line: 534, type: !472)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 64, elements: !268)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 1024, elements: !268)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !409, line: 75, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 68, size: 512, elements: !480)
!480 = !{!481, !482, !494, !495, !506, !507}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !479, file: !409, line: 69, baseType: !144, size: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !479, file: !409, line: 70, baseType: !483, size: 128, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !412, line: 378, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 373, size: 128, elements: !485)
!485 = !{!486, !488, !490, !492}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !484, file: !412, line: 374, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !412, line: 317, baseType: !424)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !484, file: !412, line: 375, baseType: !489, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !412, line: 326, baseType: !440)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !484, file: !412, line: 376, baseType: !491, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !412, line: 333, baseType: !446)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !484, file: !412, line: 377, baseType: !493, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !412, line: 341, baseType: !450)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !479, file: !409, line: 71, baseType: !144, size: 8, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !479, file: !409, line: 72, baseType: !496, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !409, line: 66, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 63, size: 64, elements: !498)
!498 = !{!499, !505}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !497, file: !409, line: 64, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !412, line: 410, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504, !141}
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !412, line: 359, baseType: !455)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !497, file: !409, line: 65, baseType: !141, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !479, file: !409, line: 73, baseType: !144, size: 8, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !479, file: !409, line: 74, baseType: !508, size: 224, offset: 288)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !412, line: 390, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 382, size: 224, elements: !510)
!510 = !{!511, !513, !514, !515, !516, !517, !518}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !509, file: !412, line: 383, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !509, file: !412, line: 384, baseType: !12, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !509, file: !412, line: 385, baseType: !12, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !509, file: !412, line: 386, baseType: !512, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !509, file: !412, line: 387, baseType: !12, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !509, file: !412, line: 388, baseType: !12, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !509, file: !412, line: 389, baseType: !12, size: 32, offset: 192)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "test_rtc_callback", scope: !521, file: !522, line: 68, type: !234, isLocal: false, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !523, retainedTypes: !524, globals: !525, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/rtc_set_alarm/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!523 = !{!419, !424, !440, !446, !450, !311}
!524 = !{!141}
!525 = !{!519, !526, !531}
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "param", scope: !521, file: !522, line: 50, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 56, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 7)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "alarm_param", scope: !521, file: !522, line: 59, type: !528, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !535, file: !536, line: 59, type: !12, isLocal: false, isDefinition: true)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !537, globals: !590, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/rtc_set_alarm/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!537 = !{!538, !546, !571}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !210, line: 656, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 650, size: 128, elements: !541)
!541 = !{!542, !543, !544, !545}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !540, file: !210, line: 652, baseType: !11, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !540, file: !210, line: 653, baseType: !11, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !540, file: !210, line: 654, baseType: !11, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !540, file: !210, line: 655, baseType: !249, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !548, file: !210, line: 397, baseType: !249, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !548, file: !210, line: 398, baseType: !11, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !548, file: !210, line: 399, baseType: !11, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !548, file: !210, line: 400, baseType: !11, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !548, file: !210, line: 401, baseType: !11, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !548, file: !210, line: 402, baseType: !11, size: 32, offset: 160)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !548, file: !210, line: 403, baseType: !256, size: 96, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !548, file: !210, line: 404, baseType: !11, size: 32, offset: 288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !548, file: !210, line: 405, baseType: !11, size: 32, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !548, file: !210, line: 406, baseType: !11, size: 32, offset: 352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !548, file: !210, line: 407, baseType: !11, size: 32, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !548, file: !210, line: 408, baseType: !11, size: 32, offset: 416)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !548, file: !210, line: 409, baseType: !11, size: 32, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !548, file: !210, line: 410, baseType: !11, size: 32, offset: 480)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !548, file: !210, line: 411, baseType: !267, size: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !548, file: !210, line: 412, baseType: !249, size: 32, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !548, file: !210, line: 413, baseType: !249, size: 32, offset: 608)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !548, file: !210, line: 414, baseType: !273, size: 128, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !548, file: !210, line: 415, baseType: !277, size: 160, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !548, file: !210, line: 416, baseType: !281, size: 160, offset: 928)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !548, file: !210, line: 417, baseType: !11, size: 32, offset: 1088)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !114, line: 72, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 56, size: 525312, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !573, file: !114, line: 57, baseType: !11, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !573, file: !114, line: 58, baseType: !11, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !573, file: !114, line: 59, baseType: !11, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !573, file: !114, line: 60, baseType: !11, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !573, file: !114, line: 61, baseType: !11, size: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !573, file: !114, line: 62, baseType: !11, size: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !573, file: !114, line: 63, baseType: !11, size: 32, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !573, file: !114, line: 64, baseType: !11, size: 32, offset: 224)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !573, file: !114, line: 65, baseType: !11, size: 32, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !573, file: !114, line: 66, baseType: !11, size: 32, offset: 288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !573, file: !114, line: 67, baseType: !128, size: 32, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !573, file: !114, line: 68, baseType: !11, size: 32, offset: 352)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !573, file: !114, line: 69, baseType: !133, size: 523904, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !573, file: !114, line: 70, baseType: !137, size: 512, offset: 524288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !573, file: !114, line: 71, baseType: !137, size: 512, offset: 524800)
!590 = !{!533, !591}
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !535, file: !536, line: 61, type: !11, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "heap_end", scope: !595, file: !596, line: 66, type: !601, isLocal: true, isDefinition: true)
!595 = distinct !DISubprogram(name: "_sbrk_r", scope: !596, file: !596, line: 63, type: !597, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !793, retainedNodes: !797)
!596 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!597 = !DISubroutineType(types: !598)
!598 = !{!599, !602, !792}
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !600, line: 123, baseType: !601)
!600 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !604, line: 377, size: 1920, elements: !605)
!604 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!605 = !{!606, !607, !681, !682, !683, !684, !685, !686, !687, !690, !711, !715, !716, !717, !718, !728, !741, !742, !747, !766, !767, !774, !775, !791}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !603, file: !604, line: 381, baseType: !66, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !603, file: !604, line: 386, baseType: !608, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !604, line: 292, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !604, line: 186, size: 832, elements: !611)
!611 = !{!612, !614, !615, !616, !618, !619, !624, !625, !626, !627, !631, !637, !644, !648, !649, !650, !651, !655, !657, !658, !659, !661, !667, !680}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !610, file: !604, line: 187, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !610, file: !604, line: 188, baseType: !66, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !610, file: !604, line: 189, baseType: !66, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !610, file: !604, line: 190, baseType: !617, size: 16, offset: 96)
!617 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !610, file: !604, line: 191, baseType: !617, size: 16, offset: 112)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !610, file: !604, line: 192, baseType: !620, size: 64, offset: 128)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !604, line: 122, size: 64, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !620, file: !604, line: 123, baseType: !613, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !620, file: !604, line: 124, baseType: !66, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !610, file: !604, line: 193, baseType: !66, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !610, file: !604, line: 196, baseType: !602, size: 32, offset: 224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !610, file: !604, line: 200, baseType: !141, size: 32, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !610, file: !604, line: 202, baseType: !628, size: 32, offset: 288)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DISubroutineType(types: !630)
!630 = !{!66, !602, !141, !601, !66}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !610, file: !604, line: 204, baseType: !632, size: 32, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DISubroutineType(types: !634)
!634 = !{!66, !602, !141, !635, !66}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !610, file: !604, line: 207, baseType: !638, size: 32, offset: 352)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !602, !141, !641, !66}
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !642, line: 116, baseType: !643)
!642 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!643 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !610, file: !604, line: 208, baseType: !645, size: 32, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!646 = !DISubroutineType(types: !647)
!647 = !{!66, !602, !141}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !610, file: !604, line: 211, baseType: !620, size: 64, offset: 416)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !610, file: !604, line: 212, baseType: !613, size: 32, offset: 480)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !610, file: !604, line: 213, baseType: !66, size: 32, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !610, file: !604, line: 216, baseType: !652, size: 24, offset: 544)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 3)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !610, file: !604, line: 217, baseType: !656, size: 8, offset: 568)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, elements: !129)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !610, file: !604, line: 220, baseType: !620, size: 64, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !610, file: !604, line: 223, baseType: !66, size: 32, offset: 640)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !610, file: !604, line: 224, baseType: !660, size: 32, offset: 672)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !642, line: 46, baseType: !643)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !610, file: !604, line: 231, baseType: !662, size: 32, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !604, line: 35, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !664, line: 34, baseType: !665)
!664 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !664, line: 33, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !610, file: !604, line: 233, baseType: !668, size: 64, offset: 736)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !642, line: 170, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !642, line: 162, size: 64, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !669, file: !642, line: 164, baseType: !66, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !669, file: !642, line: 169, baseType: !673, size: 32, offset: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !669, file: !642, line: 165, size: 32, elements: !674)
!674 = !{!675, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !673, file: !642, line: 167, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !677, line: 116, baseType: !66)
!677 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !673, file: !642, line: 168, baseType: !679, size: 32)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !274)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !610, file: !604, line: 234, baseType: !66, size: 32, offset: 800)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !603, file: !604, line: 386, baseType: !608, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !603, file: !604, line: 386, baseType: !608, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !603, file: !604, line: 388, baseType: !66, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !603, file: !604, line: 390, baseType: !601, size: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !603, file: !604, line: 392, baseType: !66, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !603, file: !604, line: 394, baseType: !66, size: 32, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !603, file: !604, line: 395, baseType: !688, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !604, line: 45, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !603, file: !604, line: 397, baseType: !691, size: 32, offset: 288)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !604, line: 349, size: 128, elements: !693)
!693 = !{!694, !707, !708, !709}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !692, file: !604, line: 352, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !604, line: 52, size: 192, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !696, file: !604, line: 54, baseType: !695, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !696, file: !604, line: 55, baseType: !66, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !696, file: !604, line: 55, baseType: !66, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !696, file: !604, line: 55, baseType: !66, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !696, file: !604, line: 55, baseType: !66, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !696, file: !604, line: 56, baseType: !704, size: 32, offset: 160)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 32, elements: !129)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !604, line: 22, baseType: !706)
!706 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !692, file: !604, line: 353, baseType: !66, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !692, file: !604, line: 354, baseType: !695, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !692, file: !604, line: 355, baseType: !710, size: 32, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !603, file: !604, line: 399, baseType: !712, size: 32, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !602}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !603, file: !604, line: 401, baseType: !66, size: 32, offset: 352)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !603, file: !604, line: 404, baseType: !66, size: 32, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !603, file: !604, line: 405, baseType: !601, size: 32, offset: 416)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !603, file: !604, line: 407, baseType: !719, size: 32, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !604, line: 324, size: 192, elements: !721)
!721 = !{!722, !724, !725, !726}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !720, file: !604, line: 325, baseType: !723, size: 48)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !653)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !720, file: !604, line: 326, baseType: !723, size: 48, offset: 48)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !720, file: !604, line: 327, baseType: !53, size: 16, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !720, file: !604, line: 330, baseType: !727, size: 64, offset: 128)
!727 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !603, file: !604, line: 408, baseType: !729, size: 32, offset: 480)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !604, line: 60, size: 288, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !730, file: !604, line: 62, baseType: !66, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !730, file: !604, line: 63, baseType: !66, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !730, file: !604, line: 64, baseType: !66, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !730, file: !604, line: 65, baseType: !66, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !730, file: !604, line: 66, baseType: !66, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !730, file: !604, line: 67, baseType: !66, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !730, file: !604, line: 68, baseType: !66, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !730, file: !604, line: 69, baseType: !66, size: 32, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !730, file: !604, line: 70, baseType: !66, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !603, file: !604, line: 409, baseType: !601, size: 32, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !603, file: !604, line: 412, baseType: !743, size: 32, offset: 544)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !66}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !603, file: !604, line: 416, baseType: !748, size: 32, offset: 576)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !604, line: 90, size: 1120, elements: !750)
!750 = !{!751, !752, !753, !757}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !749, file: !604, line: 91, baseType: !748, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !749, file: !604, line: 92, baseType: !66, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !749, file: !604, line: 93, baseType: !754, size: 1024, offset: 64)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1024, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !749, file: !604, line: 94, baseType: !758, size: 32, offset: 1088)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !604, line: 79, size: 2112, elements: !760)
!760 = !{!761, !763, !764, !765}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !759, file: !604, line: 80, baseType: !762, size: 1024)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 1024, elements: !755)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !759, file: !604, line: 81, baseType: !762, size: 1024, offset: 1024)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !759, file: !604, line: 83, baseType: !705, size: 32, offset: 2048)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !759, file: !604, line: 86, baseType: !705, size: 32, offset: 2080)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !603, file: !604, line: 417, baseType: !749, size: 1120, offset: 608)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !603, file: !604, line: 420, baseType: !768, size: 96, offset: 1728)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !604, line: 296, size: 96, elements: !769)
!769 = !{!770, !772, !773}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !768, file: !604, line: 298, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !768, file: !604, line: 299, baseType: !66, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !768, file: !604, line: 300, baseType: !608, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !603, file: !604, line: 421, baseType: !608, size: 32, offset: 1824)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !603, file: !604, line: 422, baseType: !776, size: 32, offset: 1856)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !604, line: 359, size: 640, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !785, !786, !787, !788, !789, !790}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !777, file: !604, line: 362, baseType: !601, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !777, file: !604, line: 363, baseType: !668, size: 64, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !777, file: !604, line: 364, baseType: !668, size: 64, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !777, file: !604, line: 365, baseType: !668, size: 64, offset: 160)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !777, file: !604, line: 366, baseType: !784, size: 64, offset: 224)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 64, elements: !215)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !777, file: !604, line: 367, baseType: !66, size: 32, offset: 288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !777, file: !604, line: 368, baseType: !668, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !777, file: !604, line: 369, baseType: !668, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !777, file: !604, line: 370, baseType: !668, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !777, file: !604, line: 371, baseType: !668, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !777, file: !604, line: 372, baseType: !668, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !603, file: !604, line: 423, baseType: !601, size: 32, offset: 1888)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !677, line: 46, baseType: !7)
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, globals: !796, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!795 = !{!601, !599}
!796 = !{!593}
!797 = !{!798, !799, !800, !801}
!798 = !DILocalVariable(name: "r", arg: 1, scope: !595, file: !596, line: 63, type: !602)
!799 = !DILocalVariable(name: "nbytes", arg: 2, scope: !595, file: !596, line: 63, type: !792)
!800 = !DILocalVariable(name: "prev_heap_end", scope: !595, file: !596, line: 67, type: !601)
!801 = !DILocalVariable(name: "stack", scope: !595, file: !596, line: 68, type: !601)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !804, file: !809, line: 4, type: !815, isLocal: false, isDefinition: true)
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !806, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!806 = !{!802, !807, !813}
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !804, file: !809, line: 5, type: !810, isLocal: false, isDefinition: true)
!809 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 88, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 11)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !804, file: !809, line: 6, type: !810, isLocal: false, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 248, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 31)
!818 = distinct !DICompileUnit(language: DW_LANG_C99, file: !819, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !820, retainedTypes: !826, splitDebugInlining: false, nameTableKind: None)
!819 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!820 = !{!821}
!821 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !822, line: 1209, baseType: !7, size: 32, elements: !823)
!822 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!823 = !{!824, !825}
!824 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!825 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!826 = !{!827, !829}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !9, line: 116, baseType: !7)
!830 = distinct !DICompileUnit(language: DW_LANG_C99, file: !831, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !832, retainedTypes: !910, splitDebugInlining: false, nameTableKind: None)
!831 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!832 = !{!833}
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !834, line: 150, baseType: !7, size: 32, elements: !835)
!834 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!836 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!837 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!838 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!839 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!840 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!841 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!842 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!843 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!844 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!845 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!846 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!847 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!848 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!849 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!850 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!851 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!852 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!853 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!854 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!855 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!856 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!857 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!858 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!859 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!860 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!861 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!862 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!863 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!864 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!865 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!866 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!867 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!868 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!869 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!870 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!871 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!872 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!873 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!874 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!875 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!876 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!877 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!878 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!879 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!880 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!881 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!882 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!883 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!884 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!885 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!886 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!887 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!888 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!889 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!890 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!891 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!892 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!893 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!894 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!895 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!896 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!897 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!898 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!899 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!900 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!901 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!902 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!903 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!904 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!905 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!906 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!907 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!908 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!909 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!910 = !{!827, !8}
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !913, retainedTypes: !914, splitDebugInlining: false, nameTableKind: None)
!912 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_rtc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!913 = !{!306}
!914 = !{!915, !5, !8, !957, !141}
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "P_IOT_RTC_CTRL_TypeDef", file: !307, line: 733, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_RTC_CTRL_TypeDef", file: !307, line: 694, size: 1216, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PWRCHK1", scope: !917, file: !307, line: 695, baseType: !17, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PWRCHK2", scope: !917, file: !307, line: 696, baseType: !17, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_KEY", scope: !917, file: !307, line: 697, baseType: !17, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PROT1", scope: !917, file: !307, line: 698, baseType: !17, size: 32, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PROT2", scope: !917, file: !307, line: 699, baseType: !17, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PROT3", scope: !917, file: !307, line: 700, baseType: !17, size: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PROT4", scope: !917, file: !307, line: 701, baseType: !17, size: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_CTL", scope: !917, file: !307, line: 702, baseType: !17, size: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_LPD_CTL", scope: !917, file: !307, line: 703, baseType: !17, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_XOSC_CFG", scope: !917, file: !307, line: 704, baseType: !17, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_DEBNCE", scope: !917, file: !307, line: 705, baseType: !17, size: 32, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PMU_EN", scope: !917, file: !307, line: 706, baseType: !17, size: 32, offset: 352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_PAD_CTL", scope: !917, file: !307, line: 707, baseType: !17, size: 32, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RESV0", scope: !917, file: !307, line: 708, baseType: !17, size: 32, offset: 416)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_WAVEOUT", scope: !917, file: !307, line: 709, baseType: !17, size: 32, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_YEA", scope: !917, file: !307, line: 710, baseType: !17, size: 32, offset: 480)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_MON", scope: !917, file: !307, line: 711, baseType: !17, size: 32, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_DOM", scope: !917, file: !307, line: 712, baseType: !17, size: 32, offset: 544)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_DOW", scope: !917, file: !307, line: 713, baseType: !17, size: 32, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_HOU", scope: !917, file: !307, line: 714, baseType: !17, size: 32, offset: 608)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_MIN", scope: !917, file: !307, line: 715, baseType: !17, size: 32, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TC_SEC", scope: !917, file: !307, line: 716, baseType: !17, size: 32, offset: 672)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RESV1", scope: !917, file: !307, line: 717, baseType: !17, size: 32, offset: 704)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_YEAR", scope: !917, file: !307, line: 718, baseType: !17, size: 32, offset: 736)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_MON", scope: !917, file: !307, line: 719, baseType: !17, size: 32, offset: 768)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_DOM", scope: !917, file: !307, line: 720, baseType: !17, size: 32, offset: 800)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_DOW", scope: !917, file: !307, line: 721, baseType: !17, size: 32, offset: 832)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_HOUR", scope: !917, file: !307, line: 722, baseType: !17, size: 32, offset: 864)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_MIN", scope: !917, file: !307, line: 723, baseType: !17, size: 32, offset: 896)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_SEC", scope: !917, file: !307, line: 724, baseType: !17, size: 32, offset: 928)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_AL_CTL", scope: !917, file: !307, line: 725, baseType: !17, size: 32, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RIP_CTL", scope: !917, file: !307, line: 726, baseType: !17, size: 32, offset: 992)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RIP_CNTH", scope: !917, file: !307, line: 727, baseType: !17, size: 32, offset: 1024)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RIP_CNTL", scope: !917, file: !307, line: 728, baseType: !17, size: 32, offset: 1056)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_RESV2", scope: !917, file: !307, line: 729, baseType: !17, size: 32, offset: 1088)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TIMER_CTL", scope: !917, file: !307, line: 730, baseType: !17, size: 32, offset: 1120)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TIMER_CNTH", scope: !917, file: !307, line: 731, baseType: !17, size: 32, offset: 1152)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_TIMER_CNTL", scope: !917, file: !307, line: 732, baseType: !17, size: 32, offset: 1184)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "P_IOT_RTC_BACKUP_TypeDef", file: !307, line: 792, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_RTC_BACKUP_TypeDef", file: !307, line: 755, size: 1152, elements: !960)
!960 = !{!961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP0", scope: !959, file: !307, line: 756, baseType: !17, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP1", scope: !959, file: !307, line: 757, baseType: !17, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP2", scope: !959, file: !307, line: 758, baseType: !17, size: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP3", scope: !959, file: !307, line: 759, baseType: !17, size: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP4", scope: !959, file: !307, line: 760, baseType: !17, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP5", scope: !959, file: !307, line: 761, baseType: !17, size: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP6", scope: !959, file: !307, line: 762, baseType: !17, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP7", scope: !959, file: !307, line: 763, baseType: !17, size: 32, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP8", scope: !959, file: !307, line: 764, baseType: !17, size: 32, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP9", scope: !959, file: !307, line: 765, baseType: !17, size: 32, offset: 288)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP10", scope: !959, file: !307, line: 766, baseType: !17, size: 32, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP11", scope: !959, file: !307, line: 767, baseType: !17, size: 32, offset: 352)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP12", scope: !959, file: !307, line: 768, baseType: !17, size: 32, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP13", scope: !959, file: !307, line: 769, baseType: !17, size: 32, offset: 416)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP14", scope: !959, file: !307, line: 770, baseType: !17, size: 32, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP15", scope: !959, file: !307, line: 771, baseType: !17, size: 32, offset: 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP16", scope: !959, file: !307, line: 772, baseType: !17, size: 32, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP17", scope: !959, file: !307, line: 773, baseType: !17, size: 32, offset: 544)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP18", scope: !959, file: !307, line: 774, baseType: !17, size: 32, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP19", scope: !959, file: !307, line: 775, baseType: !17, size: 32, offset: 608)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP20", scope: !959, file: !307, line: 776, baseType: !17, size: 32, offset: 640)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP21", scope: !959, file: !307, line: 777, baseType: !17, size: 32, offset: 672)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP22", scope: !959, file: !307, line: 778, baseType: !17, size: 32, offset: 704)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP23", scope: !959, file: !307, line: 779, baseType: !17, size: 32, offset: 736)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP24", scope: !959, file: !307, line: 780, baseType: !17, size: 32, offset: 768)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP25", scope: !959, file: !307, line: 781, baseType: !17, size: 32, offset: 800)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP26", scope: !959, file: !307, line: 782, baseType: !17, size: 32, offset: 832)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP27", scope: !959, file: !307, line: 783, baseType: !17, size: 32, offset: 864)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP28", scope: !959, file: !307, line: 784, baseType: !17, size: 32, offset: 896)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP29", scope: !959, file: !307, line: 785, baseType: !17, size: 32, offset: 928)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP30", scope: !959, file: !307, line: 786, baseType: !17, size: 32, offset: 960)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP31", scope: !959, file: !307, line: 787, baseType: !17, size: 32, offset: 992)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP32", scope: !959, file: !307, line: 788, baseType: !17, size: 32, offset: 1024)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP33", scope: !959, file: !307, line: 789, baseType: !17, size: 32, offset: 1056)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP34", scope: !959, file: !307, line: 790, baseType: !17, size: 32, offset: 1088)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_BACKUP35", scope: !959, file: !307, line: 791, baseType: !17, size: 32, offset: 1120)
!997 = distinct !DICompileUnit(language: DW_LANG_C99, file: !998, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !999, splitDebugInlining: false, nameTableKind: None)
!998 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/rtc_set_alarm/GCC")
!999 = !{!1000, !1025}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1002, file: !210, line: 397, baseType: !249, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1002, file: !210, line: 398, baseType: !11, size: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1002, file: !210, line: 399, baseType: !11, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1002, file: !210, line: 400, baseType: !11, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1002, file: !210, line: 401, baseType: !11, size: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1002, file: !210, line: 402, baseType: !11, size: 32, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1002, file: !210, line: 403, baseType: !256, size: 96, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1002, file: !210, line: 404, baseType: !11, size: 32, offset: 288)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1002, file: !210, line: 405, baseType: !11, size: 32, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1002, file: !210, line: 406, baseType: !11, size: 32, offset: 352)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1002, file: !210, line: 407, baseType: !11, size: 32, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1002, file: !210, line: 408, baseType: !11, size: 32, offset: 416)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !1002, file: !210, line: 409, baseType: !11, size: 32, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !1002, file: !210, line: 410, baseType: !11, size: 32, offset: 480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !1002, file: !210, line: 411, baseType: !267, size: 64, offset: 512)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !1002, file: !210, line: 412, baseType: !249, size: 32, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !1002, file: !210, line: 413, baseType: !249, size: 32, offset: 608)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !1002, file: !210, line: 414, baseType: !273, size: 128, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !1002, file: !210, line: 415, baseType: !277, size: 160, offset: 768)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1002, file: !210, line: 416, baseType: !281, size: 160, offset: 928)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !1002, file: !210, line: 417, baseType: !11, size: 32, offset: 1088)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !210, line: 378, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 363, size: 28704, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1027, file: !210, line: 365, baseType: !214, size: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1027, file: !210, line: 366, baseType: !218, size: 768, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1027, file: !210, line: 367, baseType: !214, size: 256, offset: 1024)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1027, file: !210, line: 368, baseType: !218, size: 768, offset: 1280)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1027, file: !210, line: 369, baseType: !214, size: 256, offset: 2048)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1027, file: !210, line: 370, baseType: !218, size: 768, offset: 2304)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1027, file: !210, line: 371, baseType: !214, size: 256, offset: 3072)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1027, file: !210, line: 372, baseType: !218, size: 768, offset: 3328)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1027, file: !210, line: 373, baseType: !214, size: 256, offset: 4096)
