; ModuleID = 'build/adafruit_trinket_m0/drivers/crypto/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.mode_test = type { i8*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.sam0_eic_data = type { [1 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.crypto_driver_api = type { i32 (%struct.device*)*, i32 (%struct.device*, %struct.cipher_ctx*, i32, i32, i32)*, i32 (%struct.device*, %struct.cipher_ctx*)*, i32 (%struct.device*, void (%struct.cipher_pkt*, i32)*)*, i32 (%struct.device*, %struct.hash_ctx*, i32)*, i32 (%struct.device*, %struct.hash_ctx*)*, i32 (%struct.device*, void (%struct.hash_pkt*, i32)*)* }
%struct.cipher_ctx = type { %struct.cipher_ops, %union.anon.4, %struct.device*, i8*, i8*, %union.anon.5, i16, i16 }
%struct.cipher_ops = type { i32, %union.anon.3 }
%union.anon.3 = type { i32 (%struct.cipher_ctx*, %struct.cipher_pkt*)* }
%struct.cipher_pkt = type { i8*, i32, i8*, i32, i32, %struct.cipher_ctx* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/crypto/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/crypto")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/crypto")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !294, line: 18, type: !371, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !290, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/crypto")
!29 = !{!30, !39, !42, !46, !116}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_mode", file: !31, line: 44, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/crypto/cipher.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_ECB", value: 1)
!35 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CBC", value: 2)
!36 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CTR", value: 3)
!37 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CCM", value: 4)
!38 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_GCM", value: 5)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_algo", file: !31, line: 29, baseType: !32, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "CRYPTO_CIPHER_ALGO_AES", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_op", file: !31, line: 34, baseType: !32, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_DECRYPT", value: 0)
!45 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_ENCRYPT", value: 1)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !47, line: 27, baseType: !32, size: 32, elements: !48)
!47 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!49 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!50 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!51 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!52 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!53 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!54 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!55 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!56 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!57 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!58 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!59 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!60 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!61 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!62 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!63 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!64 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!65 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!115 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_algo", file: !117, line: 26, baseType: !32, size: 32, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/crypto/hash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA224", value: 1)
!120 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA256", value: 2)
!121 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA384", value: 3)
!122 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA512", value: 4)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/crypto/crypto.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !161, !241, !245, !253, !278, !282}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !127, file: !128, line: 66, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!125, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !143, !144, !145, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 380, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !136, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !136, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !136, file: !137, line: 386, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !147, file: !137, line: 359, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !147, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !136, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !137, line: 43, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !127, file: !128, line: 69, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !134, !165, !39, !30, !42}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !167)
!167 = !{!168, !212, !217, !218, !219, !220, !239, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !31, line: 116, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !169, file: !31, line: 76, baseType: !30, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !31, line: 78, baseType: !173, size: 32, offset: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !31, line: 78, size: 32, elements: !174)
!174 = !{!175, !190, !195, !197, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !173, file: !31, line: 79, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!125, !165, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !182)
!182 = !{!183, !185, !186, !187, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !181, file: !31, line: 183, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !181, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !181, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !181, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !181, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !31, line: 208, baseType: !165, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !173, file: !31, line: 80, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!125, !165, !180, !184}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !173, file: !31, line: 81, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !173, file: !31, line: 82, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!125, !165, !202, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !204)
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !203, file: !31, line: 219, baseType: !180, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !203, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !203, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !173, file: !31, line: 83, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !31, line: 126, baseType: !213, size: 32, offset: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 119, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !213, file: !31, line: 121, baseType: !184, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !213, file: !31, line: 125, baseType: !124, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !166, file: !31, line: 131, baseType: !134, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !166, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !166, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !166, file: !31, line: 156, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 152, size: 32, elements: !222)
!222 = !{!223, !230, !234}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !221, file: !31, line: 153, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !224, file: !31, line: 88, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !224, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !221, file: !31, line: 154, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !231, file: !31, line: 96, baseType: !208, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !221, file: !31, line: 155, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !235, file: !31, line: 100, baseType: !227, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !235, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !166, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !127, file: !128, line: 74, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !134, !165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !127, file: !128, line: 77, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !134, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !180, !125}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !127, file: !128, line: 81, baseType: !254, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!125, !134, !257, !116}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !259)
!259 = !{!260, !261, !262, !276, !277}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !258, file: !117, line: 51, baseType: !134, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !258, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !258, file: !117, line: 65, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!125, !257, !267, !153}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !269)
!269 = !{!270, !271, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !268, file: !117, line: 91, baseType: !184, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !268, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !268, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !268, file: !117, line: 107, baseType: !257, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !258, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !127, file: !128, line: 84, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!125, !134, !257}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !127, file: !128, line: 86, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!125, !134, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !267, !125}
!290 = !{!25, !291, !314, !316, !318, !320, !324, !327, !329, !334, !339, !344, !349, !351, !356, !361, !366}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "iv", scope: !293, file: !294, line: 227, type: !311, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "cbc_mode", scope: !294, file: !294, line: 205, type: !295, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !297)
!294 = !DIFile(filename: "zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !134}
!297 = !{!298, !299, !303, !307, !308, !309, !310}
!298 = !DILocalVariable(name: "dev", arg: 1, scope: !293, file: !294, line: 205, type: !134)
!299 = !DILocalVariable(name: "encrypted", scope: !293, file: !294, line: 207, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 640, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 80)
!303 = !DILocalVariable(name: "decrypted", scope: !293, file: !294, line: 208, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DILocalVariable(name: "ini", scope: !293, file: !294, line: 209, type: !166)
!308 = !DILocalVariable(name: "encrypt", scope: !293, file: !294, line: 214, type: !181)
!309 = !DILocalVariable(name: "decrypt", scope: !293, file: !294, line: 220, type: !181)
!310 = !DILabel(scope: !293, name: "out", file: !294, line: 279)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "cap_flags", scope: !27, file: !294, line: 48, type: !208, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "key", scope: !27, file: !294, line: 34, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plaintext", scope: !27, file: !294, line: 39, type: !304, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "cbc_ciphertext", scope: !27, file: !294, line: 195, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 640, elements: !301)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ctr_ciphertext", scope: !27, file: !294, line: 283, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !305)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ccm_key", scope: !27, file: !294, line: 373, type: !311, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ccm_data", scope: !27, file: !294, line: 384, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 184, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 23)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "ccm_hdr", scope: !27, file: !294, line: 381, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "ccm_nonce", scope: !27, file: !294, line: 377, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "ccm_expected", scope: !27, file: !294, line: 388, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 248, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 31)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "gcm_key", scope: !27, file: !294, line: 485, type: !311, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gcm_data", scope: !27, file: !294, line: 496, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 336, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 42)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "gcm_hdr", scope: !27, file: !294, line: 492, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gcm_nonce", scope: !27, file: !294, line: 489, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "gcm_expected", scope: !27, file: !294, line: 502, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 464, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 58)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 17, baseType: !140, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !379, file: !395, line: 18, type: !396, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, globals: !394, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/crypto")
!381 = !{!22, !124, !24, !382, !384, !386, !272, !125, !387, !388, !390, !392, !393, !184, !227, !140}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!394 = !{!377}
!395 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !373, line: 17, baseType: !140, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_char_out", scope: !403, file: !408, line: 54, type: !409, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/crypto")
!405 = !{!46}
!406 = !{!124, !125}
!407 = !{!401}
!408 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!125, !125}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !414, file: !1146, line: 202, type: !1147, isLocal: true, isDefinition: true, align: 32)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !416, globals: !1145, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/crypto")
!416 = !{!124, !125, !417, !541, !880, !881, !948}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !419, line: 335, baseType: !420)
!419 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 320, size: 288, elements: !421)
!421 = !{!422, !433, !441, !455, !466, !477, !481, !492, !493, !504, !505, !520, !521, !531}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !420, file: !419, line: 321, baseType: !423, size: 16)
!423 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !419, line: 50, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 43, size: 16, elements: !426)
!426 = !{!427, !432}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !425, file: !419, line: 48, baseType: !428, size: 16)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !425, file: !419, line: 44, size: 16, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !428, file: !419, line: 45, baseType: !227, size: 7, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !428, file: !419, line: 47, baseType: !227, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !425, file: !419, line: 49, baseType: !227, size: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !420, file: !419, line: 322, baseType: !434, size: 16, offset: 16)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 16, elements: !439)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !436, line: 52, baseType: !437)
!436 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21e18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!439 = !{!440}
!440 = !DISubrange(count: 2)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !420, file: !419, line: 323, baseType: !442, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !419, line: 107, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 94, size: 32, elements: !445)
!445 = !{!446, !454}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !444, file: !419, line: 105, baseType: !447, size: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !444, file: !419, line: 95, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !447, file: !419, line: 97, baseType: !208, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !447, file: !419, line: 99, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !447, file: !419, line: 100, baseType: !208, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !447, file: !419, line: 102, baseType: !208, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !447, file: !419, line: 103, baseType: !208, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !444, file: !419, line: 106, baseType: !208, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !420, file: !419, line: 324, baseType: !456, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !419, line: 155, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 148, size: 32, elements: !459)
!459 = !{!460, !465}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !458, file: !419, line: 153, baseType: !461, size: 32)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !419, line: 149, size: 32, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !461, file: !419, line: 150, baseType: !208, size: 16, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !461, file: !419, line: 151, baseType: !208, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !458, file: !419, line: 154, baseType: !208, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !420, file: !419, line: 325, baseType: !467, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !419, line: 194, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 187, size: 8, elements: !470)
!470 = !{!471, !476}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !469, file: !419, line: 192, baseType: !472, size: 8)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !419, line: 188, size: 8, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !472, file: !419, line: 189, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !472, file: !419, line: 190, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !469, file: !419, line: 193, baseType: !150, size: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !420, file: !419, line: 326, baseType: !478, size: 24, offset: 104)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 24, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 3)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !420, file: !419, line: 327, baseType: !482, size: 8, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !419, line: 215, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 208, size: 8, elements: !485)
!485 = !{!486, !491}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !484, file: !419, line: 213, baseType: !487, size: 8)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !484, file: !419, line: 209, size: 8, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !487, file: !419, line: 210, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !487, file: !419, line: 211, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !484, file: !419, line: 214, baseType: !150, size: 8)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !420, file: !419, line: 328, baseType: !478, size: 24, offset: 136)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !420, file: !419, line: 329, baseType: !494, size: 8, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !419, line: 236, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 229, size: 8, elements: !497)
!497 = !{!498, !503}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !496, file: !419, line: 234, baseType: !499, size: 8)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !496, file: !419, line: 230, size: 8, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !499, file: !419, line: 231, baseType: !437, size: 1, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !499, file: !419, line: 232, baseType: !437, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !496, file: !419, line: 235, baseType: !150, size: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !420, file: !419, line: 330, baseType: !478, size: 24, offset: 168)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !420, file: !419, line: 331, baseType: !506, size: 16, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !419, line: 262, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 250, size: 16, elements: !509)
!509 = !{!510, !519}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !508, file: !419, line: 260, baseType: !511, size: 16)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !419, line: 251, size: 16, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !511, file: !419, line: 252, baseType: !227, size: 1, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !511, file: !419, line: 253, baseType: !227, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !511, file: !419, line: 254, baseType: !227, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !511, file: !419, line: 255, baseType: !227, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !511, file: !419, line: 256, baseType: !227, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !511, file: !419, line: 258, baseType: !227, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !508, file: !419, line: 261, baseType: !227, size: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !420, file: !419, line: 332, baseType: !434, size: 16, offset: 208)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !420, file: !419, line: 333, baseType: !522, size: 32, offset: 224)
!522 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !419, line: 290, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 284, size: 32, elements: !525)
!525 = !{!526, !530}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !524, file: !419, line: 288, baseType: !527, size: 32)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !524, file: !419, line: 285, size: 32, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !527, file: !419, line: 286, baseType: !208, size: 22, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !524, file: !419, line: 289, baseType: !208, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !420, file: !419, line: 334, baseType: !532, size: 16, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !419, line: 308, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 303, size: 16, elements: !535)
!535 = !{!536, !540}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !534, file: !419, line: 306, baseType: !537, size: 16)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !534, file: !419, line: 304, size: 16, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !537, file: !419, line: 305, baseType: !227, size: 16, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !534, file: !419, line: 307, baseType: !227, size: 16)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !543, line: 928, baseType: !544)
!543 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 899, size: 672, elements: !545)
!545 = !{!546, !570, !594, !620, !645, !661, !662, !680, !681, !698, !709, !710, !725, !745, !746, !758, !770, !780, !781, !798, !802, !813, !814, !826, !838, !839, !850, !866}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !544, file: !543, line: 900, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !543, line: 64, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 43, size: 32, elements: !550)
!550 = !{!551, !569}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !549, file: !543, line: 62, baseType: !552, size: 32)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !549, file: !543, line: 44, size: 32, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !552, file: !543, line: 45, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !552, file: !543, line: 46, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !552, file: !543, line: 47, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !552, file: !543, line: 48, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !552, file: !543, line: 49, baseType: !208, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !552, file: !543, line: 50, baseType: !208, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !552, file: !543, line: 51, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !552, file: !543, line: 52, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !552, file: !543, line: 53, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !552, file: !543, line: 54, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !552, file: !543, line: 55, baseType: !208, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !552, file: !543, line: 56, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !552, file: !543, line: 58, baseType: !208, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !552, file: !543, line: 59, baseType: !208, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !552, file: !543, line: 60, baseType: !208, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !549, file: !543, line: 63, baseType: !208, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !544, file: !543, line: 901, baseType: !571, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !543, line: 125, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 104, size: 32, elements: !574)
!574 = !{!575, !593}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !573, file: !543, line: 123, baseType: !576, size: 32)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !543, line: 105, size: 32, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !576, file: !543, line: 106, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !576, file: !543, line: 107, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !576, file: !543, line: 108, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !576, file: !543, line: 109, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !576, file: !543, line: 110, baseType: !208, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !576, file: !543, line: 111, baseType: !208, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !576, file: !543, line: 112, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !576, file: !543, line: 113, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !576, file: !543, line: 114, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !576, file: !543, line: 115, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !576, file: !543, line: 116, baseType: !208, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !576, file: !543, line: 117, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !576, file: !543, line: 119, baseType: !208, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !576, file: !543, line: 120, baseType: !208, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !576, file: !543, line: 121, baseType: !208, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !573, file: !543, line: 124, baseType: !208, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !544, file: !543, line: 902, baseType: !595, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !543, line: 186, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 165, size: 32, elements: !598)
!598 = !{!599, !619}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !597, file: !543, line: 184, baseType: !600, size: 32)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !543, line: 166, size: 32, elements: !601)
!601 = !{!602, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !600, file: !543, line: 167, baseType: !603, size: 1, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !600, file: !543, line: 168, baseType: !603, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !600, file: !543, line: 169, baseType: !603, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !600, file: !543, line: 170, baseType: !603, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !600, file: !543, line: 171, baseType: !603, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !600, file: !543, line: 172, baseType: !603, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !600, file: !543, line: 173, baseType: !603, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !600, file: !543, line: 174, baseType: !603, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !600, file: !543, line: 175, baseType: !603, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !600, file: !543, line: 176, baseType: !603, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !600, file: !543, line: 177, baseType: !603, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !600, file: !543, line: 178, baseType: !603, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !600, file: !543, line: 180, baseType: !603, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !600, file: !543, line: 181, baseType: !603, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !600, file: !543, line: 182, baseType: !603, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !597, file: !543, line: 185, baseType: !208, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !544, file: !543, line: 903, baseType: !621, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !543, line: 247, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 226, size: 32, elements: !625)
!625 = !{!626, !644}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !624, file: !543, line: 245, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !543, line: 227, size: 32, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !627, file: !543, line: 228, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !627, file: !543, line: 229, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !627, file: !543, line: 230, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !627, file: !543, line: 231, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !627, file: !543, line: 232, baseType: !208, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !627, file: !543, line: 233, baseType: !208, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !627, file: !543, line: 234, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !627, file: !543, line: 235, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !627, file: !543, line: 236, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !627, file: !543, line: 237, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !627, file: !543, line: 238, baseType: !208, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !627, file: !543, line: 239, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !627, file: !543, line: 241, baseType: !208, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !627, file: !543, line: 242, baseType: !208, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !627, file: !543, line: 243, baseType: !208, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !624, file: !543, line: 246, baseType: !208, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !544, file: !543, line: 904, baseType: !646, size: 16, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !543, line: 300, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 287, size: 16, elements: !649)
!649 = !{!650, !660}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !648, file: !543, line: 298, baseType: !651, size: 16)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !648, file: !543, line: 288, size: 16, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !651, file: !543, line: 290, baseType: !227, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !651, file: !543, line: 291, baseType: !227, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !651, file: !543, line: 293, baseType: !227, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !651, file: !543, line: 294, baseType: !227, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !651, file: !543, line: 295, baseType: !227, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !651, file: !543, line: 296, baseType: !227, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !651, file: !543, line: 297, baseType: !227, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !648, file: !543, line: 299, baseType: !227, size: 16)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !544, file: !543, line: 905, baseType: !434, size: 16, offset: 144)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !544, file: !543, line: 906, baseType: !663, size: 16, offset: 160)
!663 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !543, line: 352, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 336, size: 16, elements: !666)
!666 = !{!667, !679}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !665, file: !543, line: 350, baseType: !668, size: 16)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !543, line: 337, size: 16, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !668, file: !543, line: 339, baseType: !227, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !668, file: !543, line: 340, baseType: !227, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !668, file: !543, line: 341, baseType: !227, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !668, file: !543, line: 342, baseType: !227, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !668, file: !543, line: 343, baseType: !227, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !668, file: !543, line: 344, baseType: !227, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !668, file: !543, line: 345, baseType: !227, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !668, file: !543, line: 346, baseType: !227, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !668, file: !543, line: 348, baseType: !227, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !665, file: !543, line: 351, baseType: !227, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !544, file: !543, line: 907, baseType: !434, size: 16, offset: 176)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !544, file: !543, line: 908, baseType: !682, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !543, line: 398, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 381, size: 32, elements: !685)
!685 = !{!686, !697}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !684, file: !543, line: 396, baseType: !687, size: 32)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !684, file: !543, line: 382, size: 32, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !687, file: !543, line: 384, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !687, file: !543, line: 385, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !687, file: !543, line: 386, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !687, file: !543, line: 388, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !687, file: !543, line: 389, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !687, file: !543, line: 390, baseType: !208, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !687, file: !543, line: 392, baseType: !208, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !687, file: !543, line: 394, baseType: !208, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !684, file: !543, line: 397, baseType: !208, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !544, file: !543, line: 909, baseType: !699, size: 8, offset: 224)
!699 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !543, line: 433, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 426, size: 8, elements: !702)
!702 = !{!703, !708}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !701, file: !543, line: 431, baseType: !704, size: 8)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !701, file: !543, line: 427, size: 8, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !704, file: !543, line: 428, baseType: !150, size: 5, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !704, file: !543, line: 430, baseType: !150, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !701, file: !543, line: 432, baseType: !150, size: 8)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !544, file: !543, line: 910, baseType: !478, size: 24, offset: 232)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !544, file: !543, line: 911, baseType: !711, size: 32, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !543, line: 462, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 448, size: 32, elements: !714)
!714 = !{!715, !724}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !713, file: !543, line: 460, baseType: !716, size: 32)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !713, file: !543, line: 449, size: 32, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !716, file: !543, line: 451, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !716, file: !543, line: 453, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !716, file: !543, line: 454, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !716, file: !543, line: 455, baseType: !208, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !716, file: !543, line: 457, baseType: !208, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !716, file: !543, line: 459, baseType: !208, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !713, file: !543, line: 461, baseType: !208, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !544, file: !543, line: 912, baseType: !726, size: 16, offset: 288)
!726 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !543, line: 520, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 503, size: 16, elements: !729)
!729 = !{!730, !744}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !728, file: !543, line: 518, baseType: !731, size: 16)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !728, file: !543, line: 504, size: 16, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !731, file: !543, line: 506, baseType: !227, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !731, file: !543, line: 507, baseType: !227, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !731, file: !543, line: 508, baseType: !227, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !731, file: !543, line: 509, baseType: !227, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !731, file: !543, line: 510, baseType: !227, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !731, file: !543, line: 511, baseType: !227, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !731, file: !543, line: 512, baseType: !227, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !731, file: !543, line: 513, baseType: !227, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !731, file: !543, line: 514, baseType: !227, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !731, file: !543, line: 515, baseType: !227, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !731, file: !543, line: 516, baseType: !227, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !728, file: !543, line: 519, baseType: !227, size: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !544, file: !543, line: 913, baseType: !434, size: 16, offset: 304)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !544, file: !543, line: 914, baseType: !747, size: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !543, line: 559, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 552, size: 32, elements: !750)
!750 = !{!751, !757}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !749, file: !543, line: 557, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !749, file: !543, line: 553, size: 32, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !752, file: !543, line: 554, baseType: !208, size: 10, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !752, file: !543, line: 555, baseType: !208, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !752, file: !543, line: 556, baseType: !208, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !749, file: !543, line: 558, baseType: !208, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !544, file: !543, line: 915, baseType: !759, size: 32, offset: 352)
!759 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !543, line: 585, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 578, size: 32, elements: !762)
!762 = !{!763, !769}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !761, file: !543, line: 583, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !761, file: !543, line: 579, size: 32, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !764, file: !543, line: 580, baseType: !208, size: 16, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !764, file: !543, line: 581, baseType: !208, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !764, file: !543, line: 582, baseType: !208, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !761, file: !543, line: 584, baseType: !208, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !544, file: !543, line: 916, baseType: !771, size: 8, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !543, line: 610, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 604, size: 8, elements: !774)
!774 = !{!775, !779}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !773, file: !543, line: 608, baseType: !776, size: 8)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !773, file: !543, line: 605, size: 8, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !776, file: !543, line: 607, baseType: !150, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !773, file: !543, line: 609, baseType: !150, size: 8)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !544, file: !543, line: 917, baseType: !478, size: 24, offset: 392)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !544, file: !543, line: 918, baseType: !782, size: 32, offset: 416)
!782 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !543, line: 639, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 622, size: 32, elements: !785)
!785 = !{!786, !797}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !784, file: !543, line: 637, baseType: !787, size: 32)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !784, file: !543, line: 623, size: 32, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !787, file: !543, line: 625, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !787, file: !543, line: 626, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !787, file: !543, line: 627, baseType: !208, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !787, file: !543, line: 629, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !787, file: !543, line: 631, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !787, file: !543, line: 632, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !787, file: !543, line: 634, baseType: !208, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !787, file: !543, line: 635, baseType: !208, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !784, file: !543, line: 638, baseType: !208, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !544, file: !543, line: 919, baseType: !799, size: 32, offset: 448)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 32, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 4)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !544, file: !543, line: 920, baseType: !803, size: 16, offset: 480)
!803 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !543, line: 715, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 706, size: 16, elements: !806)
!806 = !{!807, !812}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !805, file: !543, line: 713, baseType: !808, size: 16)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !805, file: !543, line: 707, size: 16, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !808, file: !543, line: 709, baseType: !227, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !808, file: !543, line: 711, baseType: !227, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !805, file: !543, line: 714, baseType: !227, size: 16)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !544, file: !543, line: 921, baseType: !434, size: 16, offset: 496)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !544, file: !543, line: 922, baseType: !815, size: 32, offset: 512)
!815 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !543, line: 739, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 729, size: 32, elements: !818)
!818 = !{!819, !825}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !817, file: !543, line: 737, baseType: !820, size: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !817, file: !543, line: 730, size: 32, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !820, file: !543, line: 732, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !820, file: !543, line: 733, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !820, file: !543, line: 735, baseType: !208, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !817, file: !543, line: 738, baseType: !208, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !544, file: !543, line: 923, baseType: !827, size: 8, offset: 544)
!827 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !543, line: 765, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 756, size: 8, elements: !830)
!830 = !{!831, !837}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !829, file: !543, line: 763, baseType: !832, size: 8)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !829, file: !543, line: 757, size: 8, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !832, file: !543, line: 759, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !832, file: !543, line: 761, baseType: !150, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !832, file: !543, line: 762, baseType: !150, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !829, file: !543, line: 764, baseType: !150, size: 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !544, file: !543, line: 924, baseType: !478, size: 24, offset: 552)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !544, file: !543, line: 925, baseType: !840, size: 32, offset: 576)
!840 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !543, line: 789, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 781, size: 32, elements: !843)
!843 = !{!844, !849}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !842, file: !543, line: 787, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !842, file: !543, line: 782, size: 32, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !845, file: !543, line: 783, baseType: !208, size: 12, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !845, file: !543, line: 785, baseType: !208, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !842, file: !543, line: 788, baseType: !208, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !544, file: !543, line: 926, baseType: !851, size: 32, offset: 608)
!851 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !543, line: 820, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 805, size: 32, elements: !854)
!854 = !{!855, !865}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !853, file: !543, line: 818, baseType: !856, size: 32)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !853, file: !543, line: 806, size: 32, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !864}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !856, file: !543, line: 807, baseType: !208, size: 2, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !856, file: !543, line: 808, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !856, file: !543, line: 809, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !856, file: !543, line: 810, baseType: !208, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !856, file: !543, line: 812, baseType: !208, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !856, file: !543, line: 814, baseType: !208, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !856, file: !543, line: 816, baseType: !208, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !853, file: !543, line: 819, baseType: !208, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !544, file: !543, line: 927, baseType: !867, size: 8, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !543, line: 881, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !543, line: 872, size: 8, elements: !871)
!871 = !{!872, !879}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !870, file: !543, line: 879, baseType: !873, size: 8)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !870, file: !543, line: 873, size: 8, elements: !874)
!874 = !{!875, !876, !877, !878}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !873, file: !543, line: 874, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !873, file: !543, line: 875, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !873, file: !543, line: 876, baseType: !150, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !873, file: !543, line: 877, baseType: !150, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !870, file: !543, line: 880, baseType: !150, size: 8)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !883, line: 290, baseType: !884)
!883 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !883, line: 284, size: 96, elements: !885)
!885 = !{!886, !896, !907, !920, !937}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !884, file: !883, line: 285, baseType: !887, size: 8)
!887 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !883, line: 49, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !883, line: 43, size: 8, elements: !890)
!890 = !{!891, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !889, file: !883, line: 47, baseType: !892, size: 8)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !889, file: !883, line: 44, size: 8, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !892, file: !883, line: 45, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !889, file: !883, line: 48, baseType: !150, size: 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !884, file: !883, line: 286, baseType: !897, size: 8, offset: 8)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !883, line: 67, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !883, line: 61, size: 8, elements: !901)
!901 = !{!902, !906}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !900, file: !883, line: 65, baseType: !903, size: 8)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !900, file: !883, line: 62, size: 8, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !903, file: !883, line: 64, baseType: !150, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !900, file: !883, line: 66, baseType: !150, size: 8)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !884, file: !883, line: 287, baseType: !908, size: 16, offset: 16)
!908 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !883, line: 89, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !883, line: 79, size: 16, elements: !911)
!911 = !{!912, !919}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !910, file: !883, line: 87, baseType: !913, size: 16)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !910, file: !883, line: 80, size: 16, elements: !914)
!914 = !{!915, !916, !917, !918}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !913, file: !883, line: 81, baseType: !227, size: 6, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !913, file: !883, line: 83, baseType: !227, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !913, file: !883, line: 85, baseType: !227, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !913, file: !883, line: 86, baseType: !227, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !910, file: !883, line: 88, baseType: !227, size: 16)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !884, file: !883, line: 288, baseType: !921, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !883, line: 214, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !883, line: 199, size: 32, elements: !924)
!924 = !{!925, !936}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !923, file: !883, line: 212, baseType: !926, size: 32)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !923, file: !883, line: 200, size: 32, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !926, file: !883, line: 201, baseType: !208, size: 4, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !926, file: !883, line: 203, baseType: !208, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !926, file: !883, line: 205, baseType: !208, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !926, file: !883, line: 206, baseType: !208, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !926, file: !883, line: 207, baseType: !208, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !926, file: !883, line: 208, baseType: !208, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !926, file: !883, line: 209, baseType: !208, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !926, file: !883, line: 210, baseType: !208, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !923, file: !883, line: 213, baseType: !208, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !884, file: !883, line: 289, baseType: !938, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !883, line: 268, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !883, line: 260, size: 32, elements: !941)
!941 = !{!942, !947}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !940, file: !883, line: 266, baseType: !943, size: 32)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !940, file: !883, line: 261, size: 32, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !943, file: !883, line: 262, baseType: !208, size: 4, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !943, file: !883, line: 264, baseType: !208, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !940, file: !883, line: 267, baseType: !208, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
