; ModuleID = 'build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i8*, i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_consumer_sub", scope: !27, file: !117, line: 13, type: !126, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !114, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !111, !112}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !113)
!113 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!114 = !{!25, !115, !289, !320, !324, !329, !334}
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "consumer_sub", scope: !27, file: !117, line: 13, type: !118, isLocal: false, isDefinition: true, align: 32)
!117 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !120)
!119 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121, !123, !168}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !118, file: !119, line: 91, baseType: !122, size: 8)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !118, file: !119, line: 93, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !150, !155, !158, !159, !161, !162, !163, !164, !165}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !126, file: !127, line: 4206, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !132, file: !131, line: 232, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !138)
!138 = !{!139, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !136, line: 38, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !136, line: 38, size: 32, elements: !141)
!141 = !{!142, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !140, file: !136, line: 39, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !136, line: 40, baseType: !143, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !136, line: 42, baseType: !146, size: 32, offset: 32)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !136, line: 42, size: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !146, file: !136, line: 43, baseType: !143, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !136, line: 44, baseType: !143, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !126, file: !127, line: 4208, baseType: !151, size: 32, offset: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !153)
!152 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !151, file: !152, line: 52, baseType: !22, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !126, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 214, baseType: !32)
!157 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !126, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !126, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !126, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !126, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !126, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !126, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !167)
!167 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !118, file: !119, line: 96, baseType: !169, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !176)
!176 = !{!177, !179, !183, !185, !186, !191, !284}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !119, line: 32, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !175, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !175, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !175, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !175, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!122, !13, !156}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !175, file: !119, line: 56, baseType: !192, size: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !194)
!194 = !{!195, !196, !282, !283}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !193, file: !127, line: 2722, baseType: !130, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !193, file: !127, line: 2724, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 896, elements: !200)
!199 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !{!201, !246, !259, !260, !261, !262, !277}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !198, file: !199, line: 247, baseType: !202, size: 384)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !203)
!203 = !{!204, !218, !220, !221, !222, !233, !234, !235}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !199, line: 60, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !199, line: 60, size: 64, elements: !206)
!206 = !{!207, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !205, file: !199, line: 61, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !137)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !205, file: !199, line: 62, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !210, file: !211, line: 50, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !216)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !202, file: !199, line: 68, baseType: !219, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !202, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !202, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !199, line: 90, baseType: !223, size: 16, offset: 112)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !199, line: 90, size: 16, elements: !224)
!224 = !{!225, !232}
!225 = !DIDerivedType(tag: DW_TAG_member, scope: !223, file: !199, line: 91, baseType: !226, size: 16)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !223, file: !199, line: 91, size: 16, elements: !227)
!227 = !{!228, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !226, file: !199, line: 96, baseType: !229, size: 8)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !230)
!230 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !226, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !223, file: !199, line: 100, baseType: !181, size: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !202, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !202, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !202, file: !199, line: 131, baseType: !236, size: 192, offset: 192)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !237)
!237 = !{!238, !239, !245}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !236, file: !131, line: 245, baseType: !208, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !236, file: !131, line: 246, baseType: !240, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !236, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !198, file: !199, line: 250, baseType: !247, size: 288, offset: 384)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !249)
!248 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !247, file: !248, line: 26, baseType: !111, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !247, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !247, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !247, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !247, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !247, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !247, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !247, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !247, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !198, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !198, file: !199, line: 256, baseType: !130, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !198, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !198, file: !199, line: 325, baseType: !263, size: 32, offset: 800)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !265)
!265 = !{!266, !275, !276}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !264, file: !127, line: 5074, baseType: !267, size: 96)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270, !273, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !267, file: !268, line: 57, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !268, line: 57, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !267, file: !268, line: 58, baseType: !102, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !267, file: !268, line: 59, baseType: !156, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !264, file: !127, line: 5075, baseType: !130, size: 64, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !264, file: !127, line: 5076, baseType: !151, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !198, file: !199, line: 343, baseType: !278, size: 64, offset: 832)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !278, file: !248, line: 63, baseType: !111, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !278, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !193, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !193, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !175, file: !119, line: 67, baseType: !285, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_k_thread_data_consumer_thread_id", scope: !27, file: !117, line: 44, type: !291, isLocal: false, isDefinition: true, align: 32)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !127, line: 620, size: 384, elements: !292)
!292 = !{!293, !294, !302, !303, !308, !309, !310, !311, !312, !313, !315, !319}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !291, file: !127, line: 621, baseType: !197, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !291, file: !127, line: 622, baseType: !295, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !297, line: 44, baseType: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !299, line: 47, size: 8, elements: !300)
!299 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !299, line: 48, baseType: !110, size: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !291, file: !127, line: 623, baseType: !32, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !291, file: !127, line: 624, baseType: !304, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !297, line: 46, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !102, !102, !102}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !291, file: !127, line: 625, baseType: !102, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !291, file: !127, line: 626, baseType: !102, size: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !291, file: !127, line: 627, baseType: !102, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !291, file: !127, line: 628, baseType: !103, size: 32, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !291, file: !127, line: 629, baseType: !111, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !291, file: !127, line: 630, baseType: !314, size: 32, offset: 288)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !291, file: !127, line: 631, baseType: !316, size: 32, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DISubroutineType(types: !318)
!318 = !{null}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !291, file: !127, line: 632, baseType: !108, size: 32, offset: 352)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "consumer_thread_id", scope: !27, file: !117, line: 44, type: !322, isLocal: false, isDefinition: true)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !199, line: 347, baseType: !197)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_consumer_sub", scope: !27, file: !117, line: 13, type: !326, isLocal: true, isDefinition: true, align: 32)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 16)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "_k_thread_stack_consumer_thread_id", scope: !27, file: !117, line: 44, type: !331, isLocal: false, isDefinition: true, align: 64)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 8192, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 1024)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "_k_thread_obj_consumer_thread_id", scope: !27, file: !117, line: 44, type: !198, isLocal: false, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "_zbus_mutex_pkt_chan", scope: !338, file: !344, line: 15, type: !355, isLocal: true, isDefinition: true, align: 32)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !340, globals: !341, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel")
!340 = !{!102, !103}
!341 = !{!336, !342, !486, !488, !490, !492, !494, !496, !498, !500, !507, !510, !517, !522, !527, !529, !531}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "pkt_chan", scope: !338, file: !344, line: 15, type: !345, isLocal: false, isDefinition: true, align: 32)
!344 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !457}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !346, file: !119, line: 32, baseType: !178, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !346, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !346, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !346, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !346, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !346, file: !119, line: 56, baseType: !354, size: 32, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !356)
!356 = !{!357, !376, !455, !456}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !355, file: !127, line: 2722, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !359, file: !131, line: 232, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !364)
!364 = !{!365, !371}
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !136, line: 38, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !136, line: 38, size: 32, elements: !367)
!367 = !{!368, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !366, file: !136, line: 39, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !136, line: 40, baseType: !369, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !136, line: 42, baseType: !372, size: 32, offset: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !136, line: 42, size: 32, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !372, file: !136, line: 43, baseType: !369, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !372, file: !136, line: 44, baseType: !369, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !355, file: !127, line: 2724, baseType: !377, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 896, elements: !379)
!379 = !{!380, !420, !432, !433, !434, !435, !450}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !378, file: !199, line: 247, baseType: !381, size: 384)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !382)
!382 = !{!383, !394, !396, !397, !398, !407, !408, !409}
!383 = !DIDerivedType(tag: DW_TAG_member, scope: !381, file: !199, line: 60, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !381, file: !199, line: 60, size: 64, elements: !385)
!385 = !{!386, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !384, file: !199, line: 61, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !363)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !384, file: !199, line: 62, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !390)
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !389, file: !211, line: 50, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 64, elements: !216)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !381, file: !199, line: 68, baseType: !395, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !381, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !381, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!398 = !DIDerivedType(tag: DW_TAG_member, scope: !381, file: !199, line: 90, baseType: !399, size: 16, offset: 112)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !381, file: !199, line: 90, size: 16, elements: !400)
!400 = !{!401, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, scope: !399, file: !199, line: 91, baseType: !402, size: 16)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !199, line: 91, size: 16, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !402, file: !199, line: 96, baseType: !229, size: 8)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !402, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !399, file: !199, line: 100, baseType: !181, size: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !381, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !381, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !381, file: !199, line: 131, baseType: !410, size: 192, offset: 192)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !411)
!411 = !{!412, !413, !419}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !410, file: !131, line: 245, baseType: !387, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !410, file: !131, line: 246, baseType: !414, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !410, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !378, file: !199, line: 250, baseType: !421, size: 288, offset: 384)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !421, file: !248, line: 26, baseType: !111, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !421, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !421, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !421, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !421, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !421, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !421, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !421, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !421, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !378, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !378, file: !199, line: 256, baseType: !358, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !378, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !378, file: !199, line: 325, baseType: !436, size: 32, offset: 800)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !438)
!438 = !{!439, !445, !446}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !437, file: !127, line: 5074, baseType: !440, size: 96)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !440, file: !268, line: 57, baseType: !271, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !440, file: !268, line: 58, baseType: !102, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !440, file: !268, line: 59, baseType: !156, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !437, file: !127, line: 5075, baseType: !358, size: 64, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !437, file: !127, line: 5076, baseType: !447, size: 32, offset: 160)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !448)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !447, file: !152, line: 52, baseType: !22, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !378, file: !199, line: 343, baseType: !451, size: 64, offset: 832)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !451, file: !248, line: 63, baseType: !111, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !451, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !355, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !355, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !346, file: !119, line: 67, baseType: !458, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !463)
!463 = !{!464, !465, !480}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !462, file: !119, line: 91, baseType: !122, size: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !462, file: !119, line: 93, baseType: !466, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !468, file: !127, line: 4206, baseType: !358, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !468, file: !127, line: 4208, baseType: !447, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !468, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !468, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !468, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !468, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !468, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !468, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !468, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !468, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !462, file: !119, line: 96, baseType: !481, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !338, file: !344, line: 24, type: !355, isLocal: true, isDefinition: true, align: 32)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "version_chan", scope: !338, file: !344, line: 24, type: !345, isLocal: false, isDefinition: true, align: 32)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "_zbus_mutex_data_ready_chan", scope: !338, file: !344, line: 33, type: !355, isLocal: true, isDefinition: true, align: 32)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "data_ready_chan", scope: !338, file: !344, line: 33, type: !345, isLocal: false, isDefinition: true, align: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "_zbus_mutex_ack", scope: !338, file: !344, line: 42, type: !355, isLocal: true, isDefinition: true, align: 32)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "ack", scope: !338, file: !344, line: 42, type: !345, isLocal: false, isDefinition: true, align: 32)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "filter_lis", scope: !338, file: !344, line: 73, type: !462, isLocal: false, isDefinition: true, align: 32)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "_zbus_message_pkt_chan", scope: !338, file: !344, line: 15, type: !502, isLocal: true, isDefinition: true)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !503, line: 16, size: 64, elements: !504)
!503 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !502, file: !503, line: 17, baseType: !102, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !502, file: !503, line: 18, baseType: !156, size: 32, offset: 32)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "_zbus_observers_pkt_chan", scope: !338, file: !344, line: 15, type: !509, isLocal: true, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 64, elements: !216)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !338, file: !344, line: 24, type: !512, isLocal: true, isDefinition: true)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !503, line: 10, size: 32, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !512, file: !503, line: 11, baseType: !166, size: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !512, file: !503, line: 12, baseType: !166, size: 8, offset: 8)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !512, file: !503, line: 13, baseType: !181, size: 16, offset: 16)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !338, file: !344, line: 24, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 32, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 1)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "_zbus_message_data_ready_chan", scope: !338, file: !344, line: 33, type: !524, isLocal: true, isDefinition: true)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ack_msg", file: !503, line: 21, size: 8, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !524, file: !503, line: 22, baseType: !166, size: 8)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "_zbus_observers_data_ready_chan", scope: !338, file: !344, line: 33, type: !509, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "_zbus_message_ack", scope: !338, file: !344, line: 42, type: !524, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "_zbus_observers_ack", scope: !338, file: !344, line: 42, type: !509, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_producer_sub", scope: !535, file: !542, line: 13, type: !549, isLocal: false, isDefinition: true, align: 32)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !537, globals: !539, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel")
!537 = !{!102, !103, !538, !104, !111, !112}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!539 = !{!533, !540, !684, !705, !709, !711, !714}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "producer_sub", scope: !535, file: !542, line: 13, type: !543, isLocal: false, isDefinition: true, align: 32)
!542 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !544)
!544 = !{!545, !546, !582}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !543, file: !119, line: 91, baseType: !122, size: 8)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !543, file: !119, line: 93, baseType: !547, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !550)
!550 = !{!551, !570, !574, !575, !576, !577, !578, !579, !580, !581}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !549, file: !127, line: 4206, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !554)
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !553, file: !131, line: 232, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !558)
!558 = !{!559, !565}
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !136, line: 38, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !557, file: !136, line: 38, size: 32, elements: !561)
!561 = !{!562, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !560, file: !136, line: 39, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !136, line: 40, baseType: !563, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !136, line: 42, baseType: !566, size: 32, offset: 32)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !557, file: !136, line: 42, size: 32, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !566, file: !136, line: 43, baseType: !563, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !566, file: !136, line: 44, baseType: !563, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !549, file: !127, line: 4208, baseType: !571, size: 32, offset: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !572)
!572 = !{!573}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !571, file: !152, line: 52, baseType: !22, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !549, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !549, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !549, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !549, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !549, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !549, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !549, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !549, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !543, file: !119, line: 96, baseType: !583, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !679}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !589, file: !119, line: 32, baseType: !178, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !589, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !589, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !589, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !589, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !589, file: !119, line: 56, baseType: !597, size: 32, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !599)
!599 = !{!600, !601, !677, !678}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !598, file: !127, line: 2722, baseType: !552, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !598, file: !127, line: 2724, baseType: !602, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 896, elements: !604)
!604 = !{!605, !645, !657, !658, !659, !660, !672}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !603, file: !199, line: 247, baseType: !606, size: 384)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !607)
!607 = !{!608, !619, !621, !622, !623, !632, !633, !634}
!608 = !DIDerivedType(tag: DW_TAG_member, scope: !606, file: !199, line: 60, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !199, line: 60, size: 64, elements: !610)
!610 = !{!611, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !609, file: !199, line: 61, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !557)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !609, file: !199, line: 62, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !614, file: !211, line: 50, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 64, elements: !216)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !606, file: !199, line: 68, baseType: !620, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !606, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !606, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!623 = !DIDerivedType(tag: DW_TAG_member, scope: !606, file: !199, line: 90, baseType: !624, size: 16, offset: 112)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !199, line: 90, size: 16, elements: !625)
!625 = !{!626, !631}
!626 = !DIDerivedType(tag: DW_TAG_member, scope: !624, file: !199, line: 91, baseType: !627, size: 16)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !199, line: 91, size: 16, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !627, file: !199, line: 96, baseType: !229, size: 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !627, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !624, file: !199, line: 100, baseType: !181, size: 16)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !606, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !606, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !606, file: !199, line: 131, baseType: !635, size: 192, offset: 192)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !636)
!636 = !{!637, !638, !644}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !635, file: !131, line: 245, baseType: !612, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !635, file: !131, line: 246, baseType: !639, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !635, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !603, file: !199, line: 250, baseType: !646, size: 288, offset: 384)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !646, file: !248, line: 26, baseType: !111, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !646, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !646, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !646, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !646, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !646, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !646, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !646, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !646, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !603, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !603, file: !199, line: 256, baseType: !552, size: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !603, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !603, file: !199, line: 325, baseType: !661, size: 32, offset: 800)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !663)
!663 = !{!664, !670, !671}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !662, file: !127, line: 5074, baseType: !665, size: 96)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !665, file: !268, line: 57, baseType: !271, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !665, file: !268, line: 58, baseType: !102, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !665, file: !268, line: 59, baseType: !156, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !662, file: !127, line: 5075, baseType: !552, size: 64, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !662, file: !127, line: 5076, baseType: !571, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !603, file: !199, line: 343, baseType: !673, size: 64, offset: 832)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !673, file: !248, line: 63, baseType: !111, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !673, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !598, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !598, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !589, file: !119, line: 67, baseType: !680, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !535, file: !542, line: 40, type: !686, isLocal: false, isDefinition: true, align: 32)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !127, line: 620, size: 384, elements: !687)
!687 = !{!688, !689, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !686, file: !127, line: 621, baseType: !602, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !686, file: !127, line: 622, baseType: !690, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !297, line: 44, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !299, line: 47, size: 8, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !692, file: !299, line: 48, baseType: !110, size: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !686, file: !127, line: 623, baseType: !32, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !686, file: !127, line: 624, baseType: !304, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !686, file: !127, line: 625, baseType: !102, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !686, file: !127, line: 626, baseType: !102, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !686, file: !127, line: 627, baseType: !102, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !686, file: !127, line: 628, baseType: !103, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !686, file: !127, line: 629, baseType: !111, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !686, file: !127, line: 630, baseType: !314, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !686, file: !127, line: 631, baseType: !316, size: 32, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !686, file: !127, line: 632, baseType: !108, size: 32, offset: 352)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !535, file: !542, line: 40, type: !707, isLocal: false, isDefinition: true)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !199, line: 347, baseType: !602)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_producer_sub", scope: !535, file: !542, line: 13, type: !326, isLocal: true, isDefinition: true, align: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !535, file: !542, line: 40, type: !713, isLocal: false, isDefinition: true, align: 64)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 8192, elements: !332)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !535, file: !542, line: 40, type: !603, isLocal: false, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !718, file: !732, line: 18, type: !733, isLocal: false, isDefinition: true)
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !720, globals: !731, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel")
!720 = !{!22, !102, !24, !721, !723, !725, !156, !103, !726, !727, !729, !730, !160, !538, !181, !108}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!731 = !{!716}
!732 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !735, line: 16, size: 64, elements: !736)
!735 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !735, line: 17, baseType: !108, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !734, file: !735, line: 18, baseType: !166, size: 8, offset: 32)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "_char_out", scope: !741, file: !744, line: 54, type: !745, isLocal: false, isDefinition: true)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !340, globals: !743, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel")
!743 = !{!739}
!744 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DISubroutineType(types: !747)
!747 = !{!103, !103}
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !750, file: !1480, line: 202, type: !1481, isLocal: true, isDefinition: true, align: 32)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !752, globals: !1479, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/zbus/dyn_channel")
!752 = !{!102, !103, !753, !875, !1214, !1215, !1282}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !755, line: 335, baseType: !756)
!755 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !755, line: 320, size: 288, elements: !757)
!757 = !{!758, !769, !775, !789, !800, !811, !815, !826, !827, !838, !839, !854, !855, !865}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !756, file: !755, line: 321, baseType: !759, size: 16)
!759 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !755, line: 50, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 43, size: 16, elements: !762)
!762 = !{!763, !768}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !761, file: !755, line: 48, baseType: !764, size: 16)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !761, file: !755, line: 44, size: 16, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !764, file: !755, line: 45, baseType: !181, size: 7, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !764, file: !755, line: 47, baseType: !181, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !761, file: !755, line: 49, baseType: !181, size: 16)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !756, file: !755, line: 322, baseType: !770, size: 16, offset: 16)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 16, elements: !216)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !772, line: 52, baseType: !773)
!772 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !166)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !756, file: !755, line: 323, baseType: !776, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !755, line: 107, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 94, size: 32, elements: !779)
!779 = !{!780, !788}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !778, file: !755, line: 105, baseType: !781, size: 32)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !778, file: !755, line: 95, size: 32, elements: !782)
!782 = !{!783, !784, !785, !786, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !781, file: !755, line: 97, baseType: !111, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !781, file: !755, line: 99, baseType: !111, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !781, file: !755, line: 100, baseType: !111, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !781, file: !755, line: 102, baseType: !111, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !781, file: !755, line: 103, baseType: !111, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !778, file: !755, line: 106, baseType: !111, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !756, file: !755, line: 324, baseType: !790, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !755, line: 155, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 148, size: 32, elements: !793)
!793 = !{!794, !799}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !792, file: !755, line: 153, baseType: !795, size: 32)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !792, file: !755, line: 149, size: 32, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !795, file: !755, line: 150, baseType: !111, size: 16, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !795, file: !755, line: 151, baseType: !111, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !792, file: !755, line: 154, baseType: !111, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !756, file: !755, line: 325, baseType: !801, size: 8, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !755, line: 194, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 187, size: 8, elements: !804)
!804 = !{!805, !810}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !803, file: !755, line: 192, baseType: !806, size: 8)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !803, file: !755, line: 188, size: 8, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !806, file: !755, line: 189, baseType: !166, size: 1, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !806, file: !755, line: 190, baseType: !166, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !803, file: !755, line: 193, baseType: !166, size: 8)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !756, file: !755, line: 326, baseType: !812, size: 24, offset: 104)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 24, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 3)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !756, file: !755, line: 327, baseType: !816, size: 8, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !755, line: 215, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 208, size: 8, elements: !819)
!819 = !{!820, !825}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !818, file: !755, line: 213, baseType: !821, size: 8)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !755, line: 209, size: 8, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !821, file: !755, line: 210, baseType: !166, size: 1, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !821, file: !755, line: 211, baseType: !166, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !818, file: !755, line: 214, baseType: !166, size: 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !756, file: !755, line: 328, baseType: !812, size: 24, offset: 136)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !756, file: !755, line: 329, baseType: !828, size: 8, offset: 160)
!828 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !755, line: 236, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 229, size: 8, elements: !831)
!831 = !{!832, !837}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !830, file: !755, line: 234, baseType: !833, size: 8)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !830, file: !755, line: 230, size: 8, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !833, file: !755, line: 231, baseType: !773, size: 1, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !833, file: !755, line: 232, baseType: !773, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !830, file: !755, line: 235, baseType: !166, size: 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !756, file: !755, line: 330, baseType: !812, size: 24, offset: 168)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !756, file: !755, line: 331, baseType: !840, size: 16, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !755, line: 262, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 250, size: 16, elements: !843)
!843 = !{!844, !853}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !842, file: !755, line: 260, baseType: !845, size: 16)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !842, file: !755, line: 251, size: 16, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !845, file: !755, line: 252, baseType: !181, size: 1, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !845, file: !755, line: 253, baseType: !181, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !845, file: !755, line: 254, baseType: !181, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !845, file: !755, line: 255, baseType: !181, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !845, file: !755, line: 256, baseType: !181, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !845, file: !755, line: 258, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !842, file: !755, line: 261, baseType: !181, size: 16)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !756, file: !755, line: 332, baseType: !770, size: 16, offset: 208)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !756, file: !755, line: 333, baseType: !856, size: 32, offset: 224)
!856 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !755, line: 290, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 284, size: 32, elements: !859)
!859 = !{!860, !864}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !858, file: !755, line: 288, baseType: !861, size: 32)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !858, file: !755, line: 285, size: 32, elements: !862)
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !861, file: !755, line: 286, baseType: !111, size: 22, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !858, file: !755, line: 289, baseType: !111, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !756, file: !755, line: 334, baseType: !866, size: 16, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !755, line: 308, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !755, line: 303, size: 16, elements: !869)
!869 = !{!870, !874}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !868, file: !755, line: 306, baseType: !871, size: 16)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !868, file: !755, line: 304, size: 16, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !871, file: !755, line: 305, baseType: !181, size: 16, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !868, file: !755, line: 307, baseType: !181, size: 16)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !877, line: 928, baseType: !878)
!877 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !877, line: 899, size: 672, elements: !879)
!879 = !{!880, !904, !928, !954, !979, !995, !996, !1014, !1015, !1032, !1043, !1044, !1059, !1079, !1080, !1092, !1104, !1114, !1115, !1132, !1136, !1147, !1148, !1160, !1172, !1173, !1184, !1200}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !878, file: !877, line: 900, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !877, line: 64, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !877, line: 43, size: 32, elements: !884)
!884 = !{!885, !903}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !883, file: !877, line: 62, baseType: !886, size: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !877, line: 44, size: 32, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !886, file: !877, line: 45, baseType: !111, size: 1, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !886, file: !877, line: 46, baseType: !111, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !886, file: !877, line: 47, baseType: !111, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !886, file: !877, line: 48, baseType: !111, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !886, file: !877, line: 49, baseType: !111, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !886, file: !877, line: 50, baseType: !111, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !886, file: !877, line: 51, baseType: !111, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !886, file: !877, line: 52, baseType: !111, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !886, file: !877, line: 53, baseType: !111, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !886, file: !877, line: 54, baseType: !111, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !886, file: !877, line: 55, baseType: !111, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !886, file: !877, line: 56, baseType: !111, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !886, file: !877, line: 58, baseType: !111, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !886, file: !877, line: 59, baseType: !111, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !886, file: !877, line: 60, baseType: !111, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !883, file: !877, line: 63, baseType: !111, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !878, file: !877, line: 901, baseType: !905, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !877, line: 125, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !877, line: 104, size: 32, elements: !908)
!908 = !{!909, !927}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !907, file: !877, line: 123, baseType: !910, size: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !907, file: !877, line: 105, size: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !910, file: !877, line: 106, baseType: !111, size: 1, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !910, file: !877, line: 107, baseType: !111, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !910, file: !877, line: 108, baseType: !111, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !910, file: !877, line: 109, baseType: !111, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !910, file: !877, line: 110, baseType: !111, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !910, file: !877, line: 111, baseType: !111, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !910, file: !877, line: 112, baseType: !111, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !910, file: !877, line: 113, baseType: !111, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !910, file: !877, line: 114, baseType: !111, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !910, file: !877, line: 115, baseType: !111, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !910, file: !877, line: 116, baseType: !111, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !910, file: !877, line: 117, baseType: !111, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !910, file: !877, line: 119, baseType: !111, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !910, file: !877, line: 120, baseType: !111, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !910, file: !877, line: 121, baseType: !111, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !907, file: !877, line: 124, baseType: !111, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !878, file: !877, line: 902, baseType: !929, size: 32, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !877, line: 186, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !877, line: 165, size: 32, elements: !932)
!932 = !{!933, !953}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !931, file: !877, line: 184, baseType: !934, size: 32)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !931, file: !877, line: 166, size: 32, elements: !935)
!935 = !{!936, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !934, file: !877, line: 167, baseType: !937, size: 1, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !111)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !934, file: !877, line: 168, baseType: !937, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !934, file: !877, line: 169, baseType: !937, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !934, file: !877, line: 170, baseType: !937, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !934, file: !877, line: 171, baseType: !937, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !934, file: !877, line: 172, baseType: !937, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !934, file: !877, line: 173, baseType: !937, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !934, file: !877, line: 174, baseType: !937, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !934, file: !877, line: 175, baseType: !937, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !934, file: !877, line: 176, baseType: !937, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !934, file: !877, line: 177, baseType: !937, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !934, file: !877, line: 178, baseType: !937, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
