; ModuleID = 'build/96b_carbon_nrf51/tfm_regression_test/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !154, line: 27, type: !183, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !125, globals: !151, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!113 = !{!114, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !{!102, !126, !103, !24, !130, !146, !148, !149}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !129)
!129 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !132, line: 54, size: 96, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !141, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !131, file: !132, line: 55, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 30, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !131, file: !132, line: 60, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !114}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !131, file: !132, line: 65, baseType: !142, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !150)
!150 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!151 = !{!109, !152, !158, !160, !173, !175}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !154, line: 44, type: !155, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !154, line: 49, type: !155, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !154, line: 36, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !171)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !164)
!164 = !{!165, !166, !169, !170}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !115, line: 115, baseType: !114, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !163, file: !115, line: 141, baseType: !167, size: 8, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !163, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !163, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!171 = !{!172}
!172 = !DISubrange(count: 1)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !154, line: 40, type: !162, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !154, line: 28, type: !177, isLocal: true, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !179)
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !178, file: !136, line: 36, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !178, file: !136, line: 37, baseType: !181, size: 32, offset: 32)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 32, elements: !171)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !185, line: 22, baseType: !186)
!185 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!186 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!187 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!188 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !191, file: !222, line: 50, type: !209, isLocal: true, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !193, globals: !219, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!193 = !{!194, !126, !196, !103, !102, !148, !149, !198, !146, !209, !210}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !195)
!195 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 214, baseType: !32)
!197 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !200, line: 45, size: 64, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !208}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !200, line: 46, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !136, line: 30, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !200, line: 48, baseType: !148, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !200, line: 38, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !211, file: !200, line: 39, baseType: !203, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !211, file: !200, line: 41, baseType: !215, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !200, line: 35, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !209}
!219 = !{!220, !224, !232, !189, !234, !244}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "latency_lock", scope: !191, file: !222, line: 44, type: !223, isLocal: true, isDefinition: true)
!222 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !191, file: !222, line: 46, type: !226, isLocal: true, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !228)
!228 = !{!229, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !227, file: !136, line: 36, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !227, file: !136, line: 37, baseType: !230, size: 32, offset: 32)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "latency_subs", scope: !191, file: !222, line: 52, type: !226, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !191, file: !222, line: 39, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, elements: !242)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 35, size: 96, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !237, file: !222, line: 36, baseType: !114, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !237, file: !222, line: 37, baseType: !167, size: 8, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !237, file: !222, line: 38, baseType: !184, size: 32, offset: 64)
!242 = !{!243}
!243 = !DISubrange(count: 0)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !191, file: !222, line: 48, type: !209, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !248, file: !255, line: 47, type: !269, isLocal: true, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !250, retainedTypes: !251, globals: !252, splitDebugInlining: false, nameTableKind: None)
!249 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!250 = !{!114}
!251 = !{!196, !103}
!252 = !{!253, !246, !265}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "cpus_states", scope: !248, file: !255, line: 50, type: !256, isLocal: true, isDefinition: true)
!255 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 32, elements: !171)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !259, file: !115, line: 115, baseType: !114, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !259, file: !115, line: 141, baseType: !167, size: 8, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !259, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !259, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !248, file: !255, line: 55, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 8, elements: !171)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, elements: !242)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !272, file: !279, line: 21, type: !106, isLocal: true, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !274, globals: !278, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!274 = !{!275, !103, !102}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !277, line: 22, baseType: !103)
!277 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !{!270}
!279 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !282, file: !387, line: 71, type: !388, isLocal: true, isDefinition: true, align: 32)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !284, globals: !380, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!284 = !{!285, !167, !102, !103, !353, !354, !369, !148}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !287, line: 247, baseType: !288)
!287 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 216, size: 20576, elements: !289)
!289 = !{!290, !296, !297, !298, !302, !303, !307, !308, !309, !313, !314, !318, !319, !323, !324, !328, !329, !333, !334, !335, !336, !340, !341, !342, !343, !347, !348, !352}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !288, file: !287, line: 217, baseType: !291, size: 960)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 960, elements: !294)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!294 = !{!295}
!295 = !DISubrange(count: 30)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !288, file: !287, line: 218, baseType: !293, size: 32, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !288, file: !287, line: 219, baseType: !293, size: 32, offset: 992)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !288, file: !287, line: 220, baseType: !299, size: 1088, offset: 1024)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 1088, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 34)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !288, file: !287, line: 221, baseType: !293, size: 32, offset: 2112)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !288, file: !287, line: 222, baseType: !304, size: 4032, offset: 2144)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 4032, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 126)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !288, file: !287, line: 223, baseType: !293, size: 32, offset: 6176)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !288, file: !287, line: 224, baseType: !293, size: 32, offset: 6208)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !288, file: !287, line: 225, baseType: !310, size: 1952, offset: 6240)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 1952, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 61)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !288, file: !287, line: 226, baseType: !293, size: 32, offset: 8192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !288, file: !287, line: 227, baseType: !315, size: 288, offset: 8224)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 288, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 9)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !288, file: !287, line: 228, baseType: !292, size: 32, offset: 8512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !288, file: !287, line: 229, baseType: !320, size: 1696, offset: 8544)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 1696, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 53)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !288, file: !287, line: 230, baseType: !293, size: 32, offset: 10240)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !288, file: !287, line: 231, baseType: !325, size: 96, offset: 10272)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 96, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 3)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !288, file: !287, line: 232, baseType: !293, size: 32, offset: 10368)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !288, file: !287, line: 233, baseType: !330, size: 64, offset: 10400)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 64, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 2)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !288, file: !287, line: 234, baseType: !293, size: 32, offset: 10464)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !288, file: !287, line: 236, baseType: !292, size: 32, offset: 10496)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !288, file: !287, line: 237, baseType: !293, size: 32, offset: 10528)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !288, file: !287, line: 238, baseType: !337, size: 224, offset: 10560)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 224, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 7)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !288, file: !287, line: 239, baseType: !293, size: 32, offset: 10784)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !288, file: !287, line: 241, baseType: !325, size: 96, offset: 10816)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !288, file: !287, line: 242, baseType: !293, size: 32, offset: 10912)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !288, file: !287, line: 243, baseType: !344, size: 256, offset: 10944)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !288, file: !287, line: 244, baseType: !293, size: 32, offset: 11200)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !288, file: !287, line: 245, baseType: !349, size: 9312, offset: 11232)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 9312, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 291)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !288, file: !287, line: 246, baseType: !293, size: 32, offset: 20544)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !356, line: 352, baseType: !357)
!356 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 341, size: 320, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !368}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !357, file: !356, line: 343, baseType: !292, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !357, file: !356, line: 344, baseType: !293, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !357, file: !356, line: 345, baseType: !148, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !357, file: !356, line: 346, baseType: !293, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !357, file: !356, line: 347, baseType: !293, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !357, file: !356, line: 348, baseType: !293, size: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !357, file: !356, line: 349, baseType: !148, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !357, file: !356, line: 350, baseType: !367, size: 64, offset: 224)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !331)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !357, file: !356, line: 351, baseType: !293, size: 32, offset: 288)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !371, file: !370, line: 167, baseType: !379)
!370 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !370, file: !370, line: 134, type: !372, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !282, retainedNodes: !374)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !148}
!374 = !{!375, !376, !378}
!375 = !DILocalVariable(name: "time_us", arg: 1, scope: !371, file: !370, line: 134, type: !148)
!376 = !DILocalVariable(name: "delay_cycles", scope: !371, file: !370, line: 168, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!378 = !DILocalVariable(name: "cycles", scope: !371, file: !370, line: 171, type: !148)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!380 = !{!280, !381}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !371, file: !370, line: 161, type: !383, isLocal: true, isDefinition: true, align: 128)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 48, elements: !326)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !386)
!386 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!387 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !390, line: 51, size: 64, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !399}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !389, file: !390, line: 60, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DISubroutineType(types: !395)
!395 = !{!103, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !390, line: 48, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !389, file: !390, line: 65, baseType: !396, size: 32, offset: 32)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !402, file: !601, line: 733, type: !707, isLocal: false, isDefinition: true, align: 32)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !404, retainedTypes: !519, globals: !597, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!404 = !{!405, !411, !30, !416, !421, !426, !432, !438, !447, !451, !484, !491, !510}
!405 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !406, line: 23, baseType: !32, size: 32, elements: !407)
!406 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = !{!408, !409, !410}
!408 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!409 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!410 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !406, line: 48, baseType: !32, size: 32, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!414 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!415 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !417, line: 167, baseType: !32, size: 32, elements: !418)
!417 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!418 = !{!419, !420}
!419 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!420 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !417, line: 107, baseType: !32, size: 32, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!424 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!425 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !417, line: 208, baseType: !32, size: 32, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!429 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!430 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!431 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !417, line: 261, baseType: !32, size: 32, elements: !433)
!433 = !{!434, !435, !436, !437}
!434 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!435 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!436 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!437 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!438 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !417, line: 237, baseType: !32, size: 32, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446}
!440 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!441 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!442 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!443 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!444 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!445 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!446 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !417, line: 152, baseType: !32, size: 32, elements: !448)
!448 = !{!449, !450}
!449 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!450 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !287, line: 71, baseType: !103, size: 32, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!453 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!454 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!455 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!456 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!457 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!458 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!459 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!460 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!461 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!462 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!463 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!464 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!465 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!466 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!467 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!468 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!469 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!470 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!471 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!472 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!473 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!474 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!475 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!476 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!477 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!478 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!479 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!480 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!481 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!482 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!483 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !485, line: 44, baseType: !32, size: 32, elements: !486)
!485 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!486 = !{!487, !488, !489, !490}
!487 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!488 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!489 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!490 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !492, line: 54, baseType: !32, size: 32, elements: !493)
!492 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!494 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!495 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!496 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!497 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!498 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!499 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!500 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!501 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!502 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!503 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!504 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!505 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!506 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!507 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!508 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!509 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !511, line: 53, baseType: !32, size: 32, elements: !512)
!511 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = !{!513, !514, !515, !516, !517, !518}
!513 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!514 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!515 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!516 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!517 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!518 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!519 = !{!405, !102, !103, !520, !568, !569, !570, !571, !126, !148, !149, !572, !353, !573, !209, !574, !596, !196}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !287, line: 291, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 260, size: 10912, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !535, !536, !537, !538, !539, !540, !544, !545, !546, !550, !551, !552, !553, !554, !555, !556, !560, !561, !562, !563, !567}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !522, file: !287, line: 261, baseType: !293, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !522, file: !287, line: 262, baseType: !293, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !522, file: !287, line: 263, baseType: !293, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !522, file: !287, line: 264, baseType: !293, size: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !522, file: !287, line: 265, baseType: !293, size: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !522, file: !287, line: 266, baseType: !293, size: 32, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !522, file: !287, line: 267, baseType: !293, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !522, file: !287, line: 268, baseType: !532, size: 1824, offset: 224)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 1824, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 57)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !522, file: !287, line: 269, baseType: !293, size: 32, offset: 2048)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !522, file: !287, line: 270, baseType: !293, size: 32, offset: 2080)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !522, file: !287, line: 271, baseType: !292, size: 32, offset: 2112)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !522, file: !287, line: 272, baseType: !293, size: 32, offset: 2144)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !522, file: !287, line: 273, baseType: !293, size: 32, offset: 2176)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !522, file: !287, line: 274, baseType: !541, size: 3968, offset: 2208)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 3968, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 124)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !522, file: !287, line: 275, baseType: !293, size: 32, offset: 6176)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !522, file: !287, line: 276, baseType: !293, size: 32, offset: 6208)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !522, file: !287, line: 277, baseType: !547, size: 2016, offset: 6240)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 2016, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 63)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !522, file: !287, line: 278, baseType: !292, size: 32, offset: 8256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !522, file: !287, line: 279, baseType: !292, size: 32, offset: 8288)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !522, file: !287, line: 280, baseType: !292, size: 32, offset: 8320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !522, file: !287, line: 281, baseType: !292, size: 32, offset: 8352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !522, file: !287, line: 282, baseType: !292, size: 32, offset: 8384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !522, file: !287, line: 283, baseType: !292, size: 32, offset: 8416)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !522, file: !287, line: 285, baseType: !557, size: 1984, offset: 8448)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 1984, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 62)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !522, file: !287, line: 286, baseType: !293, size: 32, offset: 10432)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !522, file: !287, line: 287, baseType: !337, size: 224, offset: 10464)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !522, file: !287, line: 288, baseType: !293, size: 32, offset: 10688)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !522, file: !287, line: 289, baseType: !564, size: 160, offset: 10720)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 160, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 5)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !522, file: !287, line: 290, baseType: !293, size: 32, offset: 10880)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !417, line: 146, baseType: !421)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !417, line: 164, baseType: !447)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!572 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !356, line: 326, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 314, size: 6400, elements: !577)
!577 = !{!578, !580, !584, !585, !586, !587, !588, !589, !590, !594}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !576, file: !356, line: 316, baseType: !579, size: 32)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 32, elements: !171)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !576, file: !356, line: 317, baseType: !581, size: 992, offset: 32)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 992, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 31)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !576, file: !356, line: 318, baseType: !579, size: 32, offset: 1024)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !576, file: !356, line: 319, baseType: !581, size: 992, offset: 1056)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !576, file: !356, line: 320, baseType: !579, size: 32, offset: 2048)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !576, file: !356, line: 321, baseType: !581, size: 992, offset: 2080)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !576, file: !356, line: 322, baseType: !579, size: 32, offset: 3072)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !576, file: !356, line: 323, baseType: !581, size: 992, offset: 3104)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !576, file: !356, line: 324, baseType: !591, size: 2048, offset: 4096)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 2048, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !576, file: !356, line: 325, baseType: !595, size: 256, offset: 6144)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 256, elements: !345)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !485, line: 56, baseType: !102)
!597 = !{!598, !648, !691, !400, !697, !725, !727, !744, !746, !756, !759, !774, !812, !826}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "on", scope: !600, file: !601, line: 549, type: !184, isLocal: true, isDefinition: true)
!600 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !601, file: !601, line: 547, type: !602, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !402, retainedNodes: !604)
!601 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!602 = !DISubroutineType(types: !603)
!603 = !{null, !411}
!604 = !{!605, !606, !609}
!605 = !DILocalVariable(name: "start_mode", arg: 1, scope: !600, file: !601, line: 547, type: !411)
!606 = !DILocalVariable(name: "err", scope: !607, file: !601, line: 553, type: !103)
!607 = distinct !DILexicalBlock(scope: !608, file: !601, line: 552, column: 31)
!608 = distinct !DILexicalBlock(scope: !600, file: !601, line: 552, column: 6)
!609 = !DILocalVariable(name: "mgr", scope: !607, file: !601, line: 554, type: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !612, line: 154, size: 224, elements: !613)
!612 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!613 = !{!614, !626, !627, !643, !645, !646, !647}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !611, file: !612, line: 158, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !617)
!617 = !{!618, !625}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !616, file: !136, line: 36, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !622)
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !621, file: !136, line: 30, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !616, file: !136, line: 37, baseType: !619, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !611, file: !612, line: 163, baseType: !615, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !611, file: !612, line: 166, baseType: !628, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !612, line: 133, size: 96, elements: !631)
!631 = !{!632, !641, !642}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !612, line: 135, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !612, line: 129, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !610, !637}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !612, line: 101, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !610, !103}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !630, file: !612, line: 138, baseType: !633, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !630, file: !612, line: 143, baseType: !633, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !611, file: !612, line: 169, baseType: !644, offset: 160)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !611, file: !612, line: 172, baseType: !103, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !611, file: !612, line: 175, baseType: !385, size: 16, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !611, file: !612, line: 178, baseType: !385, size: 16, offset: 208)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "cli", scope: !600, file: !601, line: 550, type: !650, isLocal: true, isDefinition: true)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !612, line: 273, size: 128, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !650, file: !612, line: 280, baseType: !620, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !650, file: !612, line: 283, baseType: !654, size: 96, offset: 32)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !655, line: 138, size: 96, elements: !656)
!655 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = !{!657, !688, !689}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !654, file: !655, line: 149, baseType: !658, size: 32)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !655, line: 139, size: 32, elements: !659)
!659 = !{!660, !683}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !658, file: !655, line: 145, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !663, line: 5397, size: 128, elements: !664)
!663 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!664 = !{!665, !681, !682}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !662, file: !663, line: 5399, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !667, line: 48, baseType: !668)
!667 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !667, line: 37, size: 64, elements: !669)
!669 = !{!670, !676}
!670 = !DIDerivedType(tag: DW_TAG_member, scope: !668, file: !667, line: 38, baseType: !671, size: 32)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !668, file: !667, line: 38, size: 32, elements: !672)
!672 = !{!673, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !671, file: !667, line: 39, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !671, file: !667, line: 40, baseType: !674, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, scope: !668, file: !667, line: 42, baseType: !677, size: 32, offset: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !668, file: !667, line: 42, size: 32, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !677, file: !667, line: 43, baseType: !674, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !677, file: !667, line: 44, baseType: !674, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !662, file: !663, line: 5405, baseType: !32, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !662, file: !663, line: 5408, baseType: !103, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !658, file: !655, line: 148, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !655, line: 98, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DISubroutineType(types: !687)
!687 = !{null, null}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !654, file: !655, line: 165, baseType: !293, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !654, file: !655, line: 174, baseType: !690, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !402, file: !601, line: 733, type: !693, isLocal: false, isDefinition: true, align: 16)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 80, elements: !565)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !696, line: 43, baseType: !194)
!696 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !402, file: !601, line: 733, type: !699, isLocal: true, isDefinition: true, align: 32)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !390, line: 51, size: 64, elements: !701)
!701 = !{!702, !724}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !700, file: !390, line: 60, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = !DISubroutineType(types: !705)
!705 = !{!103, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !696, line: 378, size: 192, elements: !709)
!709 = !{!710, !713, !714, !715, !721, !722}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !708, file: !696, line: 380, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !708, file: !696, line: 382, baseType: !13, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !708, file: !696, line: 384, baseType: !13, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !708, file: !696, line: 386, baseType: !716, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !696, line: 351, size: 16, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !717, file: !696, line: 359, baseType: !167, size: 8)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !717, file: !696, line: 364, baseType: !572, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !708, file: !696, line: 388, baseType: !102, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !708, file: !696, line: 396, baseType: !723, size: 32, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !700, file: !390, line: 65, baseType: !706, size: 32, offset: 32)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !402, file: !601, line: 79, type: !184, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "data", scope: !402, file: !601, line: 702, type: !729, isLocal: true, isDefinition: true)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !601, line: 69, size: 640, elements: !730)
!730 = !{!731, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !729, file: !601, line: 70, baseType: !732, size: 448)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 448, elements: !331)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !729, file: !601, line: 71, baseType: !734, size: 192, offset: 448)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 192, elements: !331)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !601, line: 52, size: 96, elements: !736)
!736 = !{!737, !742, !743}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !735, file: !601, line: 53, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !485, line: 72, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !706, !596, !102}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !735, file: !601, line: 54, baseType: !102, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !735, file: !601, line: 55, baseType: !148, size: 32, offset: 64)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !402, file: !601, line: 733, type: !717, isLocal: true, isDefinition: true, align: 8)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "d", scope: !748, file: !601, line: 476, type: !754, isLocal: true, isDefinition: true)
!748 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !601, file: !601, line: 474, type: !602, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !402, retainedNodes: !749)
!749 = !{!750, !751, !752, !753}
!750 = !DILocalVariable(name: "mode", arg: 1, scope: !748, file: !601, line: 474, type: !411)
!751 = !DILocalVariable(name: "type", scope: !748, file: !601, line: 486, type: !568)
!752 = !DILocalVariable(name: "isr_mode", scope: !748, file: !601, line: 500, type: !572)
!753 = !DILocalVariable(name: "key", scope: !748, file: !601, line: 501, type: !103)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !417, line: 177, baseType: !416)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "target_type", scope: !748, file: !601, line: 477, type: !758, isLocal: true, isDefinition: true)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "config", scope: !402, file: !601, line: 704, type: !761, isLocal: true, isDefinition: true)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !601, line: 74, size: 128, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !762, file: !601, line: 76, baseType: !765, size: 128)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 128, elements: !331)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !601, line: 61, size: 64, elements: !767)
!767 = !{!768, !773}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !766, file: !601, line: 62, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !601, line: 58, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{null}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !766, file: !601, line: 63, baseType: !769, size: 32, offset: 32)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !402, file: !601, line: 695, type: !776, isLocal: true, isDefinition: true)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !485, line: 100, size: 224, elements: !778)
!778 = !{!779, !784, !785, !790, !796, !801, !807}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !777, file: !485, line: 101, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !485, line: 76, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!103, !706, !596}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !777, file: !485, line: 102, baseType: !780, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !777, file: !485, line: 103, baseType: !786, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !485, line: 83, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{!103, !706, !596, !738, !102}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !777, file: !485, line: 104, baseType: !791, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !485, line: 79, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DISubroutineType(types: !794)
!794 = !{!103, !706, !596, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !777, file: !485, line: 105, baseType: !797, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !485, line: 88, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{!484, !706, !596}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !777, file: !485, line: 106, baseType: !802, size: 32, offset: 160)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !485, line: 92, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{!103, !706, !596, !806}
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !485, line: 64, baseType: !102)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !777, file: !485, line: 107, baseType: !808, size: 32, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !485, line: 96, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{!103, !706, !596, !102}
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "transitions", scope: !814, file: !601, line: 655, type: !629, isLocal: true, isDefinition: true)
!814 = distinct !DISubprogram(name: "clk_init", scope: !601, file: !601, line: 651, type: !704, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !402, retainedNodes: !815)
!815 = !{!816, !817, !819, !820, !822}
!816 = !DILocalVariable(name: "dev", arg: 1, scope: !814, file: !601, line: 651, type: !706)
!817 = !DILocalVariable(name: "nrfx_err", scope: !814, file: !601, line: 653, type: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !492, line: 72, baseType: !491)
!819 = !DILocalVariable(name: "err", scope: !814, file: !601, line: 654, type: !103)
!820 = !DILocalVariable(name: "i", scope: !821, file: !601, line: 678, type: !405)
!821 = distinct !DILexicalBlock(scope: !814, file: !601, line: 678, column: 2)
!822 = !DILocalVariable(name: "subdata", scope: !823, file: !601, line: 680, type: !825)
!823 = distinct !DILexicalBlock(scope: !824, file: !601, line: 679, column: 42)
!824 = distinct !DILexicalBlock(scope: !821, file: !601, line: 678, column: 2)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !814, file: !601, line: 660, type: !828, isLocal: true, isDefinition: true, align: 32)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !828, file: !10, line: 55, baseType: !209, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !10, line: 57, baseType: !209, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !828, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !828, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !836, file: !841, line: 7, type: !842, isLocal: false, isDefinition: true, align: 16)
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !838, splitDebugInlining: false, nameTableKind: None)
!837 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!838 = !{!834, !839, !843}
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !836, file: !841, line: 12, type: !842, isLocal: false, isDefinition: true, align: 16)
!841 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 48, elements: !326)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !836, file: !841, line: 17, type: !842, isLocal: false, isDefinition: true, align: 16)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !847, file: !904, line: 603, type: !906, isLocal: true, isDefinition: true, align: 32)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !849, globals: !901, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!849 = !{!102, !103, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !853, line: 336, size: 160, elements: !854)
!853 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !{!855, !875, !879, !883, !896}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !852, file: !853, line: 365, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{!103, !859, !874}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !696, line: 378, size: 192, elements: !862)
!862 = !{!863, !864, !865, !866, !872, !873}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !861, file: !696, line: 380, baseType: !711, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !861, file: !696, line: 382, baseType: !13, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !861, file: !696, line: 384, baseType: !13, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !861, file: !696, line: 386, baseType: !867, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !696, line: 351, size: 16, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !868, file: !696, line: 359, baseType: !167, size: 8)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !868, file: !696, line: 364, baseType: !572, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !861, file: !696, line: 388, baseType: !102, size: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !861, file: !696, line: 396, baseType: !723, size: 32, offset: 160)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !852, file: !853, line: 366, baseType: !876, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !859, !168}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !852, file: !853, line: 374, baseType: !880, size: 32, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DISubroutineType(types: !882)
!882 = !{!103, !859}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !852, file: !853, line: 377, baseType: !884, size: 32, offset: 96)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DISubroutineType(types: !886)
!886 = !{!103, !859, !887}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !853, line: 122, size: 64, elements: !890)
!890 = !{!891, !892, !893, !894, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !889, file: !853, line: 123, baseType: !148, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !889, file: !853, line: 124, baseType: !167, size: 8, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !889, file: !853, line: 125, baseType: !167, size: 8, offset: 40)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !889, file: !853, line: 126, baseType: !167, size: 8, offset: 48)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !889, file: !853, line: 127, baseType: !167, size: 8, offset: 56)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !852, file: !853, line: 379, baseType: !897, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{!103, !859, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!901 = !{!845, !902}
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !847, file: !904, line: 38, type: !905, isLocal: true, isDefinition: true)
!904 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !390, line: 51, size: 64, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !907, file: !390, line: 60, baseType: !880, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !907, file: !390, line: 65, baseType: !859, size: 32, offset: 32)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "gpio_nrfx_p0_cfg", scope: !913, file: !1080, line: 424, type: !1121, isLocal: true, isDefinition: true)
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !915, retainedTypes: !972, globals: !1077, splitDebugInlining: false, nameTableKind: None)
!914 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_nrfx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tfm_regression_test")
!915 = !{!916, !922, !491, !927, !937, !943, !953, !957, !964, !968}
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !917, line: 506, baseType: !32, size: 32, elements: !918)
!917 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!918 = !{!919, !920, !921}
!919 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!920 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!921 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !917, line: 512, baseType: !32, size: 32, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!925 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!926 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !928, line: 56, baseType: !32, size: 32, elements: !929)
!928 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_gpiote.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_NONE", value: 0)
!931 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_LOTOHI", value: 1)
!932 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_HITOLO", value: 2)
!933 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_TOGGLE", value: 3)
!934 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_LOW", value: 4)
!935 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_HIGH", value: 5)
!936 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_MAX", value: 6)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 102, baseType: !32, size: 32, elements: !939)
!938 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!939 = !{!940, !941, !942}
!940 = !DIEnumerator(name: "NRF_GPIO_PIN_NOPULL", value: 0)
!941 = !DIEnumerator(name: "NRF_GPIO_PIN_PULLDOWN", value: 1)
!942 = !DIEnumerator(name: "NRF_GPIO_PIN_PULLUP", value: 3)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 110, baseType: !32, size: 32, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952}
!945 = !DIEnumerator(name: "NRF_GPIO_PIN_S0S1", value: 0)
!946 = !DIEnumerator(name: "NRF_GPIO_PIN_H0S1", value: 1)
!947 = !DIEnumerator(name: "NRF_GPIO_PIN_S0H1", value: 2)
!948 = !DIEnumerator(name: "NRF_GPIO_PIN_H0H1", value: 3)
!949 = !DIEnumerator(name: "NRF_GPIO_PIN_D0S1", value: 4)
!950 = !DIEnumerator(name: "NRF_GPIO_PIN_D0H1", value: 5)
!951 = !DIEnumerator(name: "NRF_GPIO_PIN_S0D1", value: 6)
!952 = !DIEnumerator(name: "NRF_GPIO_PIN_H0D1", value: 7)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 92, baseType: !32, size: 32, elements: !954)
!954 = !{!955, !956}
!955 = !DIEnumerator(name: "NRF_GPIO_PIN_INPUT_CONNECT", value: 0)
!956 = !DIEnumerator(name: "NRF_GPIO_PIN_INPUT_DISCONNECT", value: 1)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !958, line: 65, baseType: !32, size: 32, elements: !959)
!958 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_gpiote.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!959 = !{!960, !961, !962, !963}
!960 = !DIEnumerator(name: "NRF_GPIOTE_POLARITY_NONE", value: 0)
!961 = !DIEnumerator(name: "NRF_GPIOTE_POLARITY_LOTOHI", value: 1)
!962 = !DIEnumerator(name: "NRF_GPIOTE_POLARITY_HITOLO", value: 2)
!963 = !DIEnumerator(name: "NRF_GPIOTE_POLARITY_TOGGLE", value: 3)
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !958, line: 74, baseType: !32, size: 32, elements: !965)
!965 = !{!966, !967}
!966 = !DIEnumerator(name: "NRF_GPIOTE_INITIAL_VALUE_LOW", value: 0)
!967 = !DIEnumerator(name: "NRF_GPIOTE_INITIAL_VALUE_HIGH", value: 1)
!968 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 85, baseType: !32, size: 32, elements: !969)
!969 = !{!970, !971}
!970 = !DIEnumerator(name: "NRF_GPIO_PIN_DIR_INPUT", value: 0)
!971 = !DIEnumerator(name: "NRF_GPIO_PIN_DIR_OUTPUT", value: 1)
!972 = !{!973, !1042, !1047, !1008, !922, !916, !1052, !102, !1053, !1054, !1023, !146}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !917, line: 523, size: 288, elements: !976)
!976 = !{!977, !998, !1004, !1009, !1013, !1014, !1015, !1019, !1038}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !975, file: !917, line: 524, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{!103, !981, !996, !997}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !696, line: 378, size: 192, elements: !984)
!984 = !{!985, !986, !987, !988, !994, !995}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !696, line: 380, baseType: !711, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !983, file: !696, line: 382, baseType: !13, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !983, file: !696, line: 384, baseType: !13, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !983, file: !696, line: 386, baseType: !989, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !696, line: 351, size: 16, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !990, file: !696, line: 359, baseType: !167, size: 8)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !990, file: !696, line: 364, baseType: !572, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !983, file: !696, line: 388, baseType: !102, size: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !983, file: !696, line: 396, baseType: !723, size: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !917, line: 237, baseType: !167)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !917, line: 257, baseType: !148)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !975, file: !917, line: 530, baseType: !999, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!103, !981, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !917, line: 229, baseType: !148)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !975, file: !917, line: 532, baseType: !1005, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!103, !981, !1008, !1003}
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !917, line: 216, baseType: !148)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !975, file: !917, line: 535, baseType: !1010, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!103, !981, !1008}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !975, file: !917, line: 537, baseType: !1010, size: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !975, file: !917, line: 539, baseType: !1010, size: 32, offset: 160)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !975, file: !917, line: 541, baseType: !1016, size: 32, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!103, !981, !996, !916, !922}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !975, file: !917, line: 544, baseType: !1020, size: 32, offset: 224)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!103, !981, !1023, !572}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !917, line: 478, size: 96, elements: !1025)
!1025 = !{!1026, !1032, !1037}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1024, file: !917, line: 482, baseType: !1027, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !1029)
!1029 = !{!1030}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !136, line: 30, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1024, file: !917, line: 485, baseType: !1033, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !917, line: 464, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !981, !1023, !1008}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1024, file: !917, line: 493, baseType: !1008, size: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !975, file: !917, line: 547, baseType: !1039, size: 32, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!148, !981}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !917, line: 428, size: 32, elements: !1045)
!1045 = !{!1046}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1044, file: !917, line: 434, baseType: !1008, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !917, line: 441, size: 32, elements: !1050)
!1050 = !{!1051}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1049, file: !917, line: 447, baseType: !1008, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_gpio_pin_dir_t", file: !938, line: 89, baseType: !968)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_GPIO_Type", file: !287, line: 1186, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 1175, size: 15360, elements: !1057)
!1057 = !{!1058, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1073}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1056, file: !287, line: 1176, baseType: !1059, size: 10272)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 10272, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 321)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "OUT", scope: !1056, file: !287, line: 1177, baseType: !293, size: 32, offset: 10272)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "OUTSET", scope: !1056, file: !287, line: 1178, baseType: !293, size: 32, offset: 10304)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "OUTCLR", scope: !1056, file: !287, line: 1179, baseType: !293, size: 32, offset: 10336)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "IN", scope: !1056, file: !287, line: 1180, baseType: !292, size: 32, offset: 10368)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "DIR", scope: !1056, file: !287, line: 1181, baseType: !293, size: 32, offset: 10400)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "DIRSET", scope: !1056, file: !287, line: 1182, baseType: !293, size: 32, offset: 10432)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "DIRCLR", scope: !1056, file: !287, line: 1183, baseType: !293, size: 32, offset: 10464)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1056, file: !287, line: 1184, baseType: !1070, size: 3840, offset: 10496)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 3840, elements: !1071)
!1071 = !{!1072}
!1072 = !DISubrange(count: 120)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "PIN_CNF", scope: !1056, file: !287, line: 1185, baseType: !1074, size: 1024, offset: 14336)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 1024, elements: !1075)
!1075 = !{!1076}
!1076 = !DISubrange(count: 32)
!1077 = !{!1078, !1081, !1083, !1093, !1105, !911, !1107, !1109}
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !913, file: !1080, line: 424, type: !693, isLocal: false, isDefinition: true, align: 16)
!1080 = !DIFile(filename: "zephyr/drivers/gpio/gpio_nrfx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "__device_dts_ord_54", scope: !913, file: !1080, line: 424, type: !982, isLocal: false, isDefinition: true, align: 32)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_54", scope: !913, file: !1080, line: 424, type: !1085, isLocal: true, isDefinition: true, align: 32)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !390, line: 51, size: 64, elements: !1087)
!1087 = !{!1088, !1092}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1086, file: !390, line: 60, baseType: !1089, size: 32)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 32)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!103, !981}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1086, file: !390, line: 65, baseType: !981, size: 32, offset: 32)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(name: "gpio_nrfx_p0_data", scope: !913, file: !1080, line: 424, type: !1095, isLocal: true, isDefinition: true)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_nrfx_data", file: !1080, line: 16, size: 96, elements: !1096)
!1096 = !{!1097, !1098}
