; ModuleID = 'build/actinius_icarus_som/subsys/console/getchar/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.tty_serial = type { %struct.device*, %struct.k_sem, i8*, i32, i16, i16, i32, %struct.k_sem, i8*, i32, i16, i16, i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !111, file: !173, line: 65, type: !174, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !166, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!113 = !{!102, !103, !114, !119, !126}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !116, file: !115, line: 167, baseType: !125)
!115 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !115, file: !115, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!120 = !{!121, !122, !124}
!121 = !DILocalVariable(name: "time_us", arg: 1, scope: !116, file: !115, line: 134, type: !119)
!122 = !DILocalVariable(name: "delay_cycles", scope: !116, file: !115, line: 168, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!124 = !DILocalVariable(name: "cycles", scope: !116, file: !115, line: 171, type: !119)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !128, line: 1928, baseType: !129)
!128 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 1909, size: 11360, elements: !130)
!130 = !{!131, !137, !138, !139, !140, !144, !145, !146, !147, !151, !152, !156, !157, !158, !159, !160, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !129, file: !128, line: 1910, baseType: !132, size: 8192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !119)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !129, file: !128, line: 1911, baseType: !133, size: 32, offset: 8192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !129, file: !128, line: 1912, baseType: !133, size: 32, offset: 8224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !129, file: !128, line: 1913, baseType: !133, size: 32, offset: 8256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !129, file: !128, line: 1914, baseType: !141, size: 1984, offset: 8288)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1984, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 62)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !129, file: !128, line: 1915, baseType: !134, size: 32, offset: 10272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !129, file: !128, line: 1916, baseType: !133, size: 32, offset: 10304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !129, file: !128, line: 1917, baseType: !134, size: 32, offset: 10336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !129, file: !128, line: 1918, baseType: !148, size: 96, offset: 10368)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !129, file: !128, line: 1919, baseType: !134, size: 32, offset: 10464)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !129, file: !128, line: 1920, baseType: !153, size: 256, offset: 10496)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !129, file: !128, line: 1921, baseType: !134, size: 32, offset: 10752)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !129, file: !128, line: 1922, baseType: !133, size: 32, offset: 10784)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !129, file: !128, line: 1923, baseType: !134, size: 32, offset: 10816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !129, file: !128, line: 1924, baseType: !134, size: 32, offset: 10848)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !129, file: !128, line: 1925, baseType: !161, size: 416, offset: 10880)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !129, file: !128, line: 1926, baseType: !134, size: 32, offset: 11296)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !129, file: !128, line: 1927, baseType: !134, size: 32, offset: 11328)
!166 = !{!109, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !116, file: !115, line: 161, type: !169, isLocal: true, isDefinition: true, align: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !149)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !177)
!176 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !{!178, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !176, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !175, file: !176, line: 65, baseType: !182, size: 32, offset: 32)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "console_serial", scope: !188, file: !291, line: 13, type: !297, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !190, globals: !288, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!190 = !{!191, !102, !103}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !194, line: 336, size: 608, elements: !195)
!194 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!195 = !{!196, !228, !232, !236, !249, !254, !260, !266, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !193, file: !194, line: 365, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{!103, !200, !227}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !203, line: 378, size: 192, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !209, !210, !211, !220, !221}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 380, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !202, file: !203, line: 382, baseType: !13, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !202, file: !203, line: 384, baseType: !13, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !202, file: !203, line: 386, baseType: !212, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !203, line: 351, size: 16, elements: !214)
!214 = !{!215, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !213, file: !203, line: 359, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !217)
!217 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !213, file: !203, line: 364, baseType: !219, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!219 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !203, line: 388, baseType: !102, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !202, file: !203, line: 396, baseType: !222, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !203, line: 43, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !226)
!226 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !193, file: !194, line: 366, baseType: !229, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !200, !217}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !193, file: !194, line: 374, baseType: !233, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DISubroutineType(types: !235)
!235 = !{!103, !200}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !193, file: !194, line: 377, baseType: !237, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{!103, !200, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !194, line: 122, size: 64, elements: !243)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !242, file: !194, line: 123, baseType: !119, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !242, file: !194, line: 124, baseType: !216, size: 8, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !242, file: !194, line: 125, baseType: !216, size: 8, offset: 40)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !242, file: !194, line: 126, baseType: !216, size: 8, offset: 48)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !242, file: !194, line: 127, baseType: !216, size: 8, offset: 56)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !193, file: !194, line: 379, baseType: !250, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{!103, !200, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !193, file: !194, line: 384, baseType: !255, size: 32, offset: 160)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{!103, !200, !258, !103}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !193, file: !194, line: 393, baseType: !261, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DISubroutineType(types: !263)
!263 = !{!103, !200, !264, !265}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !193, file: !194, line: 402, baseType: !267, size: 32, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !200}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !193, file: !194, line: 405, baseType: !267, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !193, file: !194, line: 408, baseType: !233, size: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !193, file: !194, line: 411, baseType: !267, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !193, file: !194, line: 414, baseType: !267, size: 32, offset: 352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !193, file: !194, line: 417, baseType: !233, size: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !193, file: !194, line: 420, baseType: !233, size: 32, offset: 416)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !193, file: !194, line: 423, baseType: !267, size: 32, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !193, file: !194, line: 426, baseType: !267, size: 32, offset: 480)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !193, file: !194, line: 429, baseType: !233, size: 32, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !193, file: !194, line: 432, baseType: !233, size: 32, offset: 544)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !193, file: !194, line: 435, baseType: !281, size: 32, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !200, !284, !102}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !194, line: 142, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !200, !102}
!288 = !{!186, !289, !295}
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "console_rxbuf", scope: !188, file: !291, line: 15, type: !292, isLocal: true, isDefinition: true)
!291 = !DIFile(filename: "zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 128, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 16)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "console_txbuf", scope: !188, file: !291, line: 16, type: !292, isLocal: true, isDefinition: true)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tty_serial", file: !298, line: 18, size: 544, elements: !299)
!298 = !DIFile(filename: "zephyr/include/zephyr/console/tty.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !{!300, !301, !328, !329, !330, !331, !332, !334, !335, !336, !337, !338, !339}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "uart_dev", scope: !297, file: !298, line: 19, baseType: !200, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rx_sem", scope: !297, file: !298, line: 21, baseType: !302, size: 128, offset: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !303, line: 2909, size: 128, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !326, !327}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !302, file: !303, line: 2910, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !307, line: 233, baseType: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 231, size: 64, elements: !309)
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !308, file: !307, line: 232, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !312, line: 48, baseType: !313)
!312 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !312, line: 37, size: 64, elements: !314)
!314 = !{!315, !321}
!315 = !DIDerivedType(tag: DW_TAG_member, scope: !313, file: !312, line: 38, baseType: !316, size: 32)
!316 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !313, file: !312, line: 38, size: 32, elements: !317)
!317 = !{!318, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !316, file: !312, line: 39, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !312, line: 40, baseType: !319, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, scope: !313, file: !312, line: 42, baseType: !322, size: 32, offset: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !313, file: !312, line: 42, size: 32, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !322, file: !312, line: 43, baseType: !319, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !322, file: !312, line: 44, baseType: !319, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !302, file: !303, line: 2911, baseType: !32, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !302, file: !303, line: 2912, baseType: !32, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf", scope: !297, file: !298, line: 22, baseType: !264, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf_sz", scope: !297, file: !298, line: 23, baseType: !119, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rx_get", scope: !297, file: !298, line: 24, baseType: !171, size: 16, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rx_put", scope: !297, file: !298, line: 24, baseType: !171, size: 16, offset: 240)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rx_timeout", scope: !297, file: !298, line: 25, baseType: !333, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tx_sem", scope: !297, file: !298, line: 27, baseType: !302, size: 128, offset: 288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf", scope: !297, file: !298, line: 28, baseType: !264, size: 32, offset: 416)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf_sz", scope: !297, file: !298, line: 29, baseType: !119, size: 32, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tx_get", scope: !297, file: !298, line: 30, baseType: !171, size: 16, offset: 480)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tx_put", scope: !297, file: !298, line: 30, baseType: !171, size: 16, offset: 496)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tx_timeout", scope: !297, file: !298, line: 31, baseType: !333, size: 32, offset: 512)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !342, file: !383, line: 27, type: !410, isLocal: true, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !344, retainedTypes: !356, globals: !380, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!344 = !{!345, !30}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !346, line: 27, baseType: !32, size: 32, elements: !347)
!346 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355}
!348 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!349 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!350 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!351 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!352 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!353 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!354 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!355 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!356 = !{!102, !357, !103, !24, !361, !377, !119, !378}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !358, line: 46, baseType: !359)
!358 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !360)
!360 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !363, line: 54, size: 96, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !372, !376}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !362, file: !363, line: 55, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !367, line: 33, baseType: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !367, line: 29, size: 32, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !367, line: 30, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !362, file: !363, line: 60, baseType: !373, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !345}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !362, file: !363, line: 65, baseType: !373, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !379)
!379 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!380 = !{!340, !381, !387, !389, !400, !402}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !342, file: !383, line: 44, type: !384, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !385, line: 43, elements: !386)
!385 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !{}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !342, file: !383, line: 49, type: !384, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !342, file: !383, line: 36, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 128, elements: !398)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !346, line: 114, size: 128, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !392, file: !346, line: 115, baseType: !345, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !392, file: !346, line: 141, baseType: !216, size: 8, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !392, file: !346, line: 149, baseType: !119, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !392, file: !346, line: 156, baseType: !119, size: 32, offset: 96)
!398 = !{!399}
!399 = !DISubrange(count: 1)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !342, file: !383, line: 40, type: !391, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !342, file: !383, line: 28, type: !404, isLocal: true, isDefinition: true)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !367, line: 40, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !367, line: 35, size: 64, elements: !406)
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !405, file: !367, line: 36, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !405, file: !367, line: 37, baseType: !408, size: 32, offset: 32)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 32, elements: !398)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !412, line: 22, baseType: !413)
!412 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!413 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!414 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!415 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !418, file: !446, line: 50, type: !333, isLocal: true, isDefinition: true)
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !344, retainedTypes: !420, globals: !443, splitDebugInlining: false, nameTableKind: None)
!419 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!420 = !{!225, !357, !421, !103, !102, !119, !378, !423, !377, !333, !434}
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !422, line: 214, baseType: !32)
!422 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !425, line: 45, size: 64, elements: !426)
!425 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !{!427, !433}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !424, file: !425, line: 46, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !367, line: 33, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !367, line: 29, size: 32, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !367, line: 30, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !424, file: !425, line: 48, baseType: !119, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !425, line: 38, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !435, file: !425, line: 39, baseType: !428, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !435, file: !425, line: 41, baseType: !439, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !425, line: 35, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !333}
!443 = !{!444, !448, !456, !416, !458, !468}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "latency_lock", scope: !418, file: !446, line: 44, type: !447, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !385, line: 43, elements: !386)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !418, file: !446, line: 46, type: !450, isLocal: true, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !367, line: 40, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !367, line: 35, size: 64, elements: !452)
!452 = !{!453, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !451, file: !367, line: 36, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !451, file: !367, line: 37, baseType: !454, size: 32, offset: 32)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "latency_subs", scope: !418, file: !446, line: 52, type: !450, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !418, file: !446, line: 39, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, elements: !466)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 35, size: 96, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !461, file: !446, line: 36, baseType: !345, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !461, file: !446, line: 37, baseType: !216, size: 8, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !461, file: !446, line: 38, baseType: !411, size: 32, offset: 64)
!466 = !{!467}
!467 = !DISubrange(count: 0)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !418, file: !446, line: 48, type: !333, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !472, file: !479, line: 47, type: !492, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !474, retainedTypes: !475, globals: !476, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!474 = !{!345}
!475 = !{!421, !103}
!476 = !{!477, !470, !489}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "cpus_states", scope: !472, file: !479, line: 50, type: !480, isLocal: true, isDefinition: true)
!479 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 32, elements: !398)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !346, line: 114, size: 128, elements: !484)
!484 = !{!485, !486, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !483, file: !346, line: 115, baseType: !345, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !483, file: !346, line: 141, baseType: !216, size: 8, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !483, file: !346, line: 149, baseType: !119, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !483, file: !346, line: 156, baseType: !119, size: 32, offset: 96)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !472, file: !479, line: 55, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 8, elements: !398)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, elements: !466)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "static_regions", scope: !495, file: !502, line: 62, type: !631, isLocal: true, isDefinition: true)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !497, globals: !498, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!497 = !{!421, !103, !119, !102}
!498 = !{!499, !493}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !501, file: !502, line: 198, type: !618, isLocal: true, isDefinition: true)
!501 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !502, file: !502, line: 175, type: !503, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !495, retainedNodes: !615)
!502 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = !DISubroutineType(types: !504)
!504 = !{null, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !507, line: 245, size: 1024, elements: !508)
!507 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = !{!509, !572, !585, !586, !587, !588, !594, !610}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !506, file: !507, line: 247, baseType: !510, size: 384)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !507, line: 57, size: 384, elements: !511)
!511 = !{!512, !539, !546, !547, !548, !559, !560, !561}
!512 = !DIDerivedType(tag: DW_TAG_member, scope: !510, file: !507, line: 60, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !510, file: !507, line: 60, size: 64, elements: !514)
!514 = !{!515, !530}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !513, file: !507, line: 61, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !312, line: 49, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !312, line: 37, size: 64, elements: !518)
!518 = !{!519, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !312, line: 38, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !517, file: !312, line: 38, size: 32, elements: !521)
!521 = !{!522, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !520, file: !312, line: 39, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !312, line: 40, baseType: !523, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !312, line: 42, baseType: !526, size: 32, offset: 32)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !517, file: !312, line: 42, size: 32, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !526, file: !312, line: 43, baseType: !523, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !526, file: !312, line: 44, baseType: !523, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !513, file: !507, line: 62, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !532, line: 49, size: 64, elements: !533)
!532 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !531, file: !532, line: 50, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 64, elements: !537)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!537 = !{!538}
!538 = !DISubrange(count: 2)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !510, file: !507, line: 68, baseType: !540, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !307, line: 233, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 231, size: 64, elements: !543)
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !542, file: !307, line: 232, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !312, line: 48, baseType: !517)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !510, file: !507, line: 71, baseType: !216, size: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !510, file: !507, line: 74, baseType: !216, size: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, scope: !510, file: !507, line: 90, baseType: !549, size: 16, offset: 112)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !510, file: !507, line: 90, size: 16, elements: !550)
!550 = !{!551, !558}
!551 = !DIDerivedType(tag: DW_TAG_member, scope: !549, file: !507, line: 91, baseType: !552, size: 16)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !549, file: !507, line: 91, size: 16, elements: !553)
!553 = !{!554, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !552, file: !507, line: 96, baseType: !555, size: 8)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !556)
!556 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !552, file: !507, line: 97, baseType: !216, size: 8, offset: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !549, file: !507, line: 100, baseType: !171, size: 16)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !510, file: !507, line: 107, baseType: !119, size: 32, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !510, file: !507, line: 127, baseType: !102, size: 32, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !510, file: !507, line: 131, baseType: !562, size: 192, offset: 192)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !307, line: 244, size: 192, elements: !563)
!563 = !{!564, !565, !571}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !562, file: !307, line: 245, baseType: !516, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !562, file: !307, line: 246, baseType: !566, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !307, line: 242, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !562, file: !307, line: 249, baseType: !359, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !506, file: !507, line: 250, baseType: !573, size: 288, offset: 384)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !574, line: 25, size: 288, elements: !575)
!574 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !573, file: !574, line: 26, baseType: !119, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !573, file: !574, line: 27, baseType: !119, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !573, file: !574, line: 28, baseType: !119, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !573, file: !574, line: 29, baseType: !119, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !573, file: !574, line: 30, baseType: !119, size: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !573, file: !574, line: 31, baseType: !119, size: 32, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !573, file: !574, line: 32, baseType: !119, size: 32, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !573, file: !574, line: 33, baseType: !119, size: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !573, file: !574, line: 34, baseType: !119, size: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !506, file: !507, line: 253, baseType: !102, size: 32, offset: 672)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !506, file: !507, line: 256, baseType: !541, size: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !506, file: !507, line: 294, baseType: !103, size: 32, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !506, file: !507, line: 300, baseType: !589, size: 96, offset: 800)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !507, line: 149, size: 96, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !589, file: !507, line: 153, baseType: !22, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !589, file: !507, line: 162, baseType: !421, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !589, file: !507, line: 168, baseType: !421, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !506, file: !507, line: 325, baseType: !595, size: 32, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !303, line: 5073, size: 160, elements: !597)
!597 = !{!598, !607, !608}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !596, file: !303, line: 5074, baseType: !599, size: 96)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !600, line: 56, size: 96, elements: !601)
!600 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!601 = !{!602, !605, !606}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !599, file: !600, line: 57, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !600, line: 57, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !599, file: !600, line: 58, baseType: !102, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !599, file: !600, line: 59, baseType: !421, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !596, file: !303, line: 5075, baseType: !541, size: 64, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !596, file: !303, line: 5076, baseType: !609, offset: 160)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !385, line: 43, elements: !386)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !506, file: !507, line: 343, baseType: !611, size: 64, offset: 928)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !574, line: 60, size: 64, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !611, file: !574, line: 63, baseType: !119, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !611, file: !574, line: 66, baseType: !119, size: 32, offset: 32)
!615 = !{!616, !617}
!616 = !DILocalVariable(name: "thread", arg: 1, scope: !501, file: !502, line: 175, type: !505)
!617 = !DILocalVariable(name: "region_num", scope: !501, file: !502, line: 200, type: !216)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, elements: !466)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !620, line: 52, size: 96, elements: !621)
!620 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !619, file: !620, line: 53, baseType: !22, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !620, line: 54, baseType: !421, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !619, file: !620, line: 55, baseType: !625, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !626, line: 304, baseType: !627)
!626 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !626, line: 301, size: 32, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !627, file: !626, line: 302, baseType: !171, size: 16)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !627, file: !626, line: 303, baseType: !171, size: 16, offset: 16)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 96, elements: !398)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !635, file: !689, line: 39, type: !216, isLocal: true, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C99, file: !636, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !637, globals: !680, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!637 = !{!638, !102, !103, !666}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !640, line: 1495, baseType: !641)
!640 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !640, line: 1474, size: 448, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !656}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !641, file: !640, line: 1476, baseType: !133, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !641, file: !640, line: 1477, baseType: !134, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !641, file: !640, line: 1478, baseType: !134, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !641, file: !640, line: 1479, baseType: !134, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !641, file: !640, line: 1480, baseType: !134, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !641, file: !640, line: 1481, baseType: !134, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !641, file: !640, line: 1482, baseType: !134, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !641, file: !640, line: 1483, baseType: !134, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !641, file: !640, line: 1484, baseType: !134, size: 32, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !641, file: !640, line: 1485, baseType: !134, size: 32, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !641, file: !640, line: 1486, baseType: !134, size: 32, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !641, file: !640, line: 1487, baseType: !655, size: 32, offset: 352)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !398)
!656 = !DIDerivedType(tag: DW_TAG_member, scope: !641, file: !640, line: 1488, baseType: !657, size: 64, offset: 384)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !640, line: 1488, size: 64, elements: !658)
!658 = !{!659, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !657, file: !640, line: 1489, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !537)
!661 = !DIDerivedType(tag: DW_TAG_member, scope: !657, file: !640, line: 1490, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !657, file: !640, line: 1490, size: 64, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !662, file: !640, line: 1491, baseType: !134, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !662, file: !640, line: 1492, baseType: !134, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !669, line: 27, size: 128, elements: !670)
!669 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !668, file: !669, line: 29, baseType: !119, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !669, line: 31, baseType: !206, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !668, file: !669, line: 37, baseType: !674, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !626, line: 298, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !626, line: 289, size: 64, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !675, file: !626, line: 291, baseType: !216, size: 5, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !675, file: !626, line: 293, baseType: !216, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !675, file: !626, line: 295, baseType: !119, size: 32, offset: 32)
!680 = !{!633, !681}
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !635, file: !683, line: 31, type: !684, isLocal: true, isDefinition: true)
!683 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 160, elements: !398)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !683, line: 21, size: 160, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !685, file: !683, line: 22, baseType: !103, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !685, file: !683, line: 23, baseType: !668, size: 128, offset: 32)
!689 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !692, file: !699, line: 21, type: !106, isLocal: true, isDefinition: true)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !694, globals: !698, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!694 = !{!695, !103, !102}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !697, line: 22, baseType: !103)
!697 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!698 = !{!690}
!699 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !702, file: !707, line: 13, type: !726, isLocal: true, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !704, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!704 = !{!705, !700}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "mpu_config", scope: !702, file: !707, line: 37, type: !708, isLocal: false, isDefinition: true)
!707 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !669, line: 41, size: 64, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !709, file: !669, line: 43, baseType: !119, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !709, file: !669, line: 45, baseType: !713, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !669, line: 27, size: 128, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !715, file: !669, line: 29, baseType: !119, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !669, line: 31, baseType: !206, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !715, file: !669, line: 37, baseType: !720, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !626, line: 298, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !626, line: 289, size: 64, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !721, file: !626, line: 291, baseType: !216, size: 5, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !721, file: !626, line: 293, baseType: !216, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !721, file: !626, line: 295, baseType: !119, size: 32, offset: 32)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 256, elements: !537)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "__device_dts_ord_35", scope: !729, file: !930, line: 733, type: !1033, isLocal: false, isDefinition: true, align: 32)
!729 = distinct !DICompileUnit(language: DW_LANG_C99, file: !730, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !731, retainedTypes: !849, globals: !926, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/console/getchar")
!731 = !{!732, !738, !30, !743, !748, !752, !756, !760, !766, !770, !814, !821, !840}
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !733, line: 23, baseType: !32, size: 32, elements: !734)
!733 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!734 = !{!735, !736, !737}
!735 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!736 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!737 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !733, line: 48, baseType: !32, size: 32, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!741 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!742 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !744, line: 167, baseType: !32, size: 32, elements: !745)
!744 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = !{!746, !747}
!746 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!747 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !744, line: 107, baseType: !32, size: 32, elements: !749)
!749 = !{!750, !751}
!750 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!751 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !744, line: 208, baseType: !32, size: 32, elements: !753)
!753 = !{!754, !755}
!754 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!755 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !744, line: 261, baseType: !32, size: 32, elements: !757)
!757 = !{!758, !759}
!758 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!759 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!760 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !744, line: 237, baseType: !32, size: 32, elements: !761)
!761 = !{!762, !763, !764, !765}
!762 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!763 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!764 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!765 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!766 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !744, line: 152, baseType: !32, size: 32, elements: !767)
!767 = !{!768, !769}
!768 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!769 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 71, baseType: !103, size: 32, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!772 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!773 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!774 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!775 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!776 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!777 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!778 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!779 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!780 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!781 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!782 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!783 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!784 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!785 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!786 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!787 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!788 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!789 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!790 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!791 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!792 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!793 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!794 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!795 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!796 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!797 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!798 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!799 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!800 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!801 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!802 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!803 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!804 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!805 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!806 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!807 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!808 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!809 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!810 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!811 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!812 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!813 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !815, line: 44, baseType: !32, size: 32, elements: !816)
!815 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !{!817, !818, !819, !820}
!817 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!818 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!819 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!820 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!821 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !822, line: 54, baseType: !32, size: 32, elements: !823)
!822 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839}
!824 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!825 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!826 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!827 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!828 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!829 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!830 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!831 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!832 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!833 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!834 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!835 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!836 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!837 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!838 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!839 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!840 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !841, line: 53, baseType: !32, size: 32, elements: !842)
!841 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!842 = !{!843, !844, !845, !846, !847, !848}
!843 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!844 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!845 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!846 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!847 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!848 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!849 = !{!732, !102, !103, !850, !892, !893, !894, !895, !357, !119, !378, !219, !896, !264, !333, !897, !925, !421}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !128, line: 923, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 883, size: 10464, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !862, !863, !864, !865, !866, !867, !868, !869, !873, !874, !875, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !852, file: !128, line: 884, baseType: !134, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !852, file: !128, line: 885, baseType: !134, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !852, file: !128, line: 886, baseType: !134, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !852, file: !128, line: 887, baseType: !134, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !852, file: !128, line: 888, baseType: !859, size: 896, offset: 128)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 28)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !852, file: !128, line: 889, baseType: !134, size: 32, offset: 1024)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !852, file: !128, line: 890, baseType: !134, size: 32, offset: 1056)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !852, file: !128, line: 891, baseType: !134, size: 32, offset: 1088)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !852, file: !128, line: 892, baseType: !134, size: 32, offset: 1120)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !852, file: !128, line: 893, baseType: !859, size: 896, offset: 1152)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !852, file: !128, line: 894, baseType: !134, size: 32, offset: 2048)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !852, file: !128, line: 895, baseType: !134, size: 32, offset: 2080)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !852, file: !128, line: 896, baseType: !870, size: 960, offset: 2112)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 960, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 30)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !852, file: !128, line: 897, baseType: !134, size: 32, offset: 3072)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !852, file: !128, line: 898, baseType: !134, size: 32, offset: 3104)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !852, file: !128, line: 899, baseType: !876, size: 3008, offset: 3136)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3008, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 94)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !852, file: !128, line: 900, baseType: !134, size: 32, offset: 6144)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !852, file: !128, line: 901, baseType: !134, size: 32, offset: 6176)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !852, file: !128, line: 902, baseType: !134, size: 32, offset: 6208)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !852, file: !128, line: 903, baseType: !133, size: 32, offset: 6240)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !852, file: !128, line: 904, baseType: !141, size: 1984, offset: 6272)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !852, file: !128, line: 905, baseType: !133, size: 32, offset: 8256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !852, file: !128, line: 907, baseType: !133, size: 32, offset: 8288)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !852, file: !128, line: 910, baseType: !133, size: 32, offset: 8320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !852, file: !128, line: 911, baseType: !133, size: 32, offset: 8352)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !852, file: !128, line: 913, baseType: !133, size: 32, offset: 8384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !852, file: !128, line: 917, baseType: !133, size: 32, offset: 8416)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !852, file: !128, line: 919, baseType: !141, size: 1984, offset: 8448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !852, file: !128, line: 920, baseType: !134, size: 32, offset: 10432)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !744, line: 146, baseType: !748)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !744, line: 164, baseType: !766)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !640, line: 485, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !640, line: 468, size: 28704, elements: !900)
!900 = !{!901, !903, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !920, !924}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !899, file: !640, line: 470, baseType: !902, size: 512)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !293)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !899, file: !640, line: 471, baseType: !904, size: 512, offset: 512)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !293)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !899, file: !640, line: 472, baseType: !902, size: 512, offset: 1024)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !899, file: !640, line: 473, baseType: !904, size: 512, offset: 1536)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !899, file: !640, line: 474, baseType: !902, size: 512, offset: 2048)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !899, file: !640, line: 475, baseType: !904, size: 512, offset: 2560)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !899, file: !640, line: 476, baseType: !902, size: 512, offset: 3072)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !899, file: !640, line: 477, baseType: !904, size: 512, offset: 3584)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !899, file: !640, line: 478, baseType: !902, size: 512, offset: 4096)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !899, file: !640, line: 479, baseType: !904, size: 512, offset: 4608)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !899, file: !640, line: 480, baseType: !902, size: 512, offset: 5120)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !899, file: !640, line: 481, baseType: !904, size: 512, offset: 5632)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !899, file: !640, line: 482, baseType: !916, size: 3968, offset: 6144)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 3968, elements: !918)
!917 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !216)
!918 = !{!919}
!919 = !DISubrange(count: 496)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !899, file: !640, line: 483, baseType: !921, size: 18560, offset: 10112)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 18560, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 580)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !899, file: !640, line: 484, baseType: !134, size: 32, offset: 28672)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !815, line: 56, baseType: !102)
!926 = !{!927, !977, !1018, !727, !1023, !1048, !1050, !1067, !1069, !1079, !1082, !1097, !1135, !1149}
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "on", scope: !929, file: !930, line: 549, type: !411, isLocal: true, isDefinition: true)
!929 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !930, file: !930, line: 547, type: !931, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !729, retainedNodes: !933)
!930 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!931 = !DISubroutineType(types: !932)
!932 = !{null, !738}
!933 = !{!934, !935, !938}
!934 = !DILocalVariable(name: "start_mode", arg: 1, scope: !929, file: !930, line: 547, type: !738)
!935 = !DILocalVariable(name: "err", scope: !936, file: !930, line: 553, type: !103)
!936 = distinct !DILexicalBlock(scope: !937, file: !930, line: 552, column: 31)
!937 = distinct !DILexicalBlock(scope: !929, file: !930, line: 552, column: 6)
!938 = !DILocalVariable(name: "mgr", scope: !936, file: !930, line: 554, type: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !941, line: 154, size: 224, elements: !942)
!941 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!942 = !{!943, !955, !956, !972, !974, !975, !976}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !940, file: !941, line: 158, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !367, line: 40, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !367, line: 35, size: 64, elements: !946)
!946 = !{!947, !954}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !945, file: !367, line: 36, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !367, line: 33, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !367, line: 29, size: 32, elements: !951)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !367, line: 30, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !945, file: !367, line: 37, baseType: !948, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !940, file: !941, line: 163, baseType: !944, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !940, file: !941, line: 166, baseType: !957, size: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !941, line: 133, size: 96, elements: !960)
!960 = !{!961, !970, !971}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !959, file: !941, line: 135, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !941, line: 129, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !939, !966}
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !941, line: 101, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !939, !103}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !959, file: !941, line: 138, baseType: !962, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !959, file: !941, line: 143, baseType: !962, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !940, file: !941, line: 169, baseType: !973, offset: 160)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !385, line: 43, elements: !386)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !940, file: !941, line: 172, baseType: !103, size: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !941, line: 175, baseType: !171, size: 16, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !940, file: !941, line: 178, baseType: !171, size: 16, offset: 208)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "cli", scope: !929, file: !930, line: 550, type: !979, isLocal: true, isDefinition: true)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !941, line: 273, size: 128, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !979, file: !941, line: 280, baseType: !949, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !979, file: !941, line: 283, baseType: !983, size: 96, offset: 32)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !984, line: 138, size: 96, elements: !985)
!984 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!985 = !{!986, !1015, !1016}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !983, file: !984, line: 149, baseType: !987, size: 32)
!987 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !984, line: 139, size: 32, elements: !988)
!988 = !{!989, !1010}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !987, file: !984, line: 145, baseType: !990, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !303, line: 5397, size: 128, elements: !992)
!992 = !{!993, !1008, !1009}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !991, file: !303, line: 5399, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !312, line: 48, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !312, line: 37, size: 64, elements: !996)
!996 = !{!997, !1003}
!997 = !DIDerivedType(tag: DW_TAG_member, scope: !995, file: !312, line: 38, baseType: !998, size: 32)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !312, line: 38, size: 32, elements: !999)
!999 = !{!1000, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !998, file: !312, line: 39, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !998, file: !312, line: 40, baseType: !1001, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, scope: !995, file: !312, line: 42, baseType: !1004, size: 32, offset: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !312, line: 42, size: 32, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1004, file: !312, line: 43, baseType: !1001, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1004, file: !312, line: 44, baseType: !1001, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !991, file: !303, line: 5405, baseType: !32, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !991, file: !303, line: 5408, baseType: !103, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !987, file: !984, line: 148, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !984, line: 98, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, null}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !984, line: 165, baseType: !134, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !983, file: !984, line: 174, baseType: !1017, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !729, file: !930, line: 733, type: !1020, isLocal: false, isDefinition: true, align: 16)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 80, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 5)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_35", scope: !729, file: !930, line: 733, type: !1025, isLocal: true, isDefinition: true, align: 32)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !1027)
!1027 = !{!1028, !1047}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1026, file: !176, line: 60, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!103, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !203, line: 378, size: 192, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1045, !1046}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1034, file: !203, line: 380, baseType: !206, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1034, file: !203, line: 382, baseType: !13, size: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1034, file: !203, line: 384, baseType: !13, size: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1034, file: !203, line: 386, baseType: !1040, size: 32, offset: 96)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
