; ModuleID = 'build/actinius_icarus/s2ram/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.__cpu_context = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !111, file: !173, line: 65, type: !174, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !166, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!113 = !{!102, !103, !114, !119, !126}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !116, file: !115, line: 167, baseType: !125)
!115 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !115, file: !115, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!120 = !{!121, !122, !124}
!121 = !DILocalVariable(name: "time_us", arg: 1, scope: !116, file: !115, line: 134, type: !119)
!122 = !DILocalVariable(name: "delay_cycles", scope: !116, file: !115, line: 168, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!124 = !DILocalVariable(name: "cycles", scope: !116, file: !115, line: 171, type: !119)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !128, line: 1928, baseType: !129)
!128 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 1909, size: 11360, elements: !130)
!130 = !{!131, !137, !138, !139, !140, !144, !145, !146, !147, !151, !152, !156, !157, !158, !159, !160, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !129, file: !128, line: 1910, baseType: !132, size: 8192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !119)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !129, file: !128, line: 1911, baseType: !133, size: 32, offset: 8192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !129, file: !128, line: 1912, baseType: !133, size: 32, offset: 8224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !129, file: !128, line: 1913, baseType: !133, size: 32, offset: 8256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !129, file: !128, line: 1914, baseType: !141, size: 1984, offset: 8288)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1984, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 62)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !129, file: !128, line: 1915, baseType: !134, size: 32, offset: 10272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !129, file: !128, line: 1916, baseType: !133, size: 32, offset: 10304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !129, file: !128, line: 1917, baseType: !134, size: 32, offset: 10336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !129, file: !128, line: 1918, baseType: !148, size: 96, offset: 10368)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !129, file: !128, line: 1919, baseType: !134, size: 32, offset: 10464)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !129, file: !128, line: 1920, baseType: !153, size: 256, offset: 10496)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !129, file: !128, line: 1921, baseType: !134, size: 32, offset: 10752)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !129, file: !128, line: 1922, baseType: !133, size: 32, offset: 10784)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !129, file: !128, line: 1923, baseType: !134, size: 32, offset: 10816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !129, file: !128, line: 1924, baseType: !134, size: 32, offset: 10848)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !129, file: !128, line: 1925, baseType: !161, size: 416, offset: 10880)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !129, file: !128, line: 1926, baseType: !134, size: 32, offset: 11296)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !129, file: !128, line: 1927, baseType: !134, size: 32, offset: 11328)
!166 = !{!109, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !116, file: !115, line: 161, type: !169, isLocal: true, isDefinition: true, align: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !149)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !177)
!176 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !{!178, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !176, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !175, file: !176, line: 65, baseType: !182, size: 32, offset: 32)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !188, file: !230, line: 27, type: !259, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !202, globals: !227, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!190 = !{!191, !30}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !192, line: 27, baseType: !32, size: 32, elements: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!195 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!196 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!197 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!198 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!199 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!200 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!201 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!202 = !{!102, !203, !103, !24, !207, !223, !119, !225}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !204, line: 46, baseType: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !206)
!206 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !209, line: 54, size: 96, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !218, !222}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !208, file: !209, line: 55, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !214)
!213 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !213, line: 30, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !208, file: !209, line: 60, baseType: !219, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !191}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !208, file: !209, line: 65, baseType: !219, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !226)
!226 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!227 = !{!186, !228, !234, !236, !249, !251}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !188, file: !230, line: 44, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!232 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !{}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !188, file: !230, line: 49, type: !231, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !188, file: !230, line: 36, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 128, elements: !247)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !240)
!240 = !{!241, !242, !245, !246}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !239, file: !192, line: 115, baseType: !191, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !239, file: !192, line: 141, baseType: !243, size: 8, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !244)
!244 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !239, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !239, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !188, file: !230, line: 40, type: !238, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !188, file: !230, line: 28, type: !253, isLocal: true, isDefinition: true)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !255)
!255 = !{!256, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !254, file: !213, line: 36, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !254, file: !213, line: 37, baseType: !257, size: 32, offset: 32)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !247)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !261, line: 22, baseType: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!263 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!264 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !267, file: !298, line: 50, type: !285, isLocal: true, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !269, globals: !295, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!269 = !{!270, !203, !272, !103, !102, !119, !225, !274, !223, !285, !286}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !271)
!271 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !276, line: 45, size: 64, elements: !277)
!276 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = !{!278, !284}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !275, file: !276, line: 46, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !213, line: 30, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !275, file: !276, line: 48, baseType: !119, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !276, line: 38, size: 64, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !287, file: !276, line: 39, baseType: !279, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !287, file: !276, line: 41, baseType: !291, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !276, line: 35, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !285}
!295 = !{!296, !300, !308, !265, !310, !320}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "latency_lock", scope: !267, file: !298, line: 44, type: !299, isLocal: true, isDefinition: true)
!298 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !267, file: !298, line: 46, type: !302, isLocal: true, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !303, file: !213, line: 36, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !303, file: !213, line: 37, baseType: !306, size: 32, offset: 32)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "latency_subs", scope: !267, file: !298, line: 52, type: !302, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !267, file: !298, line: 39, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, elements: !318)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 35, size: 96, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !298, line: 36, baseType: !191, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !313, file: !298, line: 37, baseType: !243, size: 8, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !313, file: !298, line: 38, baseType: !260, size: 32, offset: 64)
!318 = !{!319}
!319 = !DISubrange(count: 0)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !267, file: !298, line: 48, type: !285, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !324, file: !331, line: 47, type: !345, isLocal: true, isDefinition: true)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !326, retainedTypes: !327, globals: !328, splitDebugInlining: false, nameTableKind: None)
!325 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!326 = !{!191}
!327 = !{!272, !103}
!328 = !{!329, !322, !341}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "cpus_states", scope: !324, file: !331, line: 50, type: !332, isLocal: true, isDefinition: true)
!331 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 32, elements: !247)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !192, line: 115, baseType: !191, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !335, file: !192, line: 141, baseType: !243, size: 8, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !335, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !335, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !324, file: !331, line: 55, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 8, elements: !247)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, elements: !318)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "_cpu_context", scope: !348, file: !353, line: 15, type: !354, isLocal: false, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !350, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/cortex_m/pm_s2ram.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!350 = !{!346, !351}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "marker", scope: !348, file: !353, line: 20, type: !119, isLocal: false, isDefinition: true)
!353 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/cortex_m/pm_s2ram.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpu_context_t", file: !355, line: 69, baseType: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/cortex_m/cpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__cpu_context", file: !355, line: 54, size: 352, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "msp", scope: !356, file: !355, line: 56, baseType: !119, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "msplim", scope: !356, file: !355, line: 57, baseType: !119, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !356, file: !355, line: 58, baseType: !119, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "psplim", scope: !356, file: !355, line: 59, baseType: !119, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "apsr", scope: !356, file: !355, line: 60, baseType: !119, size: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ipsr", scope: !356, file: !355, line: 61, baseType: !119, size: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "epsr", scope: !356, file: !355, line: 62, baseType: !119, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "primask", scope: !356, file: !355, line: 63, baseType: !119, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "faultmask", scope: !356, file: !355, line: 64, baseType: !119, size: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !356, file: !355, line: 65, baseType: !119, size: 32, offset: 288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !356, file: !355, line: 66, baseType: !119, size: 32, offset: 320)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "static_regions", scope: !371, file: !378, line: 62, type: !510, isLocal: true, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !373, globals: !374, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!373 = !{!272, !103, !119, !102}
!374 = !{!375, !369}
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !377, file: !378, line: 198, type: !497, isLocal: true, isDefinition: true)
!377 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !378, file: !378, line: 175, type: !379, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !371, retainedNodes: !494)
!378 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !DISubroutineType(types: !380)
!380 = !{null, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !383, line: 245, size: 1024, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{!385, !450, !463, !464, !465, !466, !472, !489}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !382, file: !383, line: 247, baseType: !386, size: 384)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !383, line: 57, size: 384, elements: !387)
!387 = !{!388, !416, !424, !425, !426, !437, !438, !439}
!388 = !DIDerivedType(tag: DW_TAG_member, scope: !386, file: !383, line: 60, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !386, file: !383, line: 60, size: 64, elements: !390)
!390 = !{!391, !407}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !389, file: !383, line: 61, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !393, line: 49, baseType: !394)
!393 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !393, line: 37, size: 64, elements: !395)
!395 = !{!396, !402}
!396 = !DIDerivedType(tag: DW_TAG_member, scope: !394, file: !393, line: 38, baseType: !397, size: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !394, file: !393, line: 38, size: 32, elements: !398)
!398 = !{!399, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !397, file: !393, line: 39, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !393, line: 40, baseType: !400, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, scope: !394, file: !393, line: 42, baseType: !403, size: 32, offset: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !394, file: !393, line: 42, size: 32, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !403, file: !393, line: 43, baseType: !400, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !393, line: 44, baseType: !400, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !389, file: !383, line: 62, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !409, line: 49, size: 64, elements: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !408, file: !409, line: 50, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 64, elements: !414)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!414 = !{!415}
!415 = !DISubrange(count: 2)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !386, file: !383, line: 68, baseType: !417, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !419, line: 233, baseType: !420)
!419 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 231, size: 64, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !420, file: !419, line: 232, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !393, line: 48, baseType: !394)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !386, file: !383, line: 71, baseType: !243, size: 8, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !386, file: !383, line: 74, baseType: !243, size: 8, offset: 104)
!426 = !DIDerivedType(tag: DW_TAG_member, scope: !386, file: !383, line: 90, baseType: !427, size: 16, offset: 112)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !386, file: !383, line: 90, size: 16, elements: !428)
!428 = !{!429, !436}
!429 = !DIDerivedType(tag: DW_TAG_member, scope: !427, file: !383, line: 91, baseType: !430, size: 16)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !383, line: 91, size: 16, elements: !431)
!431 = !{!432, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !430, file: !383, line: 96, baseType: !433, size: 8)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !434)
!434 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !430, file: !383, line: 97, baseType: !243, size: 8, offset: 8)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !427, file: !383, line: 100, baseType: !171, size: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !386, file: !383, line: 107, baseType: !119, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !386, file: !383, line: 127, baseType: !102, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !386, file: !383, line: 131, baseType: !440, size: 192, offset: 192)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !419, line: 244, size: 192, elements: !441)
!441 = !{!442, !443, !449}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !440, file: !419, line: 245, baseType: !392, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !440, file: !419, line: 246, baseType: !444, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !419, line: 242, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !440, file: !419, line: 249, baseType: !205, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !382, file: !383, line: 250, baseType: !451, size: 288, offset: 384)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !452, line: 25, size: 288, elements: !453)
!452 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !451, file: !452, line: 26, baseType: !119, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !451, file: !452, line: 27, baseType: !119, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !451, file: !452, line: 28, baseType: !119, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !451, file: !452, line: 29, baseType: !119, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !451, file: !452, line: 30, baseType: !119, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !451, file: !452, line: 31, baseType: !119, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !451, file: !452, line: 32, baseType: !119, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !451, file: !452, line: 33, baseType: !119, size: 32, offset: 224)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !451, file: !452, line: 34, baseType: !119, size: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !382, file: !383, line: 253, baseType: !102, size: 32, offset: 672)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !382, file: !383, line: 256, baseType: !418, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !382, file: !383, line: 294, baseType: !103, size: 32, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !382, file: !383, line: 300, baseType: !467, size: 96, offset: 800)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !383, line: 149, size: 96, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !467, file: !383, line: 153, baseType: !22, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !467, file: !383, line: 162, baseType: !272, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !467, file: !383, line: 168, baseType: !272, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !382, file: !383, line: 325, baseType: !473, size: 32, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !475, line: 5073, size: 160, elements: !476)
!475 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !{!477, !486, !487}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !474, file: !475, line: 5074, baseType: !478, size: 96)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !479, line: 56, size: 96, elements: !480)
!479 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = !{!481, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !478, file: !479, line: 57, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !479, line: 57, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !478, file: !479, line: 58, baseType: !102, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !478, file: !479, line: 59, baseType: !272, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !474, file: !475, line: 5075, baseType: !418, size: 64, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !474, file: !475, line: 5076, baseType: !488, offset: 160)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !382, file: !383, line: 343, baseType: !490, size: 64, offset: 928)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !452, line: 60, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !490, file: !452, line: 63, baseType: !119, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !490, file: !452, line: 66, baseType: !119, size: 32, offset: 32)
!494 = !{!495, !496}
!495 = !DILocalVariable(name: "thread", arg: 1, scope: !377, file: !378, line: 175, type: !381)
!496 = !DILocalVariable(name: "region_num", scope: !377, file: !378, line: 200, type: !243)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, elements: !318)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !499, line: 52, size: 96, elements: !500)
!499 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !498, file: !499, line: 53, baseType: !22, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !498, file: !499, line: 54, baseType: !272, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !498, file: !499, line: 55, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !505, line: 304, baseType: !506)
!505 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 301, size: 32, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !506, file: !505, line: 302, baseType: !171, size: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !506, file: !505, line: 303, baseType: !171, size: 16, offset: 16)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 96, elements: !247)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !514, file: !570, line: 39, type: !243, isLocal: true, isDefinition: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !516, globals: !561, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!516 = !{!517, !102, !103, !545}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !519, line: 1495, baseType: !520)
!519 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 1474, size: 448, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !520, file: !519, line: 1476, baseType: !133, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !520, file: !519, line: 1477, baseType: !134, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !520, file: !519, line: 1478, baseType: !134, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !520, file: !519, line: 1479, baseType: !134, size: 32, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !520, file: !519, line: 1480, baseType: !134, size: 32, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !520, file: !519, line: 1481, baseType: !134, size: 32, offset: 160)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !520, file: !519, line: 1482, baseType: !134, size: 32, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !520, file: !519, line: 1483, baseType: !134, size: 32, offset: 224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !520, file: !519, line: 1484, baseType: !134, size: 32, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !520, file: !519, line: 1485, baseType: !134, size: 32, offset: 288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !520, file: !519, line: 1486, baseType: !134, size: 32, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !520, file: !519, line: 1487, baseType: !534, size: 32, offset: 352)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !247)
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !520, file: !519, line: 1488, baseType: !536, size: 64, offset: 384)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !520, file: !519, line: 1488, size: 64, elements: !537)
!537 = !{!538, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !536, file: !519, line: 1489, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !414)
!540 = !DIDerivedType(tag: DW_TAG_member, scope: !536, file: !519, line: 1490, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !536, file: !519, line: 1490, size: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !541, file: !519, line: 1491, baseType: !134, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !541, file: !519, line: 1492, baseType: !134, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !548, line: 27, size: 128, elements: !549)
!548 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = !{!550, !551, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !547, file: !548, line: 29, baseType: !119, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !547, file: !548, line: 31, baseType: !552, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !547, file: !548, line: 37, baseType: !555, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !505, line: 298, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !505, line: 289, size: 64, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !556, file: !505, line: 291, baseType: !243, size: 5, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !556, file: !505, line: 293, baseType: !243, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !556, file: !505, line: 295, baseType: !119, size: 32, offset: 32)
!561 = !{!512, !562}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !514, file: !564, line: 31, type: !565, isLocal: true, isDefinition: true)
!564 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 160, elements: !247)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !564, line: 21, size: 160, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !566, file: !564, line: 22, baseType: !103, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !566, file: !564, line: 23, baseType: !547, size: 128, offset: 32)
!570 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !573, file: !580, line: 21, type: !106, isLocal: true, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !575, globals: !579, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!575 = !{!576, !103, !102}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !578, line: 22, baseType: !103)
!578 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !{!571}
!580 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !583, file: !588, line: 13, type: !607, isLocal: true, isDefinition: true)
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !585, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!585 = !{!586, !581}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "mpu_config", scope: !583, file: !588, line: 37, type: !589, isLocal: false, isDefinition: true)
!588 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !548, line: 41, size: 64, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !590, file: !548, line: 43, baseType: !119, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !590, file: !548, line: 45, baseType: !594, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !548, line: 27, size: 128, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !596, file: !548, line: 29, baseType: !119, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !548, line: 31, baseType: !552, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !596, file: !548, line: 37, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !505, line: 298, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !505, line: 289, size: 64, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !602, file: !505, line: 291, baseType: !243, size: 5, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !602, file: !505, line: 293, baseType: !243, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !602, file: !505, line: 295, baseType: !119, size: 32, offset: 32)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 256, elements: !414)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "__device_dts_ord_65", scope: !610, file: !815, line: 733, type: !921, isLocal: false, isDefinition: true, align: 32)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !612, retainedTypes: !730, globals: !811, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/s2ram")
!612 = !{!613, !619, !30, !624, !629, !633, !637, !641, !647, !651, !695, !702, !721}
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !614, line: 23, baseType: !32, size: 32, elements: !615)
!614 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = !{!616, !617, !618}
!616 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!617 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!618 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !614, line: 48, baseType: !32, size: 32, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!622 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!623 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 167, baseType: !32, size: 32, elements: !626)
!625 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!626 = !{!627, !628}
!627 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!628 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 107, baseType: !32, size: 32, elements: !630)
!630 = !{!631, !632}
!631 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!632 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 208, baseType: !32, size: 32, elements: !634)
!634 = !{!635, !636}
!635 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!636 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 261, baseType: !32, size: 32, elements: !638)
!638 = !{!639, !640}
!639 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!640 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 237, baseType: !32, size: 32, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!644 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!645 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!646 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 152, baseType: !32, size: 32, elements: !648)
!648 = !{!649, !650}
!649 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!650 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 71, baseType: !103, size: 32, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!653 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!654 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!655 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!656 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!657 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!658 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!659 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!660 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!661 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!662 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!663 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!664 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!665 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!666 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!667 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!668 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!669 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!670 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!671 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!672 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!673 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!674 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!675 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!676 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!677 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!678 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!679 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!680 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!681 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!682 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!683 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!684 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!685 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!686 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!687 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!688 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!689 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!690 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!691 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!692 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!693 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!694 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !696, line: 44, baseType: !32, size: 32, elements: !697)
!696 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !{!698, !699, !700, !701}
!698 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!699 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!700 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!701 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !703, line: 54, baseType: !32, size: 32, elements: !704)
!703 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!705 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!706 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!707 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!708 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!709 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!710 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!711 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!712 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!713 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!714 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!715 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!716 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!717 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!718 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!719 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!720 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!721 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 53, baseType: !32, size: 32, elements: !723)
!722 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!723 = !{!724, !725, !726, !727, !728, !729}
!724 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!725 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!726 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!727 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!728 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!729 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!730 = !{!613, !102, !103, !731, !773, !774, !775, !776, !203, !119, !225, !777, !778, !779, !285, !780, !810, !272}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !128, line: 923, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 883, size: 10464, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !743, !744, !745, !746, !747, !748, !749, !750, !754, !755, !756, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !733, file: !128, line: 884, baseType: !134, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !733, file: !128, line: 885, baseType: !134, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !733, file: !128, line: 886, baseType: !134, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !733, file: !128, line: 887, baseType: !134, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !733, file: !128, line: 888, baseType: !740, size: 896, offset: 128)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 28)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !733, file: !128, line: 889, baseType: !134, size: 32, offset: 1024)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !733, file: !128, line: 890, baseType: !134, size: 32, offset: 1056)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !733, file: !128, line: 891, baseType: !134, size: 32, offset: 1088)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !733, file: !128, line: 892, baseType: !134, size: 32, offset: 1120)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !733, file: !128, line: 893, baseType: !740, size: 896, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !733, file: !128, line: 894, baseType: !134, size: 32, offset: 2048)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !733, file: !128, line: 895, baseType: !134, size: 32, offset: 2080)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !733, file: !128, line: 896, baseType: !751, size: 960, offset: 2112)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 960, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 30)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !733, file: !128, line: 897, baseType: !134, size: 32, offset: 3072)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !733, file: !128, line: 898, baseType: !134, size: 32, offset: 3104)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !733, file: !128, line: 899, baseType: !757, size: 3008, offset: 3136)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3008, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 94)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !733, file: !128, line: 900, baseType: !134, size: 32, offset: 6144)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !733, file: !128, line: 901, baseType: !134, size: 32, offset: 6176)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !733, file: !128, line: 902, baseType: !134, size: 32, offset: 6208)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !733, file: !128, line: 903, baseType: !133, size: 32, offset: 6240)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !733, file: !128, line: 904, baseType: !141, size: 1984, offset: 6272)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !733, file: !128, line: 905, baseType: !133, size: 32, offset: 8256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !733, file: !128, line: 907, baseType: !133, size: 32, offset: 8288)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !733, file: !128, line: 910, baseType: !133, size: 32, offset: 8320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !733, file: !128, line: 911, baseType: !133, size: 32, offset: 8352)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !733, file: !128, line: 913, baseType: !133, size: 32, offset: 8384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !733, file: !128, line: 917, baseType: !133, size: 32, offset: 8416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !733, file: !128, line: 919, baseType: !141, size: 1984, offset: 8448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !733, file: !128, line: 920, baseType: !134, size: 32, offset: 10432)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !625, line: 146, baseType: !629)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !625, line: 164, baseType: !647)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!777 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !519, line: 485, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 468, size: 28704, elements: !783)
!783 = !{!784, !788, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !805, !809}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !782, file: !519, line: 470, baseType: !785, size: 512)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 16)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !782, file: !519, line: 471, baseType: !789, size: 512, offset: 512)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !786)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !782, file: !519, line: 472, baseType: !785, size: 512, offset: 1024)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !782, file: !519, line: 473, baseType: !789, size: 512, offset: 1536)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !782, file: !519, line: 474, baseType: !785, size: 512, offset: 2048)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !782, file: !519, line: 475, baseType: !789, size: 512, offset: 2560)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !782, file: !519, line: 476, baseType: !785, size: 512, offset: 3072)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !782, file: !519, line: 477, baseType: !789, size: 512, offset: 3584)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !782, file: !519, line: 478, baseType: !785, size: 512, offset: 4096)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !782, file: !519, line: 479, baseType: !789, size: 512, offset: 4608)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !782, file: !519, line: 480, baseType: !785, size: 512, offset: 5120)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !782, file: !519, line: 481, baseType: !789, size: 512, offset: 5632)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !782, file: !519, line: 482, baseType: !801, size: 3968, offset: 6144)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 3968, elements: !803)
!802 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !243)
!803 = !{!804}
!804 = !DISubrange(count: 496)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !782, file: !519, line: 483, baseType: !806, size: 18560, offset: 10112)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 18560, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 580)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !782, file: !519, line: 484, baseType: !134, size: 32, offset: 28672)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !696, line: 56, baseType: !102)
!811 = !{!812, !862, !903, !608, !911, !937, !939, !956, !958, !968, !971, !986, !1024, !1038}
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "on", scope: !814, file: !815, line: 549, type: !260, isLocal: true, isDefinition: true)
!814 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !815, file: !815, line: 547, type: !816, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !610, retainedNodes: !818)
!815 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !DISubroutineType(types: !817)
!817 = !{null, !619}
!818 = !{!819, !820, !823}
!819 = !DILocalVariable(name: "start_mode", arg: 1, scope: !814, file: !815, line: 547, type: !619)
!820 = !DILocalVariable(name: "err", scope: !821, file: !815, line: 553, type: !103)
!821 = distinct !DILexicalBlock(scope: !822, file: !815, line: 552, column: 31)
!822 = distinct !DILexicalBlock(scope: !814, file: !815, line: 552, column: 6)
!823 = !DILocalVariable(name: "mgr", scope: !821, file: !815, line: 554, type: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !826, line: 154, size: 224, elements: !827)
!826 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = !{!828, !840, !841, !857, !859, !860, !861}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !825, file: !826, line: 158, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !831)
!831 = !{!832, !839}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !830, file: !213, line: 36, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !836)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !835, file: !213, line: 30, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !830, file: !213, line: 37, baseType: !833, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !825, file: !826, line: 163, baseType: !829, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !825, file: !826, line: 166, baseType: !842, size: 32, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !826, line: 133, size: 96, elements: !845)
!845 = !{!846, !855, !856}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !844, file: !826, line: 135, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !826, line: 129, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !824, !851}
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !826, line: 101, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !824, !103}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !844, file: !826, line: 138, baseType: !847, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !844, file: !826, line: 143, baseType: !847, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !825, file: !826, line: 169, baseType: !858, offset: 160)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !825, file: !826, line: 172, baseType: !103, size: 32, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !825, file: !826, line: 175, baseType: !171, size: 16, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !825, file: !826, line: 178, baseType: !171, size: 16, offset: 208)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "cli", scope: !814, file: !815, line: 550, type: !864, isLocal: true, isDefinition: true)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !826, line: 273, size: 128, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !864, file: !826, line: 280, baseType: !834, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !864, file: !826, line: 283, baseType: !868, size: 96, offset: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !869, line: 138, size: 96, elements: !870)
!869 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!870 = !{!871, !900, !901}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !868, file: !869, line: 149, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !869, line: 139, size: 32, elements: !873)
!873 = !{!874, !895}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !872, file: !869, line: 145, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !475, line: 5397, size: 128, elements: !877)
!877 = !{!878, !893, !894}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !876, file: !475, line: 5399, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !393, line: 48, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !393, line: 37, size: 64, elements: !881)
!881 = !{!882, !888}
!882 = !DIDerivedType(tag: DW_TAG_member, scope: !880, file: !393, line: 38, baseType: !883, size: 32)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !880, file: !393, line: 38, size: 32, elements: !884)
!884 = !{!885, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !883, file: !393, line: 39, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !883, file: !393, line: 40, baseType: !886, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, scope: !880, file: !393, line: 42, baseType: !889, size: 32, offset: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !880, file: !393, line: 42, size: 32, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !889, file: !393, line: 43, baseType: !886, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !889, file: !393, line: 44, baseType: !886, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !876, file: !475, line: 5405, baseType: !32, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !876, file: !475, line: 5408, baseType: !103, size: 32, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !872, file: !869, line: 148, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !869, line: 98, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{null, null}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !868, file: !869, line: 165, baseType: !134, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !868, file: !869, line: 174, baseType: !902, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !610, file: !815, line: 733, type: !905, isLocal: false, isDefinition: true, align: 16)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 80, elements: !909)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !908, line: 43, baseType: !270)
!908 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!909 = !{!910}
!910 = !DISubrange(count: 5)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_65", scope: !610, file: !815, line: 733, type: !913, isLocal: true, isDefinition: true, align: 32)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !915)
!915 = !{!916, !936}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !914, file: !176, line: 60, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{!103, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !908, line: 378, size: 192, elements: !923)
!923 = !{!924, !925, !926, !927, !933, !934}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !922, file: !908, line: 380, baseType: !552, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !922, file: !908, line: 382, baseType: !13, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !922, file: !908, line: 384, baseType: !13, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !922, file: !908, line: 386, baseType: !928, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !908, line: 351, size: 16, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !929, file: !908, line: 359, baseType: !243, size: 8)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !929, file: !908, line: 364, baseType: !777, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !922, file: !908, line: 388, baseType: !102, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !922, file: !908, line: 396, baseType: !935, size: 32, offset: 160)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !914, file: !176, line: 65, baseType: !920, size: 32, offset: 32)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !610, file: !815, line: 79, type: !260, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "data", scope: !610, file: !815, line: 702, type: !941, isLocal: true, isDefinition: true)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !815, line: 69, size: 640, elements: !942)
!942 = !{!943, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !941, file: !815, line: 70, baseType: !944, size: 448)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 448, elements: !414)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !941, file: !815, line: 71, baseType: !946, size: 192, offset: 448)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 192, elements: !414)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !815, line: 52, size: 96, elements: !948)
!948 = !{!949, !954, !955}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !947, file: !815, line: 53, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !696, line: 72, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !920, !810, !102}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !947, file: !815, line: 54, baseType: !102, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !947, file: !815, line: 55, baseType: !119, size: 32, offset: 64)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_65", scope: !610, file: !815, line: 733, type: !929, isLocal: true, isDefinition: true, align: 8)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "d", scope: !960, file: !815, line: 476, type: !966, isLocal: true, isDefinition: true)
!960 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !815, file: !815, line: 474, type: !816, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !610, retainedNodes: !961)
!961 = !{!962, !963, !964, !965}
!962 = !DILocalVariable(name: "mode", arg: 1, scope: !960, file: !815, line: 474, type: !619)
!963 = !DILocalVariable(name: "type", scope: !960, file: !815, line: 486, type: !773)
!964 = !DILocalVariable(name: "isr_mode", scope: !960, file: !815, line: 500, type: !777)
!965 = !DILocalVariable(name: "key", scope: !960, file: !815, line: 501, type: !103)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !625, line: 177, baseType: !624)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "target_type", scope: !960, file: !815, line: 477, type: !970, isLocal: true, isDefinition: true)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "config", scope: !610, file: !815, line: 704, type: !973, isLocal: true, isDefinition: true)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !815, line: 74, size: 128, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !974, file: !815, line: 76, baseType: !977, size: 128)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 128, elements: !414)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !815, line: 61, size: 64, elements: !979)
!979 = !{!980, !985}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !978, file: !815, line: 62, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !815, line: 58, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{null}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !978, file: !815, line: 63, baseType: !981, size: 32, offset: 32)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !610, file: !815, line: 695, type: !988, isLocal: true, isDefinition: true)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !696, line: 100, size: 224, elements: !990)
!990 = !{!991, !996, !997, !1002, !1008, !1013, !1019}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !989, file: !696, line: 101, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !696, line: 76, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DISubroutineType(types: !995)
!995 = !{!103, !920, !810}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !989, file: !696, line: 102, baseType: !992, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !989, file: !696, line: 103, baseType: !998, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !696, line: 83, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!103, !920, !810, !950, !102}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !989, file: !696, line: 104, baseType: !1003, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !696, line: 79, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!103, !920, !810, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !989, file: !696, line: 105, baseType: !1009, size: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !696, line: 88, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!695, !920, !810}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !989, file: !696, line: 106, baseType: !1014, size: 32, offset: 160)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !696, line: 92, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!103, !920, !810, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !696, line: 64, baseType: !102)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !989, file: !696, line: 107, baseType: !1020, size: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !696, line: 96, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!103, !920, !810, !102}
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "transitions", scope: !1026, file: !815, line: 655, type: !843, isLocal: true, isDefinition: true)
!1026 = distinct !DISubprogram(name: "clk_init", scope: !815, file: !815, line: 651, type: !918, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !610, retainedNodes: !1027)
!1027 = !{!1028, !1029, !1031, !1032, !1034}
!1028 = !DILocalVariable(name: "dev", arg: 1, scope: !1026, file: !815, line: 651, type: !920)
!1029 = !DILocalVariable(name: "nrfx_err", scope: !1026, file: !815, line: 653, type: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !703, line: 72, baseType: !702)
!1031 = !DILocalVariable(name: "err", scope: !1026, file: !815, line: 654, type: !103)
!1032 = !DILocalVariable(name: "i", scope: !1033, file: !815, line: 678, type: !613)
!1033 = distinct !DILexicalBlock(scope: !1026, file: !815, line: 678, column: 2)
!1034 = !DILocalVariable(name: "subdata", scope: !1035, file: !815, line: 680, type: !1037)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !815, line: 679, column: 42)
!1036 = distinct !DILexicalBlock(scope: !1033, file: !815, line: 678, column: 2)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !1026, file: !815, line: 660, type: !1040, isLocal: true, isDefinition: true, align: 32)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1040, file: !10, line: 55, baseType: !285, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1040, file: !10, line: 57, baseType: !285, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1040, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
