; ModuleID = 'build/adafruit_feather_m0_lora/subsys/console/echo/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.tty_serial = type { %struct.device*, %struct.k_sem, i8*, i32, i16, i16, i32, %struct.k_sem, i8*, i32, i16, i16, i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %union.anon }
%struct._sflist = type { %struct.z_heap_bucket*, %struct.z_heap_bucket* }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%struct.console_input = type { i32, i8, [128 x i8] }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/console/echo/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/console/echo")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/console/echo")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "prompt", scope: !27, file: !105, line: 9, type: !106, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/console/echo")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 400, elements: !109)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !{!110}
!110 = !DISubrange(count: 50)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "_char_out", scope: !113, file: !116, line: 54, type: !117, isLocal: false, isDefinition: true)
!113 = distinct !DICompileUnit(language: DW_LANG_C99, file: !114, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !115, splitDebugInlining: false, nameTableKind: None)
!114 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/console/echo")
!115 = !{!111}
!116 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!103, !103}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !122, file: !863, line: 202, type: !864, isLocal: true, isDefinition: true, align: 32)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !124, globals: !862, splitDebugInlining: false, nameTableKind: None)
!123 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/console/echo")
!124 = !{!102, !103, !125, !254, !593, !594, !661}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !127, line: 335, baseType: !128)
!127 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 320, size: 288, elements: !129)
!129 = !{!130, !143, !153, !168, !179, !190, !194, !205, !206, !217, !218, !233, !234, !244}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !128, file: !127, line: 321, baseType: !131, size: 16)
!131 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !127, line: 50, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 43, size: 16, elements: !134)
!134 = !{!135, !142}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !133, file: !127, line: 48, baseType: !136, size: 16)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !133, file: !127, line: 44, size: 16, elements: !137)
!137 = !{!138, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !136, file: !127, line: 45, baseType: !139, size: 7, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !140)
!140 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !136, file: !127, line: 47, baseType: !139, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !133, file: !127, line: 49, baseType: !139, size: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !128, file: !127, line: 322, baseType: !144, size: 16, offset: 16)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 16, elements: !151)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !146, line: 52, baseType: !147)
!146 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !150)
!150 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152}
!152 = !DISubrange(count: 2)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !128, file: !127, line: 323, baseType: !154, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !127, line: 107, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 94, size: 32, elements: !157)
!157 = !{!158, !167}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !156, file: !127, line: 105, baseType: !159, size: 32)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !127, line: 95, size: 32, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !159, file: !127, line: 97, baseType: !162, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !159, file: !127, line: 99, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !159, file: !127, line: 100, baseType: !162, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !159, file: !127, line: 102, baseType: !162, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !159, file: !127, line: 103, baseType: !162, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !156, file: !127, line: 106, baseType: !162, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !128, file: !127, line: 324, baseType: !169, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !127, line: 155, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 148, size: 32, elements: !172)
!172 = !{!173, !178}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !171, file: !127, line: 153, baseType: !174, size: 32)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !127, line: 149, size: 32, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !174, file: !127, line: 150, baseType: !162, size: 16, flags: DIFlagBitField, extraData: i64 0)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !174, file: !127, line: 151, baseType: !162, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !171, file: !127, line: 154, baseType: !162, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !128, file: !127, line: 325, baseType: !180, size: 8, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !127, line: 194, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 187, size: 8, elements: !183)
!183 = !{!184, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !182, file: !127, line: 192, baseType: !185, size: 8)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !127, line: 188, size: 8, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !185, file: !127, line: 189, baseType: !149, size: 1, flags: DIFlagBitField, extraData: i64 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !185, file: !127, line: 190, baseType: !149, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !182, file: !127, line: 193, baseType: !149, size: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !128, file: !127, line: 326, baseType: !191, size: 24, offset: 104)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 24, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 3)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !128, file: !127, line: 327, baseType: !195, size: 8, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !127, line: 215, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 208, size: 8, elements: !198)
!198 = !{!199, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !197, file: !127, line: 213, baseType: !200, size: 8)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !197, file: !127, line: 209, size: 8, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !200, file: !127, line: 210, baseType: !149, size: 1, flags: DIFlagBitField, extraData: i64 0)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !200, file: !127, line: 211, baseType: !149, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !197, file: !127, line: 214, baseType: !149, size: 8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !128, file: !127, line: 328, baseType: !191, size: 24, offset: 136)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !128, file: !127, line: 329, baseType: !207, size: 8, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !127, line: 236, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 229, size: 8, elements: !210)
!210 = !{!211, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !209, file: !127, line: 234, baseType: !212, size: 8)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !127, line: 230, size: 8, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !212, file: !127, line: 231, baseType: !147, size: 1, flags: DIFlagBitField, extraData: i64 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !212, file: !127, line: 232, baseType: !147, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !209, file: !127, line: 235, baseType: !149, size: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !128, file: !127, line: 330, baseType: !191, size: 24, offset: 168)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !128, file: !127, line: 331, baseType: !219, size: 16, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !127, line: 262, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 250, size: 16, elements: !222)
!222 = !{!223, !232}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !221, file: !127, line: 260, baseType: !224, size: 16)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !221, file: !127, line: 251, size: 16, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !224, file: !127, line: 252, baseType: !139, size: 1, flags: DIFlagBitField, extraData: i64 0)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !224, file: !127, line: 253, baseType: !139, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !224, file: !127, line: 254, baseType: !139, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !224, file: !127, line: 255, baseType: !139, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !224, file: !127, line: 256, baseType: !139, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !224, file: !127, line: 258, baseType: !139, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !221, file: !127, line: 261, baseType: !139, size: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !128, file: !127, line: 332, baseType: !144, size: 16, offset: 208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !128, file: !127, line: 333, baseType: !235, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !127, line: 290, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 284, size: 32, elements: !238)
!238 = !{!239, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !237, file: !127, line: 288, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !127, line: 285, size: 32, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !240, file: !127, line: 286, baseType: !162, size: 22, flags: DIFlagBitField, extraData: i64 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !237, file: !127, line: 289, baseType: !162, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !128, file: !127, line: 334, baseType: !245, size: 16, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !127, line: 308, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !127, line: 303, size: 16, elements: !248)
!248 = !{!249, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !247, file: !127, line: 306, baseType: !250, size: 16)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !247, file: !127, line: 304, size: 16, elements: !251)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !250, file: !127, line: 305, baseType: !139, size: 16, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !247, file: !127, line: 307, baseType: !139, size: 16)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !256, line: 928, baseType: !257)
!256 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !256, line: 899, size: 672, elements: !258)
!258 = !{!259, !283, !307, !333, !358, !374, !375, !393, !394, !411, !422, !423, !438, !458, !459, !471, !483, !493, !494, !511, !515, !526, !527, !539, !551, !552, !563, !579}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !257, file: !256, line: 900, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !256, line: 64, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 43, size: 32, elements: !263)
!263 = !{!264, !282}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !262, file: !256, line: 62, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !256, line: 44, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !265, file: !256, line: 45, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !265, file: !256, line: 46, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !265, file: !256, line: 47, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !265, file: !256, line: 48, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !265, file: !256, line: 49, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !265, file: !256, line: 50, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !265, file: !256, line: 51, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !265, file: !256, line: 52, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !265, file: !256, line: 53, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !265, file: !256, line: 54, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !265, file: !256, line: 55, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !265, file: !256, line: 56, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !265, file: !256, line: 58, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !265, file: !256, line: 59, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !265, file: !256, line: 60, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !262, file: !256, line: 63, baseType: !162, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !257, file: !256, line: 901, baseType: !284, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !256, line: 125, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 104, size: 32, elements: !287)
!287 = !{!288, !306}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !286, file: !256, line: 123, baseType: !289, size: 32)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !256, line: 105, size: 32, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !289, file: !256, line: 106, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !289, file: !256, line: 107, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !289, file: !256, line: 108, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !289, file: !256, line: 109, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !289, file: !256, line: 110, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !289, file: !256, line: 111, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !289, file: !256, line: 112, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !289, file: !256, line: 113, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !289, file: !256, line: 114, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !289, file: !256, line: 115, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !289, file: !256, line: 116, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !289, file: !256, line: 117, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !289, file: !256, line: 119, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !289, file: !256, line: 120, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !289, file: !256, line: 121, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !286, file: !256, line: 124, baseType: !162, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !257, file: !256, line: 902, baseType: !308, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !256, line: 186, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 165, size: 32, elements: !311)
!311 = !{!312, !332}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !310, file: !256, line: 184, baseType: !313, size: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !310, file: !256, line: 166, size: 32, elements: !314)
!314 = !{!315, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !313, file: !256, line: 167, baseType: !316, size: 1, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !313, file: !256, line: 168, baseType: !316, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !313, file: !256, line: 169, baseType: !316, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !313, file: !256, line: 170, baseType: !316, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !313, file: !256, line: 171, baseType: !316, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !313, file: !256, line: 172, baseType: !316, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !313, file: !256, line: 173, baseType: !316, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !313, file: !256, line: 174, baseType: !316, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !313, file: !256, line: 175, baseType: !316, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !313, file: !256, line: 176, baseType: !316, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !313, file: !256, line: 177, baseType: !316, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !313, file: !256, line: 178, baseType: !316, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !313, file: !256, line: 180, baseType: !316, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !313, file: !256, line: 181, baseType: !316, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !313, file: !256, line: 182, baseType: !316, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !310, file: !256, line: 185, baseType: !162, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !257, file: !256, line: 903, baseType: !334, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !256, line: 247, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 226, size: 32, elements: !338)
!338 = !{!339, !357}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !337, file: !256, line: 245, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !256, line: 227, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !340, file: !256, line: 228, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !340, file: !256, line: 229, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !340, file: !256, line: 230, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !340, file: !256, line: 231, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !340, file: !256, line: 232, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !340, file: !256, line: 233, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !340, file: !256, line: 234, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !340, file: !256, line: 235, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !340, file: !256, line: 236, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !340, file: !256, line: 237, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !340, file: !256, line: 238, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !340, file: !256, line: 239, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !340, file: !256, line: 241, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !340, file: !256, line: 242, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !340, file: !256, line: 243, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !337, file: !256, line: 246, baseType: !162, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !257, file: !256, line: 904, baseType: !359, size: 16, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !256, line: 300, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 287, size: 16, elements: !362)
!362 = !{!363, !373}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !361, file: !256, line: 298, baseType: !364, size: 16)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !361, file: !256, line: 288, size: 16, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !364, file: !256, line: 290, baseType: !139, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !364, file: !256, line: 291, baseType: !139, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !364, file: !256, line: 293, baseType: !139, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !364, file: !256, line: 294, baseType: !139, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !364, file: !256, line: 295, baseType: !139, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !364, file: !256, line: 296, baseType: !139, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !364, file: !256, line: 297, baseType: !139, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !361, file: !256, line: 299, baseType: !139, size: 16)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !257, file: !256, line: 905, baseType: !144, size: 16, offset: 144)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !257, file: !256, line: 906, baseType: !376, size: 16, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !256, line: 352, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 336, size: 16, elements: !379)
!379 = !{!380, !392}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !378, file: !256, line: 350, baseType: !381, size: 16)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !378, file: !256, line: 337, size: 16, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !381, file: !256, line: 339, baseType: !139, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !381, file: !256, line: 340, baseType: !139, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !381, file: !256, line: 341, baseType: !139, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !381, file: !256, line: 342, baseType: !139, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !381, file: !256, line: 343, baseType: !139, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !381, file: !256, line: 344, baseType: !139, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !381, file: !256, line: 345, baseType: !139, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !381, file: !256, line: 346, baseType: !139, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !381, file: !256, line: 348, baseType: !139, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !378, file: !256, line: 351, baseType: !139, size: 16)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !257, file: !256, line: 907, baseType: !144, size: 16, offset: 176)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !257, file: !256, line: 908, baseType: !395, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !256, line: 398, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 381, size: 32, elements: !398)
!398 = !{!399, !410}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !397, file: !256, line: 396, baseType: !400, size: 32)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !397, file: !256, line: 382, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !400, file: !256, line: 384, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !400, file: !256, line: 385, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !400, file: !256, line: 386, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !400, file: !256, line: 388, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !400, file: !256, line: 389, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !400, file: !256, line: 390, baseType: !162, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !400, file: !256, line: 392, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !400, file: !256, line: 394, baseType: !162, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !397, file: !256, line: 397, baseType: !162, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !257, file: !256, line: 909, baseType: !412, size: 8, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !256, line: 433, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 426, size: 8, elements: !415)
!415 = !{!416, !421}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !414, file: !256, line: 431, baseType: !417, size: 8)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !256, line: 427, size: 8, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !417, file: !256, line: 428, baseType: !149, size: 5, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !417, file: !256, line: 430, baseType: !149, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !414, file: !256, line: 432, baseType: !149, size: 8)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !257, file: !256, line: 910, baseType: !191, size: 24, offset: 232)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !257, file: !256, line: 911, baseType: !424, size: 32, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !256, line: 462, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 448, size: 32, elements: !427)
!427 = !{!428, !437}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !426, file: !256, line: 460, baseType: !429, size: 32)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !426, file: !256, line: 449, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !429, file: !256, line: 451, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !429, file: !256, line: 453, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !429, file: !256, line: 454, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !429, file: !256, line: 455, baseType: !162, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !429, file: !256, line: 457, baseType: !162, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !429, file: !256, line: 459, baseType: !162, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !426, file: !256, line: 461, baseType: !162, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !257, file: !256, line: 912, baseType: !439, size: 16, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !256, line: 520, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 503, size: 16, elements: !442)
!442 = !{!443, !457}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !441, file: !256, line: 518, baseType: !444, size: 16)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !256, line: 504, size: 16, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !444, file: !256, line: 506, baseType: !139, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !444, file: !256, line: 507, baseType: !139, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !444, file: !256, line: 508, baseType: !139, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !444, file: !256, line: 509, baseType: !139, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !444, file: !256, line: 510, baseType: !139, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !444, file: !256, line: 511, baseType: !139, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !444, file: !256, line: 512, baseType: !139, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !444, file: !256, line: 513, baseType: !139, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !444, file: !256, line: 514, baseType: !139, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !444, file: !256, line: 515, baseType: !139, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !444, file: !256, line: 516, baseType: !139, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !441, file: !256, line: 519, baseType: !139, size: 16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !257, file: !256, line: 913, baseType: !144, size: 16, offset: 304)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !257, file: !256, line: 914, baseType: !460, size: 32, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !256, line: 559, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 552, size: 32, elements: !463)
!463 = !{!464, !470}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !462, file: !256, line: 557, baseType: !465, size: 32)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !462, file: !256, line: 553, size: 32, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !465, file: !256, line: 554, baseType: !162, size: 10, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !465, file: !256, line: 555, baseType: !162, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !465, file: !256, line: 556, baseType: !162, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !462, file: !256, line: 558, baseType: !162, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !257, file: !256, line: 915, baseType: !472, size: 32, offset: 352)
!472 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !256, line: 585, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 578, size: 32, elements: !475)
!475 = !{!476, !482}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !474, file: !256, line: 583, baseType: !477, size: 32)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !256, line: 579, size: 32, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !477, file: !256, line: 580, baseType: !162, size: 16, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !477, file: !256, line: 581, baseType: !162, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !477, file: !256, line: 582, baseType: !162, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !474, file: !256, line: 584, baseType: !162, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !257, file: !256, line: 916, baseType: !484, size: 8, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !256, line: 610, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 604, size: 8, elements: !487)
!487 = !{!488, !492}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !486, file: !256, line: 608, baseType: !489, size: 8)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !486, file: !256, line: 605, size: 8, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !489, file: !256, line: 607, baseType: !149, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !486, file: !256, line: 609, baseType: !149, size: 8)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !257, file: !256, line: 917, baseType: !191, size: 24, offset: 392)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !257, file: !256, line: 918, baseType: !495, size: 32, offset: 416)
!495 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !256, line: 639, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 622, size: 32, elements: !498)
!498 = !{!499, !510}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !497, file: !256, line: 637, baseType: !500, size: 32)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !497, file: !256, line: 623, size: 32, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !500, file: !256, line: 625, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !500, file: !256, line: 626, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !500, file: !256, line: 627, baseType: !162, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !500, file: !256, line: 629, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !500, file: !256, line: 631, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !500, file: !256, line: 632, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !500, file: !256, line: 634, baseType: !162, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !500, file: !256, line: 635, baseType: !162, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !497, file: !256, line: 638, baseType: !162, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !257, file: !256, line: 919, baseType: !512, size: 32, offset: 448)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 32, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 4)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !257, file: !256, line: 920, baseType: !516, size: 16, offset: 480)
!516 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !256, line: 715, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 706, size: 16, elements: !519)
!519 = !{!520, !525}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !518, file: !256, line: 713, baseType: !521, size: 16)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !256, line: 707, size: 16, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !521, file: !256, line: 709, baseType: !139, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !521, file: !256, line: 711, baseType: !139, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !518, file: !256, line: 714, baseType: !139, size: 16)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !257, file: !256, line: 921, baseType: !144, size: 16, offset: 496)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !257, file: !256, line: 922, baseType: !528, size: 32, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !256, line: 739, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 729, size: 32, elements: !531)
!531 = !{!532, !538}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !530, file: !256, line: 737, baseType: !533, size: 32)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !530, file: !256, line: 730, size: 32, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !533, file: !256, line: 732, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !533, file: !256, line: 733, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !533, file: !256, line: 735, baseType: !162, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !530, file: !256, line: 738, baseType: !162, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !257, file: !256, line: 923, baseType: !540, size: 8, offset: 544)
!540 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !256, line: 765, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 756, size: 8, elements: !543)
!543 = !{!544, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !542, file: !256, line: 763, baseType: !545, size: 8)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !542, file: !256, line: 757, size: 8, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !545, file: !256, line: 759, baseType: !149, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !545, file: !256, line: 761, baseType: !149, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !545, file: !256, line: 762, baseType: !149, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !542, file: !256, line: 764, baseType: !149, size: 8)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !257, file: !256, line: 924, baseType: !191, size: 24, offset: 552)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !257, file: !256, line: 925, baseType: !553, size: 32, offset: 576)
!553 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !256, line: 789, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 781, size: 32, elements: !556)
!556 = !{!557, !562}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !555, file: !256, line: 787, baseType: !558, size: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !555, file: !256, line: 782, size: 32, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !558, file: !256, line: 783, baseType: !162, size: 12, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !558, file: !256, line: 785, baseType: !162, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !555, file: !256, line: 788, baseType: !162, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !257, file: !256, line: 926, baseType: !564, size: 32, offset: 608)
!564 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !256, line: 820, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 805, size: 32, elements: !567)
!567 = !{!568, !578}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !566, file: !256, line: 818, baseType: !569, size: 32)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !566, file: !256, line: 806, size: 32, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !569, file: !256, line: 807, baseType: !162, size: 2, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !569, file: !256, line: 808, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !569, file: !256, line: 809, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !569, file: !256, line: 810, baseType: !162, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !569, file: !256, line: 812, baseType: !162, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !569, file: !256, line: 814, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !569, file: !256, line: 816, baseType: !162, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !566, file: !256, line: 819, baseType: !162, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !257, file: !256, line: 927, baseType: !580, size: 8, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !256, line: 881, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 872, size: 8, elements: !584)
!584 = !{!585, !592}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !583, file: !256, line: 879, baseType: !586, size: 8)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !256, line: 873, size: 8, elements: !587)
!587 = !{!588, !589, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !586, file: !256, line: 874, baseType: !149, size: 1, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !586, file: !256, line: 875, baseType: !149, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !586, file: !256, line: 876, baseType: !149, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !586, file: !256, line: 877, baseType: !149, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !583, file: !256, line: 880, baseType: !149, size: 8)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !596, line: 290, baseType: !597)
!596 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !596, line: 284, size: 96, elements: !598)
!598 = !{!599, !609, !620, !633, !650}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !597, file: !596, line: 285, baseType: !600, size: 8)
!600 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !596, line: 49, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !596, line: 43, size: 8, elements: !603)
!603 = !{!604, !608}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !602, file: !596, line: 47, baseType: !605, size: 8)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !602, file: !596, line: 44, size: 8, elements: !606)
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !605, file: !596, line: 45, baseType: !149, size: 1, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !602, file: !596, line: 48, baseType: !149, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !597, file: !596, line: 286, baseType: !610, size: 8, offset: 8)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !596, line: 67, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !596, line: 61, size: 8, elements: !614)
!614 = !{!615, !619}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !613, file: !596, line: 65, baseType: !616, size: 8)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !613, file: !596, line: 62, size: 8, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !616, file: !596, line: 64, baseType: !149, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !613, file: !596, line: 66, baseType: !149, size: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !597, file: !596, line: 287, baseType: !621, size: 16, offset: 16)
!621 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !596, line: 89, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !596, line: 79, size: 16, elements: !624)
!624 = !{!625, !632}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !623, file: !596, line: 87, baseType: !626, size: 16)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !623, file: !596, line: 80, size: 16, elements: !627)
!627 = !{!628, !629, !630, !631}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !626, file: !596, line: 81, baseType: !139, size: 6, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !626, file: !596, line: 83, baseType: !139, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !626, file: !596, line: 85, baseType: !139, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !626, file: !596, line: 86, baseType: !139, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !623, file: !596, line: 88, baseType: !139, size: 16)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !597, file: !596, line: 288, baseType: !634, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !596, line: 214, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !596, line: 199, size: 32, elements: !637)
!637 = !{!638, !649}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !636, file: !596, line: 212, baseType: !639, size: 32)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !636, file: !596, line: 200, size: 32, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !639, file: !596, line: 201, baseType: !162, size: 4, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !639, file: !596, line: 203, baseType: !162, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !639, file: !596, line: 205, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !639, file: !596, line: 206, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !639, file: !596, line: 207, baseType: !162, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !639, file: !596, line: 208, baseType: !162, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !639, file: !596, line: 209, baseType: !162, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !639, file: !596, line: 210, baseType: !162, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !636, file: !596, line: 213, baseType: !162, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !597, file: !596, line: 289, baseType: !651, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !596, line: 268, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !596, line: 260, size: 32, elements: !654)
!654 = !{!655, !660}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !653, file: !596, line: 266, baseType: !656, size: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !653, file: !596, line: 261, size: 32, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !656, file: !596, line: 262, baseType: !162, size: 4, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !656, file: !596, line: 264, baseType: !162, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !653, file: !596, line: 267, baseType: !162, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !663, line: 513, baseType: !664)
!663 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !663, line: 494, size: 480, elements: !665)
!665 = !{!666, !672, !682, !686, !696, !706, !716, !726, !730, !746, !762, !778, !808, !812, !822, !832, !842, !846}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !664, file: !663, line: 495, baseType: !667, size: 8)
!667 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !663, line: 45, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 43, size: 8, elements: !670)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !669, file: !663, line: 44, baseType: !149, size: 8)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !664, file: !663, line: 496, baseType: !673, size: 8, offset: 8)
!673 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !663, line: 61, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 55, size: 8, elements: !676)
!676 = !{!677, !681}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !675, file: !663, line: 59, baseType: !678, size: 8)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !675, file: !663, line: 56, size: 8, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !678, file: !663, line: 57, baseType: !149, size: 2, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !675, file: !663, line: 60, baseType: !149, size: 8)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !664, file: !663, line: 497, baseType: !683, size: 48, offset: 16)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 48, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 6)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !664, file: !663, line: 498, baseType: !687, size: 8, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !663, line: 86, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 80, size: 8, elements: !690)
!690 = !{!691, !695}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !689, file: !663, line: 84, baseType: !692, size: 8)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !663, line: 81, size: 8, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !692, file: !663, line: 82, baseType: !149, size: 3, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !689, file: !663, line: 85, baseType: !149, size: 8)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !664, file: !663, line: 499, baseType: !697, size: 8, offset: 72)
!697 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !663, line: 121, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 115, size: 8, elements: !700)
!700 = !{!701, !705}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !699, file: !663, line: 119, baseType: !702, size: 8)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !699, file: !663, line: 116, size: 8, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !702, file: !663, line: 117, baseType: !149, size: 3, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !699, file: !663, line: 120, baseType: !149, size: 8)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !664, file: !663, line: 500, baseType: !707, size: 8, offset: 80)
!707 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !663, line: 156, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 150, size: 8, elements: !710)
!710 = !{!711, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !709, file: !663, line: 154, baseType: !712, size: 8)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !709, file: !663, line: 151, size: 8, elements: !713)
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !712, file: !663, line: 152, baseType: !149, size: 3, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !709, file: !663, line: 155, baseType: !149, size: 8)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !664, file: !663, line: 501, baseType: !717, size: 8, offset: 88)
!717 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !663, line: 191, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 185, size: 8, elements: !720)
!720 = !{!721, !725}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !719, file: !663, line: 189, baseType: !722, size: 8)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !719, file: !663, line: 186, size: 8, elements: !723)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !722, file: !663, line: 187, baseType: !149, size: 3, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !719, file: !663, line: 190, baseType: !149, size: 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !664, file: !663, line: 502, baseType: !727, size: 64, offset: 96)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 64, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 8)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !664, file: !663, line: 503, baseType: !731, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !663, line: 232, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 220, size: 32, elements: !734)
!734 = !{!735, !745}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !733, file: !663, line: 230, baseType: !736, size: 32)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !733, file: !663, line: 221, size: 32, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !736, file: !663, line: 222, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !736, file: !663, line: 223, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !736, file: !663, line: 224, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !736, file: !663, line: 225, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !736, file: !663, line: 226, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !736, file: !663, line: 227, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !736, file: !663, line: 228, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !733, file: !663, line: 231, baseType: !162, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !664, file: !663, line: 504, baseType: !747, size: 32, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !663, line: 268, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 256, size: 32, elements: !750)
!750 = !{!751, !761}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !749, file: !663, line: 266, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !749, file: !663, line: 257, size: 32, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !752, file: !663, line: 258, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !752, file: !663, line: 259, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !752, file: !663, line: 260, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !752, file: !663, line: 261, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !752, file: !663, line: 262, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !752, file: !663, line: 263, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !752, file: !663, line: 264, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !749, file: !663, line: 267, baseType: !162, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !664, file: !663, line: 505, baseType: !763, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !663, line: 304, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 292, size: 32, elements: !766)
!766 = !{!767, !777}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !765, file: !663, line: 302, baseType: !768, size: 32)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !765, file: !663, line: 293, size: 32, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !768, file: !663, line: 294, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !768, file: !663, line: 295, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !768, file: !663, line: 296, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !768, file: !663, line: 297, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !768, file: !663, line: 298, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !768, file: !663, line: 299, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !768, file: !663, line: 300, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !765, file: !663, line: 303, baseType: !162, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !664, file: !663, line: 506, baseType: !779, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !663, line: 354, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 328, size: 32, elements: !782)
!782 = !{!783, !807}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !781, file: !663, line: 352, baseType: !784, size: 32)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !781, file: !663, line: 329, size: 32, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !784, file: !663, line: 330, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !784, file: !663, line: 331, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !784, file: !663, line: 332, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !784, file: !663, line: 333, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !784, file: !663, line: 334, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !784, file: !663, line: 335, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !784, file: !663, line: 336, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !784, file: !663, line: 337, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !784, file: !663, line: 338, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !784, file: !663, line: 339, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !784, file: !663, line: 340, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !784, file: !663, line: 341, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !784, file: !663, line: 342, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !784, file: !663, line: 343, baseType: !162, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !784, file: !663, line: 344, baseType: !162, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !784, file: !663, line: 345, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !784, file: !663, line: 346, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !784, file: !663, line: 347, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !784, file: !663, line: 348, baseType: !162, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !784, file: !663, line: 349, baseType: !162, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !784, file: !663, line: 350, baseType: !162, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !781, file: !663, line: 353, baseType: !162, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !664, file: !663, line: 507, baseType: !809, size: 128, offset: 288)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 128, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !664, file: !663, line: 508, baseType: !813, size: 8, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !663, line: 412, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 406, size: 8, elements: !816)
!816 = !{!817, !821}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !815, file: !663, line: 410, baseType: !818, size: 8)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !815, file: !663, line: 407, size: 8, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !818, file: !663, line: 408, baseType: !149, size: 1, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !815, file: !663, line: 411, baseType: !149, size: 8)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !664, file: !663, line: 509, baseType: !823, size: 8, offset: 424)
!823 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !663, line: 430, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 424, size: 8, elements: !826)
!826 = !{!827, !831}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !825, file: !663, line: 428, baseType: !828, size: 8)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !825, file: !663, line: 425, size: 8, elements: !829)
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !828, file: !663, line: 426, baseType: !149, size: 1, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !825, file: !663, line: 429, baseType: !149, size: 8)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !664, file: !663, line: 510, baseType: !833, size: 8, offset: 432)
!833 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !663, line: 448, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 442, size: 8, elements: !836)
!836 = !{!837, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !835, file: !663, line: 446, baseType: !838, size: 8)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !835, file: !663, line: 443, size: 8, elements: !839)
!839 = !{!840}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !838, file: !663, line: 444, baseType: !147, size: 1, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !835, file: !663, line: 447, baseType: !149, size: 8)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !664, file: !663, line: 511, baseType: !843, size: 8, offset: 440)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 1)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "RCAUSE", scope: !664, file: !663, line: 512, baseType: !847, size: 8, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_RCAUSE_Type", file: !663, line: 472, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !663, line: 460, size: 8, elements: !851)
!851 = !{!852, !861}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !850, file: !663, line: 470, baseType: !853, size: 8)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !850, file: !663, line: 461, size: 8, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "POR", scope: !853, file: !663, line: 462, baseType: !149, size: 1, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "BOD12", scope: !853, file: !663, line: 463, baseType: !149, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !853, file: !663, line: 464, baseType: !149, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "EXT", scope: !853, file: !663, line: 466, baseType: !149, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "WDT", scope: !853, file: !663, line: 467, baseType: !149, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "SYST", scope: !853, file: !663, line: 468, baseType: !149, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !850, file: !663, line: 471, baseType: !149, size: 8)
!862 = !{!120}
!863 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !866, line: 51, size: 64, elements: !867)
!866 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!867 = !{!868, !895}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !865, file: !866, line: 60, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{!103, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !875, line: 378, size: 192, elements: !876)
!875 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!876 = !{!877, !879, !880, !881, !888, !889}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !875, line: 380, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !874, file: !875, line: 382, baseType: !13, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !874, file: !875, line: 384, baseType: !13, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !874, file: !875, line: 386, baseType: !882, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !875, line: 351, size: 16, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !883, file: !875, line: 359, baseType: !149, size: 8)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !883, file: !875, line: 364, baseType: !887, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!887 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !874, file: !875, line: 388, baseType: !102, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !874, file: !875, line: 396, baseType: !890, size: 32, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !875, line: 43, baseType: !893)
