; ModuleID = 'build/actinius_icarus_ns/boards/nrf/battery/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.divider_data = type { %struct.device*, %struct.adc_channel_cfg, %struct.adc_sequence, i16 }
%struct.adc_channel_cfg = type { i32, i32, i16, i8, i8, i8 }
%struct.adc_sequence = type { %struct.adc_sequence_options*, i32, i8*, i32, i8, i8, i8 }
%struct.adc_sequence_options = type { i32, i32 (%struct.device*, %struct.adc_sequence*, i16)*, i8*, i16 }
%struct.battery_level_point = type { i16, i16 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.battery_level_point }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "__init_battery_setup", scope: !27, file: !450, line: 154, type: !477, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !248, globals: !447, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/nrf/battery/src/battery.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!29 = !{!30, !54, !63, !68, !138, !144, !149, !213, !233}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "adc_gain", file: !31, line: 32, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/drivers/adc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!34 = !DIEnumerator(name: "ADC_GAIN_1_6", value: 0)
!35 = !DIEnumerator(name: "ADC_GAIN_1_5", value: 1)
!36 = !DIEnumerator(name: "ADC_GAIN_1_4", value: 2)
!37 = !DIEnumerator(name: "ADC_GAIN_1_3", value: 3)
!38 = !DIEnumerator(name: "ADC_GAIN_2_5", value: 4)
!39 = !DIEnumerator(name: "ADC_GAIN_1_2", value: 5)
!40 = !DIEnumerator(name: "ADC_GAIN_2_3", value: 6)
!41 = !DIEnumerator(name: "ADC_GAIN_4_5", value: 7)
!42 = !DIEnumerator(name: "ADC_GAIN_1", value: 8)
!43 = !DIEnumerator(name: "ADC_GAIN_2", value: 9)
!44 = !DIEnumerator(name: "ADC_GAIN_3", value: 10)
!45 = !DIEnumerator(name: "ADC_GAIN_4", value: 11)
!46 = !DIEnumerator(name: "ADC_GAIN_6", value: 12)
!47 = !DIEnumerator(name: "ADC_GAIN_8", value: 13)
!48 = !DIEnumerator(name: "ADC_GAIN_12", value: 14)
!49 = !DIEnumerator(name: "ADC_GAIN_16", value: 15)
!50 = !DIEnumerator(name: "ADC_GAIN_24", value: 16)
!51 = !DIEnumerator(name: "ADC_GAIN_32", value: 17)
!52 = !DIEnumerator(name: "ADC_GAIN_64", value: 18)
!53 = !DIEnumerator(name: "ADC_GAIN_128", value: 19)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "adc_reference", file: !31, line: 75, baseType: !32, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62}
!56 = !DIEnumerator(name: "ADC_REF_VDD_1", value: 0)
!57 = !DIEnumerator(name: "ADC_REF_VDD_1_2", value: 1)
!58 = !DIEnumerator(name: "ADC_REF_VDD_1_3", value: 2)
!59 = !DIEnumerator(name: "ADC_REF_VDD_1_4", value: 3)
!60 = !DIEnumerator(name: "ADC_REF_INTERNAL", value: 4)
!61 = !DIEnumerator(name: "ADC_REF_EXTERNAL0", value: 5)
!62 = !DIEnumerator(name: "ADC_REF_EXTERNAL1", value: 6)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "adc_action", file: !31, line: 418, baseType: !32, size: 32, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "ADC_ACTION_CONTINUE", value: 0)
!66 = !DIEnumerator(name: "ADC_ACTION_REPEAT", value: 1)
!67 = !DIEnumerator(name: "ADC_ACTION_FINISH", value: 2)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !69, line: 27, baseType: !32, size: 32, elements: !70)
!69 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!71 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!72 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!73 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!74 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!75 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!76 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!77 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!78 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!79 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!80 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!81 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!82 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!83 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!84 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!85 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!86 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!87 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!125 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!126 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!127 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!128 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!129 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!130 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!131 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!132 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!133 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!134 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!135 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!136 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!137 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !139, line: 506, baseType: !32, size: 32, elements: !140)
!139 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !{!141, !142, !143}
!141 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!142 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!143 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !139, line: 512, baseType: !32, size: 32, elements: !145)
!145 = !{!146, !147, !148}
!146 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!147 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!148 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !150, line: 53, baseType: !32, size: 32, elements: !151)
!150 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!152 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!153 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!154 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!155 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!156 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!157 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!158 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!159 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!160 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!161 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!162 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!163 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!164 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!165 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!166 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!167 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!168 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!169 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!170 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!171 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!172 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!173 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!174 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!175 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!176 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!177 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!178 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!179 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!180 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!181 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!182 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!183 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!184 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!185 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!186 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!187 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!188 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!189 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!190 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!191 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!192 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!193 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!194 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!195 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!196 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!197 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!198 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!199 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!200 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!201 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!202 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!203 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!204 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!205 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!206 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!207 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!208 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!209 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!210 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!211 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!212 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !150, line: 274, baseType: !32, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!215 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!216 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!217 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!218 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!219 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!220 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!221 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!222 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!223 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!224 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!225 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!226 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!227 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!228 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!229 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!230 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!231 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!232 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !150, line: 203, baseType: !32, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!235 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!236 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!237 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!238 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!239 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!240 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!241 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!242 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!243 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!244 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!245 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!246 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!247 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!248 = !{!249, !251, !252, !253, !336, !341, !301, !144, !138, !346, !347, !400}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !250)
!250 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!252 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !139, line: 523, size: 288, elements: !256)
!256 = !{!257, !291, !297, !302, !306, !307, !308, !312, !332}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !255, file: !139, line: 524, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DISubroutineType(types: !260)
!260 = !{!252, !261, !288, !289}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !264, line: 378, size: 192, elements: !265)
!264 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!265 = !{!266, !270, !271, !272, !281, !282}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !264, line: 380, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !263, file: !264, line: 382, baseType: !13, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !263, file: !264, line: 384, baseType: !13, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !263, file: !264, line: 386, baseType: !273, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !264, line: 351, size: 16, elements: !275)
!275 = !{!276, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !274, file: !264, line: 359, baseType: !277, size: 8)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !278)
!278 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !274, file: !264, line: 364, baseType: !280, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!280 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !264, line: 388, baseType: !251, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !263, file: !264, line: 396, baseType: !283, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !264, line: 43, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !287)
!287 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !139, line: 237, baseType: !277)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !139, line: 257, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !255, file: !139, line: 530, baseType: !292, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DISubroutineType(types: !294)
!294 = !{!252, !261, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !139, line: 229, baseType: !290)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !255, file: !139, line: 532, baseType: !298, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(types: !300)
!300 = !{!252, !261, !301, !296}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !139, line: 216, baseType: !290)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !255, file: !139, line: 535, baseType: !303, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{!252, !261, !301}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !255, file: !139, line: 537, baseType: !303, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !255, file: !139, line: 539, baseType: !303, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !255, file: !139, line: 541, baseType: !309, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{!252, !261, !288, !138, !144}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !255, file: !139, line: 544, baseType: !313, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DISubroutineType(types: !315)
!315 = !{!252, !261, !316, !280}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !139, line: 478, size: 96, elements: !318)
!318 = !{!319, !326, !331}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !317, file: !139, line: 482, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !321, line: 33, baseType: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !321, line: 29, size: 32, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !321, line: 30, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !317, file: !139, line: 485, baseType: !327, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !139, line: 464, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !261, !316, !301}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !317, file: !139, line: 493, baseType: !301, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !255, file: !139, line: 547, baseType: !333, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{!290, !261}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !139, line: 428, size: 32, elements: !339)
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !338, file: !139, line: 434, baseType: !301, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !139, line: 441, size: 32, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !343, file: !139, line: 447, baseType: !301, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "adc_driver_api", file: !31, line: 583, size: 96, elements: !350)
!350 = !{!351, !369, !399}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "channel_setup", scope: !349, file: !31, line: 584, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "adc_api_channel_setup", file: !31, line: 559, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DISubroutineType(types: !355)
!355 = !{!252, !261, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "adc_channel_cfg", file: !31, line: 88, size: 128, elements: !359)
!359 = !{!360, !361, !362, !365, !366, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !358, file: !31, line: 90, baseType: !30, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !358, file: !31, line: 93, baseType: !54, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_time", scope: !358, file: !31, line: 104, baseType: !363, size: 16, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !364)
!364 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "channel_id", scope: !358, file: !31, line: 128, baseType: !277, size: 5, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "differential", scope: !358, file: !31, line: 131, baseType: !277, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 80)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "input_positive", scope: !358, file: !31, line: 139, baseType: !277, size: 8, offset: 88)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "input_negative", scope: !358, file: !31, line: 146, baseType: !277, size: 8, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !349, file: !31, line: 585, baseType: !370, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "adc_api_read", file: !31, line: 566, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DISubroutineType(types: !373)
!373 = !{!252, !261, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "adc_sequence", file: !31, line: 492, size: 160, elements: !377)
!377 = !{!378, !391, !392, !393, !396, !397, !398}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !376, file: !31, line: 497, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "adc_sequence_options", file: !31, line: 458, size: 128, elements: !382)
!382 = !{!383, !384, !389, !390}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "interval_us", scope: !381, file: !31, line: 468, baseType: !290, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !381, file: !31, line: 474, baseType: !385, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "adc_sequence_callback", file: !31, line: 451, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DISubroutineType(types: !388)
!388 = !{!63, !261, !374, !363}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !381, file: !31, line: 480, baseType: !251, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "extra_samplings", scope: !381, file: !31, line: 486, baseType: !363, size: 16, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !376, file: !31, line: 505, baseType: !290, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !376, file: !31, line: 516, baseType: !251, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !376, file: !31, line: 524, baseType: !394, size: 32, offset: 96)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !395, line: 214, baseType: !32)
!395 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !376, file: !31, line: 533, baseType: !277, size: 8, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "oversampling", scope: !376, file: !31, line: 541, baseType: !277, size: 8, offset: 136)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "calibrate", scope: !376, file: !31, line: 551, baseType: !280, size: 8, offset: 144)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ref_internal", scope: !349, file: !31, line: 589, baseType: !363, size: 16, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !150, line: 397, size: 160, elements: !403)
!403 = !{!404, !416, !422, !437, !442}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !402, file: !150, line: 398, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !150, line: 354, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DISubroutineType(types: !408)
!408 = !{!252, !261, !149, !213, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !150, line: 43, size: 64, elements: !412)
!412 = !{!413, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !411, file: !150, line: 45, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !252)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !411, file: !150, line: 47, baseType: !414, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !402, file: !150, line: 399, baseType: !417, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !150, line: 365, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = !DISubroutineType(types: !420)
!420 = !{!252, !261, !149, !213, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !402, file: !150, line: 400, baseType: !423, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !150, line: 376, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DISubroutineType(types: !426)
!426 = !{!252, !261, !427, !433}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !150, line: 264, size: 64, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !150, line: 266, baseType: !233, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !429, file: !150, line: 268, baseType: !149, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !150, line: 345, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !261, !427}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !402, file: !150, line: 401, baseType: !438, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !150, line: 385, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DISubroutineType(types: !441)
!441 = !{!252, !261, !149}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !402, file: !150, line: 402, baseType: !443, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !150, line: 393, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DISubroutineType(types: !446)
!446 = !{!252, !261, !149, !421}
!447 = !{!25, !448, !451, !469}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "battery_ok", scope: !27, file: !450, line: 143, type: !280, isLocal: true, isDefinition: true)
!450 = !DIFile(filename: "zephyr/samples/boards/nrf/battery/src/battery.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "divider_config", scope: !27, file: !450, line: 53, type: !453, isLocal: true, isDefinition: true)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "divider_config", file: !450, line: 42, size: 160, elements: !455)
!455 = !{!456, !460, !467, !468}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "io_channel", scope: !454, file: !450, line: 43, baseType: !457, size: 8)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_channel_config", file: !450, line: 38, size: 8, elements: !458)
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !457, file: !450, line: 39, baseType: !277, size: 8)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "power_gpios", scope: !454, file: !450, line: 44, baseType: !461, size: 64, offset: 32)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !139, line: 271, size: 64, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !461, file: !139, line: 273, baseType: !261, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !461, file: !139, line: 275, baseType: !288, size: 8, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !461, file: !139, line: 277, baseType: !466, size: 16, offset: 48)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !139, line: 249, baseType: !363)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "output_ohm", scope: !454, file: !450, line: 49, baseType: !290, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "full_ohm", scope: !454, file: !450, line: 50, baseType: !290, size: 32, offset: 128)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "divider_data", scope: !27, file: !450, line: 74, type: !471, isLocal: true, isDefinition: true)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "divider_data", file: !450, line: 68, size: 352, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "adc", scope: !471, file: !450, line: 69, baseType: !261, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "adc_cfg", scope: !471, file: !450, line: 70, baseType: !358, size: 128, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "adc_seq", scope: !471, file: !450, line: 71, baseType: !376, size: 160, offset: 160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !471, file: !450, line: 72, baseType: !286, size: 16, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !479, line: 51, size: 64, elements: !480)
!479 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = !{!481, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !478, file: !479, line: 60, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DISubroutineType(types: !484)
!484 = !{!252, !261}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !478, file: !479, line: 65, baseType: !261, size: 32, offset: 32)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "levels", scope: !488, file: !496, line: 16, type: !508, isLocal: true, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !491, globals: !492, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/nrf/battery/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!490 = !{!68}
!491 = !{!251, !252, !290, !249}
!492 = !{!486, !493}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "buf", scope: !495, file: !496, line: 36, type: !505, isLocal: true, isDefinition: true)
!495 = distinct !DISubprogram(name: "now_str", scope: !496, file: !496, line: 34, type: !497, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !488, retainedNodes: !499)
!496 = !DIFile(filename: "zephyr/samples/boards/nrf/battery/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !DISubroutineType(types: !498)
!498 = !{!267}
!499 = !{!500, !501, !502, !503, !504}
!500 = !DILocalVariable(name: "now", scope: !495, file: !496, line: 37, type: !290)
!501 = !DILocalVariable(name: "ms", scope: !495, file: !496, line: 38, type: !32)
!502 = !DILocalVariable(name: "s", scope: !495, file: !496, line: 39, type: !32)
!503 = !DILocalVariable(name: "min", scope: !495, file: !496, line: 40, type: !32)
!504 = !DILocalVariable(name: "h", scope: !495, file: !496, line: 41, type: !32)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 128, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 16)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 96, elements: !515)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "battery_level_point", file: !511, line: 32, size: 32, elements: !512)
!511 = !DIFile(filename: "zephyr/samples/boards/nrf/battery/src/battery.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lvl_pptt", scope: !510, file: !511, line: 34, baseType: !363, size: 16)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lvl_mV", scope: !510, file: !511, line: 37, baseType: !363, size: 16, offset: 16)
!515 = !{!516}
!516 = !DISubrange(count: 3)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "_char_out", scope: !519, file: !523, line: 54, type: !524, isLocal: false, isDefinition: true)
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !521, globals: !522, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!521 = !{!251, !252}
!522 = !{!517}
!523 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DISubroutineType(types: !526)
!526 = !{!252, !252}
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !529, file: !586, line: 65, type: !587, isLocal: true, isDefinition: true, align: 32)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !531, globals: !581, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!531 = !{!251, !252, !532, !290, !543}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !534, file: !533, line: 167, baseType: !542)
!533 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !533, file: !533, line: 134, type: !535, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !529, retainedNodes: !537)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !290}
!537 = !{!538, !539, !541}
!538 = !DILocalVariable(name: "time_us", arg: 1, scope: !534, file: !533, line: 134, type: !290)
!539 = !DILocalVariable(name: "delay_cycles", scope: !534, file: !533, line: 168, type: !540)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!541 = !DILocalVariable(name: "cycles", scope: !534, file: !533, line: 171, type: !290)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !545, line: 1928, baseType: !546)
!545 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 1909, size: 11360, elements: !547)
!547 = !{!548, !554, !555, !556, !557, !561, !562, !563, !564, !566, !567, !571, !572, !573, !574, !575, !579, !580}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !546, file: !545, line: 1910, baseType: !549, size: 8192)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 8192, elements: !552)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !290)
!552 = !{!553}
!553 = !DISubrange(count: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !546, file: !545, line: 1911, baseType: !550, size: 32, offset: 8192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !546, file: !545, line: 1912, baseType: !550, size: 32, offset: 8224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !546, file: !545, line: 1913, baseType: !550, size: 32, offset: 8256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !546, file: !545, line: 1914, baseType: !558, size: 1984, offset: 8288)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 1984, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 62)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !546, file: !545, line: 1915, baseType: !551, size: 32, offset: 10272)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !546, file: !545, line: 1916, baseType: !550, size: 32, offset: 10304)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !546, file: !545, line: 1917, baseType: !551, size: 32, offset: 10336)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !546, file: !545, line: 1918, baseType: !565, size: 96, offset: 10368)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 96, elements: !515)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !546, file: !545, line: 1919, baseType: !551, size: 32, offset: 10464)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !546, file: !545, line: 1920, baseType: !568, size: 256, offset: 10496)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 256, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 8)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !546, file: !545, line: 1921, baseType: !551, size: 32, offset: 10752)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !546, file: !545, line: 1922, baseType: !550, size: 32, offset: 10784)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !546, file: !545, line: 1923, baseType: !551, size: 32, offset: 10816)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !546, file: !545, line: 1924, baseType: !551, size: 32, offset: 10848)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !546, file: !545, line: 1925, baseType: !576, size: 416, offset: 10880)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 416, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 13)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !546, file: !545, line: 1926, baseType: !551, size: 32, offset: 11296)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !546, file: !545, line: 1927, baseType: !551, size: 32, offset: 11328)
!581 = !{!527, !582}
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !534, file: !533, line: 161, type: !584, isLocal: true, isDefinition: true, align: 128)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 48, elements: !515)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!586 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !479, line: 51, size: 64, elements: !589)
!589 = !{!590, !597}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !588, file: !479, line: 60, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DISubroutineType(types: !593)
!593 = !{!252, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !479, line: 48, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !588, file: !479, line: 65, baseType: !594, size: 32, offset: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !600, file: !638, line: 27, type: !665, isLocal: true, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !602, retainedTypes: !614, globals: !635, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!602 = !{!603, !68}
!603 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !604, line: 27, baseType: !32, size: 32, elements: !605)
!604 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613}
!606 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!607 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!608 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!609 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!610 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!611 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!612 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!613 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!614 = !{!251, !615, !252, !24, !619, !634, !290, !249}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !616, line: 46, baseType: !617)
!616 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !618)
!618 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !621, line: 54, size: 96, elements: !622)
!621 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!622 = !{!623, !629, !633}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !620, file: !621, line: 55, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !321, line: 33, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !321, line: 29, size: 32, elements: !626)
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !625, file: !321, line: 30, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !620, file: !621, line: 60, baseType: !630, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !603}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !620, file: !621, line: 65, baseType: !630, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!635 = !{!598, !636, !642, !644, !655, !657}
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !600, file: !638, line: 44, type: !639, isLocal: true, isDefinition: true)
!638 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !640, line: 43, elements: !641)
!640 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!641 = !{}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !600, file: !638, line: 49, type: !639, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !600, file: !638, line: 36, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 128, elements: !653)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !604, line: 114, size: 128, elements: !648)
!648 = !{!649, !650, !651, !652}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !647, file: !604, line: 115, baseType: !603, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !647, file: !604, line: 141, baseType: !277, size: 8, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !647, file: !604, line: 149, baseType: !290, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !647, file: !604, line: 156, baseType: !290, size: 32, offset: 96)
!653 = !{!654}
!654 = !DISubrange(count: 1)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !600, file: !638, line: 40, type: !646, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !600, file: !638, line: 28, type: !659, isLocal: true, isDefinition: true)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !321, line: 40, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !321, line: 35, size: 64, elements: !661)
!661 = !{!662, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !660, file: !321, line: 36, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !660, file: !321, line: 37, baseType: !663, size: 32, offset: 32)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 32, elements: !653)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !667, line: 22, baseType: !668)
!667 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!668 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!669 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!670 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !673, file: !699, line: 50, type: !414, isLocal: true, isDefinition: true)
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !602, retainedTypes: !675, globals: !696, splitDebugInlining: false, nameTableKind: None)
!674 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!675 = !{!286, !615, !394, !252, !251, !290, !249, !676, !634, !414, !687}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !678, line: 45, size: 64, elements: !679)
!678 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!679 = !{!680, !686}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !677, file: !678, line: 46, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !321, line: 33, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !321, line: 29, size: 32, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !321, line: 30, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !677, file: !678, line: 48, baseType: !290, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !678, line: 38, size: 64, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !688, file: !678, line: 39, baseType: !681, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !688, file: !678, line: 41, baseType: !692, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !678, line: 35, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !414}
!696 = !{!697, !701, !709, !671, !711, !721}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "latency_lock", scope: !673, file: !699, line: 44, type: !700, isLocal: true, isDefinition: true)
!699 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !640, line: 43, elements: !641)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !673, file: !699, line: 46, type: !703, isLocal: true, isDefinition: true)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !321, line: 40, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !321, line: 35, size: 64, elements: !705)
!705 = !{!706, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !704, file: !321, line: 36, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !704, file: !321, line: 37, baseType: !707, size: 32, offset: 32)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "latency_subs", scope: !673, file: !699, line: 52, type: !703, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !673, file: !699, line: 39, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, elements: !719)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !699, line: 35, size: 96, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !714, file: !699, line: 36, baseType: !603, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !714, file: !699, line: 37, baseType: !277, size: 8, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !714, file: !699, line: 38, baseType: !666, size: 32, offset: 64)
!719 = !{!720}
!720 = !DISubrange(count: 0)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !673, file: !699, line: 48, type: !414, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !725, file: !732, line: 47, type: !746, isLocal: true, isDefinition: true)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !727, retainedTypes: !728, globals: !729, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!727 = !{!603}
!728 = !{!394, !252}
!729 = !{!730, !723, !742}
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "cpus_states", scope: !725, file: !732, line: 50, type: !733, isLocal: true, isDefinition: true)
!732 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 32, elements: !653)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !604, line: 114, size: 128, elements: !737)
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !736, file: !604, line: 115, baseType: !603, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !736, file: !604, line: 141, baseType: !277, size: 8, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !736, file: !604, line: 149, baseType: !290, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !736, file: !604, line: 156, baseType: !290, size: 32, offset: 96)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !725, file: !732, line: 55, type: !744, isLocal: true, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 8, elements: !653)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, elements: !719)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "static_regions", scope: !749, file: !756, line: 62, type: !888, isLocal: true, isDefinition: true)
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !751, globals: !752, splitDebugInlining: false, nameTableKind: None)
!750 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!751 = !{!394, !252, !290, !251}
!752 = !{!753, !747}
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !755, file: !756, line: 198, type: !875, isLocal: true, isDefinition: true)
!755 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !756, file: !756, line: 175, type: !757, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !749, retainedNodes: !872)
!756 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!757 = !DISubroutineType(types: !758)
!758 = !{null, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !761, line: 245, size: 1024, elements: !762)
!761 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!762 = !{!763, !828, !841, !842, !843, !844, !850, !867}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !760, file: !761, line: 247, baseType: !764, size: 384)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !761, line: 57, size: 384, elements: !765)
!765 = !{!766, !794, !802, !803, !804, !815, !816, !817}
!766 = !DIDerivedType(tag: DW_TAG_member, scope: !764, file: !761, line: 60, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !764, file: !761, line: 60, size: 64, elements: !768)
!768 = !{!769, !785}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !767, file: !761, line: 61, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !771, line: 49, baseType: !772)
!771 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !771, line: 37, size: 64, elements: !773)
!773 = !{!774, !780}
!774 = !DIDerivedType(tag: DW_TAG_member, scope: !772, file: !771, line: 38, baseType: !775, size: 32)
!775 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !772, file: !771, line: 38, size: 32, elements: !776)
!776 = !{!777, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !775, file: !771, line: 39, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !775, file: !771, line: 40, baseType: !778, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, scope: !772, file: !771, line: 42, baseType: !781, size: 32, offset: 32)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !772, file: !771, line: 42, size: 32, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !781, file: !771, line: 43, baseType: !778, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !781, file: !771, line: 44, baseType: !778, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !767, file: !761, line: 62, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !787, line: 49, size: 64, elements: !788)
!787 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !786, file: !787, line: 50, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 64, elements: !792)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!792 = !{!793}
!793 = !DISubrange(count: 2)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !764, file: !761, line: 68, baseType: !795, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !797, line: 233, baseType: !798)
!797 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !797, line: 231, size: 64, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !798, file: !797, line: 232, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !771, line: 48, baseType: !772)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !764, file: !761, line: 71, baseType: !277, size: 8, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !764, file: !761, line: 74, baseType: !277, size: 8, offset: 104)
!804 = !DIDerivedType(tag: DW_TAG_member, scope: !764, file: !761, line: 90, baseType: !805, size: 16, offset: 112)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !764, file: !761, line: 90, size: 16, elements: !806)
!806 = !{!807, !814}
!807 = !DIDerivedType(tag: DW_TAG_member, scope: !805, file: !761, line: 91, baseType: !808, size: 16)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !805, file: !761, line: 91, size: 16, elements: !809)
!809 = !{!810, !813}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !808, file: !761, line: 96, baseType: !811, size: 8)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !812)
!812 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !808, file: !761, line: 97, baseType: !277, size: 8, offset: 8)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !805, file: !761, line: 100, baseType: !363, size: 16)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !764, file: !761, line: 107, baseType: !290, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !764, file: !761, line: 127, baseType: !251, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !764, file: !761, line: 131, baseType: !818, size: 192, offset: 192)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !797, line: 244, size: 192, elements: !819)
!819 = !{!820, !821, !827}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !818, file: !797, line: 245, baseType: !770, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !818, file: !797, line: 246, baseType: !822, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !797, line: 242, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !818, file: !797, line: 249, baseType: !617, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !760, file: !761, line: 250, baseType: !829, size: 288, offset: 384)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !830, line: 25, size: 288, elements: !831)
!830 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !829, file: !830, line: 26, baseType: !290, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !829, file: !830, line: 27, baseType: !290, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !829, file: !830, line: 28, baseType: !290, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !829, file: !830, line: 29, baseType: !290, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !829, file: !830, line: 30, baseType: !290, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !829, file: !830, line: 31, baseType: !290, size: 32, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !829, file: !830, line: 32, baseType: !290, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !829, file: !830, line: 33, baseType: !290, size: 32, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !829, file: !830, line: 34, baseType: !290, size: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !760, file: !761, line: 253, baseType: !251, size: 32, offset: 672)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !760, file: !761, line: 256, baseType: !796, size: 64, offset: 704)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !760, file: !761, line: 294, baseType: !252, size: 32, offset: 768)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !760, file: !761, line: 300, baseType: !845, size: 96, offset: 800)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !761, line: 149, size: 96, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !845, file: !761, line: 153, baseType: !22, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !845, file: !761, line: 162, baseType: !394, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !845, file: !761, line: 168, baseType: !394, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !760, file: !761, line: 325, baseType: !851, size: 32, offset: 896)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !853, line: 5073, size: 160, elements: !854)
!853 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !{!855, !864, !865}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !852, file: !853, line: 5074, baseType: !856, size: 96)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !857, line: 56, size: 96, elements: !858)
!857 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!858 = !{!859, !862, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !856, file: !857, line: 57, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !857, line: 57, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !856, file: !857, line: 58, baseType: !251, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !856, file: !857, line: 59, baseType: !394, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !852, file: !853, line: 5075, baseType: !796, size: 64, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !852, file: !853, line: 5076, baseType: !866, offset: 160)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !640, line: 43, elements: !641)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !760, file: !761, line: 343, baseType: !868, size: 64, offset: 928)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !830, line: 60, size: 64, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !868, file: !830, line: 63, baseType: !290, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !868, file: !830, line: 66, baseType: !290, size: 32, offset: 32)
!872 = !{!873, !874}
!873 = !DILocalVariable(name: "thread", arg: 1, scope: !755, file: !756, line: 175, type: !759)
!874 = !DILocalVariable(name: "region_num", scope: !755, file: !756, line: 200, type: !277)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, elements: !719)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !877, line: 52, size: 96, elements: !878)
!877 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !876, file: !877, line: 53, baseType: !22, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !876, file: !877, line: 54, baseType: !394, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !876, file: !877, line: 55, baseType: !882, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !883, line: 304, baseType: !884)
!883 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !883, line: 301, size: 32, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !884, file: !883, line: 302, baseType: !363, size: 16)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !884, file: !883, line: 303, baseType: !363, size: 16, offset: 16)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 96, elements: !653)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !892, file: !946, line: 39, type: !277, isLocal: true, isDefinition: true)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !894, globals: !937, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!894 = !{!895, !251, !252, !923}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !897, line: 1495, baseType: !898)
!897 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !897, line: 1474, size: 448, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !913}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !898, file: !897, line: 1476, baseType: !550, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !898, file: !897, line: 1477, baseType: !551, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !898, file: !897, line: 1478, baseType: !551, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !898, file: !897, line: 1479, baseType: !551, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !898, file: !897, line: 1480, baseType: !551, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !898, file: !897, line: 1481, baseType: !551, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !898, file: !897, line: 1482, baseType: !551, size: 32, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !898, file: !897, line: 1483, baseType: !551, size: 32, offset: 224)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !898, file: !897, line: 1484, baseType: !551, size: 32, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !898, file: !897, line: 1485, baseType: !551, size: 32, offset: 288)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !898, file: !897, line: 1486, baseType: !551, size: 32, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !898, file: !897, line: 1487, baseType: !912, size: 32, offset: 352)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 32, elements: !653)
!913 = !DIDerivedType(tag: DW_TAG_member, scope: !898, file: !897, line: 1488, baseType: !914, size: 64, offset: 384)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !898, file: !897, line: 1488, size: 64, elements: !915)
!915 = !{!916, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !914, file: !897, line: 1489, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 64, elements: !792)
!918 = !DIDerivedType(tag: DW_TAG_member, scope: !914, file: !897, line: 1490, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !914, file: !897, line: 1490, size: 64, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !919, file: !897, line: 1491, baseType: !551, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !919, file: !897, line: 1492, baseType: !551, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !926, line: 27, size: 128, elements: !927)
!926 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!927 = !{!928, !929, !930}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !925, file: !926, line: 29, baseType: !290, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !925, file: !926, line: 31, baseType: !267, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !925, file: !926, line: 37, baseType: !931, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !883, line: 298, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !883, line: 289, size: 64, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !932, file: !883, line: 291, baseType: !277, size: 5, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !932, file: !883, line: 293, baseType: !277, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !932, file: !883, line: 295, baseType: !290, size: 32, offset: 32)
!937 = !{!890, !938}
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !892, file: !940, line: 31, type: !941, isLocal: true, isDefinition: true)
!940 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 160, elements: !653)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !940, line: 21, size: 160, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !942, file: !940, line: 22, baseType: !252, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !942, file: !940, line: 23, baseType: !925, size: 128, offset: 32)
!946 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !949, file: !956, line: 21, type: !524, isLocal: true, isDefinition: true)
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !951, globals: !955, splitDebugInlining: false, nameTableKind: None)
!950 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!951 = !{!952, !252, !251}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !954, line: 22, baseType: !252)
!954 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!955 = !{!947}
!956 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !959, file: !964, line: 13, type: !983, isLocal: true, isDefinition: true)
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !961, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!961 = !{!962, !957}
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "mpu_config", scope: !959, file: !964, line: 37, type: !965, isLocal: false, isDefinition: true)
!964 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !926, line: 41, size: 64, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !966, file: !926, line: 43, baseType: !290, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !966, file: !926, line: 45, baseType: !970, size: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !926, line: 27, size: 128, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !972, file: !926, line: 29, baseType: !290, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !926, line: 31, baseType: !267, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !972, file: !926, line: 37, baseType: !977, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !883, line: 298, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !883, line: 289, size: 64, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !978, file: !883, line: 291, baseType: !277, size: 5, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !978, file: !883, line: 293, baseType: !277, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !978, file: !883, line: 295, baseType: !290, size: 32, offset: 32)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, elements: !792)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_init", scope: !986, file: !1066, line: 86, type: !1067, isLocal: true, isDefinition: true, align: 32)
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !988, retainedTypes: !989, globals: !1065, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/boards/nrf/battery")
!988 = !{!138, !144}
!989 = !{!990, !1054, !1059, !301, !144, !138, !1064, !251}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !139, line: 523, size: 288, elements: !993)
!993 = !{!994, !1013, !1017, !1021, !1025, !1026, !1027, !1031, !1050}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !992, file: !139, line: 524, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{!252, !998, !288, !289}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !264, line: 378, size: 192, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1011, !1012}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1000, file: !264, line: 380, baseType: !267, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1000, file: !264, line: 382, baseType: !13, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1000, file: !264, line: 384, baseType: !13, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1000, file: !264, line: 386, baseType: !1006, size: 32, offset: 96)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !264, line: 351, size: 16, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1007, file: !264, line: 359, baseType: !277, size: 8)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1007, file: !264, line: 364, baseType: !280, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1000, file: !264, line: 388, baseType: !251, size: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1000, file: !264, line: 396, baseType: !283, size: 32, offset: 160)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !992, file: !139, line: 530, baseType: !1014, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!252, !998, !295}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !992, file: !139, line: 532, baseType: !1018, size: 32, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!252, !998, !301, !296}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !992, file: !139, line: 535, baseType: !1022, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!252, !998, !301}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !992, file: !139, line: 537, baseType: !1022, size: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !992, file: !139, line: 539, baseType: !1022, size: 32, offset: 160)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !992, file: !139, line: 541, baseType: !1028, size: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!252, !998, !288, !138, !144}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !992, file: !139, line: 544, baseType: !1032, size: 32, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!252, !998, !1035, !280}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !139, line: 478, size: 96, elements: !1037)
!1037 = !{!1038, !1044, !1049}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1036, file: !139, line: 482, baseType: !1039, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !321, line: 33, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !321, line: 29, size: 32, elements: !1041)
!1041 = !{!1042}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !321, line: 30, baseType: !1043, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1036, file: !139, line: 485, baseType: !1045, size: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !139, line: 464, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 32)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !998, !1035, !301}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1036, file: !139, line: 493, baseType: !301, size: 32, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !992, file: !139, line: 547, baseType: !1051, size: 32, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 32)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!290, !998}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !139, line: 428, size: 32, elements: !1057)
!1057 = !{!1058}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1056, file: !139, line: 434, baseType: !301, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !139, line: 441, size: 32, elements: !1062)
!1062 = !{!1063}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1061, file: !139, line: 447, baseType: !301, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 32)
!1065 = !{!984}
!1066 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !479, line: 51, size: 64, elements: !1069)
!1069 = !{!1070, !1074}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1068, file: !479, line: 60, baseType: !1071, size: 32)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 32)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!252, !998}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1068, file: !479, line: 65, baseType: !998, size: 32, offset: 32)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "gains", scope: !1077, file: !1078, line: 16, type: !1164, isLocal: true, isDefinition: true)
!1077 = distinct !DISubprogram(name: "adc_gain_invert", scope: !1078, file: !1078, line: 9, type: !1079, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1082, retainedNodes: !1151)
!1078 = !DIFile(filename: "zephyr/drivers/adc/adc_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!252, !30, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
