; ModuleID = './build/flash_read_write_data.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.flash_info_t = type { i8*, i8, i32, i32, i32, i8, i8, i8 }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!79 = distinct !DIGlobalVariable(name: "sf_Mutex", scope: !2, file: !3, line: 78, type: !7, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !83, file: !84, line: 71, type: !158, isLocal: false, isDefinition: true)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !85, retainedTypes: !136, globals: !141, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!85 = !{!86, !91}
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 121, baseType: !30, size: 32, elements: !88)
!87 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!90 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !92, line: 47, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!94 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!95 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!96 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!97 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!98 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!99 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!100 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!101 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!102 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!103 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!104 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!105 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!106 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!107 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!108 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!109 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!110 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!111 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!112 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!113 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!114 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!115 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!116 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!117 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!118 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!119 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!120 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!121 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!122 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!123 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!124 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!125 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!126 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!127 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!128 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!129 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!130 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!131 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!132 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!133 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!134 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!135 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!136 = !{!137, !140}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !87, line: 116, baseType: !30)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !92, line: 95, baseType: !91)
!141 = !{!81, !142}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !83, file: !84, line: 67, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !145, line: 111, baseType: !146)
!145 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 109, size: 96, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !146, file: !145, line: 110, baseType: !149, size: 96)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !145, line: 106, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 102, size: 96, elements: !151)
!151 = !{!152, !156, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !150, file: !145, line: 103, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{null}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !150, file: !145, line: 104, baseType: !153, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !150, file: !145, line: 105, baseType: !153, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !87, line: 62, baseType: !30)
!160 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!161 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "g_sfc_security_enable", scope: !164, file: !165, line: 58, type: !30, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !173, globals: !180, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!166 = !{!167}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 45, baseType: !30, size: 32, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIEnumerator(name: "SF_UNDEF", value: 0)
!170 = !DIEnumerator(name: "SPI", value: 1)
!171 = !DIEnumerator(name: "SPIQ", value: 2)
!172 = !DIEnumerator(name: "QPI", value: 3)
!173 = !{!137, !174, !30, !175, !177, !178}
!174 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!180 = !{!162}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "gSFC_max_data_size", scope: !183, file: !184, line: 67, type: !30, isLocal: false, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !192, globals: !211, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/spi_flash.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!185 = !{!35, !5, !167, !186}
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 66, baseType: !7, size: 32, elements: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DIEnumerator(name: "FLASH_NOT_READY", value: -1)
!189 = !DIEnumerator(name: "FLASH_READY", value: 0)
!190 = !DIEnumerator(name: "FLASH_PROGRAMMING", value: 1)
!191 = !DIEnumerator(name: "FLASH_ERASING", value: 2)
!192 = !{!193, !195, !196, !30, !51, !210, !61, !139}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!195 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chip_info", file: !6, line: 137, size: 192, elements: !199)
!199 = !{!200, !203, !204, !205, !206, !207, !208, !209}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !6, line: 138, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !6, line: 139, baseType: !58, size: 8, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !198, file: !6, line: 140, baseType: !195, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !198, file: !6, line: 141, baseType: !195, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !198, file: !6, line: 142, baseType: !30, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !198, file: !6, line: 144, baseType: !58, size: 8, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !198, file: !6, line: 145, baseType: !58, size: 8, offset: 168)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !198, file: !6, line: 146, baseType: !58, size: 8, offset: 176)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!211 = !{!181, !212, !217, !222, !227, !230, !232, !237, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !259, !264, !266, !268, !270, !273}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_winbond", scope: !183, file: !184, line: 70, type: !214, isLocal: false, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 96, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 12)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_winbond", scope: !183, file: !184, line: 73, type: !219, isLocal: false, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 32, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 4)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_winbond", scope: !183, file: !184, line: 76, type: !224, isLocal: false, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 72, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 9)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "cmdlist_suspend_winbond", scope: !183, file: !184, line: 79, type: !229, isLocal: false, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !220)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "cmdlist_resume_winbond", scope: !183, file: !184, line: 82, type: !229, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_mxic", scope: !183, file: !184, line: 87, type: !234, isLocal: false, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 8)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_mxic", scope: !183, file: !184, line: 91, type: !234, isLocal: false, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_mxic", scope: !183, file: !184, line: 95, type: !234, isLocal: false, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd", scope: !183, file: !184, line: 100, type: !224, isLocal: false, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd", scope: !183, file: !184, line: 104, type: !224, isLocal: false, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd", scope: !183, file: !184, line: 108, type: !224, isLocal: false, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd25q32c", scope: !183, file: !184, line: 112, type: !234, isLocal: false, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd25q32c", scope: !183, file: !184, line: 115, type: !234, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd25q32c", scope: !183, file: !184, line: 119, type: !234, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_micron", scope: !183, file: !184, line: 123, type: !234, isLocal: false, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_micron", scope: !183, file: !184, line: 126, type: !234, isLocal: false, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_micron", scope: !183, file: !184, line: 130, type: !234, isLocal: false, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_spimode", scope: !183, file: !184, line: 135, type: !261, isLocal: false, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 56, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 7)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_qpimode", scope: !183, file: !184, line: 138, type: !261, isLocal: false, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "spi_chip_info", scope: !183, file: !184, line: 142, type: !196, isLocal: false, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "gd_write_sr2_1", scope: !183, file: !184, line: 161, type: !7, isLocal: false, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "support_flash_id", scope: !183, file: !184, line: 162, type: !272, isLocal: false, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_TYPT", file: !6, line: 81, baseType: !35)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "chips_data", scope: !183, file: !184, line: 144, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 2496, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 13)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !280, file: !281, line: 43, type: !61, isLocal: true, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !282, globals: !287, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!282 = !{!175, !159, !59, !283, !284, !286}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !87, line: 133, baseType: !30)
!287 = !{!278, !288}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !280, file: !281, line: 44, type: !61, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !292, file: !293, line: 54, type: !61, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !294, retainedTypes: !318, globals: !326, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!294 = !{!295, !301}
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !296, line: 71, baseType: !30, size: 32, elements: !297)
!296 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!297 = !{!298, !299, !300}
!298 = !DIEnumerator(name: "UART_PORT0", value: 0)
!299 = !DIEnumerator(name: "UART_PORT1", value: 1)
!300 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 129, baseType: !30, size: 32, elements: !303)
!302 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!304 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!305 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!306 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!307 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!308 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!309 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!310 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!311 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!312 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!313 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!314 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!315 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!316 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!317 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!318 = !{!175, !61, !319, !321, !323, !324, !159}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !87, line: 113, baseType: !322)
!322 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !87, line: 59, baseType: !58)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !323)
!326 = !{!290}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !329, file: !330, line: 51, type: !409, isLocal: false, isDefinition: true)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !331, retainedTypes: !378, globals: !408, splitDebugInlining: false, nameTableKind: None)
!330 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!331 = !{!332, !343, !362, !369}
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 163, baseType: !7, size: 32, elements: !334)
!333 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342}
!335 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!336 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!337 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!338 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!339 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!340 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!341 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!342 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 186, baseType: !30, size: 32, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!345 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!346 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!347 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!348 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!349 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!350 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!351 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!352 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!353 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!354 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!355 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!356 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!357 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!358 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!359 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!360 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!361 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 176, baseType: !30, size: 32, elements: !363)
!363 = !{!364, !365, !366, !367, !368}
!364 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!365 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!366 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!367 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!368 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!369 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 99, baseType: !30, size: 32, elements: !371)
!370 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!371 = !{!372, !373, !374, !375, !376, !377}
!372 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!373 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!374 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!375 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!376 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!377 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!378 = !{!379, !51}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !381, line: 72, baseType: !382)
!381 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 56, size: 525312, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !398, !399, !403, !407}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !382, file: !381, line: 57, baseType: !60, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !382, file: !381, line: 58, baseType: !60, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !382, file: !381, line: 59, baseType: !60, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !382, file: !381, line: 60, baseType: !60, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !382, file: !381, line: 61, baseType: !60, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !382, file: !381, line: 62, baseType: !60, size: 32, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !382, file: !381, line: 63, baseType: !60, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !382, file: !381, line: 64, baseType: !60, size: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !382, file: !381, line: 65, baseType: !60, size: 32, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !382, file: !381, line: 66, baseType: !60, size: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !382, file: !381, line: 67, baseType: !395, size: 32, offset: 320)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 1)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !382, file: !381, line: 68, baseType: !60, size: 32, offset: 352)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !382, file: !381, line: 69, baseType: !400, size: 523904, offset: 384)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 16372)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !382, file: !381, line: 70, baseType: !404, size: 512, offset: 524288)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !382, file: !381, line: 71, baseType: !404, size: 512, offset: 524800)
!408 = !{!327}
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "g_cache_con", scope: !412, file: !413, line: 48, type: !447, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !414, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!414 = !{!410, !415, !418}
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "g_cache_region_en", scope: !412, file: !413, line: 49, type: !417, isLocal: false, isDefinition: true)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGION_EN_Type", file: !370, line: 66, baseType: !61)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "g_cache_entry", scope: !412, file: !413, line: 50, type: !420, isLocal: false, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 1024, elements: !405)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_Type", file: !370, line: 90, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 87, size: 64, elements: !423)
!423 = !{!424, !437}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cache_entry_n", scope: !422, file: !370, line: 88, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_N_Type", file: !370, line: 77, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !370, line: 68, size: 32, elements: !427)
!427 = !{!428, !436}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !426, file: !370, line: 75, baseType: !429, size: 32)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !426, file: !370, line: 69, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434, !435}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !429, file: !370, line: 70, baseType: !61, size: 5, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ATTR", scope: !429, file: !370, line: 71, baseType: !61, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !429, file: !370, line: 72, baseType: !61, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !429, file: !370, line: 73, baseType: !61, size: 3, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !429, file: !370, line: 74, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !426, file: !370, line: 76, baseType: !61, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cache_end_entry_n", scope: !422, file: !370, line: 89, baseType: !438, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_END_ENTRY_N_Type", file: !370, line: 85, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !370, line: 79, size: 32, elements: !440)
!440 = !{!441, !446}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !439, file: !370, line: 83, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !370, line: 80, size: 32, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !442, file: !370, line: 81, baseType: !61, size: 12, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !442, file: !370, line: 82, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !439, file: !370, line: 84, baseType: !61, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_CON_Type", file: !370, line: 64, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !370, line: 51, size: 32, elements: !449)
!449 = !{!450, !462}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !448, file: !370, line: 62, baseType: !451, size: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !370, line: 52, size: 32, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "MCEN", scope: !451, file: !370, line: 53, baseType: !61, size: 1, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "MPEN", scope: !451, file: !370, line: 54, baseType: !61, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN0", scope: !451, file: !370, line: 55, baseType: !61, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN1", scope: !451, file: !370, line: 56, baseType: !61, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "MPDEFEN", scope: !451, file: !370, line: 57, baseType: !61, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !451, file: !370, line: 58, baseType: !61, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "MDRF", scope: !451, file: !370, line: 59, baseType: !61, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "CACHESIZE", scope: !451, file: !370, line: 60, baseType: !61, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !451, file: !370, line: 61, baseType: !61, size: 22, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !448, file: !370, line: 63, baseType: !61, size: 32)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !465, file: !466, line: 53, type: !547, isLocal: false, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !467, retainedTypes: !476, globals: !546, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!467 = !{!468, !91}
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !469, line: 152, baseType: !7, size: 32, elements: !470)
!469 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!470 = !{!471, !472, !473, !474, !475}
!471 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!472 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!473 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!474 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!475 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!476 = !{!477, !51, !61, !478, !480, !511}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !92, line: 97, baseType: !140)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 44, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 77, baseType: !7)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !482, line: 378, baseType: !483)
!482 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 363, size: 28704, elements: !484)
!484 = !{!485, !487, !491, !492, !493, !494, !495, !496, !497, !498, !502, !506, !510}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !483, file: !482, line: 365, baseType: !486, size: 256)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, elements: !235)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !483, file: !482, line: 366, baseType: !488, size: 768, offset: 256)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 24)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !483, file: !482, line: 367, baseType: !486, size: 256, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !483, file: !482, line: 368, baseType: !488, size: 768, offset: 1280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !483, file: !482, line: 369, baseType: !486, size: 256, offset: 2048)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !483, file: !482, line: 370, baseType: !488, size: 768, offset: 2304)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !483, file: !482, line: 371, baseType: !486, size: 256, offset: 3072)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !483, file: !482, line: 372, baseType: !488, size: 768, offset: 3328)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !483, file: !482, line: 373, baseType: !486, size: 256, offset: 4096)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !483, file: !482, line: 374, baseType: !499, size: 1792, offset: 4352)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1792, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 56)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !483, file: !482, line: 375, baseType: !503, size: 1920, offset: 6144)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1920, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 240)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !483, file: !482, line: 376, baseType: !507, size: 20608, offset: 8064)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 20608, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 644)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !483, file: !482, line: 377, baseType: !60, size: 32, offset: 28672)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !482, line: 418, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 395, size: 1120, elements: !514)
!514 = !{!515, !517, !518, !519, !520, !521, !522, !524, !525, !526, !527, !528, !529, !530, !531, !535, !536, !537, !539, !543, !545}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !513, file: !482, line: 397, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !513, file: !482, line: 398, baseType: !60, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !513, file: !482, line: 399, baseType: !60, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !513, file: !482, line: 400, baseType: !60, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !513, file: !482, line: 401, baseType: !60, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !513, file: !482, line: 402, baseType: !60, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !513, file: !482, line: 403, baseType: !523, size: 96, offset: 192)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !215)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !513, file: !482, line: 404, baseType: !60, size: 32, offset: 288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !513, file: !482, line: 405, baseType: !60, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !513, file: !482, line: 406, baseType: !60, size: 32, offset: 352)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !513, file: !482, line: 407, baseType: !60, size: 32, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !513, file: !482, line: 408, baseType: !60, size: 32, offset: 416)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !513, file: !482, line: 409, baseType: !60, size: 32, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !513, file: !482, line: 410, baseType: !60, size: 32, offset: 480)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !513, file: !482, line: 411, baseType: !532, size: 64, offset: 512)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 64, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 2)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !513, file: !482, line: 412, baseType: !516, size: 32, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !513, file: !482, line: 413, baseType: !516, size: 32, offset: 608)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !513, file: !482, line: 414, baseType: !538, size: 128, offset: 640)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 128, elements: !220)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !513, file: !482, line: 415, baseType: !540, size: 160, offset: 768)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 160, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 5)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !513, file: !482, line: 416, baseType: !544, size: 160, offset: 928)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !541)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !513, file: !482, line: 417, baseType: !60, size: 32, offset: 1088)
!546 = !{!463}
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 6144, elements: !556)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !466, line: 50, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !466, line: 47, size: 64, elements: !550)
!550 = !{!551, !555}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !549, file: !466, line: 48, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !477}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !549, file: !466, line: 49, baseType: !61, size: 32, offset: 32)
!556 = !{!557}
!557 = !DISubrange(count: 96)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !560, file: !561, line: 61, type: !580, isLocal: true, isDefinition: true)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !562, retainedTypes: !578, globals: !579, splitDebugInlining: false, nameTableKind: None)
!561 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!562 = !{!20, !563, !570, !28, !574}
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 657, baseType: !30, size: 32, elements: !564)
!564 = !{!565, !566, !567, !568, !569}
!565 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!566 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!567 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!568 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!569 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 397, baseType: !30, size: 32, elements: !571)
!571 = !{!572, !573}
!572 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!573 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 380, baseType: !30, size: 32, elements: !575)
!575 = !{!576, !577}
!576 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!577 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!578 = !{!51, !61}
!579 = !{!558}
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 640, elements: !541)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !561, line: 55, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 51, size: 128, elements: !583)
!583 = !{!584, !586, !596}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !582, file: !561, line: 52, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !21, line: 400, baseType: !570)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !582, file: !561, line: 53, baseType: !587, size: 64, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !561, line: 49, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 46, size: 64, elements: !589)
!589 = !{!590, !595}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !588, file: !561, line: 47, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !21, line: 371, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !51}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !588, file: !561, line: 48, baseType: !51, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !582, file: !561, line: 54, baseType: !69, size: 8, offset: 96)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !599, file: !600, line: 77, type: !664, isLocal: true, isDefinition: true)
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !601, retainedTypes: !651, globals: !652, splitDebugInlining: false, nameTableKind: None)
!600 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!601 = !{!602, !610, !615, !631, !637, !641, !295, !301, !646}
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 345, baseType: !7, size: 32, elements: !604)
!603 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!606 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!607 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!608 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!609 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 109, baseType: !30, size: 32, elements: !611)
!611 = !{!612, !613, !614}
!612 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!613 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!614 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 302, baseType: !30, size: 32, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!617 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!618 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!619 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!620 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!621 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!622 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!623 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!624 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!625 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!626 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!627 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!628 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!629 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!630 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 321, baseType: !30, size: 32, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!634 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!635 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!636 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 330, baseType: !30, size: 32, elements: !638)
!638 = !{!639, !640}
!639 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!640 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 337, baseType: !30, size: 32, elements: !642)
!642 = !{!643, !644, !645}
!643 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!644 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!645 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!646 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 355, baseType: !7, size: 32, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!649 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!650 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!651 = !{!30, !51, !58, !202, !54}
!652 = !{!597, !653}
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "func_tbl", scope: !655, file: !600, line: 536, type: !662, isLocal: true, isDefinition: true)
!655 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !600, file: !600, line: 534, type: !656, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !599, retainedNodes: !660)
!656 = !DISubroutineType(types: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !302, line: 197, baseType: !153)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !29, line: 113, baseType: !610)
!660 = !{!661}
!661 = !DILocalVariable(name: "uart_port", arg: 1, scope: !655, file: !600, line: 534, type: !659)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 64, elements: !533)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 1024, elements: !533)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !600, line: 75, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 68, size: 512, elements: !667)
!667 = !{!668, !669, !681, !682, !693, !694}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !666, file: !600, line: 69, baseType: !69, size: 8)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !666, file: !600, line: 70, baseType: !670, size: 128, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !603, line: 378, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 373, size: 128, elements: !672)
!672 = !{!673, !675, !677, !679}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !671, file: !603, line: 374, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !603, line: 317, baseType: !615)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !671, file: !603, line: 375, baseType: !676, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !603, line: 326, baseType: !631)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !671, file: !603, line: 376, baseType: !678, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !603, line: 333, baseType: !637)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !671, file: !603, line: 377, baseType: !680, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !603, line: 341, baseType: !641)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !666, file: !600, line: 71, baseType: !69, size: 8, offset: 160)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !666, file: !600, line: 72, baseType: !683, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !600, line: 66, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 63, size: 64, elements: !685)
!685 = !{!686, !692}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !684, file: !600, line: 64, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !603, line: 410, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !691, !51}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !603, line: 359, baseType: !646)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !684, file: !600, line: 65, baseType: !51, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !666, file: !600, line: 73, baseType: !69, size: 8, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !666, file: !600, line: 74, baseType: !695, size: 224, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !603, line: 390, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 382, size: 224, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !696, file: !603, line: 383, baseType: !210, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !696, file: !603, line: 384, baseType: !61, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !696, file: !603, line: 385, baseType: !61, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !696, file: !603, line: 386, baseType: !210, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !696, file: !603, line: 387, baseType: !61, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !696, file: !603, line: 388, baseType: !61, size: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !696, file: !603, line: 389, baseType: !61, size: 32, offset: 192)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_default", scope: !707, file: !708, line: 164, type: !214, isLocal: false, isDefinition: true)
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !709, globals: !724, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "../../../../../driver/board/mt76x7_hdk/external_flash/src/bsp_flash_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!709 = !{!710, !51}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_info_t", file: !713, line: 48, baseType: !714)
!713 = !DIFile(filename: "../../../../../driver/board/mt76x7_hdk/external_flash/inc/bsp_flash_config.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !713, line: 38, size: 192, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !714, file: !713, line: 39, baseType: !201, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !714, file: !713, line: 40, baseType: !58, size: 8, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !714, file: !713, line: 41, baseType: !195, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !714, file: !713, line: 42, baseType: !195, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !714, file: !713, line: 43, baseType: !30, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !714, file: !713, line: 45, baseType: !58, size: 8, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !714, file: !713, line: 46, baseType: !58, size: 8, offset: 168)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !714, file: !713, line: 47, baseType: !58, size: 8, offset: 176)
!724 = !{!705, !725, !727, !729}
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_default", scope: !707, file: !708, line: 167, type: !219, isLocal: false, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_default", scope: !707, file: !708, line: 170, type: !224, isLocal: false, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "customer_flash_info", scope: !707, file: !708, line: 174, type: !711, isLocal: false, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !733, file: !734, line: 59, type: !61, isLocal: false, isDefinition: true)
!733 = distinct !DICompileUnit(language: DW_LANG_C99, file: !734, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !735, globals: !788, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/flash_read_write_data/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!735 = !{!736, !744, !769}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !482, line: 656, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 650, size: 128, elements: !739)
!739 = !{!740, !741, !742, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !738, file: !482, line: 652, baseType: !60, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !738, file: !482, line: 653, baseType: !60, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !738, file: !482, line: 654, baseType: !60, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !738, file: !482, line: 655, baseType: !516, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !482, line: 418, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 395, size: 1120, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !746, file: !482, line: 397, baseType: !516, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !746, file: !482, line: 398, baseType: !60, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !746, file: !482, line: 399, baseType: !60, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !746, file: !482, line: 400, baseType: !60, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !746, file: !482, line: 401, baseType: !60, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !746, file: !482, line: 402, baseType: !60, size: 32, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !746, file: !482, line: 403, baseType: !523, size: 96, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !746, file: !482, line: 404, baseType: !60, size: 32, offset: 288)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !746, file: !482, line: 405, baseType: !60, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !746, file: !482, line: 406, baseType: !60, size: 32, offset: 352)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !746, file: !482, line: 407, baseType: !60, size: 32, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !746, file: !482, line: 408, baseType: !60, size: 32, offset: 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !746, file: !482, line: 409, baseType: !60, size: 32, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !746, file: !482, line: 410, baseType: !60, size: 32, offset: 480)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !746, file: !482, line: 411, baseType: !532, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !746, file: !482, line: 412, baseType: !516, size: 32, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !746, file: !482, line: 413, baseType: !516, size: 32, offset: 608)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !746, file: !482, line: 414, baseType: !538, size: 128, offset: 640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !746, file: !482, line: 415, baseType: !540, size: 160, offset: 768)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !746, file: !482, line: 416, baseType: !544, size: 160, offset: 928)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !746, file: !482, line: 417, baseType: !60, size: 32, offset: 1088)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !381, line: 72, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 56, size: 525312, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !771, file: !381, line: 57, baseType: !60, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !771, file: !381, line: 58, baseType: !60, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !771, file: !381, line: 59, baseType: !60, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !771, file: !381, line: 60, baseType: !60, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !771, file: !381, line: 61, baseType: !60, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !771, file: !381, line: 62, baseType: !60, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !771, file: !381, line: 63, baseType: !60, size: 32, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !771, file: !381, line: 64, baseType: !60, size: 32, offset: 224)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !771, file: !381, line: 65, baseType: !60, size: 32, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !771, file: !381, line: 66, baseType: !60, size: 32, offset: 288)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !771, file: !381, line: 67, baseType: !395, size: 32, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !771, file: !381, line: 68, baseType: !60, size: 32, offset: 352)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !771, file: !381, line: 69, baseType: !400, size: 523904, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !771, file: !381, line: 70, baseType: !404, size: 512, offset: 524288)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !771, file: !381, line: 71, baseType: !404, size: 512, offset: 524800)
!788 = !{!731, !789}
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !733, file: !734, line: 61, type: !60, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "heap_end", scope: !793, file: !794, line: 66, type: !201, isLocal: true, isDefinition: true)
!793 = distinct !DISubprogram(name: "_sbrk_r", scope: !794, file: !794, line: 63, type: !795, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !986, retainedNodes: !990)
!794 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/flash_read_write_data/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !799, !985}
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !798, line: 123, baseType: !201)
!798 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !801, line: 377, size: 1920, elements: !802)
!801 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!802 = !{!803, !804, !875, !876, !877, !878, !879, !880, !881, !884, !904, !908, !909, !910, !911, !921, !934, !935, !940, !959, !960, !967, !968, !984}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !800, file: !801, line: 381, baseType: !7, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !800, file: !801, line: 386, baseType: !805, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !801, line: 292, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !801, line: 186, size: 832, elements: !808)
!808 = !{!809, !810, !811, !812, !814, !815, !820, !821, !822, !823, !827, !833, !839, !843, !844, !845, !846, !850, !852, !853, !854, !856, !862, !874}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !807, file: !801, line: 187, baseType: !177, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !807, file: !801, line: 188, baseType: !7, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !807, file: !801, line: 189, baseType: !7, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !807, file: !801, line: 190, baseType: !813, size: 16, offset: 96)
!813 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !807, file: !801, line: 191, baseType: !813, size: 16, offset: 112)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !807, file: !801, line: 192, baseType: !816, size: 64, offset: 128)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !801, line: 122, size: 64, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !816, file: !801, line: 123, baseType: !177, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !816, file: !801, line: 124, baseType: !7, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !807, file: !801, line: 193, baseType: !7, size: 32, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !807, file: !801, line: 196, baseType: !799, size: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !807, file: !801, line: 200, baseType: !51, size: 32, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !807, file: !801, line: 202, baseType: !824, size: 32, offset: 288)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DISubroutineType(types: !826)
!826 = !{!7, !799, !51, !201, !7}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !807, file: !801, line: 204, baseType: !828, size: 32, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DISubroutineType(types: !830)
!830 = !{!7, !799, !51, !831, !7}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !807, file: !801, line: 207, baseType: !834, size: 32, offset: 352)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{!837, !799, !51, !837, !7}
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !838, line: 116, baseType: !174)
!838 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !807, file: !801, line: 208, baseType: !840, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{!7, !799, !51}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !807, file: !801, line: 211, baseType: !816, size: 64, offset: 416)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !807, file: !801, line: 212, baseType: !177, size: 32, offset: 480)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !807, file: !801, line: 213, baseType: !7, size: 32, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !807, file: !801, line: 216, baseType: !847, size: 24, offset: 544)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 3)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !807, file: !801, line: 217, baseType: !851, size: 8, offset: 568)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !396)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !807, file: !801, line: 220, baseType: !816, size: 64, offset: 576)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !807, file: !801, line: 223, baseType: !7, size: 32, offset: 640)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !807, file: !801, line: 224, baseType: !855, size: 32, offset: 672)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !838, line: 46, baseType: !174)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !807, file: !801, line: 231, baseType: !857, size: 32, offset: 704)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !801, line: 35, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !859, line: 34, baseType: !860)
!859 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !859, line: 33, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !807, file: !801, line: 233, baseType: !863, size: 64, offset: 736)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !838, line: 170, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !838, line: 162, size: 64, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !864, file: !838, line: 164, baseType: !7, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !864, file: !838, line: 169, baseType: !868, size: 32, offset: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !864, file: !838, line: 165, size: 32, elements: !869)
!869 = !{!870, !873}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !868, file: !838, line: 167, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !872, line: 116, baseType: !7)
!872 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !868, file: !838, line: 168, baseType: !229, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !807, file: !801, line: 234, baseType: !7, size: 32, offset: 800)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !800, file: !801, line: 386, baseType: !805, size: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !800, file: !801, line: 386, baseType: !805, size: 32, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !800, file: !801, line: 388, baseType: !7, size: 32, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !800, file: !801, line: 390, baseType: !201, size: 32, offset: 160)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !800, file: !801, line: 392, baseType: !7, size: 32, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !800, file: !801, line: 394, baseType: !7, size: 32, offset: 224)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !800, file: !801, line: 395, baseType: !882, size: 32, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !801, line: 45, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !800, file: !801, line: 397, baseType: !885, size: 32, offset: 288)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !801, line: 349, size: 128, elements: !887)
!887 = !{!888, !900, !901, !902}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !886, file: !801, line: 352, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !801, line: 52, size: 192, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !890, file: !801, line: 54, baseType: !889, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !890, file: !801, line: 55, baseType: !7, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !890, file: !801, line: 55, baseType: !7, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !890, file: !801, line: 55, baseType: !7, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !890, file: !801, line: 55, baseType: !7, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !890, file: !801, line: 56, baseType: !898, size: 32, offset: 160)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 32, elements: !396)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !801, line: 22, baseType: !195)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !886, file: !801, line: 353, baseType: !7, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !886, file: !801, line: 354, baseType: !889, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !886, file: !801, line: 355, baseType: !903, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !800, file: !801, line: 399, baseType: !905, size: 32, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !799}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !800, file: !801, line: 401, baseType: !7, size: 32, offset: 352)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !800, file: !801, line: 404, baseType: !7, size: 32, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !800, file: !801, line: 405, baseType: !201, size: 32, offset: 416)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !800, file: !801, line: 407, baseType: !912, size: 32, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !801, line: 324, size: 192, elements: !914)
!914 = !{!915, !917, !918, !919}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !913, file: !801, line: 325, baseType: !916, size: 48)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 48, elements: !848)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !913, file: !801, line: 326, baseType: !916, size: 48, offset: 48)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !913, file: !801, line: 327, baseType: !322, size: 16, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !913, file: !801, line: 330, baseType: !920, size: 64, offset: 128)
!920 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !800, file: !801, line: 408, baseType: !922, size: 32, offset: 480)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !801, line: 60, size: 288, elements: !924)
!924 = !{!925, !926, !927, !928, !929, !930, !931, !932, !933}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !923, file: !801, line: 62, baseType: !7, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !923, file: !801, line: 63, baseType: !7, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !923, file: !801, line: 64, baseType: !7, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !923, file: !801, line: 65, baseType: !7, size: 32, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !923, file: !801, line: 66, baseType: !7, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !923, file: !801, line: 67, baseType: !7, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !923, file: !801, line: 68, baseType: !7, size: 32, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !923, file: !801, line: 69, baseType: !7, size: 32, offset: 224)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !923, file: !801, line: 70, baseType: !7, size: 32, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !800, file: !801, line: 409, baseType: !201, size: 32, offset: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !800, file: !801, line: 412, baseType: !936, size: 32, offset: 544)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !7}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !800, file: !801, line: 416, baseType: !941, size: 32, offset: 576)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !801, line: 90, size: 1120, elements: !943)
!943 = !{!944, !945, !946, !950}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !942, file: !801, line: 91, baseType: !941, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !942, file: !801, line: 92, baseType: !7, size: 32, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !942, file: !801, line: 93, baseType: !947, size: 1024, offset: 64)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 1024, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !942, file: !801, line: 94, baseType: !951, size: 32, offset: 1088)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !801, line: 79, size: 2112, elements: !953)
!953 = !{!954, !956, !957, !958}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !952, file: !801, line: 80, baseType: !955, size: 1024)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1024, elements: !948)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !952, file: !801, line: 81, baseType: !955, size: 1024, offset: 1024)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !952, file: !801, line: 83, baseType: !899, size: 32, offset: 2048)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !952, file: !801, line: 86, baseType: !899, size: 32, offset: 2080)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !800, file: !801, line: 417, baseType: !942, size: 1120, offset: 608)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !800, file: !801, line: 420, baseType: !961, size: 96, offset: 1728)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !801, line: 296, size: 96, elements: !962)
!962 = !{!963, !965, !966}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !961, file: !801, line: 298, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !961, file: !801, line: 299, baseType: !7, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !961, file: !801, line: 300, baseType: !805, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !800, file: !801, line: 421, baseType: !805, size: 32, offset: 1824)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !800, file: !801, line: 422, baseType: !969, size: 32, offset: 1856)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !801, line: 359, size: 640, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !978, !979, !980, !981, !982, !983}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !970, file: !801, line: 362, baseType: !201, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !970, file: !801, line: 363, baseType: !863, size: 64, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !970, file: !801, line: 364, baseType: !863, size: 64, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !970, file: !801, line: 365, baseType: !863, size: 64, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !970, file: !801, line: 366, baseType: !977, size: 64, offset: 224)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !235)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !970, file: !801, line: 367, baseType: !7, size: 32, offset: 288)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !970, file: !801, line: 368, baseType: !863, size: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !970, file: !801, line: 369, baseType: !863, size: 64, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !970, file: !801, line: 370, baseType: !863, size: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !970, file: !801, line: 371, baseType: !863, size: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !970, file: !801, line: 372, baseType: !863, size: 64, offset: 576)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !800, file: !801, line: 423, baseType: !201, size: 32, offset: 1888)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !872, line: 46, baseType: !30)
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !988, globals: !989, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!988 = !{!201, !797}
!989 = !{!791}
!990 = !{!991, !992, !993, !994}
!991 = !DILocalVariable(name: "r", arg: 1, scope: !793, file: !794, line: 63, type: !799)
!992 = !DILocalVariable(name: "nbytes", arg: 2, scope: !793, file: !794, line: 63, type: !985)
!993 = !DILocalVariable(name: "prev_heap_end", scope: !793, file: !794, line: 67, type: !201)
!994 = !DILocalVariable(name: "stack", scope: !793, file: !794, line: 68, type: !201)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !997, file: !1002, line: 4, type: !1008, isLocal: false, isDefinition: true)
!997 = distinct !DICompileUnit(language: DW_LANG_C99, file: !998, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !999, splitDebugInlining: false, nameTableKind: None)
!998 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!999 = !{!995, !1000, !1006}
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !997, file: !1002, line: 5, type: !1003, isLocal: false, isDefinition: true)
!1002 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 88, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 11)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !997, file: !1002, line: 6, type: !1003, isLocal: false, isDefinition: true)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 248, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 31)
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1013, retainedTypes: !1019, splitDebugInlining: false, nameTableKind: None)
!1012 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!1013 = !{!1014}
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1015, line: 1209, baseType: !30, size: 32, elements: !1016)
!1015 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!1016 = !{!1017, !1018}
!1017 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!1018 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!1019 = !{!137, !139}
!1020 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1021, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1022, retainedTypes: !1100, splitDebugInlining: false, nameTableKind: None)
!1021 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!1022 = !{!1023}
!1023 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1024, line: 150, baseType: !30, size: 32, elements: !1025)
!1024 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099}
!1026 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!1027 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!1028 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!1029 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!1030 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!1031 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!1032 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!1033 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!1034 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!1035 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!1036 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!1037 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!1038 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!1039 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!1040 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!1041 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!1042 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!1043 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!1044 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!1045 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!1046 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!1047 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!1048 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!1049 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!1050 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!1051 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!1052 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!1053 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!1054 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!1055 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!1056 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!1057 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!1058 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!1059 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!1060 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!1061 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!1062 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!1063 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!1064 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!1065 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!1066 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!1067 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!1068 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!1069 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!1070 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!1071 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!1072 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!1073 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!1074 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!1075 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!1076 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!1077 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!1078 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!1079 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!1080 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!1081 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!1082 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!1083 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!1084 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!1085 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!1086 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!1087 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!1088 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!1089 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!1090 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!1091 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!1092 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!1093 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!1094 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!1095 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!1096 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!1097 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!1098 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!1099 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!1100 = !{!137, !159}
!1101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1102, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1103, splitDebugInlining: false, nameTableKind: None)
!1102 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/flash_read_write_data/GCC")
!1103 = !{!1104, !1129}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 32)
