; ModuleID = 'build/adafruit_itsybitsy_m4_express/sensor/lis2dh/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.11] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.11 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32*, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }
%struct.SercomUsart = type { %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.SERCOM_USART_BAUD_Type, %union.PORT_PMUX_Type, [5 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_DIR_Type, %struct.anon.11, [1 x i8], %union.SERCOM_USART_BAUD_Type, [4 x i8], %union.PORT_DIR_Type, [4 x i8], %union.PORT_PMUX_Type }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !111, file: !651, line: 149, type: !652, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !650, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh")
!113 = !{!102, !103, !114, !251, !336}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !116, line: 352, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 339, size: 448, elements: !118)
!118 = !{!119, !136, !148, !158, !169, !179, !189, !199, !210, !220, !230, !240}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !117, file: !116, line: 340, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !116, line: 57, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 44, size: 32, elements: !124)
!124 = !{!125, !135}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !123, file: !116, line: 55, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !116, line: 45, size: 32, elements: !127)
!127 = !{!128, !130, !131, !132, !133, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !126, file: !116, line: 47, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !126, file: !116, line: 49, baseType: !129, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !126, file: !116, line: 50, baseType: !129, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !126, file: !116, line: 51, baseType: !129, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !126, file: !116, line: 52, baseType: !129, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !126, file: !116, line: 53, baseType: !129, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !123, file: !116, line: 56, baseType: !129, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !117, file: !116, line: 341, baseType: !137, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !116, line: 124, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 114, size: 32, elements: !140)
!140 = !{!141, !147}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !139, file: !116, line: 122, baseType: !142, size: 32)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !139, file: !116, line: 115, size: 32, elements: !143)
!143 = !{!144, !145, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !142, file: !116, line: 117, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !142, file: !116, line: 118, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !142, file: !116, line: 120, baseType: !129, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !139, file: !116, line: 123, baseType: !129, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !117, file: !116, line: 342, baseType: !149, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !116, line: 161, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 155, size: 32, elements: !152)
!152 = !{!153, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !151, file: !116, line: 159, baseType: !154, size: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !116, line: 156, size: 32, elements: !155)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !154, file: !116, line: 157, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !151, file: !116, line: 160, baseType: !129, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 343, baseType: !159, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !116, line: 179, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 173, size: 32, elements: !163)
!163 = !{!164, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !162, file: !116, line: 177, baseType: !165, size: 32)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !116, line: 174, size: 32, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !165, file: !116, line: 175, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !162, file: !116, line: 178, baseType: !129, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !117, file: !116, line: 344, baseType: !170, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !116, line: 197, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 191, size: 32, elements: !173)
!173 = !{!174, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !172, file: !116, line: 195, baseType: !175, size: 32)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !172, file: !116, line: 192, size: 32, elements: !176)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !175, file: !116, line: 193, baseType: !129, size: 4, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !172, file: !116, line: 196, baseType: !129, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !117, file: !116, line: 345, baseType: !180, size: 96, offset: 160)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 96, elements: !187)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !182, line: 53, baseType: !183)
!182 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !186)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !{!188}
!188 = !DISubrange(count: 12)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !117, file: !116, line: 346, baseType: !190, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !116, line: 216, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 210, size: 32, elements: !193)
!193 = !{!194, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !192, file: !116, line: 214, baseType: !195, size: 32)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !116, line: 211, size: 32, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !195, file: !116, line: 212, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !192, file: !116, line: 215, baseType: !129, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !117, file: !116, line: 347, baseType: !200, size: 32, offset: 288)
!200 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !116, line: 236, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 228, size: 32, elements: !203)
!203 = !{!204, !209}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !202, file: !116, line: 234, baseType: !205, size: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !116, line: 229, size: 32, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !205, file: !116, line: 231, baseType: !129, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !205, file: !116, line: 233, baseType: !129, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !202, file: !116, line: 235, baseType: !129, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !117, file: !116, line: 348, baseType: !211, size: 32, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !116, line: 266, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 260, size: 32, elements: !214)
!214 = !{!215, !219}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !213, file: !116, line: 264, baseType: !216, size: 32)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !213, file: !116, line: 261, size: 32, elements: !217)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !216, file: !116, line: 262, baseType: !129, size: 2, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !213, file: !116, line: 265, baseType: !129, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !117, file: !116, line: 349, baseType: !221, size: 32, offset: 352)
!221 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !116, line: 291, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 285, size: 32, elements: !224)
!224 = !{!225, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !223, file: !116, line: 289, baseType: !226, size: 32)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !223, file: !116, line: 286, size: 32, elements: !227)
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !226, file: !116, line: 287, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !223, file: !116, line: 290, baseType: !129, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !117, file: !116, line: 350, baseType: !231, size: 32, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !116, line: 309, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 303, size: 32, elements: !234)
!234 = !{!235, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !233, file: !116, line: 307, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !116, line: 304, size: 32, elements: !237)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !236, file: !116, line: 305, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !233, file: !116, line: 308, baseType: !129, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !117, file: !116, line: 351, baseType: !241, size: 32, offset: 416)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !116, line: 326, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 321, size: 32, elements: !245)
!245 = !{!246, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !244, file: !116, line: 324, baseType: !247, size: 32)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !244, file: !116, line: 322, size: 32, elements: !248)
!248 = !{!249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !247, file: !116, line: 323, baseType: !129, size: 32, flags: DIFlagBitField, extraData: i64 0)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !244, file: !116, line: 325, baseType: !129, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !253, line: 267, baseType: !254)
!253 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !253, line: 259, size: 2560, elements: !255)
!255 = !{!256, !266, !270, !297, !301, !319, !323}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !254, file: !253, line: 260, baseType: !257, size: 8)
!257 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !253, line: 50, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !253, line: 44, size: 8, elements: !260)
!260 = !{!261, !265}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !259, file: !253, line: 48, baseType: !262, size: 8)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !259, file: !253, line: 45, size: 8, elements: !263)
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !262, file: !253, line: 46, baseType: !185, size: 1, flags: DIFlagBitField, extraData: i64 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !259, file: !253, line: 49, baseType: !185, size: 8)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !254, file: !253, line: 261, baseType: !267, size: 24, offset: 8)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 24, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 3)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !254, file: !253, line: 262, baseType: !271, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !253, line: 86, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !253, line: 62, size: 32, elements: !275)
!275 = !{!276, !292, !296}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !274, file: !253, line: 79, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !253, line: 63, size: 32, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !277, file: !253, line: 64, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !277, file: !253, line: 66, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !277, file: !253, line: 67, baseType: !129, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !277, file: !253, line: 68, baseType: !129, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !277, file: !253, line: 69, baseType: !129, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !277, file: !253, line: 70, baseType: !129, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !277, file: !253, line: 71, baseType: !129, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !277, file: !253, line: 72, baseType: !129, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !277, file: !253, line: 73, baseType: !129, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !277, file: !253, line: 74, baseType: !129, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !277, file: !253, line: 75, baseType: !129, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !277, file: !253, line: 76, baseType: !129, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !277, file: !253, line: 77, baseType: !129, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !274, file: !253, line: 84, baseType: !293, size: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !253, line: 80, size: 32, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !293, file: !253, line: 82, baseType: !129, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !274, file: !253, line: 85, baseType: !129, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !254, file: !253, line: 263, baseType: !298, size: 192, offset: 64)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 192, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 24)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !254, file: !253, line: 264, baseType: !302, size: 384, offset: 256)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 384, elements: !187)
!303 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !253, line: 163, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !253, line: 149, size: 32, elements: !306)
!306 = !{!307, !318}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !305, file: !253, line: 161, baseType: !308, size: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !305, file: !253, line: 150, size: 32, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !308, file: !253, line: 151, baseType: !129, size: 4, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !308, file: !253, line: 153, baseType: !129, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !308, file: !253, line: 154, baseType: !129, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !308, file: !253, line: 155, baseType: !129, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !308, file: !253, line: 156, baseType: !129, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !308, file: !253, line: 157, baseType: !129, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !308, file: !253, line: 158, baseType: !129, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !308, file: !253, line: 160, baseType: !129, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !305, file: !253, line: 162, baseType: !129, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !254, file: !253, line: 265, baseType: !320, size: 384, offset: 640)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 384, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 48)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !254, file: !253, line: 266, baseType: !324, size: 1536, offset: 1024)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 1536, elements: !321)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !253, line: 218, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !253, line: 209, size: 32, elements: !328)
!328 = !{!329, !335}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !327, file: !253, line: 216, baseType: !330, size: 32)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !253, line: 210, size: 32, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !330, file: !253, line: 211, baseType: !129, size: 4, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !330, file: !253, line: 213, baseType: !129, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !330, file: !253, line: 214, baseType: !129, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !327, file: !253, line: 217, baseType: !129, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !338, line: 788, baseType: !339)
!338 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 771, size: 704, elements: !340)
!340 = !{!341, !356, !357, !388, !419, !452, !487, !511, !523, !524, !541, !542, !554, !566, !579, !580}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !339, file: !338, line: 772, baseType: !342, size: 8)
!342 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !338, line: 55, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 44, size: 8, elements: !345)
!345 = !{!346, !351, !355}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !344, file: !338, line: 49, baseType: !347, size: 8)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !338, line: 45, size: 8, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !347, file: !338, line: 46, baseType: !185, size: 1, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !347, file: !338, line: 47, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !344, file: !338, line: 53, baseType: !352, size: 8)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !338, line: 50, size: 8, elements: !353)
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !352, file: !338, line: 51, baseType: !185, size: 2, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !344, file: !338, line: 54, baseType: !185, size: 8)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !339, file: !338, line: 773, baseType: !267, size: 24, offset: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !339, file: !338, line: 774, baseType: !358, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !338, line: 102, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 72, size: 32, elements: !361)
!361 = !{!362, !382, !387}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !360, file: !338, line: 95, baseType: !363, size: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !338, line: 73, size: 32, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !363, file: !338, line: 74, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !363, file: !338, line: 75, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !363, file: !338, line: 76, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !363, file: !338, line: 77, baseType: !129, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !363, file: !338, line: 79, baseType: !129, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !363, file: !338, line: 80, baseType: !129, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !363, file: !338, line: 81, baseType: !129, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !363, file: !338, line: 82, baseType: !129, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !363, file: !338, line: 83, baseType: !129, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !363, file: !338, line: 85, baseType: !129, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !363, file: !338, line: 86, baseType: !129, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !363, file: !338, line: 87, baseType: !129, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !363, file: !338, line: 88, baseType: !129, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !363, file: !338, line: 90, baseType: !129, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !363, file: !338, line: 91, baseType: !129, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !363, file: !338, line: 92, baseType: !129, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !363, file: !338, line: 93, baseType: !129, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !360, file: !338, line: 100, baseType: !383, size: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !338, line: 96, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !383, file: !338, line: 97, baseType: !129, size: 2, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !383, file: !338, line: 98, baseType: !129, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !360, file: !338, line: 101, baseType: !129, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !339, file: !338, line: 775, baseType: !389, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !338, line: 182, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 152, size: 32, elements: !392)
!392 = !{!393, !413, !418}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !391, file: !338, line: 175, baseType: !394, size: 32)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !391, file: !338, line: 153, size: 32, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !394, file: !338, line: 154, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !394, file: !338, line: 155, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !394, file: !338, line: 156, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !394, file: !338, line: 157, baseType: !129, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !394, file: !338, line: 159, baseType: !129, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !394, file: !338, line: 160, baseType: !129, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !394, file: !338, line: 161, baseType: !129, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !394, file: !338, line: 162, baseType: !129, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !394, file: !338, line: 163, baseType: !129, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !394, file: !338, line: 165, baseType: !129, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !394, file: !338, line: 166, baseType: !129, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !394, file: !338, line: 167, baseType: !129, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !394, file: !338, line: 168, baseType: !129, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !394, file: !338, line: 170, baseType: !129, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !394, file: !338, line: 171, baseType: !129, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !394, file: !338, line: 172, baseType: !129, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !394, file: !338, line: 173, baseType: !129, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !391, file: !338, line: 180, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !391, file: !338, line: 176, size: 32, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !414, file: !338, line: 177, baseType: !129, size: 2, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !414, file: !338, line: 178, baseType: !129, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !391, file: !338, line: 181, baseType: !129, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !339, file: !338, line: 776, baseType: !420, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !338, line: 262, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 232, size: 32, elements: !423)
!423 = !{!424, !446, !451}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !422, file: !338, line: 255, baseType: !425, size: 32)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !338, line: 233, size: 32, elements: !426)
!426 = !{!427, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !425, file: !338, line: 234, baseType: !428, size: 1, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !129)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !425, file: !338, line: 235, baseType: !428, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !425, file: !338, line: 236, baseType: !428, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !425, file: !338, line: 237, baseType: !428, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !425, file: !338, line: 239, baseType: !428, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !425, file: !338, line: 240, baseType: !428, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !425, file: !338, line: 241, baseType: !428, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !425, file: !338, line: 242, baseType: !428, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !425, file: !338, line: 243, baseType: !428, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !425, file: !338, line: 245, baseType: !428, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !425, file: !338, line: 246, baseType: !428, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !425, file: !338, line: 247, baseType: !428, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !425, file: !338, line: 248, baseType: !428, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !425, file: !338, line: 250, baseType: !428, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !425, file: !338, line: 251, baseType: !428, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !425, file: !338, line: 252, baseType: !428, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !425, file: !338, line: 253, baseType: !428, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !422, file: !338, line: 260, baseType: !447, size: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !338, line: 256, size: 32, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !447, file: !338, line: 257, baseType: !428, size: 2, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !447, file: !338, line: 258, baseType: !428, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !422, file: !338, line: 261, baseType: !129, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !339, file: !338, line: 777, baseType: !453, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !338, line: 345, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 312, size: 32, elements: !457)
!457 = !{!458, !480, !486}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !456, file: !338, line: 337, baseType: !459, size: 32)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !338, line: 313, size: 32, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !459, file: !338, line: 314, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !459, file: !338, line: 315, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !459, file: !338, line: 316, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !459, file: !338, line: 317, baseType: !129, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !459, file: !338, line: 318, baseType: !129, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !459, file: !338, line: 319, baseType: !129, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !459, file: !338, line: 321, baseType: !129, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !459, file: !338, line: 322, baseType: !129, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !459, file: !338, line: 323, baseType: !129, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !459, file: !338, line: 324, baseType: !129, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !459, file: !338, line: 325, baseType: !129, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !459, file: !338, line: 327, baseType: !129, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !459, file: !338, line: 328, baseType: !129, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !459, file: !338, line: 329, baseType: !129, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !459, file: !338, line: 330, baseType: !129, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !459, file: !338, line: 332, baseType: !129, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !459, file: !338, line: 333, baseType: !129, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !459, file: !338, line: 334, baseType: !129, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !459, file: !338, line: 335, baseType: !129, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !456, file: !338, line: 343, baseType: !481, size: 32)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !338, line: 338, size: 32, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !481, file: !338, line: 339, baseType: !129, size: 2, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !481, file: !338, line: 340, baseType: !129, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !481, file: !338, line: 341, baseType: !129, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !456, file: !338, line: 344, baseType: !129, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !339, file: !338, line: 778, baseType: !488, size: 64, offset: 160)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 64, elements: !509)
!489 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !338, line: 422, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 402, size: 32, elements: !492)
!492 = !{!493, !508}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !491, file: !338, line: 420, baseType: !494, size: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !491, file: !338, line: 403, size: 32, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !494, file: !338, line: 405, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !494, file: !338, line: 406, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !494, file: !338, line: 408, baseType: !129, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !494, file: !338, line: 409, baseType: !129, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !494, file: !338, line: 410, baseType: !129, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !494, file: !338, line: 411, baseType: !129, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !494, file: !338, line: 412, baseType: !129, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !494, file: !338, line: 413, baseType: !129, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !494, file: !338, line: 414, baseType: !129, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !494, file: !338, line: 415, baseType: !129, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !494, file: !338, line: 417, baseType: !129, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !494, file: !338, line: 418, baseType: !129, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !491, file: !338, line: 421, baseType: !129, size: 32)
!509 = !{!510}
!510 = !DISubrange(count: 2)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !339, file: !338, line: 779, baseType: !512, size: 8, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !338, line: 469, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 460, size: 8, elements: !515)
!515 = !{!516, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !514, file: !338, line: 467, baseType: !517, size: 8)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !338, line: 461, size: 8, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !517, file: !338, line: 463, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !517, file: !338, line: 465, baseType: !185, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !517, file: !338, line: 466, baseType: !185, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !514, file: !338, line: 468, baseType: !185, size: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !339, file: !338, line: 780, baseType: !267, size: 24, offset: 232)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !339, file: !338, line: 781, baseType: !525, size: 8, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !338, line: 497, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 485, size: 8, elements: !528)
!528 = !{!529, !540}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !527, file: !338, line: 495, baseType: !530, size: 8)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !527, file: !338, line: 486, size: 8, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !530, file: !338, line: 487, baseType: !185, size: 1, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !530, file: !338, line: 488, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !530, file: !338, line: 489, baseType: !185, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !530, file: !338, line: 490, baseType: !185, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !530, file: !338, line: 491, baseType: !185, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !530, file: !338, line: 492, baseType: !185, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !530, file: !338, line: 493, baseType: !185, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !530, file: !338, line: 494, baseType: !185, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !527, file: !338, line: 496, baseType: !185, size: 8)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !339, file: !338, line: 782, baseType: !267, size: 24, offset: 264)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !339, file: !338, line: 783, baseType: !543, size: 32, offset: 288)
!543 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !338, line: 531, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 523, size: 32, elements: !546)
!546 = !{!547, !553}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !545, file: !338, line: 529, baseType: !548, size: 32)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !545, file: !338, line: 524, size: 32, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !548, file: !338, line: 525, baseType: !129, size: 8, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !548, file: !338, line: 527, baseType: !129, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !548, file: !338, line: 528, baseType: !129, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !545, file: !338, line: 530, baseType: !129, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !339, file: !338, line: 784, baseType: !555, size: 32, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !338, line: 558, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 550, size: 32, elements: !558)
!558 = !{!559, !565}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !557, file: !338, line: 556, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !557, file: !338, line: 551, size: 32, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !560, file: !338, line: 552, baseType: !129, size: 16, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !560, file: !338, line: 553, baseType: !129, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !560, file: !338, line: 555, baseType: !129, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !557, file: !338, line: 557, baseType: !129, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !339, file: !338, line: 785, baseType: !567, size: 8, offset: 352)
!567 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !338, line: 587, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 577, size: 8, elements: !570)
!570 = !{!571, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !569, file: !338, line: 585, baseType: !572, size: 8)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !338, line: 578, size: 8, elements: !573)
!573 = !{!574, !575, !576, !577}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !572, file: !338, line: 580, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !572, file: !338, line: 581, baseType: !185, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !572, file: !338, line: 582, baseType: !185, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !572, file: !338, line: 583, baseType: !185, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !569, file: !338, line: 586, baseType: !185, size: 8)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !339, file: !338, line: 786, baseType: !267, size: 24, offset: 360)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !339, file: !338, line: 787, baseType: !581, size: 320, offset: 384)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 320, elements: !509)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !338, line: 766, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 759, size: 160, elements: !584)
!584 = !{!585, !597, !598, !609, !626, !638}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !583, file: !338, line: 760, baseType: !586, size: 8)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !338, line: 614, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 605, size: 8, elements: !589)
!589 = !{!590, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !588, file: !338, line: 612, baseType: !591, size: 8)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !338, line: 606, size: 8, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !591, file: !338, line: 608, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !591, file: !338, line: 610, baseType: !185, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !591, file: !338, line: 611, baseType: !185, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !588, file: !338, line: 613, baseType: !185, size: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !583, file: !338, line: 761, baseType: !267, size: 24, offset: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !583, file: !338, line: 762, baseType: !599, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !338, line: 638, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 630, size: 32, elements: !602)
!602 = !{!603, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !601, file: !338, line: 636, baseType: !604, size: 32)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !601, file: !338, line: 631, size: 32, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !604, file: !338, line: 632, baseType: !129, size: 13, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !604, file: !338, line: 634, baseType: !129, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !601, file: !338, line: 637, baseType: !129, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !583, file: !338, line: 763, baseType: !610, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !338, line: 667, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 654, size: 32, elements: !613)
!613 = !{!614, !625}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !612, file: !338, line: 665, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !338, line: 655, size: 32, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !615, file: !338, line: 656, baseType: !129, size: 4, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !615, file: !338, line: 657, baseType: !129, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !615, file: !338, line: 658, baseType: !129, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !615, file: !338, line: 659, baseType: !129, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !615, file: !338, line: 660, baseType: !129, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !615, file: !338, line: 661, baseType: !129, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !615, file: !338, line: 662, baseType: !129, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !615, file: !338, line: 663, baseType: !129, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !612, file: !338, line: 666, baseType: !129, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !583, file: !338, line: 764, baseType: !627, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !338, line: 724, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 716, size: 32, elements: !631)
!631 = !{!632, !637}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !630, file: !338, line: 722, baseType: !633, size: 32)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !630, file: !338, line: 717, size: 32, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !633, file: !338, line: 719, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !633, file: !338, line: 720, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !630, file: !338, line: 723, baseType: !129, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !583, file: !338, line: 765, baseType: !639, size: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !338, line: 745, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 738, size: 32, elements: !643)
!643 = !{!644, !649}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !642, file: !338, line: 743, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !338, line: 739, size: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !645, file: !338, line: 740, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !645, file: !338, line: 741, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !642, file: !338, line: 744, baseType: !129, size: 32)
!650 = !{!109}
!651 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !654, line: 51, size: 64, elements: !655)
!654 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!655 = !{!656, !685}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !653, file: !654, line: 60, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DISubroutineType(types: !659)
!659 = !{!103, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !663, line: 378, size: 192, elements: !664)
!663 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!664 = !{!665, !669, !670, !671, !678, !679}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !662, file: !663, line: 380, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !662, file: !663, line: 382, baseType: !13, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !662, file: !663, line: 384, baseType: !13, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !662, file: !663, line: 386, baseType: !672, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !663, line: 351, size: 16, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !673, file: !663, line: 359, baseType: !185, size: 8)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !673, file: !663, line: 364, baseType: !677, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!677 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !662, file: !663, line: 388, baseType: !102, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !662, file: !663, line: 396, baseType: !680, size: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !663, line: 43, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !684)
!684 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !653, file: !654, line: 65, baseType: !660, size: 32, offset: 32)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "static_regions", scope: !688, file: !697, line: 62, type: !834, isLocal: true, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !690, globals: !693, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh")
!690 = !{!691, !103, !129, !102}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !692, line: 214, baseType: !32)
!692 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!693 = !{!694, !686}
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !696, file: !697, line: 198, type: !820, isLocal: true, isDefinition: true)
!696 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !697, file: !697, line: 175, type: !698, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !688, retainedNodes: !817)
!697 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!698 = !DISubroutineType(types: !699)
!699 = !{null, !700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !702, line: 245, size: 1024, elements: !703)
!702 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!703 = !{!704, !771, !784, !785, !786, !787, !793, !812}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !701, file: !702, line: 247, baseType: !705, size: 384)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !702, line: 57, size: 384, elements: !706)
!706 = !{!707, !733, !741, !742, !743, !756, !757, !758}
!707 = !DIDerivedType(tag: DW_TAG_member, scope: !705, file: !702, line: 60, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !705, file: !702, line: 60, size: 64, elements: !709)
!709 = !{!710, !726}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !708, file: !702, line: 61, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !712, line: 49, baseType: !713)
!712 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !712, line: 37, size: 64, elements: !714)
!714 = !{!715, !721}
!715 = !DIDerivedType(tag: DW_TAG_member, scope: !713, file: !712, line: 38, baseType: !716, size: 32)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !713, file: !712, line: 38, size: 32, elements: !717)
!717 = !{!718, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !716, file: !712, line: 39, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !716, file: !712, line: 40, baseType: !719, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, scope: !713, file: !712, line: 42, baseType: !722, size: 32, offset: 32)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !713, file: !712, line: 42, size: 32, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !722, file: !712, line: 43, baseType: !719, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !722, file: !712, line: 44, baseType: !719, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !708, file: !702, line: 62, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !728, line: 49, size: 64, elements: !729)
!728 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !727, file: !728, line: 50, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 64, elements: !509)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !705, file: !702, line: 68, baseType: !734, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !736, line: 233, baseType: !737)
!736 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !736, line: 231, size: 64, elements: !738)
!738 = !{!739}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !737, file: !736, line: 232, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !712, line: 48, baseType: !713)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !705, file: !702, line: 71, baseType: !185, size: 8, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !705, file: !702, line: 74, baseType: !185, size: 8, offset: 104)
!743 = !DIDerivedType(tag: DW_TAG_member, scope: !705, file: !702, line: 90, baseType: !744, size: 16, offset: 112)
!744 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !705, file: !702, line: 90, size: 16, elements: !745)
!745 = !{!746, !753}
!746 = !DIDerivedType(tag: DW_TAG_member, scope: !744, file: !702, line: 91, baseType: !747, size: 16)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !744, file: !702, line: 91, size: 16, elements: !748)
!748 = !{!749, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !747, file: !702, line: 96, baseType: !750, size: 8)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !751)
!751 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !747, file: !702, line: 97, baseType: !185, size: 8, offset: 8)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !744, file: !702, line: 100, baseType: !754, size: 16)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !755)
!755 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !705, file: !702, line: 107, baseType: !129, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !705, file: !702, line: 127, baseType: !102, size: 32, offset: 160)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !705, file: !702, line: 131, baseType: !759, size: 192, offset: 192)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !736, line: 244, size: 192, elements: !760)
!760 = !{!761, !762, !768}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !759, file: !736, line: 245, baseType: !711, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !759, file: !736, line: 246, baseType: !763, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !736, line: 242, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !759, file: !736, line: 249, baseType: !769, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !770)
!770 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !701, file: !702, line: 250, baseType: !772, size: 288, offset: 384)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !773, line: 25, size: 288, elements: !774)
!773 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !772, file: !773, line: 26, baseType: !129, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !772, file: !773, line: 27, baseType: !129, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !772, file: !773, line: 28, baseType: !129, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !772, file: !773, line: 29, baseType: !129, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !772, file: !773, line: 30, baseType: !129, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !772, file: !773, line: 31, baseType: !129, size: 32, offset: 160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !772, file: !773, line: 32, baseType: !129, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !772, file: !773, line: 33, baseType: !129, size: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !772, file: !773, line: 34, baseType: !129, size: 32, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !701, file: !702, line: 253, baseType: !102, size: 32, offset: 672)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !701, file: !702, line: 256, baseType: !735, size: 64, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !701, file: !702, line: 294, baseType: !103, size: 32, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !701, file: !702, line: 300, baseType: !788, size: 96, offset: 800)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !702, line: 149, size: 96, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !788, file: !702, line: 153, baseType: !22, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !788, file: !702, line: 162, baseType: !691, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !788, file: !702, line: 168, baseType: !691, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !701, file: !702, line: 325, baseType: !794, size: 32, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !796, line: 5073, size: 160, elements: !797)
!796 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!797 = !{!798, !807, !808}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !795, file: !796, line: 5074, baseType: !799, size: 96)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !800, line: 56, size: 96, elements: !801)
!800 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!801 = !{!802, !805, !806}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !799, file: !800, line: 57, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !800, line: 57, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !799, file: !800, line: 58, baseType: !102, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !799, file: !800, line: 59, baseType: !691, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !795, file: !796, line: 5075, baseType: !735, size: 64, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !795, file: !796, line: 5076, baseType: !809, offset: 160)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !810, line: 43, elements: !811)
!810 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!811 = !{}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !701, file: !702, line: 343, baseType: !813, size: 64, offset: 928)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !773, line: 60, size: 64, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !813, file: !773, line: 63, baseType: !129, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !813, file: !773, line: 66, baseType: !129, size: 32, offset: 32)
!817 = !{!818, !819}
!818 = !DILocalVariable(name: "thread", arg: 1, scope: !696, file: !697, line: 175, type: !700)
!819 = !DILocalVariable(name: "region_num", scope: !696, file: !697, line: 200, type: !185)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, elements: !832)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !822, line: 52, size: 96, elements: !823)
!822 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !821, file: !822, line: 53, baseType: !22, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !821, file: !822, line: 54, baseType: !691, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !821, file: !822, line: 55, baseType: !827, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !828, line: 151, baseType: !829)
!828 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 149, size: 32, elements: !830)
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !829, file: !828, line: 150, baseType: !129, size: 32)
!832 = !{!833}
!833 = !DISubrange(count: 0)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 96, elements: !836)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!836 = !{!837}
!837 = !DISubrange(count: 1)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !840, file: !872, line: 39, type: !185, isLocal: true, isDefinition: true)
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !842, globals: !871, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh")
!842 = !{!843, !102, !103, !859, !185}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !845, line: 1226, baseType: !846)
!845 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !845, line: 1213, size: 352, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !846, file: !845, line: 1215, baseType: !428, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !846, file: !845, line: 1216, baseType: !429, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !846, file: !845, line: 1217, baseType: !429, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !846, file: !845, line: 1218, baseType: !429, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !846, file: !845, line: 1219, baseType: !429, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !846, file: !845, line: 1220, baseType: !429, size: 32, offset: 160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !846, file: !845, line: 1221, baseType: !429, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !846, file: !845, line: 1222, baseType: !429, size: 32, offset: 224)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !846, file: !845, line: 1223, baseType: !429, size: 32, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !846, file: !845, line: 1224, baseType: !429, size: 32, offset: 288)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !846, file: !845, line: 1225, baseType: !429, size: 32, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !862, line: 27, size: 96, elements: !863)
!862 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!863 = !{!864, !865, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !861, file: !862, line: 29, baseType: !129, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !861, file: !862, line: 31, baseType: !666, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !861, file: !862, line: 37, baseType: !867, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !828, line: 146, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !828, line: 141, size: 32, elements: !869)
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !868, file: !828, line: 143, baseType: !129, size: 32)
!871 = !{!838}
!872 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !875, file: !882, line: 21, type: !106, isLocal: true, isDefinition: true)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !877, globals: !881, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh")
!877 = !{!878, !103, !102}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !880, line: 22, baseType: !103)
!880 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!881 = !{!873}
!882 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !885, file: !890, line: 13, type: !907, isLocal: true, isDefinition: true)
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !887, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/lis2dh")
!887 = !{!888, !883}
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "mpu_config", scope: !885, file: !890, line: 37, type: !891, isLocal: false, isDefinition: true)
!890 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !862, line: 41, size: 64, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !892, file: !862, line: 43, baseType: !129, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !892, file: !862, line: 45, baseType: !896, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !862, line: 27, size: 96, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !898, file: !862, line: 29, baseType: !129, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !898, file: !862, line: 31, baseType: !666, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !898, file: !862, line: 37, baseType: !903, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !828, line: 146, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !828, line: 141, size: 32, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !904, file: !828, line: 143, baseType: !129, size: 32)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 192, elements: !509)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "__device_dts_ord_22", scope: !910, file: !1343, line: 411, type: !1357, isLocal: false, isDefinition: true, align: 32)
