; ModuleID = './build/ept_configure_pins_by_ept.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._rand48 = type { [3 x i16], [3 x i16], i16, i64 }

!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !9, line: 59, baseType: !55)
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!58 = !{!21}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !61, file: !62, line: 53, type: !200, isLocal: false, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !63, retainedTypes: !118, globals: !199, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!63 = !{!64, !73}
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 152, baseType: !66, size: 32, elements: !67)
!65 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !{!68, !69, !70, !71, !72}
!68 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!69 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!70 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!71 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!72 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !74, line: 47, baseType: !66, size: 32, elements: !75)
!74 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!76 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!77 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!78 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!79 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!80 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!81 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!82 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!83 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!84 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!85 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!86 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!87 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!88 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!89 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!90 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!91 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!92 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!93 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!94 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!95 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!96 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!97 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!98 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!99 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!100 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!101 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!102 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!103 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!104 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!105 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!106 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!107 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!108 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!109 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!110 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!111 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!112 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!113 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!114 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!115 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!116 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!117 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!118 = !{!119, !121, !12, !122, !124, !160}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !74, line: 97, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !74, line: 95, baseType: !73)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 44, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 77, baseType: !66)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !126, line: 378, baseType: !127)
!126 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 363, size: 28704, elements: !128)
!128 = !{!129, !133, !137, !138, !139, !140, !141, !142, !143, !144, !148, !155, !159}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !127, file: !126, line: 365, baseType: !130, size: 256)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !127, file: !126, line: 366, baseType: !134, size: 768, offset: 256)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 24)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !127, file: !126, line: 367, baseType: !130, size: 256, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !127, file: !126, line: 368, baseType: !134, size: 768, offset: 1280)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !127, file: !126, line: 369, baseType: !130, size: 256, offset: 2048)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !127, file: !126, line: 370, baseType: !134, size: 768, offset: 2304)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !127, file: !126, line: 371, baseType: !130, size: 256, offset: 3072)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !127, file: !126, line: 372, baseType: !134, size: 768, offset: 3328)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !127, file: !126, line: 373, baseType: !130, size: 256, offset: 4096)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !127, file: !126, line: 374, baseType: !145, size: 1792, offset: 4352)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1792, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 56)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !127, file: !126, line: 375, baseType: !149, size: 1920, offset: 6144)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 1920, elements: !153)
!150 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 43, baseType: !55)
!153 = !{!154}
!154 = !DISubrange(count: 240)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !127, file: !126, line: 376, baseType: !156, size: 20608, offset: 8064)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 20608, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 644)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !127, file: !126, line: 377, baseType: !11, size: 32, offset: 28672)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !126, line: 418, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 395, size: 1120, elements: !163)
!163 = !{!164, !166, !167, !168, !169, !170, !171, !175, !176, !177, !178, !179, !180, !181, !182, !186, !187, !188, !192, !196, !198}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !162, file: !126, line: 397, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !162, file: !126, line: 398, baseType: !11, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !162, file: !126, line: 399, baseType: !11, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !162, file: !126, line: 400, baseType: !11, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !162, file: !126, line: 401, baseType: !11, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !162, file: !126, line: 402, baseType: !11, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !162, file: !126, line: 403, baseType: !172, size: 96, offset: 192)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 12)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !162, file: !126, line: 404, baseType: !11, size: 32, offset: 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !162, file: !126, line: 405, baseType: !11, size: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !162, file: !126, line: 406, baseType: !11, size: 32, offset: 352)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !162, file: !126, line: 407, baseType: !11, size: 32, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !162, file: !126, line: 408, baseType: !11, size: 32, offset: 416)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !162, file: !126, line: 409, baseType: !11, size: 32, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !162, file: !126, line: 410, baseType: !11, size: 32, offset: 480)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !162, file: !126, line: 411, baseType: !183, size: 64, offset: 512)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 64, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !162, file: !126, line: 412, baseType: !165, size: 32, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !162, file: !126, line: 413, baseType: !165, size: 32, offset: 608)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !162, file: !126, line: 414, baseType: !189, size: 128, offset: 640)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 128, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 4)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !162, file: !126, line: 415, baseType: !193, size: 160, offset: 768)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 160, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 5)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !162, file: !126, line: 416, baseType: !197, size: 160, offset: 928)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !194)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !162, file: !126, line: 417, baseType: !11, size: 32, offset: 1088)
!199 = !{!59}
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 6144, elements: !209)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !62, line: 50, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 47, size: 64, elements: !203)
!203 = !{!204, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !202, file: !62, line: 48, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !119}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !202, file: !62, line: 49, baseType: !12, size: 32, offset: 32)
!209 = !{!210}
!210 = !DISubrange(count: 96)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !213, file: !214, line: 77, type: !283, isLocal: true, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !215, retainedTypes: !266, globals: !268, splitDebugInlining: false, nameTableKind: None)
!214 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!215 = !{!216, !224, !230, !246, !252, !256, !26, !32, !261}
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !217, line: 345, baseType: !66, size: 32, elements: !218)
!217 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!218 = !{!219, !220, !221, !222, !223}
!219 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!220 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!221 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!222 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!223 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !225, line: 109, baseType: !7, size: 32, elements: !226)
!225 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!226 = !{!227, !228, !229}
!227 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!228 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!229 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !217, line: 302, baseType: !7, size: 32, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!232 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!233 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!234 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!235 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!236 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!237 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!238 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!239 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!240 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!241 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!242 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!243 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!244 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!245 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !217, line: 321, baseType: !7, size: 32, elements: !247)
!247 = !{!248, !249, !250, !251}
!248 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!249 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!250 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!251 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !217, line: 330, baseType: !7, size: 32, elements: !253)
!253 = !{!254, !255}
!254 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!255 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !217, line: 337, baseType: !7, size: 32, elements: !257)
!257 = !{!258, !259, !260}
!258 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!259 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!260 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !217, line: 355, baseType: !66, size: 32, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!264 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!265 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!266 = !{!7, !121, !55, !267, !151}
!267 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!268 = !{!211, !269}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "func_tbl", scope: !271, file: !214, line: 536, type: !281, isLocal: true, isDefinition: true)
!271 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !214, file: !214, line: 534, type: !272, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !213, retainedNodes: !279)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !278}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !33, line: 197, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !225, line: 113, baseType: !224)
!279 = !{!280}
!280 = !DILocalVariable(name: "uart_port", arg: 1, scope: !271, file: !214, line: 534, type: !278)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 64, elements: !184)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 1024, elements: !184)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !214, line: 75, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 68, size: 512, elements: !286)
!286 = !{!287, !289, !301, !302, !313, !314}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !285, file: !214, line: 69, baseType: !288, size: 8)
!288 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !285, file: !214, line: 70, baseType: !290, size: 128, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !217, line: 378, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 373, size: 128, elements: !292)
!292 = !{!293, !295, !297, !299}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !291, file: !217, line: 374, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !217, line: 317, baseType: !230)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !291, file: !217, line: 375, baseType: !296, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !217, line: 326, baseType: !246)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !291, file: !217, line: 376, baseType: !298, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !217, line: 333, baseType: !252)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !291, file: !217, line: 377, baseType: !300, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !217, line: 341, baseType: !256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !285, file: !214, line: 71, baseType: !288, size: 8, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !285, file: !214, line: 72, baseType: !303, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !214, line: 66, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 63, size: 64, elements: !305)
!305 = !{!306, !312}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !304, file: !214, line: 64, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !217, line: 410, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !311, !121}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !217, line: 359, baseType: !261)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !304, file: !214, line: 65, baseType: !121, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !285, file: !214, line: 73, baseType: !288, size: 8, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !285, file: !214, line: 74, baseType: !315, size: 224, offset: 288)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !217, line: 390, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 382, size: 224, elements: !317)
!317 = !{!318, !320, !321, !322, !323, !324, !325}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !316, file: !217, line: 383, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !316, file: !217, line: 384, baseType: !12, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !316, file: !217, line: 385, baseType: !12, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !316, file: !217, line: 386, baseType: !319, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !316, file: !217, line: 387, baseType: !12, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !316, file: !217, line: 388, baseType: !12, size: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !316, file: !217, line: 389, baseType: !12, size: 32, offset: 192)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !328, file: !329, line: 59, type: !12, isLocal: false, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !330, globals: !393, splitDebugInlining: false, nameTableKind: None)
!329 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!330 = !{!331, !339, !364}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !126, line: 656, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 650, size: 128, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !333, file: !126, line: 652, baseType: !11, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !333, file: !126, line: 653, baseType: !11, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !333, file: !126, line: 654, baseType: !11, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !333, file: !126, line: 655, baseType: !165, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !126, line: 418, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 395, size: 1120, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !341, file: !126, line: 397, baseType: !165, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !341, file: !126, line: 398, baseType: !11, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !341, file: !126, line: 399, baseType: !11, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !341, file: !126, line: 400, baseType: !11, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !341, file: !126, line: 401, baseType: !11, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !341, file: !126, line: 402, baseType: !11, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !341, file: !126, line: 403, baseType: !172, size: 96, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !341, file: !126, line: 404, baseType: !11, size: 32, offset: 288)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !341, file: !126, line: 405, baseType: !11, size: 32, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !341, file: !126, line: 406, baseType: !11, size: 32, offset: 352)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !341, file: !126, line: 407, baseType: !11, size: 32, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !341, file: !126, line: 408, baseType: !11, size: 32, offset: 416)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !341, file: !126, line: 409, baseType: !11, size: 32, offset: 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !341, file: !126, line: 410, baseType: !11, size: 32, offset: 480)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !341, file: !126, line: 411, baseType: !183, size: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !341, file: !126, line: 412, baseType: !165, size: 32, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !341, file: !126, line: 413, baseType: !165, size: 32, offset: 608)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !341, file: !126, line: 414, baseType: !189, size: 128, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !341, file: !126, line: 415, baseType: !193, size: 160, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !341, file: !126, line: 416, baseType: !197, size: 160, offset: 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !341, file: !126, line: 417, baseType: !11, size: 32, offset: 1088)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !366, line: 72, baseType: !367)
!366 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 56, size: 525312, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !384, !388, !392}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !367, file: !366, line: 57, baseType: !11, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !367, file: !366, line: 58, baseType: !11, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !367, file: !366, line: 59, baseType: !11, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !367, file: !366, line: 60, baseType: !11, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !367, file: !366, line: 61, baseType: !11, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !367, file: !366, line: 62, baseType: !11, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !367, file: !366, line: 63, baseType: !11, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !367, file: !366, line: 64, baseType: !11, size: 32, offset: 224)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !367, file: !366, line: 65, baseType: !11, size: 32, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !367, file: !366, line: 66, baseType: !11, size: 32, offset: 288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !367, file: !366, line: 67, baseType: !380, size: 32, offset: 320)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 1)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !367, file: !366, line: 68, baseType: !11, size: 32, offset: 352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !367, file: !366, line: 69, baseType: !385, size: 523904, offset: 384)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 523904, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 16372)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !367, file: !366, line: 70, baseType: !389, size: 512, offset: 524288)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 16)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !367, file: !366, line: 71, baseType: !389, size: 512, offset: 524800)
!393 = !{!326, !394}
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !328, file: !329, line: 61, type: !11, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "heap_end", scope: !398, file: !399, line: 70, type: !404, isLocal: true, isDefinition: true)
!398 = distinct !DISubprogram(name: "_sbrk_r", scope: !399, file: !399, line: 67, type: !400, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !596, retainedNodes: !600)
!399 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !405, !595}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !403, line: 123, baseType: !404)
!403 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !407, line: 377, size: 1920, elements: !408)
!407 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!408 = !{!409, !410, !484, !485, !486, !487, !488, !489, !490, !493, !514, !518, !519, !520, !521, !531, !544, !545, !550, !569, !570, !577, !578, !594}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !406, file: !407, line: 381, baseType: !66, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !406, file: !407, line: 386, baseType: !411, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !407, line: 292, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !407, line: 186, size: 832, elements: !414)
!414 = !{!415, !417, !418, !419, !421, !422, !427, !428, !429, !430, !434, !440, !447, !451, !452, !453, !454, !458, !460, !461, !462, !464, !470, !483}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !413, file: !407, line: 187, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !413, file: !407, line: 188, baseType: !66, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !413, file: !407, line: 189, baseType: !66, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !413, file: !407, line: 190, baseType: !420, size: 16, offset: 96)
!420 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !413, file: !407, line: 191, baseType: !420, size: 16, offset: 112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !413, file: !407, line: 192, baseType: !423, size: 64, offset: 128)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !407, line: 122, size: 64, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !423, file: !407, line: 123, baseType: !416, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !423, file: !407, line: 124, baseType: !66, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !413, file: !407, line: 193, baseType: !66, size: 32, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !413, file: !407, line: 196, baseType: !405, size: 32, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !413, file: !407, line: 200, baseType: !121, size: 32, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !413, file: !407, line: 202, baseType: !431, size: 32, offset: 288)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DISubroutineType(types: !433)
!433 = !{!66, !405, !121, !404, !66}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !413, file: !407, line: 204, baseType: !435, size: 32, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DISubroutineType(types: !437)
!437 = !{!66, !405, !121, !438, !66}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !413, file: !407, line: 207, baseType: !441, size: 32, offset: 352)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !405, !121, !444, !66}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !445, line: 116, baseType: !446)
!445 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!446 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !413, file: !407, line: 208, baseType: !448, size: 32, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DISubroutineType(types: !450)
!450 = !{!66, !405, !121}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !413, file: !407, line: 211, baseType: !423, size: 64, offset: 416)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !413, file: !407, line: 212, baseType: !416, size: 32, offset: 480)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !413, file: !407, line: 213, baseType: !66, size: 32, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !413, file: !407, line: 216, baseType: !455, size: 24, offset: 544)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 3)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !413, file: !407, line: 217, baseType: !459, size: 8, offset: 568)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, elements: !381)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !413, file: !407, line: 220, baseType: !423, size: 64, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !413, file: !407, line: 223, baseType: !66, size: 32, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !413, file: !407, line: 224, baseType: !463, size: 32, offset: 672)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !445, line: 46, baseType: !446)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !413, file: !407, line: 231, baseType: !465, size: 32, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !407, line: 35, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !467, line: 34, baseType: !468)
!467 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !467, line: 33, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !413, file: !407, line: 233, baseType: !471, size: 64, offset: 736)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !445, line: 170, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 162, size: 64, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !472, file: !445, line: 164, baseType: !66, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !472, file: !445, line: 169, baseType: !476, size: 32, offset: 32)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !472, file: !445, line: 165, size: 32, elements: !477)
!477 = !{!478, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !476, file: !445, line: 167, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !480, line: 116, baseType: !66)
!480 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !476, file: !445, line: 168, baseType: !482, size: 32)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !190)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !413, file: !407, line: 234, baseType: !66, size: 32, offset: 800)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !406, file: !407, line: 386, baseType: !411, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !406, file: !407, line: 386, baseType: !411, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !406, file: !407, line: 388, baseType: !66, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !406, file: !407, line: 390, baseType: !404, size: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !406, file: !407, line: 392, baseType: !66, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !406, file: !407, line: 394, baseType: !66, size: 32, offset: 224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !406, file: !407, line: 395, baseType: !491, size: 32, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !407, line: 45, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !406, file: !407, line: 397, baseType: !494, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !407, line: 349, size: 128, elements: !496)
!496 = !{!497, !510, !511, !512}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !495, file: !407, line: 352, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !407, line: 52, size: 192, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !499, file: !407, line: 54, baseType: !498, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !499, file: !407, line: 55, baseType: !66, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !499, file: !407, line: 55, baseType: !66, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !499, file: !407, line: 55, baseType: !66, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !499, file: !407, line: 55, baseType: !66, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !499, file: !407, line: 56, baseType: !507, size: 32, offset: 160)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 32, elements: !381)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !407, line: 22, baseType: !509)
!509 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !495, file: !407, line: 353, baseType: !66, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !495, file: !407, line: 354, baseType: !498, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !495, file: !407, line: 355, baseType: !513, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !406, file: !407, line: 399, baseType: !515, size: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !405}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !406, file: !407, line: 401, baseType: !66, size: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !406, file: !407, line: 404, baseType: !66, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !406, file: !407, line: 405, baseType: !404, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !406, file: !407, line: 407, baseType: !522, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !407, line: 324, size: 192, elements: !524)
!524 = !{!525, !527, !528, !529}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !523, file: !407, line: 325, baseType: !526, size: 48)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !456)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !523, file: !407, line: 326, baseType: !526, size: 48, offset: 48)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !523, file: !407, line: 327, baseType: !53, size: 16, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !523, file: !407, line: 330, baseType: !530, size: 64, offset: 128)
!530 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !406, file: !407, line: 408, baseType: !532, size: 32, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !407, line: 60, size: 288, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !533, file: !407, line: 62, baseType: !66, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !533, file: !407, line: 63, baseType: !66, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !533, file: !407, line: 64, baseType: !66, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !533, file: !407, line: 65, baseType: !66, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !533, file: !407, line: 66, baseType: !66, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !533, file: !407, line: 67, baseType: !66, size: 32, offset: 160)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !533, file: !407, line: 68, baseType: !66, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !533, file: !407, line: 69, baseType: !66, size: 32, offset: 224)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !533, file: !407, line: 70, baseType: !66, size: 32, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !406, file: !407, line: 409, baseType: !404, size: 32, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !406, file: !407, line: 412, baseType: !546, size: 32, offset: 544)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !66}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !406, file: !407, line: 416, baseType: !551, size: 32, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !407, line: 90, size: 1120, elements: !553)
!553 = !{!554, !555, !556, !560}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !552, file: !407, line: 91, baseType: !551, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !552, file: !407, line: 92, baseType: !66, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !552, file: !407, line: 93, baseType: !557, size: 1024, offset: 64)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 1024, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !552, file: !407, line: 94, baseType: !561, size: 32, offset: 1088)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !407, line: 79, size: 2112, elements: !563)
!563 = !{!564, !566, !567, !568}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !562, file: !407, line: 80, baseType: !565, size: 1024)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 1024, elements: !558)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !562, file: !407, line: 81, baseType: !565, size: 1024, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !562, file: !407, line: 83, baseType: !508, size: 32, offset: 2048)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !562, file: !407, line: 86, baseType: !508, size: 32, offset: 2080)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !406, file: !407, line: 417, baseType: !552, size: 1120, offset: 608)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !406, file: !407, line: 420, baseType: !571, size: 96, offset: 1728)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !407, line: 296, size: 96, elements: !572)
!572 = !{!573, !575, !576}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !571, file: !407, line: 298, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !571, file: !407, line: 299, baseType: !66, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !571, file: !407, line: 300, baseType: !411, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !406, file: !407, line: 421, baseType: !411, size: 32, offset: 1824)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !406, file: !407, line: 422, baseType: !579, size: 32, offset: 1856)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !407, line: 359, size: 640, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !588, !589, !590, !591, !592, !593}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !580, file: !407, line: 362, baseType: !404, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !580, file: !407, line: 363, baseType: !471, size: 64, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !580, file: !407, line: 364, baseType: !471, size: 64, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !580, file: !407, line: 365, baseType: !471, size: 64, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !580, file: !407, line: 366, baseType: !587, size: 64, offset: 224)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 64, elements: !131)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !580, file: !407, line: 367, baseType: !66, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !580, file: !407, line: 368, baseType: !471, size: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !580, file: !407, line: 369, baseType: !471, size: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !580, file: !407, line: 370, baseType: !471, size: 64, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !580, file: !407, line: 371, baseType: !471, size: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !580, file: !407, line: 372, baseType: !471, size: 64, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !406, file: !407, line: 423, baseType: !404, size: 32, offset: 1888)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !480, line: 46, baseType: !7)
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !598, globals: !599, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!598 = !{!404, !402}
!599 = !{!396}
!600 = !{!601, !602, !603, !604}
!601 = !DILocalVariable(name: "r", arg: 1, scope: !398, file: !399, line: 67, type: !405)
!602 = !DILocalVariable(name: "nbytes", arg: 2, scope: !398, file: !399, line: 67, type: !595)
!603 = !DILocalVariable(name: "prev_heap_end", scope: !398, file: !399, line: 71, type: !404)
!604 = !DILocalVariable(name: "stack", scope: !398, file: !399, line: 72, type: !404)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !607, file: !612, line: 4, type: !618, isLocal: false, isDefinition: true)
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !609, splitDebugInlining: false, nameTableKind: None)
!608 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!609 = !{!605, !610, !616}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !607, file: !612, line: 5, type: !613, isLocal: false, isDefinition: true)
!612 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 88, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 11)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !607, file: !612, line: 6, type: !613, isLocal: false, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 248, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 31)
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !623, retainedTypes: !629, splitDebugInlining: false, nameTableKind: None)
!622 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!623 = !{!624}
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 1209, baseType: !7, size: 32, elements: !626)
!625 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!626 = !{!627, !628}
!627 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!628 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!629 = !{!630, !632}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !9, line: 116, baseType: !7)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!635 = !{!636}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !637, line: 150, baseType: !7, size: 32, elements: !638)
!637 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!639 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!640 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!641 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!642 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!643 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!644 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!645 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!646 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!647 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!648 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!649 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!650 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!651 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!652 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!653 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!654 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!655 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!656 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!657 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!658 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!659 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!660 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!661 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!662 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!663 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!664 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!665 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!666 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!667 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!668 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!669 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!670 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!671 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!672 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!673 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!674 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!675 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!676 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!677 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!678 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!679 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!680 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!681 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!682 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!683 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!684 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!685 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!686 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!687 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!688 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!689 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!690 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!691 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!692 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!693 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!694 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!695 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!696 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!697 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!698 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!699 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!700 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!701 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!702 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!703 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!704 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!705 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!706 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!707 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!708 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!709 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!710 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!711 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!712 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!713 = !{!630, !8}
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !716, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!716 = !{!717, !742}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !126, line: 418, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 395, size: 1120, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !719, file: !126, line: 397, baseType: !165, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !719, file: !126, line: 398, baseType: !11, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !719, file: !126, line: 399, baseType: !11, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !719, file: !126, line: 400, baseType: !11, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !719, file: !126, line: 401, baseType: !11, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !719, file: !126, line: 402, baseType: !11, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !719, file: !126, line: 403, baseType: !172, size: 96, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !719, file: !126, line: 404, baseType: !11, size: 32, offset: 288)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !719, file: !126, line: 405, baseType: !11, size: 32, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !719, file: !126, line: 406, baseType: !11, size: 32, offset: 352)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !719, file: !126, line: 407, baseType: !11, size: 32, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !719, file: !126, line: 408, baseType: !11, size: 32, offset: 416)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !719, file: !126, line: 409, baseType: !11, size: 32, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !719, file: !126, line: 410, baseType: !11, size: 32, offset: 480)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !719, file: !126, line: 411, baseType: !183, size: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !719, file: !126, line: 412, baseType: !165, size: 32, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !719, file: !126, line: 413, baseType: !165, size: 32, offset: 608)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !719, file: !126, line: 414, baseType: !189, size: 128, offset: 640)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !719, file: !126, line: 415, baseType: !193, size: 160, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !719, file: !126, line: 416, baseType: !197, size: 160, offset: 928)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !719, file: !126, line: 417, baseType: !11, size: 32, offset: 1088)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !126, line: 378, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 363, size: 28704, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !744, file: !126, line: 365, baseType: !130, size: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !744, file: !126, line: 366, baseType: !134, size: 768, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !744, file: !126, line: 367, baseType: !130, size: 256, offset: 1024)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !744, file: !126, line: 368, baseType: !134, size: 768, offset: 1280)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !744, file: !126, line: 369, baseType: !130, size: 256, offset: 2048)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !744, file: !126, line: 370, baseType: !134, size: 768, offset: 2304)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !744, file: !126, line: 371, baseType: !130, size: 256, offset: 3072)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !744, file: !126, line: 372, baseType: !134, size: 768, offset: 3328)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !744, file: !126, line: 373, baseType: !130, size: 256, offset: 4096)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !744, file: !126, line: 374, baseType: !145, size: 1792, offset: 4352)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !744, file: !126, line: 375, baseType: !149, size: 1920, offset: 6144)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !744, file: !126, line: 376, baseType: !156, size: 20608, offset: 8064)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !744, file: !126, line: 377, baseType: !11, size: 32, offset: 28672)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !761, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!761 = !{!762, !636}
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 55, baseType: !7, size: 32, elements: !764)
!763 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!765 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!766 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!767 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!768 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!769 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!770 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!771 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!772 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!773 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!774 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!775 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!776 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!777 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!778 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!779 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!780 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!781 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!782 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!783 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!784 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!785 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!786 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!787 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!788 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!789 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!790 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!791 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!792 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !797, retainedTypes: !861, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!797 = !{!798, !805, !762, !836, !842, !846, !850, !856}
!798 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !799, line: 233, baseType: !66, size: 32, elements: !800)
!799 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!800 = !{!801, !802, !803, !804}
!801 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!802 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!803 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!804 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !225, line: 249, baseType: !7, size: 32, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!807 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!808 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!809 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!810 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!811 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!812 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!813 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!814 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!815 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!816 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!817 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!818 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!819 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!820 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!821 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!822 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!823 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!824 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!825 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!826 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!827 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!828 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!829 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!830 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!831 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!832 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!833 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!834 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!835 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!836 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !799, line: 224, baseType: !66, size: 32, elements: !837)
!837 = !{!838, !839, !840, !841}
!838 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!839 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!840 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!841 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !799, line: 217, baseType: !7, size: 32, elements: !843)
!843 = !{!844, !845}
!844 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!845 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !799, line: 210, baseType: !7, size: 32, elements: !847)
!847 = !{!848, !849}
!848 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!849 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !799, line: 242, baseType: !7, size: 32, elements: !851)
!851 = !{!852, !853, !854, !855}
!852 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!853 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!854 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!855 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !857, line: 57, baseType: !7, size: 32, elements: !858)
!857 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!858 = !{!859, !860}
!859 = !DIEnumerator(name: "eDirection_IN", value: 0)
!860 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!861 = !{!862, !121, !863, !151, !864, !865}
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !763, line: 87, baseType: !762)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !799, line: 220, baseType: !842)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !799, line: 247, baseType: !850)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !857, line: 60, baseType: !856)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !868, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "../../../../../driver/board/mt76x7_hdk/ept/src/bsp_gpio_ept_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!868 = !{!12, !10}
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !871, splitDebugInlining: false, nameTableKind: None)
!870 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!871 = !{!224, !230, !246, !252, !256, !805}
!872 = !{!"Ubuntu clang version 14.0.6"}
!873 = !{i32 7, !"Dwarf Version", i32 2}
!874 = !{i32 2, !"Debug Info Version", i32 3}
!875 = !{i32 1, !"wchar_size", i32 4}
!876 = !{i32 1, !"min_enum_size", i32 4}
!877 = !{i32 1, !"branch-target-enforcement", i32 0}
!878 = !{i32 1, !"sign-return-address", i32 0}
!879 = !{i32 1, !"sign-return-address-all", i32 0}
!880 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!881 = !{i32 7, !"frame-pointer", i32 2}
!882 = distinct !DISubprogram(name: "halGPIO_ConfDirection", scope: !622, file: !622, line: 54, type: !883, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !886)
!883 = !DISubroutineType(types: !884)
!884 = !{!885, !8, !54}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !9, line: 56, baseType: !66)
!886 = !{!887, !888, !889, !891}
!887 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !882, file: !622, line: 54, type: !8)
!888 = !DILocalVariable(name: "outEnable", arg: 2, scope: !882, file: !622, line: 54, type: !54)
!889 = !DILocalVariable(name: "no", scope: !882, file: !622, line: 57, type: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !9, line: 60, baseType: !53)
!891 = !DILocalVariable(name: "remainder", scope: !882, file: !622, line: 58, type: !890)
!892 = !DILocation(line: 0, scope: !882)
!893 = !DILocation(line: 59, column: 19, scope: !882)
!894 = !DILocation(line: 60, column: 17, scope: !882)
!895 = !DILocation(line: 61, column: 5, scope: !882)
!896 = !DILocation(line: 65, column: 27, scope: !897)
!897 = distinct !DILexicalBlock(scope: !898, file: !622, line: 65, column: 17)
!898 = distinct !DILexicalBlock(scope: !882, file: !622, line: 61, column: 17)
!899 = !DILocation(line: 0, scope: !897)
!900 = !DILocation(line: 65, column: 17, scope: !898)
!901 = !DILocation(line: 66, column: 21, scope: !902)
!902 = distinct !DILexicalBlock(scope: !897, file: !622, line: 65, column: 33)
!903 = !DILocation(line: 67, column: 73, scope: !904)
!904 = distinct !DILexicalBlock(scope: !905, file: !622, line: 66, column: 38)
!905 = distinct !DILexicalBlock(scope: !902, file: !622, line: 66, column: 21)
!906 = !DILocation(line: 67, column: 69, scope: !904)
!907 = !DILocation(line: 67, column: 66, scope: !904)
!908 = !DILocation(line: 68, column: 17, scope: !904)
!909 = !DILocation(line: 68, column: 28, scope: !905)
!910 = !DILocation(line: 69, column: 77, scope: !911)
!911 = distinct !DILexicalBlock(scope: !912, file: !622, line: 68, column: 45)
!912 = distinct !DILexicalBlock(scope: !905, file: !622, line: 68, column: 28)
!913 = !DILocation(line: 70, column: 77, scope: !911)
!914 = !DILocation(line: 71, column: 17, scope: !911)
!915 = !DILocation(line: 72, column: 77, scope: !916)
!916 = distinct !DILexicalBlock(scope: !917, file: !622, line: 71, column: 45)
!917 = distinct !DILexicalBlock(scope: !912, file: !622, line: 71, column: 28)
!918 = !DILocation(line: 73, column: 77, scope: !916)
!919 = !DILocation(line: 74, column: 17, scope: !916)
!920 = !DILocation(line: 75, column: 79, scope: !921)
!921 = distinct !DILexicalBlock(scope: !922, file: !622, line: 74, column: 45)
!922 = distinct !DILexicalBlock(scope: !917, file: !622, line: 74, column: 28)
!923 = !DILocation(line: 76, column: 79, scope: !921)
!924 = !DILocation(line: 77, column: 17, scope: !921)
!925 = !DILocation(line: 78, column: 79, scope: !926)
!926 = distinct !DILexicalBlock(scope: !927, file: !622, line: 77, column: 45)
!927 = distinct !DILexicalBlock(scope: !922, file: !622, line: 77, column: 28)
!928 = !DILocation(line: 79, column: 79, scope: !926)
!929 = !DILocation(line: 80, column: 17, scope: !926)
!930 = !DILocation(line: 81, column: 79, scope: !931)
!931 = distinct !DILexicalBlock(scope: !932, file: !622, line: 80, column: 45)
!932 = distinct !DILexicalBlock(scope: !927, file: !622, line: 80, column: 28)
!933 = !DILocation(line: 82, column: 79, scope: !931)
!934 = !DILocation(line: 83, column: 17, scope: !931)
!935 = !DILocation(line: 85, column: 17, scope: !902)
!936 = !DILocation(line: 86, column: 13, scope: !902)
!937 = !DILocation(line: 88, column: 21, scope: !938)
!938 = distinct !DILexicalBlock(scope: !897, file: !622, line: 86, column: 20)
!939 = !DILocation(line: 89, column: 72, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !622, line: 88, column: 38)
!941 = distinct !DILexicalBlock(scope: !938, file: !622, line: 88, column: 21)
!942 = !DILocation(line: 89, column: 66, scope: !940)
!943 = !DILocation(line: 90, column: 17, scope: !940)
!944 = !DILocation(line: 90, column: 28, scope: !941)
!945 = !DILocation(line: 91, column: 77, scope: !946)
!946 = distinct !DILexicalBlock(scope: !947, file: !622, line: 90, column: 45)
!947 = distinct !DILexicalBlock(scope: !941, file: !622, line: 90, column: 28)
!948 = !DILocation(line: 92, column: 17, scope: !946)
!949 = !DILocation(line: 93, column: 77, scope: !950)
!950 = distinct !DILexicalBlock(scope: !951, file: !622, line: 92, column: 45)
!951 = distinct !DILexicalBlock(scope: !947, file: !622, line: 92, column: 28)
!952 = !DILocation(line: 94, column: 17, scope: !950)
!953 = !DILocation(line: 95, column: 79, scope: !954)
!954 = distinct !DILexicalBlock(scope: !955, file: !622, line: 94, column: 45)
!955 = distinct !DILexicalBlock(scope: !951, file: !622, line: 94, column: 28)
!956 = !DILocation(line: 96, column: 17, scope: !954)
!957 = !DILocation(line: 97, column: 79, scope: !958)
!958 = distinct !DILexicalBlock(scope: !959, file: !622, line: 96, column: 45)
!959 = distinct !DILexicalBlock(scope: !955, file: !622, line: 96, column: 28)
!960 = !DILocation(line: 98, column: 17, scope: !958)
!961 = !DILocation(line: 99, column: 79, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !622, line: 98, column: 45)
!963 = distinct !DILexicalBlock(scope: !959, file: !622, line: 98, column: 28)
!964 = !DILocation(line: 100, column: 17, scope: !962)
!965 = !DILocation(line: 103, column: 17, scope: !938)
!966 = !DILocation(line: 109, column: 27, scope: !967)
!967 = distinct !DILexicalBlock(scope: !898, file: !622, line: 109, column: 17)
!968 = !DILocation(line: 0, scope: !967)
!969 = !DILocation(line: 109, column: 17, scope: !898)
!970 = !DILocation(line: 110, column: 21, scope: !971)
!971 = distinct !DILexicalBlock(scope: !967, file: !622, line: 109, column: 33)
!972 = !DILocation(line: 111, column: 73, scope: !973)
!973 = distinct !DILexicalBlock(scope: !974, file: !622, line: 110, column: 36)
!974 = distinct !DILexicalBlock(scope: !971, file: !622, line: 110, column: 21)
!975 = !DILocation(line: 111, column: 69, scope: !973)
!976 = !DILocation(line: 111, column: 66, scope: !973)
!977 = !DILocation(line: 112, column: 17, scope: !973)
!978 = !DILocation(line: 113, column: 79, scope: !979)
!979 = distinct !DILexicalBlock(scope: !974, file: !622, line: 112, column: 24)
!980 = !DILocation(line: 114, column: 79, scope: !979)
!981 = !DILocation(line: 117, column: 17, scope: !971)
!982 = !DILocation(line: 118, column: 13, scope: !971)
!983 = !DILocation(line: 120, column: 21, scope: !984)
!984 = distinct !DILexicalBlock(scope: !967, file: !622, line: 118, column: 20)
!985 = !DILocation(line: 121, column: 72, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !622, line: 120, column: 36)
!987 = distinct !DILexicalBlock(scope: !984, file: !622, line: 120, column: 21)
!988 = !DILocation(line: 121, column: 66, scope: !986)
!989 = !DILocation(line: 122, column: 17, scope: !986)
!990 = !DILocation(line: 123, column: 79, scope: !991)
!991 = distinct !DILexicalBlock(scope: !987, file: !622, line: 122, column: 24)
!992 = !DILocation(line: 126, column: 17, scope: !984)
!993 = !DILocation(line: 133, column: 1, scope: !882)
!994 = distinct !DISubprogram(name: "halGPO_Write", scope: !622, file: !622, line: 136, type: !883, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !995)
!995 = !{!996, !997, !998, !999}
!996 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !994, file: !622, line: 136, type: !8)
!997 = !DILocalVariable(name: "writeValue", arg: 2, scope: !994, file: !622, line: 136, type: !54)
!998 = !DILocalVariable(name: "no", scope: !994, file: !622, line: 138, type: !890)
!999 = !DILocalVariable(name: "remainder", scope: !994, file: !622, line: 139, type: !890)
!1000 = !DILocation(line: 0, scope: !994)
!1001 = !DILocation(line: 140, column: 19, scope: !994)
!1002 = !DILocation(line: 141, column: 17, scope: !994)
!1003 = !DILocation(line: 142, column: 5, scope: !994)
!1004 = !DILocation(line: 145, column: 17, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !622, line: 145, column: 17)
!1006 = distinct !DILexicalBlock(scope: !994, file: !622, line: 142, column: 17)
!1007 = !DILocation(line: 0, scope: !1005)
!1008 = !DILocation(line: 145, column: 17, scope: !1006)
!1009 = !DILocation(line: 146, column: 17, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !622, line: 145, column: 29)
!1011 = !DILocation(line: 147, column: 13, scope: !1010)
!1012 = !DILocation(line: 148, column: 17, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1005, file: !622, line: 147, column: 20)
!1014 = !DILocation(line: 153, column: 17, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1006, file: !622, line: 153, column: 17)
!1016 = !DILocation(line: 0, scope: !1015)
!1017 = !DILocation(line: 153, column: 17, scope: !1006)
!1018 = !DILocation(line: 154, column: 17, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1015, file: !622, line: 153, column: 29)
!1020 = !DILocation(line: 155, column: 13, scope: !1019)
!1021 = !DILocation(line: 156, column: 17, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1015, file: !622, line: 155, column: 20)
!1023 = !DILocation(line: 163, column: 1, scope: !994)
!1024 = distinct !DISubprogram(name: "halgetGPIO_DOUT", scope: !622, file: !622, line: 169, type: !1025, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !1027)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!54, !8}
!1027 = !{!1028, !1029, !1030, !1031}
!1028 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1024, file: !622, line: 169, type: !8)
!1029 = !DILocalVariable(name: "no", scope: !1024, file: !622, line: 171, type: !890)
!1030 = !DILocalVariable(name: "remainder", scope: !1024, file: !622, line: 172, type: !890)
!1031 = !DILocalVariable(name: "dout", scope: !1024, file: !622, line: 175, type: !54)
!1032 = !DILocation(line: 0, scope: !1024)
!1033 = !DILocation(line: 173, column: 19, scope: !1024)
!1034 = !DILocation(line: 174, column: 17, scope: !1024)
!1035 = !DILocation(line: 177, column: 5, scope: !1024)
!1036 = !DILocation(line: 183, column: 13, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1024, file: !622, line: 177, column: 17)
!1038 = !DILocation(line: 0, scope: !1037)
!1039 = !DILocation(line: 187, column: 5, scope: !1024)
!1040 = !DILocation(line: 188, column: 1, scope: !1024)
!1041 = distinct !DISubprogram(name: "halgetGPIO_DIN", scope: !622, file: !622, line: 189, type: !1025, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !1042)
!1042 = !{!1043, !1044, !1045, !1046}
!1043 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1041, file: !622, line: 189, type: !8)
!1044 = !DILocalVariable(name: "no", scope: !1041, file: !622, line: 191, type: !890)
!1045 = !DILocalVariable(name: "remainder", scope: !1041, file: !622, line: 192, type: !890)
!1046 = !DILocalVariable(name: "din", scope: !1041, file: !622, line: 195, type: !54)
!1047 = !DILocation(line: 0, scope: !1041)
!1048 = !DILocation(line: 193, column: 19, scope: !1041)
!1049 = !DILocation(line: 194, column: 17, scope: !1041)
!1050 = !DILocation(line: 196, column: 5, scope: !1041)
!1051 = !DILocation(line: 203, column: 13, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1041, file: !622, line: 196, column: 17)
!1053 = !DILocation(line: 0, scope: !1052)
!1054 = !DILocation(line: 208, column: 5, scope: !1041)
!1055 = !DILocation(line: 209, column: 1, scope: !1041)
!1056 = distinct !DISubprogram(name: "halgetGPIO_OutEnable", scope: !622, file: !622, line: 210, type: !1025, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !1057)
!1057 = !{!1058, !1059, !1060, !1061}
!1058 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1056, file: !622, line: 210, type: !8)
!1059 = !DILocalVariable(name: "no", scope: !1056, file: !622, line: 212, type: !890)
!1060 = !DILocalVariable(name: "remainder", scope: !1056, file: !622, line: 213, type: !890)
!1061 = !DILocalVariable(name: "outEnable", scope: !1056, file: !622, line: 216, type: !54)
!1062 = !DILocation(line: 0, scope: !1056)
!1063 = !DILocation(line: 214, column: 19, scope: !1056)
!1064 = !DILocation(line: 215, column: 17, scope: !1056)
!1065 = !DILocation(line: 218, column: 5, scope: !1056)
!1066 = !DILocation(line: 224, column: 13, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1056, file: !622, line: 218, column: 17)
!1068 = !DILocation(line: 0, scope: !1067)
!1069 = !DILocation(line: 228, column: 5, scope: !1056)
!1070 = !DILocation(line: 229, column: 1, scope: !1056)
!1071 = distinct !DISubprogram(name: "halGPIO_PullUp_SET", scope: !622, file: !622, line: 232, type: !1072, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!885, !8}
!1074 = !{!1075, !1076, !1077}
!1075 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1071, file: !622, line: 232, type: !8)
!1076 = !DILocalVariable(name: "no", scope: !1071, file: !622, line: 234, type: !890)
!1077 = !DILocalVariable(name: "remainder", scope: !1071, file: !622, line: 235, type: !890)
!1078 = !DILocation(line: 0, scope: !1071)
!1079 = !DILocation(line: 236, column: 19, scope: !1071)
!1080 = !DILocation(line: 237, column: 17, scope: !1071)
!1081 = !DILocation(line: 238, column: 5, scope: !1071)
!1082 = !DILocation(line: 239, column: 5, scope: !1071)
!1083 = !DILocation(line: 241, column: 27, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !622, line: 241, column: 17)
!1085 = distinct !DILexicalBlock(scope: !1071, file: !622, line: 239, column: 17)
!1086 = !DILocation(line: 241, column: 17, scope: !1085)
!1087 = !DILocation(line: 241, column: 17, scope: !1084)
!1088 = !DILocation(line: 242, column: 17, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1084, file: !622, line: 241, column: 34)
!1090 = !DILocation(line: 243, column: 13, scope: !1089)
!1091 = !DILocation(line: 243, column: 24, scope: !1084)
!1092 = !DILocation(line: 244, column: 73, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !622, line: 243, column: 41)
!1094 = distinct !DILexicalBlock(scope: !1084, file: !622, line: 243, column: 24)
!1095 = !DILocation(line: 245, column: 73, scope: !1093)
!1096 = !DILocation(line: 246, column: 13, scope: !1093)
!1097 = !DILocation(line: 247, column: 73, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !622, line: 246, column: 41)
!1099 = distinct !DILexicalBlock(scope: !1094, file: !622, line: 246, column: 24)
!1100 = !DILocation(line: 248, column: 73, scope: !1098)
!1101 = !DILocation(line: 249, column: 13, scope: !1098)
!1102 = !DILocation(line: 250, column: 75, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !622, line: 249, column: 41)
!1104 = distinct !DILexicalBlock(scope: !1099, file: !622, line: 249, column: 24)
!1105 = !DILocation(line: 251, column: 75, scope: !1103)
!1106 = !DILocation(line: 252, column: 13, scope: !1103)
!1107 = !DILocation(line: 253, column: 75, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !622, line: 252, column: 41)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !622, line: 252, column: 24)
!1110 = !DILocation(line: 254, column: 75, scope: !1108)
!1111 = !DILocation(line: 255, column: 13, scope: !1108)
!1112 = !DILocation(line: 256, column: 75, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !622, line: 255, column: 41)
!1114 = distinct !DILexicalBlock(scope: !1109, file: !622, line: 255, column: 24)
!1115 = !DILocation(line: 257, column: 75, scope: !1113)
!1116 = !DILocation(line: 258, column: 13, scope: !1113)
!1117 = !DILocation(line: 261, column: 18, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1085, file: !622, line: 261, column: 17)
!1119 = !DILocation(line: 261, column: 17, scope: !1085)
!1120 = !DILocation(line: 262, column: 75, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1118, file: !622, line: 261, column: 29)
!1122 = !DILocation(line: 263, column: 75, scope: !1121)
!1123 = !DILocation(line: 264, column: 13, scope: !1121)
!1124 = !DILocation(line: 265, column: 17, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1118, file: !622, line: 264, column: 20)
!1126 = !DILocation(line: 272, column: 1, scope: !1071)
!1127 = distinct !DISubprogram(name: "halGPIO_PullDown_RESET", scope: !622, file: !622, line: 359, type: !1072, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1127, file: !622, line: 359, type: !8)
!1130 = !DILocalVariable(name: "no", scope: !1127, file: !622, line: 362, type: !890)
!1131 = !DILocalVariable(name: "remainder", scope: !1127, file: !622, line: 363, type: !890)
!1132 = !DILocation(line: 0, scope: !1127)
!1133 = !DILocation(line: 364, column: 19, scope: !1127)
!1134 = !DILocation(line: 365, column: 17, scope: !1127)
!1135 = !DILocation(line: 367, column: 5, scope: !1127)
!1136 = !DILocation(line: 369, column: 27, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !622, line: 369, column: 17)
!1138 = distinct !DILexicalBlock(scope: !1127, file: !622, line: 367, column: 17)
!1139 = !DILocation(line: 369, column: 17, scope: !1138)
!1140 = !DILocation(line: 369, column: 17, scope: !1137)
!1141 = !DILocation(line: 370, column: 17, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1137, file: !622, line: 369, column: 34)
!1143 = !DILocation(line: 371, column: 13, scope: !1142)
!1144 = !DILocation(line: 371, column: 24, scope: !1137)
!1145 = !DILocation(line: 372, column: 73, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !622, line: 371, column: 41)
!1147 = distinct !DILexicalBlock(scope: !1137, file: !622, line: 371, column: 24)
!1148 = !DILocation(line: 373, column: 73, scope: !1146)
!1149 = !DILocation(line: 374, column: 13, scope: !1146)
!1150 = !DILocation(line: 375, column: 73, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !622, line: 374, column: 41)
!1152 = distinct !DILexicalBlock(scope: !1147, file: !622, line: 374, column: 24)
!1153 = !DILocation(line: 376, column: 73, scope: !1151)
!1154 = !DILocation(line: 377, column: 13, scope: !1151)
!1155 = !DILocation(line: 378, column: 75, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !622, line: 377, column: 41)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !622, line: 377, column: 24)
!1158 = !DILocation(line: 379, column: 75, scope: !1156)
!1159 = !DILocation(line: 380, column: 13, scope: !1156)
!1160 = !DILocation(line: 381, column: 75, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !622, line: 380, column: 41)
!1162 = distinct !DILexicalBlock(scope: !1157, file: !622, line: 380, column: 24)
!1163 = !DILocation(line: 382, column: 75, scope: !1161)
!1164 = !DILocation(line: 383, column: 13, scope: !1161)
!1165 = !DILocation(line: 384, column: 75, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !622, line: 383, column: 41)
!1167 = distinct !DILexicalBlock(scope: !1162, file: !622, line: 383, column: 24)
!1168 = !DILocation(line: 385, column: 75, scope: !1166)
!1169 = !DILocation(line: 386, column: 13, scope: !1166)
!1170 = !DILocation(line: 389, column: 18, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1138, file: !622, line: 389, column: 17)
!1172 = !DILocation(line: 389, column: 17, scope: !1138)
!1173 = !DILocation(line: 390, column: 75, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1171, file: !622, line: 389, column: 29)
!1175 = !DILocation(line: 391, column: 75, scope: !1174)
!1176 = !DILocation(line: 392, column: 13, scope: !1174)
!1177 = !DILocation(line: 393, column: 17, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1171, file: !622, line: 392, column: 20)
!1179 = !DILocation(line: 401, column: 1, scope: !1127)
!1180 = distinct !DISubprogram(name: "halGPIO_PullUp_RESET", scope: !622, file: !622, line: 274, type: !1072, scopeLine: 275, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !1181)
!1181 = !{!1182, !1183, !1184}
!1182 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1180, file: !622, line: 274, type: !8)
!1183 = !DILocalVariable(name: "no", scope: !1180, file: !622, line: 276, type: !890)
!1184 = !DILocalVariable(name: "remainder", scope: !1180, file: !622, line: 277, type: !890)
!1185 = !DILocation(line: 0, scope: !1180)
!1186 = !DILocation(line: 278, column: 19, scope: !1180)
!1187 = !DILocation(line: 279, column: 17, scope: !1180)
