; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/zbus/benchmark/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/benchmark/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/benchmark")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/benchmark")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_bm_channel", scope: !27, file: !122, line: 16, type: !144, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !109, globals: !119, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/benchmark")
!29 = !{!30, !101}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_fatal_error_reason", file: !102, line: 27, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/fatal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106, !107, !108}
!104 = !DIEnumerator(name: "K_ERR_CPU_EXCEPTION", value: 0)
!105 = !DIEnumerator(name: "K_ERR_SPURIOUS_IRQ", value: 1)
!106 = !DIEnumerator(name: "K_ERR_STACK_CHK_FAIL", value: 2)
!107 = !DIEnumerator(name: "K_ERR_KERNEL_OOPS", value: 3)
!108 = !DIEnumerator(name: "K_ERR_KERNEL_PANIC", value: 4)
!109 = !{!110, !111, !112, !116, !117}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!111 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !115)
!115 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !118)
!118 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!119 = !{!25, !120, !292, !294, !296, !298, !300, !302, !304, !306, !308, !341, !345, !350, !352, !359, !364}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "bm_channel", scope: !27, file: !122, line: 16, type: !123, isLocal: false, isDefinition: true, align: 32)
!122 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !125, line: 29, size: 192, elements: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = !{!127, !131, !133, !134, !142, !261}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !124, file: !125, line: 35, baseType: !128, size: 16)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !130)
!130 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !124, file: !125, line: 40, baseType: !132, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !124, file: !125, line: 45, baseType: !132, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !124, file: !125, line: 51, baseType: !135, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !13, !140}
!139 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !141, line: 214, baseType: !32)
!141 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !124, file: !125, line: 56, baseType: !143, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !145, line: 2720, size: 160, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !168, !259, !260}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !144, file: !145, line: 2722, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !149, line: 233, baseType: !150)
!149 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 231, size: 64, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !150, file: !149, line: 232, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !154, line: 48, baseType: !155)
!154 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !154, line: 37, size: 64, elements: !156)
!156 = !{!157, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !154, line: 38, baseType: !158, size: 32)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !155, file: !154, line: 38, size: 32, elements: !159)
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !158, file: !154, line: 39, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !154, line: 40, baseType: !161, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !154, line: 42, baseType: !164, size: 32, offset: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !155, file: !154, line: 42, size: 32, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !164, file: !154, line: 43, baseType: !161, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !154, line: 44, baseType: !161, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !144, file: !145, line: 2724, baseType: !169, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !171, line: 245, size: 896, elements: !172)
!171 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !{!173, !220, !233, !234, !235, !236, !254}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !170, file: !171, line: 247, baseType: !174, size: 384)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !171, line: 57, size: 384, elements: !175)
!175 = !{!176, !190, !192, !195, !196, !207, !208, !209}
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !171, line: 60, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !171, line: 60, size: 64, elements: !178)
!178 = !{!179, !181}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !177, file: !171, line: 61, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !154, line: 49, baseType: !155)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !177, file: !171, line: 62, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !183, line: 49, size: 64, elements: !184)
!183 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !182, file: !183, line: 50, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 64, elements: !188)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!188 = !{!189}
!189 = !DISubrange(count: 2)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !174, file: !171, line: 68, baseType: !191, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !174, file: !171, line: 71, baseType: !193, size: 8, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !194)
!194 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !174, file: !171, line: 74, baseType: !193, size: 8, offset: 104)
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !171, line: 90, baseType: !197, size: 16, offset: 112)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !171, line: 90, size: 16, elements: !198)
!198 = !{!199, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, scope: !197, file: !171, line: 91, baseType: !200, size: 16)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !197, file: !171, line: 91, size: 16, elements: !201)
!201 = !{!202, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !200, file: !171, line: 96, baseType: !203, size: 8)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !204)
!204 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !200, file: !171, line: 97, baseType: !193, size: 8, offset: 8)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !197, file: !171, line: 100, baseType: !129, size: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !174, file: !171, line: 107, baseType: !116, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !174, file: !171, line: 127, baseType: !110, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !174, file: !171, line: 131, baseType: !210, size: 192, offset: 192)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !149, line: 244, size: 192, elements: !211)
!211 = !{!212, !213, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !210, file: !149, line: 245, baseType: !180, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !210, file: !149, line: 246, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !149, line: 242, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !210, file: !149, line: 249, baseType: !114, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !170, file: !171, line: 250, baseType: !221, size: 288, offset: 384)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !222, line: 25, size: 288, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !221, file: !222, line: 26, baseType: !116, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !221, file: !222, line: 27, baseType: !116, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !221, file: !222, line: 28, baseType: !116, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !221, file: !222, line: 29, baseType: !116, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !221, file: !222, line: 30, baseType: !116, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !221, file: !222, line: 31, baseType: !116, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !221, file: !222, line: 32, baseType: !116, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !221, file: !222, line: 33, baseType: !116, size: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !221, file: !222, line: 34, baseType: !116, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !170, file: !171, line: 253, baseType: !110, size: 32, offset: 672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !170, file: !171, line: 256, baseType: !148, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !170, file: !171, line: 294, baseType: !111, size: 32, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !170, file: !171, line: 325, baseType: !237, size: 32, offset: 800)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !145, line: 5073, size: 160, elements: !239)
!239 = !{!240, !249, !250}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !238, file: !145, line: 5074, baseType: !241, size: 96)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !242, line: 56, size: 96, elements: !243)
!242 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!243 = !{!244, !247, !248}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !241, file: !242, line: 57, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !242, line: 57, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !241, file: !242, line: 58, baseType: !110, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !241, file: !242, line: 59, baseType: !140, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !238, file: !145, line: 5075, baseType: !148, size: 64, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !238, file: !145, line: 5076, baseType: !251, offset: 160)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !252, line: 43, elements: !253)
!252 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!253 = !{}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !170, file: !171, line: 343, baseType: !255, size: 64, offset: 832)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !222, line: 60, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !255, file: !222, line: 63, baseType: !116, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !255, file: !222, line: 66, baseType: !116, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !144, file: !145, line: 2727, baseType: !116, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !144, file: !145, line: 2730, baseType: !111, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !124, file: !125, line: 67, baseType: !262, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !125, line: 85, size: 96, elements: !267)
!267 = !{!268, !269, !286}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !266, file: !125, line: 91, baseType: !139, size: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !266, file: !125, line: 93, baseType: !270, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !145, line: 4204, size: 320, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !281, !282, !283, !284, !285}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !272, file: !145, line: 4206, baseType: !148, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !272, file: !145, line: 4208, baseType: !251, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !272, file: !145, line: 4210, baseType: !140, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !272, file: !145, line: 4212, baseType: !116, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !272, file: !145, line: 4214, baseType: !279, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !272, file: !145, line: 4216, baseType: !279, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !272, file: !145, line: 4218, baseType: !279, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !272, file: !145, line: 4220, baseType: !279, size: 32, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !272, file: !145, line: 4222, baseType: !116, size: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !272, file: !145, line: 4227, baseType: !193, size: 8, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !266, file: !125, line: 96, baseType: !287, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "s1", scope: !27, file: !122, line: 126, type: !266, isLocal: false, isDefinition: true, align: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s2", scope: !27, file: !122, line: 129, type: !266, isLocal: false, isDefinition: true, align: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "s3", scope: !27, file: !122, line: 131, type: !266, isLocal: false, isDefinition: true, align: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "s4", scope: !27, file: !122, line: 132, type: !266, isLocal: false, isDefinition: true, align: 32)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "s5", scope: !27, file: !122, line: 134, type: !266, isLocal: false, isDefinition: true, align: 32)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "s6", scope: !27, file: !122, line: 135, type: !266, isLocal: false, isDefinition: true, align: 32)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "s7", scope: !27, file: !122, line: 136, type: !266, isLocal: false, isDefinition: true, align: 32)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "s8", scope: !27, file: !122, line: 137, type: !266, isLocal: false, isDefinition: true, align: 32)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !27, file: !122, line: 216, type: !310, isLocal: false, isDefinition: true, align: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !145, line: 620, size: 384, elements: !311)
!311 = !{!312, !313, !321, !322, !327, !328, !329, !330, !331, !332, !334, !338}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !310, file: !145, line: 621, baseType: !169, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !310, file: !145, line: 622, baseType: !314, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !316, line: 44, baseType: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !318, line: 47, size: 8, elements: !319)
!318 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !318, line: 48, baseType: !280, size: 8)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !310, file: !145, line: 623, baseType: !32, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !310, file: !145, line: 624, baseType: !323, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !316, line: 46, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !110, !110, !110}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !310, file: !145, line: 625, baseType: !110, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !310, file: !145, line: 626, baseType: !110, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !310, file: !145, line: 627, baseType: !110, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !310, file: !145, line: 628, baseType: !111, size: 32, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !310, file: !145, line: 629, baseType: !116, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !310, file: !145, line: 630, baseType: !333, size: 32, offset: 288)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !111)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !310, file: !145, line: 631, baseType: !335, size: 32, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{null}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !310, file: !145, line: 632, baseType: !339, size: 32, offset: 352)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !27, file: !122, line: 216, type: !343, isLocal: false, isDefinition: true)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !171, line: 347, baseType: !169)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !27, file: !122, line: 216, type: !347, isLocal: false, isDefinition: true, align: 64)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 8192, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 1024)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !27, file: !122, line: 216, type: !170, isLocal: false, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "_zbus_message_bm_channel", scope: !27, file: !122, line: 16, type: !354, isLocal: true, isDefinition: true)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !355, line: 10, size: 64, elements: !356)
!355 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !354, file: !355, line: 11, baseType: !110, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !354, file: !355, line: 12, baseType: !140, size: 32, offset: 32)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "_zbus_observers_bm_channel", scope: !27, file: !122, line: 16, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 288, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 9)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !122, line: 44, type: !117, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !368, file: !383, line: 18, type: !384, isLocal: false, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !370, globals: !382, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/benchmark")
!370 = !{!22, !110, !24, !371, !373, !375, !140, !111, !376, !377, !379, !380, !279, !381, !129, !339}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!382 = !{!366}
!383 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !386, line: 16, size: 64, elements: !387)
!386 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !386, line: 17, baseType: !339, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !385, file: !386, line: 18, baseType: !193, size: 8, offset: 32)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "_char_out", scope: !392, file: !397, line: 54, type: !398, isLocal: false, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !395, globals: !396, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/benchmark")
!394 = !{!30}
!395 = !{!110, !111}
!396 = !{!390}
!397 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DISubroutineType(types: !400)
!400 = !{!111, !111}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !403, file: !1137, line: 202, type: !1138, isLocal: true, isDefinition: true, align: 32)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !405, globals: !1136, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/benchmark")
!405 = !{!110, !111, !406, !528, !867, !868, !935}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !408, line: 335, baseType: !409)
!408 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 320, size: 288, elements: !410)
!410 = !{!411, !422, !428, !442, !453, !464, !468, !479, !480, !491, !492, !507, !508, !518}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !409, file: !408, line: 321, baseType: !412, size: 16)
!412 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !408, line: 50, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 43, size: 16, elements: !415)
!415 = !{!416, !421}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !414, file: !408, line: 48, baseType: !417, size: 16)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !408, line: 44, size: 16, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !417, file: !408, line: 45, baseType: !129, size: 7, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !417, file: !408, line: 47, baseType: !129, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !414, file: !408, line: 49, baseType: !129, size: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !409, file: !408, line: 322, baseType: !423, size: 16, offset: 16)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 16, elements: !188)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !425, line: 52, baseType: !426)
!425 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !193)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !409, file: !408, line: 323, baseType: !429, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !408, line: 107, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 94, size: 32, elements: !432)
!432 = !{!433, !441}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !431, file: !408, line: 105, baseType: !434, size: 32)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !431, file: !408, line: 95, size: 32, elements: !435)
!435 = !{!436, !437, !438, !439, !440}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !434, file: !408, line: 97, baseType: !116, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !434, file: !408, line: 99, baseType: !116, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !434, file: !408, line: 100, baseType: !116, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !434, file: !408, line: 102, baseType: !116, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !434, file: !408, line: 103, baseType: !116, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !431, file: !408, line: 106, baseType: !116, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !409, file: !408, line: 324, baseType: !443, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !408, line: 155, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 148, size: 32, elements: !446)
!446 = !{!447, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !445, file: !408, line: 153, baseType: !448, size: 32)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !445, file: !408, line: 149, size: 32, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !448, file: !408, line: 150, baseType: !116, size: 16, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !448, file: !408, line: 151, baseType: !116, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !445, file: !408, line: 154, baseType: !116, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !409, file: !408, line: 325, baseType: !454, size: 8, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !408, line: 194, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 187, size: 8, elements: !457)
!457 = !{!458, !463}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !456, file: !408, line: 192, baseType: !459, size: 8)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !408, line: 188, size: 8, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !459, file: !408, line: 189, baseType: !193, size: 1, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !459, file: !408, line: 190, baseType: !193, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !456, file: !408, line: 193, baseType: !193, size: 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !409, file: !408, line: 326, baseType: !465, size: 24, offset: 104)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 24, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 3)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !409, file: !408, line: 327, baseType: !469, size: 8, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !408, line: 215, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 208, size: 8, elements: !472)
!472 = !{!473, !478}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !471, file: !408, line: 213, baseType: !474, size: 8)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !471, file: !408, line: 209, size: 8, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !474, file: !408, line: 210, baseType: !193, size: 1, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !474, file: !408, line: 211, baseType: !193, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !471, file: !408, line: 214, baseType: !193, size: 8)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !409, file: !408, line: 328, baseType: !465, size: 24, offset: 136)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !409, file: !408, line: 329, baseType: !481, size: 8, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !408, line: 236, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 229, size: 8, elements: !484)
!484 = !{!485, !490}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !483, file: !408, line: 234, baseType: !486, size: 8)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !483, file: !408, line: 230, size: 8, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !486, file: !408, line: 231, baseType: !426, size: 1, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !486, file: !408, line: 232, baseType: !426, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !483, file: !408, line: 235, baseType: !193, size: 8)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !409, file: !408, line: 330, baseType: !465, size: 24, offset: 168)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !409, file: !408, line: 331, baseType: !493, size: 16, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !408, line: 262, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 250, size: 16, elements: !496)
!496 = !{!497, !506}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !495, file: !408, line: 260, baseType: !498, size: 16)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !495, file: !408, line: 251, size: 16, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !498, file: !408, line: 252, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !498, file: !408, line: 253, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !498, file: !408, line: 254, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !498, file: !408, line: 255, baseType: !129, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !498, file: !408, line: 256, baseType: !129, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !498, file: !408, line: 258, baseType: !129, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !495, file: !408, line: 261, baseType: !129, size: 16)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !409, file: !408, line: 332, baseType: !423, size: 16, offset: 208)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !409, file: !408, line: 333, baseType: !509, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !408, line: 290, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 284, size: 32, elements: !512)
!512 = !{!513, !517}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !511, file: !408, line: 288, baseType: !514, size: 32)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !511, file: !408, line: 285, size: 32, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !514, file: !408, line: 286, baseType: !116, size: 22, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !511, file: !408, line: 289, baseType: !116, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !409, file: !408, line: 334, baseType: !519, size: 16, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !408, line: 308, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !408, line: 303, size: 16, elements: !522)
!522 = !{!523, !527}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !521, file: !408, line: 306, baseType: !524, size: 16)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !521, file: !408, line: 304, size: 16, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !524, file: !408, line: 305, baseType: !129, size: 16, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !521, file: !408, line: 307, baseType: !129, size: 16)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !530, line: 928, baseType: !531)
!530 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !530, line: 899, size: 672, elements: !532)
!532 = !{!533, !557, !581, !607, !632, !648, !649, !667, !668, !685, !696, !697, !712, !732, !733, !745, !757, !767, !768, !785, !789, !800, !801, !813, !825, !826, !837, !853}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !531, file: !530, line: 900, baseType: !534, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !530, line: 64, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 43, size: 32, elements: !537)
!537 = !{!538, !556}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !536, file: !530, line: 62, baseType: !539, size: 32)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !536, file: !530, line: 44, size: 32, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !539, file: !530, line: 45, baseType: !116, size: 1, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !539, file: !530, line: 46, baseType: !116, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !539, file: !530, line: 47, baseType: !116, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !539, file: !530, line: 48, baseType: !116, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !539, file: !530, line: 49, baseType: !116, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !539, file: !530, line: 50, baseType: !116, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !539, file: !530, line: 51, baseType: !116, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !539, file: !530, line: 52, baseType: !116, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !539, file: !530, line: 53, baseType: !116, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !539, file: !530, line: 54, baseType: !116, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !539, file: !530, line: 55, baseType: !116, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !539, file: !530, line: 56, baseType: !116, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !539, file: !530, line: 58, baseType: !116, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !539, file: !530, line: 59, baseType: !116, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !539, file: !530, line: 60, baseType: !116, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !536, file: !530, line: 63, baseType: !116, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !531, file: !530, line: 901, baseType: !558, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !530, line: 125, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 104, size: 32, elements: !561)
!561 = !{!562, !580}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !560, file: !530, line: 123, baseType: !563, size: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !530, line: 105, size: 32, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !563, file: !530, line: 106, baseType: !116, size: 1, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !563, file: !530, line: 107, baseType: !116, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !563, file: !530, line: 108, baseType: !116, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !563, file: !530, line: 109, baseType: !116, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !563, file: !530, line: 110, baseType: !116, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !563, file: !530, line: 111, baseType: !116, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !563, file: !530, line: 112, baseType: !116, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !563, file: !530, line: 113, baseType: !116, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !563, file: !530, line: 114, baseType: !116, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !563, file: !530, line: 115, baseType: !116, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !563, file: !530, line: 116, baseType: !116, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !563, file: !530, line: 117, baseType: !116, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !563, file: !530, line: 119, baseType: !116, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !563, file: !530, line: 120, baseType: !116, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !563, file: !530, line: 121, baseType: !116, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !560, file: !530, line: 124, baseType: !116, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !531, file: !530, line: 902, baseType: !582, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !530, line: 186, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 165, size: 32, elements: !585)
!585 = !{!586, !606}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !584, file: !530, line: 184, baseType: !587, size: 32)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !584, file: !530, line: 166, size: 32, elements: !588)
!588 = !{!589, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !587, file: !530, line: 167, baseType: !590, size: 1, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !587, file: !530, line: 168, baseType: !590, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !587, file: !530, line: 169, baseType: !590, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !587, file: !530, line: 170, baseType: !590, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !587, file: !530, line: 171, baseType: !590, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !587, file: !530, line: 172, baseType: !590, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !587, file: !530, line: 173, baseType: !590, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !587, file: !530, line: 174, baseType: !590, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !587, file: !530, line: 175, baseType: !590, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !587, file: !530, line: 176, baseType: !590, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !587, file: !530, line: 177, baseType: !590, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !587, file: !530, line: 178, baseType: !590, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !587, file: !530, line: 180, baseType: !590, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !587, file: !530, line: 181, baseType: !590, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !587, file: !530, line: 182, baseType: !590, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !584, file: !530, line: 185, baseType: !116, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !531, file: !530, line: 903, baseType: !608, size: 32, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !530, line: 247, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 226, size: 32, elements: !612)
!612 = !{!613, !631}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !611, file: !530, line: 245, baseType: !614, size: 32)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !530, line: 227, size: 32, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !614, file: !530, line: 228, baseType: !116, size: 1, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !614, file: !530, line: 229, baseType: !116, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !614, file: !530, line: 230, baseType: !116, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !614, file: !530, line: 231, baseType: !116, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !614, file: !530, line: 232, baseType: !116, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !614, file: !530, line: 233, baseType: !116, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !614, file: !530, line: 234, baseType: !116, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !614, file: !530, line: 235, baseType: !116, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !614, file: !530, line: 236, baseType: !116, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !614, file: !530, line: 237, baseType: !116, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !614, file: !530, line: 238, baseType: !116, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !614, file: !530, line: 239, baseType: !116, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !614, file: !530, line: 241, baseType: !116, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !614, file: !530, line: 242, baseType: !116, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !614, file: !530, line: 243, baseType: !116, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !611, file: !530, line: 246, baseType: !116, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !531, file: !530, line: 904, baseType: !633, size: 16, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !530, line: 300, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 287, size: 16, elements: !636)
!636 = !{!637, !647}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !635, file: !530, line: 298, baseType: !638, size: 16)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !635, file: !530, line: 288, size: 16, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !638, file: !530, line: 290, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !638, file: !530, line: 291, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !638, file: !530, line: 293, baseType: !129, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !638, file: !530, line: 294, baseType: !129, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !638, file: !530, line: 295, baseType: !129, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !638, file: !530, line: 296, baseType: !129, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !638, file: !530, line: 297, baseType: !129, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !635, file: !530, line: 299, baseType: !129, size: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !531, file: !530, line: 905, baseType: !423, size: 16, offset: 144)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !531, file: !530, line: 906, baseType: !650, size: 16, offset: 160)
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !530, line: 352, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 336, size: 16, elements: !653)
!653 = !{!654, !666}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !652, file: !530, line: 350, baseType: !655, size: 16)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !652, file: !530, line: 337, size: 16, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !655, file: !530, line: 339, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !655, file: !530, line: 340, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !655, file: !530, line: 341, baseType: !129, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !655, file: !530, line: 342, baseType: !129, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !655, file: !530, line: 343, baseType: !129, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !655, file: !530, line: 344, baseType: !129, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !655, file: !530, line: 345, baseType: !129, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !655, file: !530, line: 346, baseType: !129, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !655, file: !530, line: 348, baseType: !129, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !652, file: !530, line: 351, baseType: !129, size: 16)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !531, file: !530, line: 907, baseType: !423, size: 16, offset: 176)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !531, file: !530, line: 908, baseType: !669, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !530, line: 398, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 381, size: 32, elements: !672)
!672 = !{!673, !684}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !671, file: !530, line: 396, baseType: !674, size: 32)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !530, line: 382, size: 32, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !674, file: !530, line: 384, baseType: !116, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !674, file: !530, line: 385, baseType: !116, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !674, file: !530, line: 386, baseType: !116, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !674, file: !530, line: 388, baseType: !116, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !674, file: !530, line: 389, baseType: !116, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !674, file: !530, line: 390, baseType: !116, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !674, file: !530, line: 392, baseType: !116, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !674, file: !530, line: 394, baseType: !116, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !671, file: !530, line: 397, baseType: !116, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !531, file: !530, line: 909, baseType: !686, size: 8, offset: 224)
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !530, line: 433, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 426, size: 8, elements: !689)
!689 = !{!690, !695}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !688, file: !530, line: 431, baseType: !691, size: 8)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !688, file: !530, line: 427, size: 8, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !691, file: !530, line: 428, baseType: !193, size: 5, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !691, file: !530, line: 430, baseType: !193, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !688, file: !530, line: 432, baseType: !193, size: 8)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !531, file: !530, line: 910, baseType: !465, size: 24, offset: 232)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !531, file: !530, line: 911, baseType: !698, size: 32, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !530, line: 462, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 448, size: 32, elements: !701)
!701 = !{!702, !711}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !700, file: !530, line: 460, baseType: !703, size: 32)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !530, line: 449, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !703, file: !530, line: 451, baseType: !116, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !703, file: !530, line: 453, baseType: !116, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !703, file: !530, line: 454, baseType: !116, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !703, file: !530, line: 455, baseType: !116, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !703, file: !530, line: 457, baseType: !116, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !703, file: !530, line: 459, baseType: !116, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !700, file: !530, line: 461, baseType: !116, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !531, file: !530, line: 912, baseType: !713, size: 16, offset: 288)
!713 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !530, line: 520, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 503, size: 16, elements: !716)
!716 = !{!717, !731}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !715, file: !530, line: 518, baseType: !718, size: 16)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !715, file: !530, line: 504, size: 16, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !718, file: !530, line: 506, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !718, file: !530, line: 507, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !718, file: !530, line: 508, baseType: !129, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !718, file: !530, line: 509, baseType: !129, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !718, file: !530, line: 510, baseType: !129, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !718, file: !530, line: 511, baseType: !129, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !718, file: !530, line: 512, baseType: !129, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !718, file: !530, line: 513, baseType: !129, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !718, file: !530, line: 514, baseType: !129, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !718, file: !530, line: 515, baseType: !129, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !718, file: !530, line: 516, baseType: !129, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !715, file: !530, line: 519, baseType: !129, size: 16)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !531, file: !530, line: 913, baseType: !423, size: 16, offset: 304)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !531, file: !530, line: 914, baseType: !734, size: 32, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !530, line: 559, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 552, size: 32, elements: !737)
!737 = !{!738, !744}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !736, file: !530, line: 557, baseType: !739, size: 32)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !530, line: 553, size: 32, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !739, file: !530, line: 554, baseType: !116, size: 10, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !739, file: !530, line: 555, baseType: !116, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !739, file: !530, line: 556, baseType: !116, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !736, file: !530, line: 558, baseType: !116, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !531, file: !530, line: 915, baseType: !746, size: 32, offset: 352)
!746 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !530, line: 585, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 578, size: 32, elements: !749)
!749 = !{!750, !756}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !748, file: !530, line: 583, baseType: !751, size: 32)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !748, file: !530, line: 579, size: 32, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !751, file: !530, line: 580, baseType: !116, size: 16, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !751, file: !530, line: 581, baseType: !116, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !751, file: !530, line: 582, baseType: !116, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !748, file: !530, line: 584, baseType: !116, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !531, file: !530, line: 916, baseType: !758, size: 8, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !530, line: 610, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 604, size: 8, elements: !761)
!761 = !{!762, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !760, file: !530, line: 608, baseType: !763, size: 8)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !760, file: !530, line: 605, size: 8, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !763, file: !530, line: 607, baseType: !193, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !760, file: !530, line: 609, baseType: !193, size: 8)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !531, file: !530, line: 917, baseType: !465, size: 24, offset: 392)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !531, file: !530, line: 918, baseType: !769, size: 32, offset: 416)
!769 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !530, line: 639, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 622, size: 32, elements: !772)
!772 = !{!773, !784}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !771, file: !530, line: 637, baseType: !774, size: 32)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !771, file: !530, line: 623, size: 32, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !774, file: !530, line: 625, baseType: !116, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !774, file: !530, line: 626, baseType: !116, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !774, file: !530, line: 627, baseType: !116, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !774, file: !530, line: 629, baseType: !116, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !774, file: !530, line: 631, baseType: !116, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !774, file: !530, line: 632, baseType: !116, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !774, file: !530, line: 634, baseType: !116, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !774, file: !530, line: 635, baseType: !116, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !771, file: !530, line: 638, baseType: !116, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !531, file: !530, line: 919, baseType: !786, size: 32, offset: 448)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 32, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 4)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !531, file: !530, line: 920, baseType: !790, size: 16, offset: 480)
!790 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !530, line: 715, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 706, size: 16, elements: !793)
!793 = !{!794, !799}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !792, file: !530, line: 713, baseType: !795, size: 16)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !792, file: !530, line: 707, size: 16, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !795, file: !530, line: 709, baseType: !129, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !795, file: !530, line: 711, baseType: !129, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !792, file: !530, line: 714, baseType: !129, size: 16)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !531, file: !530, line: 921, baseType: !423, size: 16, offset: 496)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !531, file: !530, line: 922, baseType: !802, size: 32, offset: 512)
!802 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !530, line: 739, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 729, size: 32, elements: !805)
!805 = !{!806, !812}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !804, file: !530, line: 737, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !804, file: !530, line: 730, size: 32, elements: !808)
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !807, file: !530, line: 732, baseType: !116, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !807, file: !530, line: 733, baseType: !116, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !807, file: !530, line: 735, baseType: !116, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !804, file: !530, line: 738, baseType: !116, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !531, file: !530, line: 923, baseType: !814, size: 8, offset: 544)
!814 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !530, line: 765, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 756, size: 8, elements: !817)
!817 = !{!818, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !816, file: !530, line: 763, baseType: !819, size: 8)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !530, line: 757, size: 8, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !819, file: !530, line: 759, baseType: !193, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !819, file: !530, line: 761, baseType: !193, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !819, file: !530, line: 762, baseType: !193, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !816, file: !530, line: 764, baseType: !193, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !531, file: !530, line: 924, baseType: !465, size: 24, offset: 552)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !531, file: !530, line: 925, baseType: !827, size: 32, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !530, line: 789, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 781, size: 32, elements: !830)
!830 = !{!831, !836}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !829, file: !530, line: 787, baseType: !832, size: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !829, file: !530, line: 782, size: 32, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !832, file: !530, line: 783, baseType: !116, size: 12, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !832, file: !530, line: 785, baseType: !116, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !829, file: !530, line: 788, baseType: !116, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !531, file: !530, line: 926, baseType: !838, size: 32, offset: 608)
!838 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !530, line: 820, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 805, size: 32, elements: !841)
!841 = !{!842, !852}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !840, file: !530, line: 818, baseType: !843, size: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !530, line: 806, size: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !843, file: !530, line: 807, baseType: !116, size: 2, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !843, file: !530, line: 808, baseType: !116, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !843, file: !530, line: 809, baseType: !116, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !843, file: !530, line: 810, baseType: !116, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !843, file: !530, line: 812, baseType: !116, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !843, file: !530, line: 814, baseType: !116, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !843, file: !530, line: 816, baseType: !116, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !840, file: !530, line: 819, baseType: !116, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !531, file: !530, line: 927, baseType: !854, size: 8, offset: 640)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !530, line: 881, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 872, size: 8, elements: !858)
!858 = !{!859, !866}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !857, file: !530, line: 879, baseType: !860, size: 8)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !857, file: !530, line: 873, size: 8, elements: !861)
!861 = !{!862, !863, !864, !865}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !860, file: !530, line: 874, baseType: !193, size: 1, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !860, file: !530, line: 875, baseType: !193, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !860, file: !530, line: 876, baseType: !193, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !860, file: !530, line: 877, baseType: !193, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !857, file: !530, line: 880, baseType: !193, size: 8)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !870, line: 290, baseType: !871)
!870 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 284, size: 96, elements: !872)
!872 = !{!873, !883, !894, !907, !924}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !871, file: !870, line: 285, baseType: !874, size: 8)
!874 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !870, line: 49, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !870, line: 43, size: 8, elements: !877)
!877 = !{!878, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !876, file: !870, line: 47, baseType: !879, size: 8)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !876, file: !870, line: 44, size: 8, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !879, file: !870, line: 45, baseType: !193, size: 1, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !876, file: !870, line: 48, baseType: !193, size: 8)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !871, file: !870, line: 286, baseType: !884, size: 8, offset: 8)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !870, line: 67, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !870, line: 61, size: 8, elements: !888)
!888 = !{!889, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !887, file: !870, line: 65, baseType: !890, size: 8)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !870, line: 62, size: 8, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !890, file: !870, line: 64, baseType: !193, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !887, file: !870, line: 66, baseType: !193, size: 8)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !871, file: !870, line: 287, baseType: !895, size: 16, offset: 16)
!895 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !870, line: 89, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !870, line: 79, size: 16, elements: !898)
!898 = !{!899, !906}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !897, file: !870, line: 87, baseType: !900, size: 16)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !870, line: 80, size: 16, elements: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !900, file: !870, line: 81, baseType: !129, size: 6, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !900, file: !870, line: 83, baseType: !129, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !900, file: !870, line: 85, baseType: !129, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !900, file: !870, line: 86, baseType: !129, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !897, file: !870, line: 88, baseType: !129, size: 16)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !871, file: !870, line: 288, baseType: !908, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !870, line: 214, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !870, line: 199, size: 32, elements: !911)
!911 = !{!912, !923}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !910, file: !870, line: 212, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !910, file: !870, line: 200, size: 32, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922}
