; ModuleID = './build/i2s_internal_loopback.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct._XPLL_INFO = type { i32 }
%union.CACHE_CON_Type = type { %struct._XPLL_INFO }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.i2s_internal_t = type { i32, %struct.I2S_GBL_CFG, %struct.I2S_DL_CFG, %struct.I2S_UL_CFG, i32, %struct.hal_i2s_config_t, i8, i8, i8, %struct.i2s_vfifo_t, void (i32, i8*)*, void (i32, i8*)*, i8*, i8* }
%struct.I2S_GBL_CFG = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.I2S_DL_CFG = type { i8, i32, i8, i8, i8, i8, i8 }
%struct.I2S_UL_CFG = type { i8, i8, i32, i32, i8, i8, i8, i8, i8, i8 }
%struct.hal_i2s_config_t = type { %struct.hal_i2s_link_config_t, %struct.hal_i2s_link_config_t, i32, i32, i32, i32, i32 }
%struct.hal_i2s_link_config_t = type { i32, i32, i32, i32, i32 }
%struct.i2s_vfifo_t = type { i32*, i32, i32, i8, i8, i32*, i32, i32, i8, i8 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }

!38 = !DIEnumerator(name: "DMA_SWCOPY", value: 2)
!39 = !DIEnumerator(name: "DMA_HWTX_RINGBUFF", value: 3)
!40 = !DIEnumerator(name: "DMA_HWRX_RINGBUFF", value: 4)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 110, baseType: !7, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DMA_BYTE", value: 0)
!44 = !DIEnumerator(name: "DMA_SHORT", value: 1)
!45 = !DIEnumerator(name: "DMA_LONG", value: 2)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 121, baseType: !7, size: 32, elements: !48)
!47 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!50 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !52, line: 47, baseType: !53, size: 32, elements: !54)
!52 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!55 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!56 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!57 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!58 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!59 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!60 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!61 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!62 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!63 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!64 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!65 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!66 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!67 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!68 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!69 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!70 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!71 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!72 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!73 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!74 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!75 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!76 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!77 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!78 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!79 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!80 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!81 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!82 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!83 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!84 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!85 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!86 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!87 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!88 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!89 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!90 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!91 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!92 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!93 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!94 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!95 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!96 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 129, baseType: !7, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!99 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!100 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!101 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!102 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!103 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!104 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!105 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!106 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!107 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!108 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!109 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!110 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!111 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!112 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!113 = !{!114, !115, !117, !139, !146, !152, !163, !172, !161, !173, !174}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !47, line: 116, baseType: !7)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWMENU", file: !6, line: 174, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 128, elements: !120)
!120 = !{!121, !133, !135, !138}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !119, file: !6, line: 170, baseType: !122, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_TMODE", file: !6, line: 127, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 124, size: 16, elements: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "burst_mode", scope: !123, file: !6, line: 125, baseType: !126, size: 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !123, file: !6, line: 126, baseType: !128, size: 8, offset: 8)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !129, line: 24, baseType: !130)
!129 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !119, file: !6, line: 171, baseType: !134, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_Master", file: !6, line: 108, baseType: !5)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !119, file: !6, line: 172, baseType: !136, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !129, line: 48, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !131, line: 79, baseType: !7)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !119, file: !6, line: 173, baseType: !136, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWMENU", file: !6, line: 158, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 154, size: 96, elements: !142)
!142 = !{!143, !144, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !141, file: !6, line: 155, baseType: !122, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !141, file: !6, line: 156, baseType: !134, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !141, file: !6, line: 157, baseType: !136, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_SWCOPYMENU", file: !6, line: 179, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 176, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "srcaddr", scope: !148, file: !6, line: 177, baseType: !136, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dstaddr", scope: !148, file: !6, line: 178, baseType: !136, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWRINGBUFF_MENU", file: !6, line: 167, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 160, size: 192, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !154, file: !6, line: 161, baseType: !122, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !154, file: !6, line: 162, baseType: !134, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !154, file: !6, line: 163, baseType: !136, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !154, file: !6, line: 164, baseType: !136, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !154, file: !6, line: 165, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !154, file: !6, line: 166, baseType: !161, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWRINGBUFF_MENU", file: !6, line: 152, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 146, size: 160, elements: !166)
!166 = !{!167, !168, !169, !170, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !165, file: !6, line: 147, baseType: !122, size: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !165, file: !6, line: 148, baseType: !134, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !6, line: 149, baseType: !136, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !165, file: !6, line: 150, baseType: !161, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !165, file: !6, line: 151, baseType: !161, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !52, line: 95, baseType: !51)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint8", file: !47, line: 108, baseType: !132)
!175 = !{!0, !176, !185, !187, !192, !194}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "DMA_VFIFO_LISR_FUNC", scope: !2, file: !3, line: 60, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 448, elements: !183)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !6, line: 197, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !{!184}
!184 = !DISubrange(count: 14)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "DMA_VFIFO_TO_LISR_FUNC", scope: !2, file: !3, line: 64, type: !178, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "DMA_Owner", scope: !2, file: !3, line: 71, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 352, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 11)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "DMA_Channel_Status", scope: !2, file: !3, line: 68, type: !114, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "DMA_used_channel", scope: !2, file: !3, line: 69, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 88, elements: !190)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 352, elements: !190)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "XpllInfo", scope: !200, file: !201, line: 762, type: !221, isLocal: false, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !202, retainedTypes: !211, globals: !220, splitDebugInlining: false, nameTableKind: None)
!201 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_i2s_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!202 = !{!97, !46, !203}
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_I2S_INITIAL_TYPE_T", file: !204, line: 552, baseType: !7, size: 32, elements: !205)
!204 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_i2s_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!205 = !{!206, !207, !208, !209, !210}
!206 = !DIEnumerator(name: "I2S_INTERNAL_LOOPBACK_MODE", value: 0)
!207 = !DIEnumerator(name: "I2S_INTERNAL_MODE", value: 1)
!208 = !DIEnumerator(name: "I2S_EXTERNAL_MODE", value: 2)
!209 = !DIEnumerator(name: "I2S_EXTERNAL_TDM_MODE", value: 3)
!210 = !DIEnumerator(name: "I2S_INITIAL_TYPE_NUM", value: 4)
!211 = !{!114, !115, !212, !213, !217, !218}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !47, line: 59, baseType: !132)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !47, line: 113, baseType: !216)
!216 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !47, line: 62, baseType: !7)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!220 = !{!198}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPLL_INFO", file: !204, line: 508, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XPLL_INFO", file: !204, line: 506, size: 32, elements: !223)
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "u4NcpoValue", scope: !222, file: !204, line: 507, baseType: !217, size: 32)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !227, file: !228, line: 43, type: !136, isLocal: true, isDefinition: true)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !229, globals: !234, splitDebugInlining: false, nameTableKind: None)
!228 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!229 = !{!218, !217, !230, !232}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !217)
!234 = !{!225, !235}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !227, file: !228, line: 44, type: !136, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !239, file: !240, line: 54, type: !136, isLocal: false, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !241, retainedTypes: !248, globals: !251, splitDebugInlining: false, nameTableKind: None)
!240 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!241 = !{!242, !97}
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !243, line: 71, baseType: !7, size: 32, elements: !244)
!243 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "UART_PORT0", value: 0)
!246 = !DIEnumerator(name: "UART_PORT1", value: 1)
!247 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!248 = !{!218, !136, !213, !215, !212, !249, !217}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !212)
!251 = !{!237}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !254, file: !255, line: 51, type: !334, isLocal: false, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !256, retainedTypes: !303, globals: !333, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!256 = !{!257, !268, !287, !294}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !258, line: 163, baseType: !53, size: 32, elements: !259)
!258 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267}
!260 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!261 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!262 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!263 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!264 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!265 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!266 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!267 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !258, line: 186, baseType: !7, size: 32, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!270 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!271 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!272 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!273 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!274 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!275 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!276 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!277 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!278 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!279 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!280 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!281 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!282 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!283 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!284 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!285 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!286 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !258, line: 176, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292, !293}
!289 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!290 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!291 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!292 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!293 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 99, baseType: !7, size: 32, elements: !296)
!295 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!296 = !{!297, !298, !299, !300, !301, !302}
!297 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!298 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!299 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!300 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!301 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!302 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!303 = !{!304, !161}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !306, line: 72, baseType: !307)
!306 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 56, size: 525312, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !323, !324, !328, !332}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !307, file: !306, line: 57, baseType: !231, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !307, file: !306, line: 58, baseType: !231, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !307, file: !306, line: 59, baseType: !231, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !307, file: !306, line: 60, baseType: !231, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !307, file: !306, line: 61, baseType: !231, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !307, file: !306, line: 62, baseType: !231, size: 32, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !307, file: !306, line: 63, baseType: !231, size: 32, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !307, file: !306, line: 64, baseType: !231, size: 32, offset: 224)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !307, file: !306, line: 65, baseType: !231, size: 32, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !307, file: !306, line: 66, baseType: !231, size: 32, offset: 288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !307, file: !306, line: 67, baseType: !320, size: 32, offset: 320)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 1)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !307, file: !306, line: 68, baseType: !231, size: 32, offset: 352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !307, file: !306, line: 69, baseType: !325, size: 523904, offset: 384)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 523904, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 16372)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !307, file: !306, line: 70, baseType: !329, size: 512, offset: 524288)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 512, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 16)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !307, file: !306, line: 71, baseType: !329, size: 512, offset: 524800)
!333 = !{!252}
!334 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !337, file: !338, line: 53, type: !426, isLocal: false, isDefinition: true)
!337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !338, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !339, retainedTypes: !348, globals: !425, splitDebugInlining: false, nameTableKind: None)
!338 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!339 = !{!340, !51}
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 152, baseType: !53, size: 32, elements: !342)
!341 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!342 = !{!343, !344, !345, !346, !347}
!343 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!344 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!345 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!346 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!347 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!348 = !{!349, !161, !136, !350, !352, !386}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !52, line: 97, baseType: !173)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !129, line: 44, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !131, line: 77, baseType: !53)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !354, line: 378, baseType: !355)
!354 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 363, size: 28704, elements: !356)
!356 = !{!357, !361, !365, !366, !367, !368, !369, !370, !371, !372, !376, !381, !385}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !355, file: !354, line: 365, baseType: !358, size: 256)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 256, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !355, file: !354, line: 366, baseType: !362, size: 768, offset: 256)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 768, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 24)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !355, file: !354, line: 367, baseType: !358, size: 256, offset: 1024)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !355, file: !354, line: 368, baseType: !362, size: 768, offset: 1280)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !355, file: !354, line: 369, baseType: !358, size: 256, offset: 2048)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !355, file: !354, line: 370, baseType: !362, size: 768, offset: 2304)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !355, file: !354, line: 371, baseType: !358, size: 256, offset: 3072)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !355, file: !354, line: 372, baseType: !362, size: 768, offset: 3328)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !355, file: !354, line: 373, baseType: !358, size: 256, offset: 4096)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !355, file: !354, line: 374, baseType: !373, size: 1792, offset: 4352)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1792, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 56)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !355, file: !354, line: 375, baseType: !377, size: 1920, offset: 6144)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 1920, elements: !379)
!378 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!379 = !{!380}
!380 = !DISubrange(count: 240)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !355, file: !354, line: 376, baseType: !382, size: 20608, offset: 8064)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 20608, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 644)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !355, file: !354, line: 377, baseType: !231, size: 32, offset: 28672)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !354, line: 418, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 395, size: 1120, elements: !389)
!389 = !{!390, !392, !393, !394, !395, !396, !397, !401, !402, !403, !404, !405, !406, !407, !408, !412, !413, !414, !418, !422, !424}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !388, file: !354, line: 397, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !388, file: !354, line: 398, baseType: !231, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !388, file: !354, line: 399, baseType: !231, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !388, file: !354, line: 400, baseType: !231, size: 32, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !388, file: !354, line: 401, baseType: !231, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !388, file: !354, line: 402, baseType: !231, size: 32, offset: 160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !388, file: !354, line: 403, baseType: !398, size: 96, offset: 192)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 96, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 12)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !388, file: !354, line: 404, baseType: !231, size: 32, offset: 288)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !388, file: !354, line: 405, baseType: !231, size: 32, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !388, file: !354, line: 406, baseType: !231, size: 32, offset: 352)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !388, file: !354, line: 407, baseType: !231, size: 32, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !388, file: !354, line: 408, baseType: !231, size: 32, offset: 416)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !388, file: !354, line: 409, baseType: !231, size: 32, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !388, file: !354, line: 410, baseType: !231, size: 32, offset: 480)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !388, file: !354, line: 411, baseType: !409, size: 64, offset: 512)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 64, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 2)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !388, file: !354, line: 412, baseType: !391, size: 32, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !388, file: !354, line: 413, baseType: !391, size: 32, offset: 608)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !388, file: !354, line: 414, baseType: !415, size: 128, offset: 640)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 128, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 4)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !388, file: !354, line: 415, baseType: !419, size: 160, offset: 768)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 160, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 5)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !388, file: !354, line: 416, baseType: !423, size: 160, offset: 928)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 160, elements: !420)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !388, file: !354, line: 417, baseType: !231, size: 32, offset: 1088)
!425 = !{!335}
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 6144, elements: !435)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !338, line: 50, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 47, size: 64, elements: !429)
!429 = !{!430, !434}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !428, file: !338, line: 48, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !349}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !428, file: !338, line: 49, baseType: !136, size: 32, offset: 32)
!435 = !{!436}
!436 = !DISubrange(count: 96)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "i2s_internal_cfg", scope: !439, file: !440, line: 47, type: !517, isLocal: true, isDefinition: true)
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !441, retainedTypes: !513, globals: !516, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_i2s.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!441 = !{!442, !448, !203, !455, !463, !467, !471, !475, !479, !484, !489, !493, !497, !97, !501, !46, !505}
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !443, line: 627, baseType: !53, size: 32, elements: !444)
!443 = !DIFile(filename: "../../../../../driver/chip/inc/hal_i2s.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!444 = !{!445, !446, !447}
!445 = !DIEnumerator(name: "HAL_I2S_STATUS_INVALID_PARAMETER", value: -2)
!446 = !DIEnumerator(name: "HAL_I2S_STATUS_ERROR", value: -1)
!447 = !DIEnumerator(name: "HAL_I2S_STATUS_OK", value: 0)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 346, baseType: !7, size: 32, elements: !450)
!449 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!450 = !{!451, !452, !453, !454}
!451 = !DIEnumerator(name: "HAL_I2S_TYPE_EXTERNAL_MODE", value: 0)
!452 = !DIEnumerator(name: "HAL_I2S_TYPE_EXTERNAL_TDM_MODE", value: 1)
!453 = !DIEnumerator(name: "HAL_I2S_TYPE_INTERNAL_MODE", value: 2)
!454 = !DIEnumerator(name: "HAL_I2S_TYPE_INTERNAL_LOOPBACK_MODE", value: 3)
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 360, baseType: !7, size: 32, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462}
!457 = !DIEnumerator(name: "HAL_I2S_SAMPLE_RATE_8K", value: 0)
!458 = !DIEnumerator(name: "HAL_I2S_SAMPLE_RATE_12K", value: 1)
!459 = !DIEnumerator(name: "HAL_I2S_SAMPLE_RATE_16K", value: 2)
!460 = !DIEnumerator(name: "HAL_I2S_SAMPLE_RATE_24K", value: 3)
!461 = !DIEnumerator(name: "HAL_I2S_SAMPLE_RATE_32K", value: 4)
!462 = !DIEnumerator(name: "HAL_I2S_SAMPLE_RATE_48K", value: 5)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !443, line: 642, baseType: !7, size: 32, elements: !464)
!464 = !{!465, !466}
!465 = !DIEnumerator(name: "HAL_I2S_MONO", value: 0)
!466 = !DIEnumerator(name: "HAL_I2S_STEREO", value: 1)
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 397, baseType: !7, size: 32, elements: !468)
!468 = !{!469, !470}
!469 = !DIEnumerator(name: "HAL_I2S_LR_SWAP_DISABLE", value: 0)
!470 = !DIEnumerator(name: "HAL_I2S_LR_SWAP_ENABLE", value: 1)
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 403, baseType: !7, size: 32, elements: !472)
!472 = !{!473, !474}
!473 = !DIEnumerator(name: "HAL_I2S_WORD_SELECT_INVERSE_DISABLE", value: 0)
!474 = !DIEnumerator(name: "HAL_I2S_WORD_SELECT_INVERSE_ENABLE", value: 1)
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !443, line: 635, baseType: !7, size: 32, elements: !476)
!476 = !{!477, !478}
!477 = !DIEnumerator(name: "HAL_I2S_MASTER", value: 0)
!478 = !DIEnumerator(name: "HAL_I2S_SLAVE", value: 1)
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 377, baseType: !7, size: 32, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIEnumerator(name: "HAL_I2S_FRAME_SYNC_WIDTH_32", value: 0)
!482 = !DIEnumerator(name: "HAL_I2S_FRAME_SYNC_WIDTH_64", value: 1)
!483 = !DIEnumerator(name: "HAL_I2S_FRAME_SYNC_WIDTH_128", value: 2)
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 370, baseType: !7, size: 32, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIEnumerator(name: "HAL_I2S_SAMPLE_WIDTH_8BIT", value: 0)
!487 = !DIEnumerator(name: "HAL_I2S_SAMPLE_WIDTH_16BIT", value: 1)
!488 = !DIEnumerator(name: "HAL_I2S_SAMPLE_WIDTH_24BIT", value: 2)
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 384, baseType: !7, size: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIEnumerator(name: "HAL_I2S_TX_MONO_DUPLICATE_DISABLE", value: 0)
!492 = !DIEnumerator(name: "HAL_I2S_TX_MONO_DUPLICATE_ENABLE", value: 1)
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 391, baseType: !7, size: 32, elements: !494)
!494 = !{!495, !496}
!495 = !DIEnumerator(name: "HAL_I2S_RX_DOWN_RATE_DISABLE", value: 0)
!496 = !DIEnumerator(name: "HAL_I2S_RX_DOWN_RATE_ENABLE", value: 1)
!497 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_I2S_DL_MONO_STEREO_MODE_T", file: !204, line: 570, baseType: !7, size: 32, elements: !498)
!498 = !{!499, !500}
!499 = !DIEnumerator(name: "I2S_DL_MONO_MODE", value: 1)
!500 = !DIEnumerator(name: "I2S_DL_STEREO_MODE", value: 0)
!501 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 354, baseType: !7, size: 32, elements: !502)
!502 = !{!503, !504}
!503 = !DIEnumerator(name: "HAL_I2S_EVENT_DATA_REQUEST", value: 0)
!504 = !DIEnumerator(name: "HAL_I2S_EVENT_DATA_NOTIFICATION", value: 1)
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_I2S_DL_SAMPLE_RATE_T", file: !204, line: 561, baseType: !7, size: 32, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512}
!507 = !DIEnumerator(name: "I2S_SAMPLE_RATE_8K", value: 0)
!508 = !DIEnumerator(name: "I2S_SAMPLE_RATE_12K", value: 2)
!509 = !DIEnumerator(name: "I2S_SAMPLE_RATE_16K", value: 4)
!510 = !DIEnumerator(name: "I2S_SAMPLE_RATE_24K", value: 6)
!511 = !DIEnumerator(name: "I2S_SAMPLE_RATE_32K", value: 8)
!512 = !DIEnumerator(name: "I2S_SAMPLE_RATE_48K", value: 10)
!513 = !{!132, !161, !217, !514, !515, !212, !115}
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_VFIFO_CHANNEL", file: !6, line: 144, baseType: !97)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!516 = !{!437}
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2s_internal_t", file: !204, line: 627, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 602, size: 1344, elements: !519)
!519 = !{!520, !522, !538, !549, !563, !565, !593, !594, !595, !596, !610, !616, !618, !619}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_INITIAL_TYPE", scope: !518, file: !204, line: 605, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_I2S_INITIAL_TYPE_T", file: !204, line: 558, baseType: !203)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "I2SGblCfg", scope: !518, file: !204, line: 608, baseType: !523, size: 96, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2S_GBL_CFG", file: !204, line: 525, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I2S_GBL_CFG", file: !204, line: 512, size: 96, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bI2SLoopBackEn", scope: !524, file: !204, line: 513, baseType: !128, size: 8)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SInClkSel", scope: !524, file: !204, line: 514, baseType: !128, size: 8, offset: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SOutClkSel", scope: !524, file: !204, line: 515, baseType: !128, size: 8, offset: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bI2SClkInvEn", scope: !524, file: !204, line: 516, baseType: !128, size: 8, offset: 24)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bI2SNegCapEn", scope: !524, file: !204, line: 517, baseType: !128, size: 8, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "bI2SDLMonoDupEn", scope: !524, file: !204, line: 518, baseType: !128, size: 8, offset: 40)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bI2S_CODEC_26M_EN", scope: !524, file: !204, line: 519, baseType: !128, size: 8, offset: 48)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bI2S_26M_SEL", scope: !524, file: !204, line: 520, baseType: !128, size: 8, offset: 56)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SDLMonoStereoSel", scope: !524, file: !204, line: 521, baseType: !128, size: 8, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SDLSwapLR", scope: !524, file: !204, line: 522, baseType: !128, size: 8, offset: 72)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SExtSwapLR", scope: !524, file: !204, line: 523, baseType: !128, size: 8, offset: 80)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SExtCodecSel", scope: !524, file: !204, line: 524, baseType: !128, size: 8, offset: 88)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "I2SDLCfg", scope: !518, file: !204, line: 609, baseType: !539, size: 128, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2S_DL_CFG", file: !204, line: 535, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I2S_DL_CFG", file: !204, line: 527, size: 128, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SChPerSample", scope: !540, file: !204, line: 528, baseType: !128, size: 8)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SMsbOffset", scope: !540, file: !204, line: 529, baseType: !136, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SBitPerSample", scope: !540, file: !204, line: 530, baseType: !128, size: 8, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SSampleRate", scope: !540, file: !204, line: 531, baseType: !128, size: 8, offset: 72)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SWordSelInv", scope: !540, file: !204, line: 532, baseType: !128, size: 8, offset: 80)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SFormat", scope: !540, file: !204, line: 533, baseType: !128, size: 8, offset: 88)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SSRC", scope: !540, file: !204, line: 534, baseType: !128, size: 8, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "I2SULCfg", scope: !518, file: !204, line: 610, baseType: !550, size: 160, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2S_UL_CFG", file: !204, line: 548, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I2S_UL_CFG", file: !204, line: 537, size: 160, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SLRSwap", scope: !551, file: !204, line: 538, baseType: !128, size: 8)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SChPerSample", scope: !551, file: !204, line: 539, baseType: !128, size: 8, offset: 8)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SUpdateWord", scope: !551, file: !204, line: 540, baseType: !136, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SMsbOffset", scope: !551, file: !204, line: 541, baseType: !136, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bI2SDownRateEn", scope: !551, file: !204, line: 542, baseType: !128, size: 8, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SBitPerSample", scope: !551, file: !204, line: 543, baseType: !128, size: 8, offset: 104)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "u4I2SSampleRate", scope: !551, file: !204, line: 544, baseType: !128, size: 8, offset: 112)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SWordSelInv", scope: !551, file: !204, line: 545, baseType: !128, size: 8, offset: 120)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SFormat", scope: !551, file: !204, line: 546, baseType: !128, size: 8, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ucI2SSRC", scope: !551, file: !204, line: 547, baseType: !128, size: 8, offset: 136)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i2s_initial_type", scope: !518, file: !204, line: 612, baseType: !564, size: 32, offset: 416)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_initial_type_t", file: !449, line: 351, baseType: !448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "i2s_user_config", scope: !518, file: !204, line: 614, baseType: !566, size: 480, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_config_t", file: !443, line: 685, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 671, size: 480, elements: !568)
!568 = !{!569, !582, !583, !585, !587, !589, !591}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i2s_in", scope: !567, file: !443, line: 672, baseType: !570, size: 160)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_link_config_t", file: !443, line: 667, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 658, size: 160, elements: !572)
!572 = !{!573, !575, !577, !578, !580}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !571, file: !443, line: 659, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_sample_rate_t", file: !449, line: 367, baseType: !455)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "channel_number", scope: !571, file: !443, line: 660, baseType: !576, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_channel_number_t", file: !443, line: 645, baseType: !463)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "msb_offset", scope: !571, file: !443, line: 662, baseType: !136, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lr_swap", scope: !571, file: !443, line: 664, baseType: !579, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_lr_swap_t", file: !449, line: 400, baseType: !467)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "word_select_inverse", scope: !571, file: !443, line: 665, baseType: !581, size: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_word_select_inverse_t", file: !449, line: 406, baseType: !471)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i2s_out", scope: !567, file: !443, line: 673, baseType: !570, size: 160, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "clock_mode", scope: !567, file: !443, line: 674, baseType: !584, size: 32, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_clock_mode_t", file: !443, line: 638, baseType: !475)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "frame_sync_width", scope: !567, file: !443, line: 679, baseType: !586, size: 32, offset: 352)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_frame_sync_width_t", file: !449, line: 381, baseType: !479)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sample_width", scope: !567, file: !443, line: 680, baseType: !588, size: 32, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_sample_width_t", file: !449, line: 374, baseType: !484)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tx_mode", scope: !567, file: !443, line: 681, baseType: !590, size: 32, offset: 416)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_tx_mode_t", file: !449, line: 387, baseType: !489)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rx_down_rate", scope: !567, file: !443, line: 683, baseType: !592, size: 32, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_rx_down_rate_t", file: !449, line: 394, baseType: !493)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i2s_state", scope: !518, file: !204, line: 617, baseType: !378, size: 8, offset: 928)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i2s_configured", scope: !518, file: !204, line: 618, baseType: !126, size: 8, offset: 936)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i2s_audiotop_enabled", scope: !518, file: !204, line: 619, baseType: !126, size: 8, offset: 944)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i2s_vfifo", scope: !518, file: !204, line: 621, baseType: !597, size: 256, offset: 960)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2s_vfifo_t", file: !204, line: 599, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 587, size: 256, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vfifo_base", scope: !598, file: !204, line: 588, baseType: !515, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vfifo_length", scope: !598, file: !204, line: 589, baseType: !136, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vfifo_threshold", scope: !598, file: !204, line: 590, baseType: !136, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dma_interrupt", scope: !598, file: !204, line: 591, baseType: !126, size: 8, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dma_configured", scope: !598, file: !204, line: 592, baseType: !126, size: 8, offset: 104)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vfifo_base", scope: !598, file: !204, line: 594, baseType: !515, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vfifo_length", scope: !598, file: !204, line: 595, baseType: !136, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vfifo_threshold", scope: !598, file: !204, line: 596, baseType: !136, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dma_interrupt", scope: !598, file: !204, line: 597, baseType: !126, size: 8, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dma_configured", scope: !598, file: !204, line: 598, baseType: !126, size: 8, offset: 232)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "user_tx_callback_func", scope: !518, file: !204, line: 623, baseType: !611, size: 32, offset: 1216)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_tx_callback_t", file: !443, line: 730, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !615, !161}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_event_t", file: !449, line: 357, baseType: !501)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "user_rx_callback_func", scope: !518, file: !204, line: 624, baseType: !617, size: 32, offset: 1248)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2s_rx_callback_t", file: !443, line: 712, baseType: !612)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "user_tx_data", scope: !518, file: !204, line: 625, baseType: !161, size: 32, offset: 1280)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "user_rx_data", scope: !518, file: !204, line: 626, baseType: !161, size: 32, offset: 1312)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !622, file: !623, line: 77, type: !687, isLocal: true, isDefinition: true)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !674, globals: !676, splitDebugInlining: false, nameTableKind: None)
!623 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!624 = !{!625, !633, !638, !654, !660, !664, !242, !97, !669}
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !626, line: 345, baseType: !53, size: 32, elements: !627)
!626 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!627 = !{!628, !629, !630, !631, !632}
!628 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!629 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!630 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!631 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!632 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 109, baseType: !7, size: 32, elements: !634)
!634 = !{!635, !636, !637}
!635 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!636 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!637 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !626, line: 302, baseType: !7, size: 32, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!640 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!641 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!642 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!643 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!644 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!645 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!646 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!647 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!648 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!649 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!650 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!651 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!652 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!653 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !626, line: 321, baseType: !7, size: 32, elements: !655)
!655 = !{!656, !657, !658, !659}
!656 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!657 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!658 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!659 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !626, line: 330, baseType: !7, size: 32, elements: !661)
!661 = !{!662, !663}
!662 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!663 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !626, line: 337, baseType: !7, size: 32, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!667 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!668 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !626, line: 355, baseType: !53, size: 32, elements: !670)
!670 = !{!671, !672, !673}
!671 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!672 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!673 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!674 = !{!7, !161, !132, !675, !128}
!675 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!676 = !{!620, !677}
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "func_tbl", scope: !679, file: !623, line: 536, type: !685, isLocal: true, isDefinition: true)
!679 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !623, file: !623, line: 534, type: !680, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !622, retainedNodes: !683)
!680 = !DISubroutineType(types: !681)
!681 = !{!179, !682}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !449, line: 113, baseType: !633)
!683 = !{!684}
!684 = !DILocalVariable(name: "uart_port", arg: 1, scope: !679, file: !623, line: 534, type: !682)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 64, elements: !410)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 1024, elements: !410)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !623, line: 75, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 68, size: 512, elements: !690)
!690 = !{!691, !692, !704, !705, !716, !717}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !689, file: !623, line: 69, baseType: !126, size: 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !689, file: !623, line: 70, baseType: !693, size: 128, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !626, line: 378, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !626, line: 373, size: 128, elements: !695)
!695 = !{!696, !698, !700, !702}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !694, file: !626, line: 374, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !626, line: 317, baseType: !638)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !694, file: !626, line: 375, baseType: !699, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !626, line: 326, baseType: !654)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !694, file: !626, line: 376, baseType: !701, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !626, line: 333, baseType: !660)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !694, file: !626, line: 377, baseType: !703, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !626, line: 341, baseType: !664)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !689, file: !623, line: 71, baseType: !126, size: 8, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !689, file: !623, line: 72, baseType: !706, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !623, line: 66, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 63, size: 64, elements: !708)
!708 = !{!709, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !707, file: !623, line: 64, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !626, line: 410, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !714, !161}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !626, line: 359, baseType: !669)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !707, file: !623, line: 65, baseType: !161, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !689, file: !623, line: 73, baseType: !126, size: 8, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !689, file: !623, line: 74, baseType: !718, size: 224, offset: 288)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !626, line: 390, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !626, line: 382, size: 224, elements: !720)
!720 = !{!721, !723, !724, !725, !726, !727, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !719, file: !626, line: 383, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !719, file: !626, line: 384, baseType: !136, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !719, file: !626, line: 385, baseType: !136, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !719, file: !626, line: 386, baseType: !722, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !719, file: !626, line: 387, baseType: !136, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !719, file: !626, line: 388, baseType: !136, size: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !719, file: !626, line: 389, baseType: !136, size: 32, offset: 192)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "I2S_TxBuf", scope: !731, file: !732, line: 50, type: !781, isLocal: true, isDefinition: true)
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !733, retainedTypes: !765, globals: !766, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/i2s_internal_loopback/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!733 = !{!633, !638, !654, !660, !664, !734, !455, !463, !467, !471, !475, !479, !484, !489, !493, !442, !448}
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 249, baseType: !7, size: 32, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!736 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!737 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!738 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!739 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!740 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!741 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!742 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!743 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!744 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!745 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!746 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!747 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!748 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!749 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!750 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!751 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!752 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!753 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!754 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!755 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!756 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!757 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!758 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!759 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!760 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!761 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!762 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!763 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!764 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!765 = !{!53, !7}
!766 = !{!729, !767, !772, !779}
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "I2S_RxBuf", scope: !731, file: !732, line: 51, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 65536, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 2048)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "audio_Tone2k_16kSR", scope: !731, file: !732, line: 54, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 512, elements: !777)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !129, line: 36, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !131, line: 57, baseType: !216)
!777 = !{!778}
!778 = !DISubrange(count: 32)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "USER_Rx_Buf", scope: !731, file: !732, line: 52, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1024, elements: !777)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !784, file: !785, line: 59, type: !136, isLocal: false, isDefinition: true)
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !785, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !786, globals: !839, splitDebugInlining: false, nameTableKind: None)
!785 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/i2s_internal_loopback/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!786 = !{!787, !795, !820}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !354, line: 656, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 650, size: 128, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !789, file: !354, line: 652, baseType: !231, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !789, file: !354, line: 653, baseType: !231, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !789, file: !354, line: 654, baseType: !231, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !789, file: !354, line: 655, baseType: !391, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !354, line: 418, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 395, size: 1120, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !797, file: !354, line: 397, baseType: !391, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !797, file: !354, line: 398, baseType: !231, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !797, file: !354, line: 399, baseType: !231, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !797, file: !354, line: 400, baseType: !231, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !797, file: !354, line: 401, baseType: !231, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !797, file: !354, line: 402, baseType: !231, size: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !797, file: !354, line: 403, baseType: !398, size: 96, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !797, file: !354, line: 404, baseType: !231, size: 32, offset: 288)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !797, file: !354, line: 405, baseType: !231, size: 32, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !797, file: !354, line: 406, baseType: !231, size: 32, offset: 352)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !797, file: !354, line: 407, baseType: !231, size: 32, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !797, file: !354, line: 408, baseType: !231, size: 32, offset: 416)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !797, file: !354, line: 409, baseType: !231, size: 32, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !797, file: !354, line: 410, baseType: !231, size: 32, offset: 480)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !797, file: !354, line: 411, baseType: !409, size: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !797, file: !354, line: 412, baseType: !391, size: 32, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !797, file: !354, line: 413, baseType: !391, size: 32, offset: 608)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !797, file: !354, line: 414, baseType: !415, size: 128, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !797, file: !354, line: 415, baseType: !419, size: 160, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !797, file: !354, line: 416, baseType: !423, size: 160, offset: 928)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !797, file: !354, line: 417, baseType: !231, size: 32, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !306, line: 72, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 56, size: 525312, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !822, file: !306, line: 57, baseType: !231, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !822, file: !306, line: 58, baseType: !231, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !822, file: !306, line: 59, baseType: !231, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !822, file: !306, line: 60, baseType: !231, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !822, file: !306, line: 61, baseType: !231, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !822, file: !306, line: 62, baseType: !231, size: 32, offset: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !822, file: !306, line: 63, baseType: !231, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !822, file: !306, line: 64, baseType: !231, size: 32, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !822, file: !306, line: 65, baseType: !231, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !822, file: !306, line: 66, baseType: !231, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !822, file: !306, line: 67, baseType: !320, size: 32, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !822, file: !306, line: 68, baseType: !231, size: 32, offset: 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !822, file: !306, line: 69, baseType: !325, size: 523904, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !822, file: !306, line: 70, baseType: !329, size: 512, offset: 524288)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !822, file: !306, line: 71, baseType: !329, size: 512, offset: 524800)
!839 = !{!782, !840}
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !784, file: !785, line: 61, type: !231, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "heap_end", scope: !844, file: !845, line: 66, type: !850, isLocal: true, isDefinition: true)
!844 = distinct !DISubprogram(name: "_sbrk_r", scope: !845, file: !845, line: 63, type: !846, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1040, retainedNodes: !1044)
!845 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !851, !1039}
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !849, line: 123, baseType: !850)
!849 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !853, line: 377, size: 1920, elements: !854)
!853 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!854 = !{!855, !856, !930, !931, !932, !933, !934, !935, !936, !939, !960, !964, !965, !966, !967, !977, !990, !991, !996, !1013, !1014, !1021, !1022, !1038}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !852, file: !853, line: 381, baseType: !53, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !852, file: !853, line: 386, baseType: !857, size: 32, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !853, line: 292, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !853, line: 186, size: 832, elements: !860)
!860 = !{!861, !863, !864, !865, !867, !868, !873, !874, !875, !876, !880, !886, !893, !897, !898, !899, !900, !904, !906, !907, !908, !910, !916, !929}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !859, file: !853, line: 187, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !859, file: !853, line: 188, baseType: !53, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !859, file: !853, line: 189, baseType: !53, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !859, file: !853, line: 190, baseType: !866, size: 16, offset: 96)
!866 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !859, file: !853, line: 191, baseType: !866, size: 16, offset: 112)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !859, file: !853, line: 192, baseType: !869, size: 64, offset: 128)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !853, line: 122, size: 64, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !869, file: !853, line: 123, baseType: !862, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !869, file: !853, line: 124, baseType: !53, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !859, file: !853, line: 193, baseType: !53, size: 32, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !859, file: !853, line: 196, baseType: !851, size: 32, offset: 224)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !859, file: !853, line: 200, baseType: !161, size: 32, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !859, file: !853, line: 202, baseType: !877, size: 32, offset: 288)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{!53, !851, !161, !850, !53}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !859, file: !853, line: 204, baseType: !881, size: 32, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DISubroutineType(types: !883)
!883 = !{!53, !851, !161, !884, !53}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !859, file: !853, line: 207, baseType: !887, size: 32, offset: 352)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DISubroutineType(types: !889)
!889 = !{!890, !851, !161, !890, !53}
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !891, line: 116, baseType: !892)
!891 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!892 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !859, file: !853, line: 208, baseType: !894, size: 32, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DISubroutineType(types: !896)
!896 = !{!53, !851, !161}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !859, file: !853, line: 211, baseType: !869, size: 64, offset: 416)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !859, file: !853, line: 212, baseType: !862, size: 32, offset: 480)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !859, file: !853, line: 213, baseType: !53, size: 32, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !859, file: !853, line: 216, baseType: !901, size: 24, offset: 544)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 24, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 3)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !859, file: !853, line: 217, baseType: !905, size: 8, offset: 568)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8, elements: !321)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !859, file: !853, line: 220, baseType: !869, size: 64, offset: 576)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !859, file: !853, line: 223, baseType: !53, size: 32, offset: 640)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !859, file: !853, line: 224, baseType: !909, size: 32, offset: 672)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !891, line: 46, baseType: !892)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !859, file: !853, line: 231, baseType: !911, size: 32, offset: 704)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !853, line: 35, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !913, line: 34, baseType: !914)
!913 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !913, line: 33, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !859, file: !853, line: 233, baseType: !917, size: 64, offset: 736)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !891, line: 170, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !891, line: 162, size: 64, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !918, file: !891, line: 164, baseType: !53, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !918, file: !891, line: 169, baseType: !922, size: 32, offset: 32)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !918, file: !891, line: 165, size: 32, elements: !923)
!923 = !{!924, !927}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !922, file: !891, line: 167, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !926, line: 116, baseType: !53)
!926 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !922, file: !891, line: 168, baseType: !928, size: 32)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !416)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !859, file: !853, line: 234, baseType: !53, size: 32, offset: 800)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !852, file: !853, line: 386, baseType: !857, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !852, file: !853, line: 386, baseType: !857, size: 32, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !852, file: !853, line: 388, baseType: !53, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !852, file: !853, line: 390, baseType: !850, size: 32, offset: 160)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !852, file: !853, line: 392, baseType: !53, size: 32, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !852, file: !853, line: 394, baseType: !53, size: 32, offset: 224)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !852, file: !853, line: 395, baseType: !937, size: 32, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !853, line: 45, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !852, file: !853, line: 397, baseType: !940, size: 32, offset: 288)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !853, line: 349, size: 128, elements: !942)
!942 = !{!943, !956, !957, !958}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !941, file: !853, line: 352, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !853, line: 52, size: 192, elements: !946)
!946 = !{!947, !948, !949, !950, !951, !952}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !945, file: !853, line: 54, baseType: !944, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !945, file: !853, line: 55, baseType: !53, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !945, file: !853, line: 55, baseType: !53, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !945, file: !853, line: 55, baseType: !53, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !945, file: !853, line: 55, baseType: !53, size: 32, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !945, file: !853, line: 56, baseType: !953, size: 32, offset: 160)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 32, elements: !321)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !853, line: 22, baseType: !955)
!955 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !941, file: !853, line: 353, baseType: !53, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !941, file: !853, line: 354, baseType: !944, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !941, file: !853, line: 355, baseType: !959, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !852, file: !853, line: 399, baseType: !961, size: 32, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !851}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !852, file: !853, line: 401, baseType: !53, size: 32, offset: 352)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !852, file: !853, line: 404, baseType: !53, size: 32, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !852, file: !853, line: 405, baseType: !850, size: 32, offset: 416)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !852, file: !853, line: 407, baseType: !968, size: 32, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !853, line: 324, size: 192, elements: !970)
!970 = !{!971, !973, !974, !975}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !969, file: !853, line: 325, baseType: !972, size: 48)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 48, elements: !902)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !969, file: !853, line: 326, baseType: !972, size: 48, offset: 48)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !969, file: !853, line: 327, baseType: !216, size: 16, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !969, file: !853, line: 330, baseType: !976, size: 64, offset: 128)
!976 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !852, file: !853, line: 408, baseType: !978, size: 32, offset: 480)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !853, line: 60, size: 288, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988, !989}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !979, file: !853, line: 62, baseType: !53, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !979, file: !853, line: 63, baseType: !53, size: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !979, file: !853, line: 64, baseType: !53, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !979, file: !853, line: 65, baseType: !53, size: 32, offset: 96)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !979, file: !853, line: 66, baseType: !53, size: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !979, file: !853, line: 67, baseType: !53, size: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !979, file: !853, line: 68, baseType: !53, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !979, file: !853, line: 69, baseType: !53, size: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !979, file: !853, line: 70, baseType: !53, size: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !852, file: !853, line: 409, baseType: !850, size: 32, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !852, file: !853, line: 412, baseType: !992, size: 32, offset: 544)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !53}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !852, file: !853, line: 416, baseType: !997, size: 32, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !853, line: 90, size: 1120, elements: !999)
!999 = !{!1000, !1001, !1002, !1004}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !998, file: !853, line: 91, baseType: !997, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !998, file: !853, line: 92, baseType: !53, size: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !998, file: !853, line: 93, baseType: !1003, size: 1024, offset: 64)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1024, elements: !777)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !998, file: !853, line: 94, baseType: !1005, size: 32, offset: 1088)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !853, line: 79, size: 2112, elements: !1007)
!1007 = !{!1008, !1010, !1011, !1012}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !1006, file: !853, line: 80, baseType: !1009, size: 1024)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !777)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !1006, file: !853, line: 81, baseType: !1009, size: 1024, offset: 1024)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !1006, file: !853, line: 83, baseType: !954, size: 32, offset: 2048)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !1006, file: !853, line: 86, baseType: !954, size: 32, offset: 2080)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !852, file: !853, line: 417, baseType: !998, size: 1120, offset: 608)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !852, file: !853, line: 420, baseType: !1015, size: 96, offset: 1728)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !853, line: 296, size: 96, elements: !1016)
!1016 = !{!1017, !1019, !1020}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1015, file: !853, line: 298, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !1015, file: !853, line: 299, baseType: !53, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !1015, file: !853, line: 300, baseType: !857, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !852, file: !853, line: 421, baseType: !857, size: 32, offset: 1824)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !852, file: !853, line: 422, baseType: !1023, size: 32, offset: 1856)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !853, line: 359, size: 640, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1032, !1033, !1034, !1035, !1036, !1037}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !1024, file: !853, line: 362, baseType: !850, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !1024, file: !853, line: 363, baseType: !917, size: 64, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !1024, file: !853, line: 364, baseType: !917, size: 64, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !1024, file: !853, line: 365, baseType: !917, size: 64, offset: 160)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !1024, file: !853, line: 366, baseType: !1031, size: 64, offset: 224)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 64, elements: !359)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !1024, file: !853, line: 367, baseType: !53, size: 32, offset: 288)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !1024, file: !853, line: 368, baseType: !917, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !1024, file: !853, line: 369, baseType: !917, size: 64, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !1024, file: !853, line: 370, baseType: !917, size: 64, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !1024, file: !853, line: 371, baseType: !917, size: 64, offset: 512)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !1024, file: !853, line: 372, baseType: !917, size: 64, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !852, file: !853, line: 423, baseType: !850, size: 32, offset: 1888)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !926, line: 46, baseType: !7)
!1040 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1041, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1042, globals: !1043, splitDebugInlining: false, nameTableKind: None)
!1041 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!1042 = !{!850, !848}
!1043 = !{!842}
!1044 = !{!1045, !1046, !1047, !1048}
!1045 = !DILocalVariable(name: "r", arg: 1, scope: !844, file: !845, line: 63, type: !851)
!1046 = !DILocalVariable(name: "nbytes", arg: 2, scope: !844, file: !845, line: 63, type: !1039)
!1047 = !DILocalVariable(name: "prev_heap_end", scope: !844, file: !845, line: 67, type: !850)
!1048 = !DILocalVariable(name: "stack", scope: !844, file: !845, line: 68, type: !850)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !1051, file: !1056, line: 4, type: !1060, isLocal: false, isDefinition: true)
!1051 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1052, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1053, splitDebugInlining: false, nameTableKind: None)
!1052 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
!1053 = !{!1049, !1054, !1058}
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !1051, file: !1056, line: 5, type: !1057, isLocal: false, isDefinition: true)
!1056 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2s_internal_loopback/GCC")
