; ModuleID = 'build/96b_argonkey/synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !116, line: 72, type: !117, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 214, baseType: !32)
!108 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !143, !153, !257, !259}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !116, line: 73, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !118, line: 2909, size: 128, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !141, !142}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2910, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !117, file: !118, line: 2911, baseType: !32, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !117, file: !118, line: 2912, baseType: !32, size: 32, offset: 96)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "threadA_stack_area", scope: !27, file: !116, line: 88, type: !145, isLocal: false, isDefinition: true, align: 512)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8704, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152}
!152 = !DISubrange(count: 1088)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "threadA_data", scope: !27, file: !116, line: 89, type: !155, isLocal: true, isDefinition: true)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1344, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !208, !221, !222, !223, !227, !228, !234, !252}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 448)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196, !197}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !159, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !198, size: 192, offset: 256)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !199)
!199 = !{!200, !201, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !198, file: !122, line: 245, baseType: !165, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !198, file: !122, line: 246, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !198, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !209, size: 288, offset: 448)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !209, file: !210, line: 26, baseType: !110, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !209, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !209, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !209, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !209, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !209, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !209, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !209, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !209, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !155, file: !156, line: 300, baseType: !229, size: 96, offset: 1120)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !156, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !156, line: 162, baseType: !107, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !156, line: 168, baseType: !107, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !235, size: 32, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !118, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !106, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !107, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !118, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !253, size: 64, offset: 1248)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !210, line: 63, baseType: !110, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !116, line: 91, type: !145, isLocal: false, isDefinition: true, align: 512)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !116, line: 92, type: !155, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "_char_out", scope: !263, file: !267, line: 54, type: !268, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !265, globals: !266, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!265 = !{!106, !109}
!266 = !{!261}
!267 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!109, !109}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !273, file: !290, line: 56, type: !291, isLocal: true, isDefinition: true, align: 32)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !275, globals: !289, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !278, line: 379, baseType: !279)
!278 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f412cx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 370, size: 224, elements: !280)
!280 = !{!281, !283, !284, !285, !286, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !279, file: !278, line: 372, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !279, file: !278, line: 373, baseType: !282, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !279, file: !278, line: 374, baseType: !282, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !279, file: !278, line: 375, baseType: !282, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !279, file: !278, line: 376, baseType: !282, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !279, file: !278, line: 377, baseType: !282, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !279, file: !278, line: 378, baseType: !282, size: 32, offset: 192)
!289 = !{!271}
!290 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !293, line: 51, size: 64, elements: !294)
!293 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!294 = !{!295, !323}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !292, file: !293, line: 60, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{!109, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !302, line: 378, size: 192, elements: !303)
!302 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!303 = !{!304, !307, !308, !309, !316, !317}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !301, file: !302, line: 380, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !301, file: !302, line: 382, baseType: !13, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !301, file: !302, line: 384, baseType: !13, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !301, file: !302, line: 386, baseType: !310, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !302, line: 351, size: 16, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !311, file: !302, line: 359, baseType: !178, size: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !311, file: !302, line: 364, baseType: !315, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!315 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !302, line: 388, baseType: !106, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !301, file: !302, line: 396, baseType: !318, size: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !302, line: 43, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !322)
!322 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !292, file: !293, line: 65, baseType: !299, size: 32, offset: 32)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !326, file: !329, line: 71, type: !330, isLocal: true, isDefinition: true, align: 32)
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !328, splitDebugInlining: false, nameTableKind: None)
!327 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!328 = !{!324}
!329 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !293, line: 51, size: 64, elements: !332)
!332 = !{!333, !352}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !331, file: !293, line: 60, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{!109, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !302, line: 378, size: 192, elements: !340)
!340 = !{!341, !342, !343, !344, !350, !351}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !302, line: 380, baseType: !305, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !339, file: !302, line: 382, baseType: !13, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !339, file: !302, line: 384, baseType: !13, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !302, line: 386, baseType: !345, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !302, line: 351, size: 16, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !346, file: !302, line: 359, baseType: !178, size: 8)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !346, file: !302, line: 364, baseType: !315, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !339, file: !302, line: 388, baseType: !106, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !339, file: !302, line: 396, baseType: !318, size: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !331, file: !293, line: 65, baseType: !337, size: 32, offset: 32)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "static_regions", scope: !355, file: !362, line: 62, type: !486, isLocal: true, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !357, globals: !358, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!357 = !{!107, !109, !110, !106}
!358 = !{!359, !353}
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !361, file: !362, line: 198, type: !472, isLocal: true, isDefinition: true)
!361 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !362, file: !362, line: 175, type: !363, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !355, retainedNodes: !467)
!362 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!363 = !DISubroutineType(types: !364)
!364 = !{null, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1344, elements: !367)
!367 = !{!368, !427, !439, !440, !441, !442, !443, !449, !462}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !366, file: !156, line: 247, baseType: !369, size: 448)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !370)
!370 = !{!371, !395, !402, !403, !404, !413, !414, !415, !416}
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !156, line: 60, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !156, line: 60, size: 64, elements: !373)
!373 = !{!374, !389}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !372, file: !156, line: 61, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !377)
!377 = !{!378, !384}
!378 = !DIDerivedType(tag: DW_TAG_member, scope: !376, file: !127, line: 38, baseType: !379, size: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !376, file: !127, line: 38, size: 32, elements: !380)
!380 = !{!381, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !379, file: !127, line: 39, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !127, line: 40, baseType: !382, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, scope: !376, file: !127, line: 42, baseType: !385, size: 32, offset: 32)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !376, file: !127, line: 42, size: 32, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !385, file: !127, line: 43, baseType: !382, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !385, file: !127, line: 44, baseType: !382, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !372, file: !156, line: 62, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !390, file: !168, line: 50, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 64, elements: !173)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !369, file: !156, line: 68, baseType: !396, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !398, file: !122, line: 232, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !376)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !369, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !369, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!404 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !156, line: 90, baseType: !405, size: 16, offset: 112)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !156, line: 90, size: 16, elements: !406)
!406 = !{!407, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, scope: !405, file: !156, line: 91, baseType: !408, size: 16)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !405, file: !156, line: 91, size: 16, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !408, file: !156, line: 96, baseType: !188, size: 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !408, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !405, file: !156, line: 100, baseType: !192, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !369, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !369, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !369, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !369, file: !156, line: 131, baseType: !417, size: 192, offset: 256)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !418)
!418 = !{!419, !420, !426}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !417, file: !122, line: 245, baseType: !375, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !417, file: !122, line: 246, baseType: !421, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !417, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !366, file: !156, line: 250, baseType: !428, size: 288, offset: 448)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !428, file: !210, line: 26, baseType: !110, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !428, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !428, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !428, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !428, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !428, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !428, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !428, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !428, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !366, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !366, file: !156, line: 256, baseType: !397, size: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !366, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !366, file: !156, line: 300, baseType: !444, size: 96, offset: 1120)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !444, file: !156, line: 153, baseType: !22, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !444, file: !156, line: 162, baseType: !107, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !444, file: !156, line: 168, baseType: !107, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !366, file: !156, line: 325, baseType: !450, size: 32, offset: 1216)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !452)
!452 = !{!453, !459, !460}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !451, file: !118, line: 5074, baseType: !454, size: 96)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !454, file: !240, line: 57, baseType: !243, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !454, file: !240, line: 58, baseType: !106, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !454, file: !240, line: 59, baseType: !107, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !451, file: !118, line: 5075, baseType: !397, size: 64, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !451, file: !118, line: 5076, baseType: !461, offset: 160)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !366, file: !156, line: 343, baseType: !463, size: 64, offset: 1248)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !463, file: !210, line: 63, baseType: !110, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !463, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!467 = !{!468, !469, !470, !471}
!468 = !DILocalVariable(name: "thread", arg: 1, scope: !361, file: !362, line: 175, type: !365)
!469 = !DILocalVariable(name: "region_num", scope: !361, file: !362, line: 200, type: !178)
!470 = !DILocalVariable(name: "guard_start", scope: !361, file: !362, line: 265, type: !22)
!471 = !DILocalVariable(name: "guard_size", scope: !361, file: !362, line: 266, type: !107)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 96, elements: !484)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !474, line: 52, size: 96, elements: !475)
!474 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !473, file: !474, line: 53, baseType: !22, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !473, file: !474, line: 54, baseType: !107, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !473, file: !474, line: 55, baseType: !479, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !480, line: 151, baseType: !481)
!480 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 149, size: 32, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !481, file: !480, line: 150, baseType: !110, size: 32)
!484 = !{!485}
!485 = !DISubrange(count: 1)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 96, elements: !484)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !490, file: !523, line: 39, type: !178, isLocal: true, isDefinition: true)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !492, globals: !522, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!492 = !{!493, !106, !109, !510, !178}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !495, line: 1226, baseType: !496)
!495 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 1213, size: 352, elements: !497)
!497 = !{!498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !496, file: !495, line: 1215, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !496, file: !495, line: 1216, baseType: !282, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !496, file: !495, line: 1217, baseType: !282, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !496, file: !495, line: 1218, baseType: !282, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !496, file: !495, line: 1219, baseType: !282, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !496, file: !495, line: 1220, baseType: !282, size: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !496, file: !495, line: 1221, baseType: !282, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !496, file: !495, line: 1222, baseType: !282, size: 32, offset: 224)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !496, file: !495, line: 1223, baseType: !282, size: 32, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !496, file: !495, line: 1224, baseType: !282, size: 32, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !496, file: !495, line: 1225, baseType: !282, size: 32, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !513, line: 27, size: 96, elements: !514)
!513 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !512, file: !513, line: 29, baseType: !110, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !512, file: !513, line: 31, baseType: !305, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !512, file: !513, line: 37, baseType: !518, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !480, line: 146, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !480, line: 141, size: 32, elements: !520)
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !519, file: !480, line: 143, baseType: !110, size: 32)
!522 = !{!488}
!523 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !526, file: !533, line: 21, type: !268, isLocal: true, isDefinition: true)
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !528, globals: !532, splitDebugInlining: false, nameTableKind: None)
!527 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!528 = !{!529, !109, !106}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !531, line: 22, baseType: !109)
!531 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!532 = !{!524}
!533 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !536, file: !541, line: 13, type: !558, isLocal: true, isDefinition: true)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !538, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!538 = !{!539, !534}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "mpu_config", scope: !536, file: !541, line: 37, type: !542, isLocal: false, isDefinition: true)
!541 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !513, line: 41, size: 64, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !543, file: !513, line: 43, baseType: !110, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !543, file: !513, line: 45, baseType: !547, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !513, line: 27, size: 96, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !549, file: !513, line: 29, baseType: !110, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !549, file: !513, line: 31, baseType: !305, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !549, file: !513, line: 37, baseType: !554, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !480, line: 146, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !480, line: 141, size: 32, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !555, file: !480, line: 143, baseType: !110, size: 32)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 192, elements: !173)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !561, file: !665, line: 72, type: !749, isLocal: true, isDefinition: true)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !563, retainedTypes: !651, globals: !662, splitDebugInlining: false, nameTableKind: None)
!562 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!563 = !{!30, !564}
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !278, line: 65, baseType: !109, size: 32, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!566 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!567 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!568 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!569 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!570 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!571 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!572 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!573 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!574 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!575 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!576 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!577 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!578 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!579 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!580 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!581 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!582 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!583 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!584 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!585 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!586 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!587 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!588 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!589 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!590 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!591 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!592 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!593 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!594 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!595 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!596 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!597 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!598 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!599 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!600 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!601 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!602 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!603 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!604 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!605 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!606 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!607 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!608 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!609 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!610 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!611 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!612 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!613 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!614 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!615 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!616 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!617 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!618 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!619 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!620 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!621 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!622 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!623 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!624 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!625 = !DIEnumerator(name: "TIM6_IRQn", value: 54)
!626 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!627 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!628 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!629 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!630 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!631 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!632 = !DIEnumerator(name: "DFSDM1_FLT0_IRQn", value: 61)
!633 = !DIEnumerator(name: "DFSDM1_FLT1_IRQn", value: 62)
!634 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!635 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!636 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!637 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!638 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!639 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!640 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!641 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!642 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!643 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!644 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!645 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!646 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!647 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!648 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!649 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!650 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!651 = !{!107, !109, !106, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !278, line: 364, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 356, size: 192, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !654, file: !278, line: 358, baseType: !282, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !654, file: !278, line: 359, baseType: !282, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !654, file: !278, line: 360, baseType: !282, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !654, file: !278, line: 361, baseType: !282, size: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !654, file: !278, line: 362, baseType: !282, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !654, file: !278, line: 363, baseType: !282, size: 32, offset: 160)
!662 = !{!663, !669, !685, !696, !713, !559, !715, !729, !731, !733, !735, !737, !739, !741, !743, !745, !747}
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !561, file: !665, line: 424, type: !666, isLocal: false, isDefinition: true, align: 16)
!665 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 4)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__device_dts_ord_35", scope: !561, file: !665, line: 424, type: !671, isLocal: false, isDefinition: true, align: 32)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !302, line: 378, size: 192, elements: !673)
!673 = !{!674, !675, !676, !677, !683, !684}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !302, line: 380, baseType: !305, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !672, file: !302, line: 382, baseType: !13, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !672, file: !302, line: 384, baseType: !13, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !672, file: !302, line: 386, baseType: !678, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !302, line: 351, size: 16, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !679, file: !302, line: 359, baseType: !178, size: 8)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !679, file: !302, line: 364, baseType: !315, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !672, file: !302, line: 388, baseType: !106, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !672, file: !302, line: 396, baseType: !318, size: 32, offset: 160)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_35", scope: !561, file: !665, line: 424, type: !687, isLocal: true, isDefinition: true, align: 32)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !293, line: 51, size: 64, elements: !689)
!689 = !{!690, !695}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !688, file: !293, line: 60, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{!109, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !688, file: !293, line: 65, baseType: !694, size: 32, offset: 32)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "exti_data", scope: !561, file: !665, line: 423, type: !698, isLocal: true, isDefinition: true)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !665, line: 107, size: 1472, elements: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !698, file: !665, line: 109, baseType: !701, size: 1472)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 1472, elements: !711)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !665, line: 101, size: 64, elements: !703)
!703 = !{!704, !710}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !702, file: !665, line: 102, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !706, line: 63, baseType: !707)
!706 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !109, !106}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !702, file: !665, line: 103, baseType: !106, size: 32, offset: 32)
!711 = !{!712}
!712 = !DISubrange(count: 23)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_35", scope: !561, file: !665, line: 424, type: !679, isLocal: true, isDefinition: true, align: 8)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !717, file: !665, line: 493, type: !722, isLocal: true, isDefinition: true, align: 32)
!717 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !665, file: !665, line: 460, type: !718, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !561, retainedNodes: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !694}
!720 = !{!721}
!721 = !DILocalVariable(name: "dev", arg: 1, scope: !717, file: !665, line: 460, type: !694)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !723)
!723 = !{!724, !726, !727, !728}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !722, file: !10, line: 55, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !722, file: !10, line: 57, baseType: !725, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !722, file: !10, line: 59, baseType: !106, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !722, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !717, file: !665, line: 497, type: !722, isLocal: true, isDefinition: true, align: 32)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !717, file: !665, line: 507, type: !722, isLocal: true, isDefinition: true, align: 32)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !717, file: !665, line: 512, type: !722, isLocal: true, isDefinition: true, align: 32)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !717, file: !665, line: 516, type: !722, isLocal: true, isDefinition: true, align: 32)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !717, file: !665, line: 523, type: !722, isLocal: true, isDefinition: true, align: 32)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !717, file: !665, line: 527, type: !722, isLocal: true, isDefinition: true, align: 32)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !717, file: !665, line: 581, type: !722, isLocal: true, isDefinition: true, align: 32)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !717, file: !665, line: 586, type: !722, isLocal: true, isDefinition: true, align: 32)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !717, file: !665, line: 591, type: !722, isLocal: true, isDefinition: true, align: 32)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !717, file: !665, line: 595, type: !722, isLocal: true, isDefinition: true, align: 32)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 736, elements: !711)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !278, line: 154, baseType: !564)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !754, file: !759, line: 22, type: !781, isLocal: false, isDefinition: true, align: 16)
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !756, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!756 = !{!757, !752, !763, !765, !767, !769, !771, !773, !775, !777, !779}
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !754, file: !759, line: 17, type: !760, isLocal: false, isDefinition: true, align: 16)
!759 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 192, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 12)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_79", scope: !754, file: !759, line: 29, type: !666, isLocal: false, isDefinition: true, align: 16)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_78", scope: !754, file: !759, line: 36, type: !666, isLocal: false, isDefinition: true, align: 16)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_77", scope: !754, file: !759, line: 43, type: !666, isLocal: false, isDefinition: true, align: 16)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !754, file: !759, line: 50, type: !666, isLocal: false, isDefinition: true, align: 16)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !754, file: !759, line: 57, type: !666, isLocal: false, isDefinition: true, align: 16)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !754, file: !759, line: 64, type: !666, isLocal: false, isDefinition: true, align: 16)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !754, file: !759, line: 71, type: !666, isLocal: false, isDefinition: true, align: 16)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !754, file: !759, line: 78, type: !666, isLocal: false, isDefinition: true, align: 16)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !754, file: !759, line: 85, type: !666, isLocal: false, isDefinition: true, align: 16)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 48, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 3)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !786, file: !848, line: 398, type: !881, isLocal: true, isDefinition: true)
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !788, retainedTypes: !801, globals: !845, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!788 = !{!789, !30, !794}
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !790, line: 197, baseType: !32, size: 32, elements: !791)
!790 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!791 = !{!792, !793}
!792 = !DIEnumerator(name: "SUCCESS", value: 0)
!793 = !DIEnumerator(name: "ERROR", value: 1)
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !795, line: 44, baseType: !32, size: 32, elements: !796)
!795 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = !{!797, !798, !799, !800}
!797 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!798 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!799 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!800 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!801 = !{!106, !109, !110, !802, !838, !844}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !278, line: 510, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 477, size: 1216, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !804, file: !278, line: 479, baseType: !282, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !804, file: !278, line: 480, baseType: !282, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !804, file: !278, line: 481, baseType: !282, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !804, file: !278, line: 482, baseType: !282, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !804, file: !278, line: 483, baseType: !282, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !804, file: !278, line: 484, baseType: !282, size: 32, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !804, file: !278, line: 485, baseType: !813, size: 64, offset: 192)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !173)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !804, file: !278, line: 486, baseType: !282, size: 32, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !804, file: !278, line: 487, baseType: !282, size: 32, offset: 288)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !804, file: !278, line: 488, baseType: !813, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !804, file: !278, line: 489, baseType: !282, size: 32, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !804, file: !278, line: 490, baseType: !282, size: 32, offset: 416)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !804, file: !278, line: 491, baseType: !813, size: 64, offset: 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !804, file: !278, line: 492, baseType: !282, size: 32, offset: 512)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !804, file: !278, line: 493, baseType: !282, size: 32, offset: 544)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !804, file: !278, line: 494, baseType: !813, size: 64, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !804, file: !278, line: 495, baseType: !282, size: 32, offset: 640)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !804, file: !278, line: 496, baseType: !282, size: 32, offset: 672)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !804, file: !278, line: 497, baseType: !813, size: 64, offset: 704)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !804, file: !278, line: 498, baseType: !282, size: 32, offset: 768)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !804, file: !278, line: 499, baseType: !282, size: 32, offset: 800)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !804, file: !278, line: 500, baseType: !813, size: 64, offset: 832)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !804, file: !278, line: 501, baseType: !282, size: 32, offset: 896)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !804, file: !278, line: 502, baseType: !282, size: 32, offset: 928)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !804, file: !278, line: 503, baseType: !813, size: 64, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !804, file: !278, line: 504, baseType: !282, size: 32, offset: 1024)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !804, file: !278, line: 505, baseType: !282, size: 32, offset: 1056)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !804, file: !278, line: 506, baseType: !110, size: 32, offset: 1088)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !804, file: !278, line: 507, baseType: !282, size: 32, offset: 1120)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "CKGATENR", scope: !804, file: !278, line: 508, baseType: !282, size: 32, offset: 1152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR2", scope: !804, file: !278, line: 509, baseType: !282, size: 32, offset: 1184)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !840, line: 343, size: 64, elements: !841)
!840 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !839, file: !840, line: 344, baseType: !110, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !839, file: !840, line: 345, baseType: !110, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!845 = !{!846, !852, !868, !879, !784}
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !786, file: !848, line: 752, type: !849, isLocal: false, isDefinition: true, align: 16)
!848 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 848, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 53)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !786, file: !848, line: 752, type: !854, isLocal: false, isDefinition: true, align: 32)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !302, line: 378, size: 192, elements: !856)
!856 = !{!857, !858, !859, !860, !866, !867}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !855, file: !302, line: 380, baseType: !305, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !855, file: !302, line: 382, baseType: !13, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !855, file: !302, line: 384, baseType: !13, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !855, file: !302, line: 386, baseType: !861, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !302, line: 351, size: 16, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !862, file: !302, line: 359, baseType: !178, size: 8)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !862, file: !302, line: 364, baseType: !315, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !855, file: !302, line: 388, baseType: !106, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !855, file: !302, line: 396, baseType: !318, size: 32, offset: 160)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !786, file: !848, line: 752, type: !870, isLocal: true, isDefinition: true, align: 32)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !293, line: 51, size: 64, elements: !872)
!872 = !{!873, !878}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !871, file: !293, line: 60, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DISubroutineType(types: !876)
!876 = !{!109, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !871, file: !293, line: 65, baseType: !877, size: 32, offset: 32)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !786, file: !848, line: 752, type: !862, isLocal: true, isDefinition: true, align: 8)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !795, line: 100, size: 224, elements: !882)
!882 = !{!883, !889, !890, !899, !904, !909, !915}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !881, file: !795, line: 101, baseType: !884, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !795, line: 76, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(types: !887)
!887 = !{!109, !877, !888}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !795, line: 56, baseType: !106)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !881, file: !795, line: 102, baseType: !884, size: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !881, file: !795, line: 103, baseType: !891, size: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !795, line: 83, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(types: !894)
!894 = !{!109, !877, !888, !895, !106}
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !795, line: 72, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !877, !888, !106}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !881, file: !795, line: 104, baseType: !900, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !795, line: 79, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!109, !877, !888, !844}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !881, file: !795, line: 105, baseType: !905, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !795, line: 88, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{!794, !877, !888}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !881, file: !795, line: 106, baseType: !910, size: 32, offset: 160)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !795, line: 92, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DISubroutineType(types: !913)
!913 = !{!109, !877, !888, !914}
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !795, line: 64, baseType: !106)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !881, file: !795, line: 107, baseType: !916, size: 32, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !795, line: 96, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{!109, !877, !888, !106}
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !922, file: !979, line: 603, type: !981, isLocal: true, isDefinition: true, align: 32)
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !924, globals: !976, splitDebugInlining: false, nameTableKind: None)
!923 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!924 = !{!106, !109, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !928, line: 336, size: 160, elements: !929)
!928 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !{!930, !950, !954, !958, !971}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !927, file: !928, line: 365, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!109, !934, !949}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !302, line: 378, size: 192, elements: !937)
!937 = !{!938, !939, !940, !941, !947, !948}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !302, line: 380, baseType: !305, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !936, file: !302, line: 382, baseType: !13, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !936, file: !302, line: 384, baseType: !13, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !936, file: !302, line: 386, baseType: !942, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !302, line: 351, size: 16, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !943, file: !302, line: 359, baseType: !178, size: 8)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !943, file: !302, line: 364, baseType: !315, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !936, file: !302, line: 388, baseType: !106, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !936, file: !302, line: 396, baseType: !318, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !927, file: !928, line: 366, baseType: !951, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !934, !179}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !927, file: !928, line: 374, baseType: !955, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{!109, !934}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !927, file: !928, line: 377, baseType: !959, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DISubroutineType(types: !961)
!961 = !{!109, !934, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !928, line: 122, size: 64, elements: !965)
!965 = !{!966, !967, !968, !969, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !964, file: !928, line: 123, baseType: !110, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !964, file: !928, line: 124, baseType: !178, size: 8, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !964, file: !928, line: 125, baseType: !178, size: 8, offset: 40)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !964, file: !928, line: 126, baseType: !178, size: 8, offset: 48)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !964, file: !928, line: 127, baseType: !178, size: 8, offset: 56)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !927, file: !928, line: 379, baseType: !972, size: 32, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{!109, !934, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!976 = !{!920, !977}
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !922, file: !979, line: 38, type: !980, isLocal: true, isDefinition: true)
!979 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !293, line: 51, size: 64, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !982, file: !293, line: 60, baseType: !955, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !982, file: !293, line: 65, baseType: !934, size: 32, offset: 32)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !988, file: !1160, line: 762, type: !1272, isLocal: true, isDefinition: true)
!988 = distinct !DICompileUnit(language: DW_LANG_C99, file: !989, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !990, retainedTypes: !1008, globals: !1157, splitDebugInlining: false, nameTableKind: None)
!989 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/synchronization")
!990 = !{!30, !991, !997, !1002, !794}
!991 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !992, line: 506, baseType: !32, size: 32, elements: !993)
!992 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!993 = !{!994, !995, !996}
!994 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!995 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!996 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!997 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !992, line: 512, baseType: !32, size: 32, elements: !998)
!998 = !{!999, !1000, !1001}
!999 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!1000 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!1001 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !706, line: 43, baseType: !32, size: 32, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007}
!1004 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!1005 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!1006 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!1007 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!1008 = !{!106, !109, !1009, !1079, !1084, !1044, !997, !991, !1089, !1090, !110, !1104, !1059, !1116, !1117, !1118}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !992, line: 523, size: 288, elements: !1012)
!1012 = !{!1013, !1034, !1040, !1045, !1049, !1050, !1051, !1055, !1075}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !1011, file: !992, line: 524, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!109, !1017, !1032, !1033}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !302, line: 378, size: 192, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1030, !1031}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1019, file: !302, line: 380, baseType: !305, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1019, file: !302, line: 382, baseType: !13, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1019, file: !302, line: 384, baseType: !13, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1019, file: !302, line: 386, baseType: !1025, size: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !302, line: 351, size: 16, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1026, file: !302, line: 359, baseType: !178, size: 8)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1026, file: !302, line: 364, baseType: !315, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1019, file: !302, line: 388, baseType: !106, size: 32, offset: 128)
