; ModuleID = 'build/arduino_nano_33_ble/boards/stm32/backup_sram/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "backup_value", scope: !27, file: !105, line: 11, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "_char_out", scope: !109, file: !112, line: 54, type: !113, isLocal: false, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !110, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!110 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!111 = !{!107}
!112 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DISubroutineType(types: !115)
!115 = !{!103, !103}
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !118, file: !160, line: 27, type: !189, isLocal: true, isDefinition: true)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !132, globals: !157, splitDebugInlining: false, nameTableKind: None)
!119 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!120 = !{!121, !30}
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !122, line: 27, baseType: !32, size: 32, elements: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131}
!124 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!125 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!126 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!127 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!128 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!129 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!130 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!131 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!132 = !{!102, !133, !103, !24, !137, !153, !106, !155}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !134, line: 46, baseType: !135)
!134 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !136)
!136 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !139, line: 54, size: 96, elements: !140)
!139 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !{!141, !148, !152}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !138, file: !139, line: 55, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !143, line: 33, baseType: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !143, line: 29, size: 32, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !144, file: !143, line: 30, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !138, file: !139, line: 60, baseType: !149, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !121}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !138, file: !139, line: 65, baseType: !149, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !156)
!156 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!157 = !{!116, !158, !164, !166, !179, !181}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !118, file: !160, line: 44, type: !161, isLocal: true, isDefinition: true)
!160 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !162, line: 43, elements: !163)
!162 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!163 = !{}
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !118, file: !160, line: 49, type: !161, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !118, file: !160, line: 36, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, elements: !177)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !122, line: 114, size: 128, elements: !170)
!170 = !{!171, !172, !175, !176}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !169, file: !122, line: 115, baseType: !121, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !169, file: !122, line: 141, baseType: !173, size: 8, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !174)
!174 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !169, file: !122, line: 149, baseType: !106, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !169, file: !122, line: 156, baseType: !106, size: 32, offset: 96)
!177 = !{!178}
!178 = !DISubrange(count: 1)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !118, file: !160, line: 40, type: !168, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !118, file: !160, line: 28, type: !183, isLocal: true, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !143, line: 40, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !143, line: 35, size: 64, elements: !185)
!185 = !{!186, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !184, file: !143, line: 36, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !184, file: !143, line: 37, baseType: !187, size: 32, offset: 32)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 32, elements: !177)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !191, line: 22, baseType: !192)
!191 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!192 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!193 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!194 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !197, file: !228, line: 50, type: !215, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !199, globals: !225, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!199 = !{!200, !133, !202, !103, !102, !106, !155, !204, !153, !215, !216}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !201)
!201 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !203, line: 214, baseType: !32)
!203 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !206, line: 45, size: 64, elements: !207)
!206 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !{!208, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !205, file: !206, line: 46, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !143, line: 33, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !143, line: 29, size: 32, elements: !211)
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !143, line: 30, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !205, file: !206, line: 48, baseType: !106, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !206, line: 38, size: 64, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !217, file: !206, line: 39, baseType: !209, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !217, file: !206, line: 41, baseType: !221, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !206, line: 35, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !215}
!225 = !{!226, !230, !238, !195, !240, !250}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "latency_lock", scope: !197, file: !228, line: 44, type: !229, isLocal: true, isDefinition: true)
!228 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !162, line: 43, elements: !163)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !197, file: !228, line: 46, type: !232, isLocal: true, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !143, line: 40, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !143, line: 35, size: 64, elements: !234)
!234 = !{!235, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !233, file: !143, line: 36, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !233, file: !143, line: 37, baseType: !236, size: 32, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "latency_subs", scope: !197, file: !228, line: 52, type: !232, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !197, file: !228, line: 39, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, elements: !248)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 35, size: 96, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !243, file: !228, line: 36, baseType: !121, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !243, file: !228, line: 37, baseType: !173, size: 8, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !243, file: !228, line: 38, baseType: !190, size: 32, offset: 64)
!248 = !{!249}
!249 = !DISubrange(count: 0)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !197, file: !228, line: 48, type: !215, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !254, file: !261, line: 47, type: !275, isLocal: true, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !256, retainedTypes: !257, globals: !258, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!256 = !{!121}
!257 = !{!202, !103}
!258 = !{!259, !252, !271}
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "cpus_states", scope: !254, file: !261, line: 50, type: !262, isLocal: true, isDefinition: true)
!261 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 32, elements: !177)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !122, line: 114, size: 128, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !265, file: !122, line: 115, baseType: !121, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !265, file: !122, line: 141, baseType: !173, size: 8, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !265, file: !122, line: 149, baseType: !106, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !265, file: !122, line: 156, baseType: !106, size: 32, offset: 96)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !254, file: !261, line: 55, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 8, elements: !177)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, elements: !248)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "static_regions", scope: !278, file: !285, line: 62, type: !420, isLocal: true, isDefinition: true)
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !280, globals: !281, splitDebugInlining: false, nameTableKind: None)
!279 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!280 = !{!202, !103, !106, !102}
!281 = !{!282, !276}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !284, file: !285, line: 198, type: !408, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !285, file: !285, line: 175, type: !286, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !278, retainedNodes: !403)
!285 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !290, line: 245, size: 1024, elements: !291)
!290 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = !{!292, !359, !372, !373, !374, !375, !381, !398}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !289, file: !290, line: 247, baseType: !293, size: 384)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !290, line: 57, size: 384, elements: !294)
!294 = !{!295, !323, !331, !332, !333, !346, !347, !348}
!295 = !DIDerivedType(tag: DW_TAG_member, scope: !293, file: !290, line: 60, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !290, line: 60, size: 64, elements: !297)
!297 = !{!298, !314}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !296, file: !290, line: 61, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !300, line: 49, baseType: !301)
!300 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !300, line: 37, size: 64, elements: !302)
!302 = !{!303, !309}
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !300, line: 38, baseType: !304, size: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !300, line: 38, size: 32, elements: !305)
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !304, file: !300, line: 39, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !300, line: 40, baseType: !307, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !300, line: 42, baseType: !310, size: 32, offset: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !300, line: 42, size: 32, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !310, file: !300, line: 43, baseType: !307, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !310, file: !300, line: 44, baseType: !307, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !296, file: !290, line: 62, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !316, line: 49, size: 64, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !315, file: !316, line: 50, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 64, elements: !321)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!321 = !{!322}
!322 = !DISubrange(count: 2)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !293, file: !290, line: 68, baseType: !324, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !326, line: 233, baseType: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 231, size: 64, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !327, file: !326, line: 232, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !300, line: 48, baseType: !301)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !293, file: !290, line: 71, baseType: !173, size: 8, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !293, file: !290, line: 74, baseType: !173, size: 8, offset: 104)
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !293, file: !290, line: 90, baseType: !334, size: 16, offset: 112)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !290, line: 90, size: 16, elements: !335)
!335 = !{!336, !343}
!336 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !290, line: 91, baseType: !337, size: 16)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !290, line: 91, size: 16, elements: !338)
!338 = !{!339, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !337, file: !290, line: 96, baseType: !340, size: 8)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !341)
!341 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !337, file: !290, line: 97, baseType: !173, size: 8, offset: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !334, file: !290, line: 100, baseType: !344, size: 16)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !345)
!345 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !293, file: !290, line: 107, baseType: !106, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !293, file: !290, line: 127, baseType: !102, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !293, file: !290, line: 131, baseType: !349, size: 192, offset: 192)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !326, line: 244, size: 192, elements: !350)
!350 = !{!351, !352, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !349, file: !326, line: 245, baseType: !299, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !349, file: !326, line: 246, baseType: !353, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !326, line: 242, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !349, file: !326, line: 249, baseType: !135, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !289, file: !290, line: 250, baseType: !360, size: 288, offset: 384)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !361, line: 25, size: 288, elements: !362)
!361 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !360, file: !361, line: 26, baseType: !106, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !360, file: !361, line: 27, baseType: !106, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !360, file: !361, line: 28, baseType: !106, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !360, file: !361, line: 29, baseType: !106, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !360, file: !361, line: 30, baseType: !106, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !360, file: !361, line: 31, baseType: !106, size: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !360, file: !361, line: 32, baseType: !106, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !360, file: !361, line: 33, baseType: !106, size: 32, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !360, file: !361, line: 34, baseType: !106, size: 32, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !289, file: !290, line: 253, baseType: !102, size: 32, offset: 672)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !289, file: !290, line: 256, baseType: !325, size: 64, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !289, file: !290, line: 294, baseType: !103, size: 32, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !289, file: !290, line: 300, baseType: !376, size: 96, offset: 800)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !290, line: 149, size: 96, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !376, file: !290, line: 153, baseType: !22, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !290, line: 162, baseType: !202, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !376, file: !290, line: 168, baseType: !202, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !289, file: !290, line: 325, baseType: !382, size: 32, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !384, line: 5073, size: 160, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !395, !396}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !383, file: !384, line: 5074, baseType: !387, size: 96)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !388, line: 56, size: 96, elements: !389)
!388 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!389 = !{!390, !393, !394}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !387, file: !388, line: 57, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !388, line: 57, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !387, file: !388, line: 58, baseType: !102, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !387, file: !388, line: 59, baseType: !202, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !383, file: !384, line: 5075, baseType: !325, size: 64, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !383, file: !384, line: 5076, baseType: !397, offset: 160)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !162, line: 43, elements: !163)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !289, file: !290, line: 343, baseType: !399, size: 64, offset: 928)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !361, line: 60, size: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !399, file: !361, line: 63, baseType: !106, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !399, file: !361, line: 66, baseType: !106, size: 32, offset: 32)
!403 = !{!404, !405, !406, !407}
!404 = !DILocalVariable(name: "thread", arg: 1, scope: !284, file: !285, line: 175, type: !288)
!405 = !DILocalVariable(name: "region_num", scope: !284, file: !285, line: 200, type: !173)
!406 = !DILocalVariable(name: "guard_start", scope: !284, file: !285, line: 265, type: !22)
!407 = !DILocalVariable(name: "guard_size", scope: !284, file: !285, line: 266, type: !202)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 96, elements: !177)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !410, line: 52, size: 96, elements: !411)
!410 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !409, file: !410, line: 53, baseType: !22, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !410, line: 54, baseType: !202, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !409, file: !410, line: 55, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !416, line: 151, baseType: !417)
!416 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 149, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !417, file: !416, line: 150, baseType: !106, size: 32)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 96, elements: !177)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !424, file: !460, line: 39, type: !173, isLocal: true, isDefinition: true)
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !426, globals: !459, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!426 = !{!427, !102, !103, !445, !173}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !429, line: 1226, baseType: !430)
!429 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 1213, size: 352, elements: !431)
!431 = !{!432, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !430, file: !429, line: 1215, baseType: !433, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !106)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !430, file: !429, line: 1216, baseType: !434, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !430, file: !429, line: 1217, baseType: !434, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !430, file: !429, line: 1218, baseType: !434, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !430, file: !429, line: 1219, baseType: !434, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !430, file: !429, line: 1220, baseType: !434, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !430, file: !429, line: 1221, baseType: !434, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !430, file: !429, line: 1222, baseType: !434, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !430, file: !429, line: 1223, baseType: !434, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !430, file: !429, line: 1224, baseType: !434, size: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !430, file: !429, line: 1225, baseType: !434, size: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !448, line: 27, size: 96, elements: !449)
!448 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !{!450, !451, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !447, file: !448, line: 29, baseType: !106, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !448, line: 31, baseType: !452, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !447, file: !448, line: 37, baseType: !455, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !416, line: 146, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !416, line: 141, size: 32, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !456, file: !416, line: 143, baseType: !106, size: 32)
!459 = !{!422}
!460 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !463, file: !470, line: 21, type: !113, isLocal: true, isDefinition: true)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !465, globals: !469, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!465 = !{!466, !103, !102}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !468, line: 22, baseType: !103)
!468 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !{!461}
!470 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !473, file: !478, line: 13, type: !495, isLocal: true, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !475, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!475 = !{!476, !471}
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "mpu_config", scope: !473, file: !478, line: 37, type: !479, isLocal: false, isDefinition: true)
!478 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !448, line: 41, size: 64, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !480, file: !448, line: 43, baseType: !106, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !480, file: !448, line: 45, baseType: !484, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !448, line: 27, size: 96, elements: !487)
!487 = !{!488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !486, file: !448, line: 29, baseType: !106, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !486, file: !448, line: 31, baseType: !452, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !486, file: !448, line: 37, baseType: !491, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !416, line: 146, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !416, line: 141, size: 32, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !492, file: !416, line: 143, baseType: !106, size: 32)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 192, elements: !321)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !498, file: !668, line: 93, type: !669, isLocal: true, isDefinition: true, align: 32)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !500, globals: !663, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!500 = !{!501, !173, !102, !103, !581, !106, !582, !618, !629}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !503, line: 1071, baseType: !504)
!503 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 1035, size: 19584, elements: !505)
!505 = !{!506, !510, !511, !512, !516, !517, !519, !520, !521, !522, !523, !524, !528, !529, !530, !534, !535, !539, !540, !544, !545, !549, !550, !551, !552, !553, !554, !555, !559, !560, !561, !562, !566, !567, !571}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !504, file: !503, line: 1036, baseType: !507, size: 960)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 960, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 30)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !504, file: !503, line: 1037, baseType: !434, size: 32, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !504, file: !503, line: 1038, baseType: !434, size: 32, offset: 992)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !504, file: !503, line: 1039, baseType: !513, size: 1088, offset: 1024)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 1088, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 34)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !504, file: !503, line: 1040, baseType: !434, size: 32, offset: 2112)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !504, file: !503, line: 1041, baseType: !518, size: 64, offset: 2144)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 64, elements: !321)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !504, file: !503, line: 1042, baseType: !434, size: 32, offset: 2208)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !504, file: !503, line: 1043, baseType: !434, size: 32, offset: 2240)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !504, file: !503, line: 1044, baseType: !434, size: 32, offset: 2272)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !504, file: !503, line: 1045, baseType: !434, size: 32, offset: 2304)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !504, file: !503, line: 1046, baseType: !434, size: 32, offset: 2336)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !504, file: !503, line: 1047, baseType: !525, size: 3808, offset: 2368)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 3808, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 119)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !504, file: !503, line: 1048, baseType: !434, size: 32, offset: 6176)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !504, file: !503, line: 1049, baseType: !434, size: 32, offset: 6208)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !504, file: !503, line: 1050, baseType: !531, size: 1952, offset: 6240)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 1952, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 61)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !504, file: !503, line: 1051, baseType: !434, size: 32, offset: 8192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !504, file: !503, line: 1052, baseType: !536, size: 288, offset: 8224)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 288, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 9)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !504, file: !503, line: 1053, baseType: !433, size: 32, offset: 8512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !504, file: !503, line: 1054, baseType: !541, size: 96, offset: 8544)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 96, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 3)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !504, file: !503, line: 1055, baseType: !433, size: 32, offset: 8640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !504, file: !503, line: 1056, baseType: !546, size: 1568, offset: 8672)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 1568, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 49)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !504, file: !503, line: 1057, baseType: !434, size: 32, offset: 10240)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !504, file: !503, line: 1058, baseType: !541, size: 96, offset: 10272)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !504, file: !503, line: 1059, baseType: !434, size: 32, offset: 10368)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !504, file: !503, line: 1060, baseType: !518, size: 64, offset: 10400)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !504, file: !503, line: 1061, baseType: !434, size: 32, offset: 10464)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !504, file: !503, line: 1062, baseType: !434, size: 32, offset: 10496)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !504, file: !503, line: 1063, baseType: !556, size: 672, offset: 10528)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 672, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 21)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !504, file: !503, line: 1064, baseType: !434, size: 32, offset: 11200)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !504, file: !503, line: 1065, baseType: !433, size: 32, offset: 11232)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !504, file: !503, line: 1066, baseType: !434, size: 32, offset: 11264)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !504, file: !503, line: 1067, baseType: !563, size: 1504, offset: 11296)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 1504, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 47)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !504, file: !503, line: 1068, baseType: !433, size: 32, offset: 12800)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !504, file: !503, line: 1069, baseType: !568, size: 5600, offset: 12832)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 5600, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 175)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !504, file: !503, line: 1070, baseType: !572, size: 1152, offset: 18432)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 1152, elements: !537)
!573 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !503, line: 278, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 272, size: 128, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !575, file: !503, line: 273, baseType: !434, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !575, file: !503, line: 274, baseType: !434, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !575, file: !503, line: 275, baseType: !434, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !575, file: !503, line: 277, baseType: !433, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !429, line: 468, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 445, size: 1120, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !611, !615, !617}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !584, file: !429, line: 447, baseType: !433, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !584, file: !429, line: 448, baseType: !434, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !584, file: !429, line: 449, baseType: !434, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !584, file: !429, line: 450, baseType: !434, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !584, file: !429, line: 451, baseType: !434, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !584, file: !429, line: 452, baseType: !434, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !584, file: !429, line: 453, baseType: !593, size: 96, offset: 192)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 96, elements: !595)
!594 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !173)
!595 = !{!596}
!596 = !DISubrange(count: 12)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !584, file: !429, line: 454, baseType: !434, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !584, file: !429, line: 455, baseType: !434, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !584, file: !429, line: 456, baseType: !434, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !584, file: !429, line: 457, baseType: !434, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !584, file: !429, line: 458, baseType: !434, size: 32, offset: 416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !584, file: !429, line: 459, baseType: !434, size: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !584, file: !429, line: 460, baseType: !434, size: 32, offset: 480)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !584, file: !429, line: 461, baseType: !518, size: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !584, file: !429, line: 462, baseType: !433, size: 32, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !584, file: !429, line: 463, baseType: !433, size: 32, offset: 608)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !584, file: !429, line: 464, baseType: !608, size: 128, offset: 640)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 128, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 4)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !584, file: !429, line: 465, baseType: !612, size: 160, offset: 768)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 160, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 5)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !584, file: !429, line: 466, baseType: !616, size: 160, offset: 928)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 160, elements: !613)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !584, file: !429, line: 467, baseType: !434, size: 32, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !620, file: !619, line: 167, baseType: !628)
!619 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!620 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !619, file: !619, line: 134, type: !621, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !498, retainedNodes: !623)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !106}
!623 = !{!624, !625, !627}
!624 = !DILocalVariable(name: "time_us", arg: 1, scope: !620, file: !619, line: 134, type: !106)
!625 = !DILocalVariable(name: "delay_cycles", scope: !620, file: !619, line: 168, type: !626)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!627 = !DILocalVariable(name: "cycles", scope: !620, file: !619, line: 171, type: !106)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !503, line: 2399, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 2373, size: 10880, elements: !632)
!632 = !{!633, !637, !638, !639, !640, !644, !645, !650, !651, !652, !653, !654, !655, !659, !660, !661, !662}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !631, file: !503, line: 2374, baseType: !634, size: 8192)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 8192, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !631, file: !503, line: 2375, baseType: !433, size: 32, offset: 8192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !631, file: !503, line: 2376, baseType: !433, size: 32, offset: 8224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !631, file: !503, line: 2377, baseType: !433, size: 32, offset: 8256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !631, file: !503, line: 2378, baseType: !641, size: 1984, offset: 8288)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 1984, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 62)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !631, file: !503, line: 2379, baseType: !434, size: 32, offset: 10272)
!645 = !DIDerivedType(tag: DW_TAG_member, scope: !631, file: !503, line: 2381, baseType: !646, size: 32, offset: 10304)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !631, file: !503, line: 2381, size: 32, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !646, file: !503, line: 2382, baseType: !434, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !646, file: !503, line: 2383, baseType: !434, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !631, file: !503, line: 2386, baseType: !434, size: 32, offset: 10336)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !631, file: !503, line: 2387, baseType: !434, size: 32, offset: 10368)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !631, file: !503, line: 2389, baseType: !434, size: 32, offset: 10400)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !631, file: !503, line: 2391, baseType: !434, size: 32, offset: 10432)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !631, file: !503, line: 2393, baseType: !434, size: 32, offset: 10464)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !631, file: !503, line: 2394, baseType: !656, size: 256, offset: 10496)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 256, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 8)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !631, file: !503, line: 2395, baseType: !434, size: 32, offset: 10752)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !631, file: !503, line: 2396, baseType: !433, size: 32, offset: 10784)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !631, file: !503, line: 2397, baseType: !434, size: 32, offset: 10816)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !631, file: !503, line: 2398, baseType: !434, size: 32, offset: 10848)
!663 = !{!496, !664}
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !620, file: !619, line: 161, type: !666, isLocal: true, isDefinition: true, align: 128)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 48, elements: !542)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!668 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !671, line: 51, size: 64, elements: !672)
!671 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = !{!673, !680}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !670, file: !671, line: 60, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DISubroutineType(types: !676)
!676 = !{!103, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !671, line: 48, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !670, file: !671, line: 65, baseType: !677, size: 32, offset: 32)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !683, file: !787, line: 36, type: !802, isLocal: true, isDefinition: true, align: 32)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !685, retainedTypes: !697, globals: !783, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!685 = !{!686, !692}
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !687, line: 506, baseType: !32, size: 32, elements: !688)
!687 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!688 = !{!689, !690, !691}
!689 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!690 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!691 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !687, line: 512, baseType: !32, size: 32, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!695 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!696 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!697 = !{!698, !772, !777, !738, !692, !686, !782, !102}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !687, line: 523, size: 288, elements: !701)
!701 = !{!702, !728, !734, !739, !743, !744, !745, !749, !768}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !700, file: !687, line: 524, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = !DISubroutineType(types: !705)
!705 = !{!103, !706, !726, !727}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !709, line: 378, size: 192, elements: !710)
!709 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!710 = !{!711, !712, !713, !714, !721, !722}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !708, file: !709, line: 380, baseType: !452, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !708, file: !709, line: 382, baseType: !13, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !708, file: !709, line: 384, baseType: !13, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !708, file: !709, line: 386, baseType: !715, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !709, line: 351, size: 16, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !716, file: !709, line: 359, baseType: !173, size: 8)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !716, file: !709, line: 364, baseType: !720, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!720 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !708, file: !709, line: 388, baseType: !102, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !708, file: !709, line: 396, baseType: !723, size: 32, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !709, line: 43, baseType: !200)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !687, line: 237, baseType: !173)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !687, line: 257, baseType: !106)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !700, file: !687, line: 530, baseType: !729, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DISubroutineType(types: !731)
!731 = !{!103, !706, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !687, line: 229, baseType: !106)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !700, file: !687, line: 532, baseType: !735, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DISubroutineType(types: !737)
!737 = !{!103, !706, !738, !733}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !687, line: 216, baseType: !106)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !700, file: !687, line: 535, baseType: !740, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DISubroutineType(types: !742)
!742 = !{!103, !706, !738}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !700, file: !687, line: 537, baseType: !740, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !700, file: !687, line: 539, baseType: !740, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !700, file: !687, line: 541, baseType: !746, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DISubroutineType(types: !748)
!748 = !{!103, !706, !726, !686, !692}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !700, file: !687, line: 544, baseType: !750, size: 32, offset: 224)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DISubroutineType(types: !752)
!752 = !{!103, !706, !753, !720}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !687, line: 478, size: 96, elements: !755)
!755 = !{!756, !762, !767}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !754, file: !687, line: 482, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !143, line: 33, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !143, line: 29, size: 32, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !758, file: !143, line: 30, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !754, file: !687, line: 485, baseType: !763, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !687, line: 464, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !706, !753, !738}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !754, file: !687, line: 493, baseType: !738, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !700, file: !687, line: 547, baseType: !769, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DISubroutineType(types: !771)
!771 = !{!106, !706}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !687, line: 428, size: 32, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !774, file: !687, line: 434, baseType: !738, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !687, line: 441, size: 32, elements: !780)
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !779, file: !687, line: 447, baseType: !738, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!783 = !{!681, !784, !800}
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "pull_up", scope: !786, file: !787, line: 15, type: !793, isLocal: true, isDefinition: true)
!786 = distinct !DISubprogram(name: "board_init", scope: !787, file: !787, line: 10, type: !788, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !683, retainedNodes: !790)
!787 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!788 = !DISubroutineType(types: !789)
!789 = !{!103, !706}
!790 = !{!791, !792}
!791 = !DILocalVariable(name: "dev", arg: 1, scope: !786, file: !787, line: 10, type: !706)
!792 = !DILocalVariable(name: "res", scope: !786, file: !787, line: 14, type: !103)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !687, line: 271, size: 64, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !794, file: !687, line: 273, baseType: !706, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !794, file: !687, line: 275, baseType: !726, size: 8, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !794, file: !687, line: 277, baseType: !799, size: 16, offset: 48)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !687, line: 249, baseType: !344)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "user_led", scope: !786, file: !787, line: 17, type: !793, isLocal: true, isDefinition: true)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !671, line: 51, size: 64, elements: !804)
!804 = !{!805, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !803, file: !671, line: 60, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !803, file: !671, line: 65, baseType: !706, size: 32, offset: 32)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !810, file: !1045, line: 733, type: !1146, isLocal: false, isDefinition: true, align: 32)
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !811, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !812, retainedTypes: !955, globals: !1041, splitDebugInlining: false, nameTableKind: None)
!811 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/backup_sram")
!812 = !{!813, !819, !30, !824, !829, !836, !844, !852, !861, !865, !920, !927, !946}
!813 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !814, line: 23, baseType: !32, size: 32, elements: !815)
!814 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!815 = !{!816, !817, !818}
!816 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!817 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!818 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!819 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !814, line: 48, baseType: !32, size: 32, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!822 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!823 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 167, baseType: !32, size: 32, elements: !826)
!825 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!826 = !{!827, !828}
!827 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!828 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!829 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 107, baseType: !32, size: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835}
!831 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!832 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!833 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!834 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!835 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!836 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 208, baseType: !32, size: 32, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843}
!838 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!839 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!840 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!841 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!842 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!843 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 261, baseType: !32, size: 32, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851}
!846 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!847 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!848 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!849 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!850 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!851 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 237, baseType: !32, size: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860}
!854 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!855 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!856 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!857 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!858 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!859 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!860 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 152, baseType: !32, size: 32, elements: !862)
!862 = !{!863, !864}
!863 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!864 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !503, line: 71, baseType: !103, size: 32, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!867 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!868 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!869 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!870 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!871 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!872 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!873 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!874 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!875 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!876 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!877 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!878 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!879 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!880 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!881 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!882 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!883 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!884 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!885 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!886 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!887 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!888 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!889 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!890 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!891 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!892 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!893 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!894 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!895 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!896 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!897 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!898 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!899 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!900 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!901 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!902 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!903 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!904 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!905 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!906 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!907 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!908 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!909 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!910 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!911 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!912 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!913 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!914 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!915 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!916 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!917 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!918 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!919 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !921, line: 44, baseType: !32, size: 32, elements: !922)
!921 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!922 = !{!923, !924, !925, !926}
!923 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!924 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!925 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!926 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !928, line: 54, baseType: !32, size: 32, elements: !929)
!928 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945}
!930 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!931 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!932 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!933 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!934 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!935 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!936 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!937 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!938 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!939 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!940 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!941 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!942 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!943 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!944 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!945 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!946 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 53, baseType: !32, size: 32, elements: !948)
!947 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!948 = !{!949, !950, !951, !952, !953, !954}
!949 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!950 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!951 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!952 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!953 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!954 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!955 = !{!813, !102, !103, !956, !1005, !1006, !1007, !1008, !133, !106, !155, !720, !581, !1009, !215, !1010, !1040, !202}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !503, line: 1022, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 979, size: 11712, elements: !959)
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !971, !972, !973, !974, !975, !976, !977, !978, !979, !983, !984, !985, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !958, file: !503, line: 980, baseType: !434, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !958, file: !503, line: 981, baseType: !434, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !958, file: !503, line: 982, baseType: !434, size: 32, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !958, file: !503, line: 983, baseType: !434, size: 32, offset: 96)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !958, file: !503, line: 984, baseType: !434, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !958, file: !503, line: 985, baseType: !434, size: 32, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !958, file: !503, line: 986, baseType: !434, size: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !958, file: !503, line: 987, baseType: !968, size: 1824, offset: 224)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 1824, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 57)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !958, file: !503, line: 988, baseType: !434, size: 32, offset: 2048)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !958, file: !503, line: 989, baseType: !434, size: 32, offset: 2080)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !958, file: !503, line: 990, baseType: !433, size: 32, offset: 2112)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !958, file: !503, line: 991, baseType: !434, size: 32, offset: 2144)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !958, file: !503, line: 992, baseType: !434, size: 32, offset: 2176)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !958, file: !503, line: 993, baseType: !612, size: 160, offset: 2208)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !958, file: !503, line: 994, baseType: !434, size: 32, offset: 2368)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !958, file: !503, line: 996, baseType: !434, size: 32, offset: 2400)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !958, file: !503, line: 998, baseType: !980, size: 3744, offset: 2432)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 3744, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 117)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !958, file: !503, line: 999, baseType: !434, size: 32, offset: 6176)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !958, file: !503, line: 1000, baseType: !434, size: 32, offset: 6208)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !958, file: !503, line: 1001, baseType: !986, size: 2016, offset: 6240)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 2016, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 63)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !958, file: !503, line: 1002, baseType: !433, size: 32, offset: 8256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !958, file: !503, line: 1004, baseType: !433, size: 32, offset: 8288)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !958, file: !503, line: 1005, baseType: !433, size: 32, offset: 8320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !958, file: !503, line: 1006, baseType: !433, size: 32, offset: 8352)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !958, file: !503, line: 1008, baseType: !433, size: 32, offset: 8384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !958, file: !503, line: 1009, baseType: !433, size: 32, offset: 8416)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !958, file: !503, line: 1011, baseType: !641, size: 1984, offset: 8448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !958, file: !503, line: 1012, baseType: !434, size: 32, offset: 10432)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !958, file: !503, line: 1013, baseType: !541, size: 96, offset: 10464)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !958, file: !503, line: 1014, baseType: !434, size: 32, offset: 10560)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !958, file: !503, line: 1016, baseType: !541, size: 96, offset: 10592)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !958, file: !503, line: 1017, baseType: !434, size: 32, offset: 10688)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !958, file: !503, line: 1018, baseType: !656, size: 256, offset: 10720)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !958, file: !503, line: 1019, baseType: !434, size: 32, offset: 10976)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !958, file: !503, line: 1020, baseType: !556, size: 672, offset: 11008)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !958, file: !503, line: 1021, baseType: !434, size: 32, offset: 11680)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !825, line: 146, baseType: !829)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !825, line: 164, baseType: !861)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !429, line: 426, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 411, size: 28704, elements: !1013)
!1013 = !{!1014, !1016, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1031, !1035, !1039}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1012, file: !429, line: 413, baseType: !1015, size: 256)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 256, elements: !657)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1012, file: !429, line: 414, baseType: !1017, size: 768, offset: 256)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 768, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 24)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1012, file: !429, line: 415, baseType: !1015, size: 256, offset: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1012, file: !429, line: 416, baseType: !1017, size: 768, offset: 1280)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1012, file: !429, line: 417, baseType: !1015, size: 256, offset: 2048)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1012, file: !429, line: 418, baseType: !1017, size: 768, offset: 2304)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1012, file: !429, line: 419, baseType: !1015, size: 256, offset: 3072)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1012, file: !429, line: 420, baseType: !1017, size: 768, offset: 3328)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1012, file: !429, line: 421, baseType: !1015, size: 256, offset: 4096)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1012, file: !429, line: 422, baseType: !1028, size: 1792, offset: 4352)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 1792, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 56)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !1012, file: !429, line: 423, baseType: !1032, size: 1920, offset: 6144)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 1920, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 240)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1012, file: !429, line: 424, baseType: !1036, size: 20608, offset: 8064)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 20608, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 644)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1012, file: !429, line: 425, baseType: !434, size: 32, offset: 28672)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !921, line: 56, baseType: !102)
!1041 = !{!1042, !1092, !1133, !808, !1136, !1161, !1163, !1180, !1182, !1192, !1195, !1210, !1248, !1262}
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "on", scope: !1044, file: !1045, line: 549, type: !190, isLocal: true, isDefinition: true)
!1044 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !1045, file: !1045, line: 547, type: !1046, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !810, retainedNodes: !1048)
!1045 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !819}
!1048 = !{!1049, !1050, !1053}
