; ModuleID = 'build/actinius_icarus_som_ns/sensor/tmp108/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !111, file: !173, line: 65, type: !174, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !166, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!113 = !{!102, !103, !114, !119, !126}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !116, file: !115, line: 167, baseType: !125)
!115 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !115, file: !115, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!120 = !{!121, !122, !124}
!121 = !DILocalVariable(name: "time_us", arg: 1, scope: !116, file: !115, line: 134, type: !119)
!122 = !DILocalVariable(name: "delay_cycles", scope: !116, file: !115, line: 168, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!124 = !DILocalVariable(name: "cycles", scope: !116, file: !115, line: 171, type: !119)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !128, line: 1928, baseType: !129)
!128 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 1909, size: 11360, elements: !130)
!130 = !{!131, !137, !138, !139, !140, !144, !145, !146, !147, !151, !152, !156, !157, !158, !159, !160, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !129, file: !128, line: 1910, baseType: !132, size: 8192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !119)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !129, file: !128, line: 1911, baseType: !133, size: 32, offset: 8192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !129, file: !128, line: 1912, baseType: !133, size: 32, offset: 8224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !129, file: !128, line: 1913, baseType: !133, size: 32, offset: 8256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !129, file: !128, line: 1914, baseType: !141, size: 1984, offset: 8288)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1984, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 62)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !129, file: !128, line: 1915, baseType: !134, size: 32, offset: 10272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !129, file: !128, line: 1916, baseType: !133, size: 32, offset: 10304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !129, file: !128, line: 1917, baseType: !134, size: 32, offset: 10336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !129, file: !128, line: 1918, baseType: !148, size: 96, offset: 10368)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !129, file: !128, line: 1919, baseType: !134, size: 32, offset: 10464)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !129, file: !128, line: 1920, baseType: !153, size: 256, offset: 10496)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !129, file: !128, line: 1921, baseType: !134, size: 32, offset: 10752)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !129, file: !128, line: 1922, baseType: !133, size: 32, offset: 10784)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !129, file: !128, line: 1923, baseType: !134, size: 32, offset: 10816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !129, file: !128, line: 1924, baseType: !134, size: 32, offset: 10848)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !129, file: !128, line: 1925, baseType: !161, size: 416, offset: 10880)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !129, file: !128, line: 1926, baseType: !134, size: 32, offset: 11296)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !129, file: !128, line: 1927, baseType: !134, size: 32, offset: 11328)
!166 = !{!109, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !116, file: !115, line: 161, type: !169, isLocal: true, isDefinition: true, align: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !149)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !177)
!176 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !{!178, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !176, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !175, file: !176, line: 65, baseType: !182, size: 32, offset: 32)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !188, file: !230, line: 27, type: !260, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !202, globals: !227, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!190 = !{!191, !30}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !192, line: 27, baseType: !32, size: 32, elements: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!195 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!196 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!197 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!198 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!199 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!200 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!201 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!202 = !{!102, !203, !103, !24, !207, !223, !119, !225}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !204, line: 46, baseType: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !206)
!206 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !209, line: 54, size: 96, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !218, !222}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !208, file: !209, line: 55, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !214)
!213 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !213, line: 30, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !208, file: !209, line: 60, baseType: !219, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !191}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !208, file: !209, line: 65, baseType: !219, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !226)
!226 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!227 = !{!186, !228, !235, !237, !250, !252}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !188, file: !230, line: 44, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, size: 32, elements: !233)
!232 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !231, file: !232, line: 52, baseType: !22, size: 32)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !188, file: !230, line: 49, type: !231, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !188, file: !230, line: 36, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 128, elements: !248)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !241)
!241 = !{!242, !243, !246, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !240, file: !192, line: 115, baseType: !191, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !240, file: !192, line: 141, baseType: !244, size: 8, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !245)
!245 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !240, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !240, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!248 = !{!249}
!249 = !DISubrange(count: 1)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !188, file: !230, line: 40, type: !239, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !188, file: !230, line: 28, type: !254, isLocal: true, isDefinition: true)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !256)
!256 = !{!257, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !255, file: !213, line: 36, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !255, file: !213, line: 37, baseType: !258, size: 32, offset: 32)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 32, elements: !248)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !262, line: 22, baseType: !263)
!262 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!263 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!264 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!265 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !268, file: !299, line: 50, type: !286, isLocal: true, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !270, globals: !296, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!270 = !{!271, !203, !273, !103, !102, !119, !225, !275, !223, !286, !287}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !272)
!272 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !274, line: 214, baseType: !32)
!274 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !277, line: 45, size: 64, elements: !278)
!277 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !{!279, !285}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !276, file: !277, line: 46, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !213, line: 30, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !276, file: !277, line: 48, baseType: !119, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !277, line: 38, size: 64, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !288, file: !277, line: 39, baseType: !280, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !288, file: !277, line: 41, baseType: !292, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !277, line: 35, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !286}
!296 = !{!297, !303, !311, !266, !313, !323}
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "latency_lock", scope: !268, file: !299, line: 44, type: !300, isLocal: true, isDefinition: true)
!299 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, size: 32, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !300, file: !232, line: 52, baseType: !22, size: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !268, file: !299, line: 46, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !307)
!307 = !{!308, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !306, file: !213, line: 36, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !306, file: !213, line: 37, baseType: !309, size: 32, offset: 32)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "latency_subs", scope: !268, file: !299, line: 52, type: !305, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !268, file: !299, line: 39, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, elements: !321)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 35, size: 96, elements: !317)
!317 = !{!318, !319, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !316, file: !299, line: 36, baseType: !191, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !316, file: !299, line: 37, baseType: !244, size: 8, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !316, file: !299, line: 38, baseType: !261, size: 32, offset: 64)
!321 = !{!322}
!322 = !DISubrange(count: 0)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !268, file: !299, line: 48, type: !286, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !327, file: !334, line: 47, type: !348, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !330, globals: !331, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!329 = !{!191}
!330 = !{!273, !103}
!331 = !{!332, !325, !344}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "cpus_states", scope: !327, file: !334, line: 50, type: !335, isLocal: true, isDefinition: true)
!334 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 32, elements: !248)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !339)
!339 = !{!340, !341, !342, !343}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !338, file: !192, line: 115, baseType: !191, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !338, file: !192, line: 141, baseType: !244, size: 8, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !338, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !338, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !327, file: !334, line: 55, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 8, elements: !248)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, elements: !321)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions", scope: !351, file: !358, line: 62, type: !492, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !354, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!353 = !{!273, !103, !119, !102}
!354 = !{!355, !349}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !357, file: !358, line: 198, type: !479, isLocal: true, isDefinition: true)
!357 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !358, file: !358, line: 175, type: !359, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !351, retainedNodes: !476)
!358 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !363, line: 245, size: 1024, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !430, !443, !444, !445, !446, !452, !471}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !362, file: !363, line: 247, baseType: !366, size: 384)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !363, line: 57, size: 384, elements: !367)
!367 = !{!368, !396, !404, !405, !406, !417, !418, !419}
!368 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !363, line: 60, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !363, line: 60, size: 64, elements: !370)
!370 = !{!371, !387}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !369, file: !363, line: 61, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !373, line: 49, baseType: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !373, line: 37, size: 64, elements: !375)
!375 = !{!376, !382}
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !373, line: 38, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !373, line: 38, size: 32, elements: !378)
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !377, file: !373, line: 39, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !373, line: 40, baseType: !380, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !373, line: 42, baseType: !383, size: 32, offset: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !373, line: 42, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !383, file: !373, line: 43, baseType: !380, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !373, line: 44, baseType: !380, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !369, file: !363, line: 62, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !389, line: 49, size: 64, elements: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !388, file: !389, line: 50, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 64, elements: !394)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!394 = !{!395}
!395 = !DISubrange(count: 2)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !366, file: !363, line: 68, baseType: !397, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !399, line: 233, baseType: !400)
!399 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 231, size: 64, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !400, file: !399, line: 232, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !373, line: 48, baseType: !374)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !366, file: !363, line: 71, baseType: !244, size: 8, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !366, file: !363, line: 74, baseType: !244, size: 8, offset: 104)
!406 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !363, line: 90, baseType: !407, size: 16, offset: 112)
!407 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !363, line: 90, size: 16, elements: !408)
!408 = !{!409, !416}
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !407, file: !363, line: 91, baseType: !410, size: 16)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !363, line: 91, size: 16, elements: !411)
!411 = !{!412, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !410, file: !363, line: 96, baseType: !413, size: 8)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !414)
!414 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !410, file: !363, line: 97, baseType: !244, size: 8, offset: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !407, file: !363, line: 100, baseType: !171, size: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !366, file: !363, line: 107, baseType: !119, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !366, file: !363, line: 127, baseType: !102, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !366, file: !363, line: 131, baseType: !420, size: 192, offset: 192)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !399, line: 244, size: 192, elements: !421)
!421 = !{!422, !423, !429}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !420, file: !399, line: 245, baseType: !372, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !420, file: !399, line: 246, baseType: !424, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !399, line: 242, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !420, file: !399, line: 249, baseType: !205, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !362, file: !363, line: 250, baseType: !431, size: 288, offset: 384)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !432, line: 25, size: 288, elements: !433)
!432 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !431, file: !432, line: 26, baseType: !119, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !431, file: !432, line: 27, baseType: !119, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !431, file: !432, line: 28, baseType: !119, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !431, file: !432, line: 29, baseType: !119, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !431, file: !432, line: 30, baseType: !119, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !431, file: !432, line: 31, baseType: !119, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !431, file: !432, line: 32, baseType: !119, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !431, file: !432, line: 33, baseType: !119, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !431, file: !432, line: 34, baseType: !119, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !362, file: !363, line: 253, baseType: !102, size: 32, offset: 672)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !362, file: !363, line: 256, baseType: !398, size: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !362, file: !363, line: 294, baseType: !103, size: 32, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !362, file: !363, line: 300, baseType: !447, size: 96, offset: 800)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !363, line: 149, size: 96, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !447, file: !363, line: 153, baseType: !22, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !363, line: 162, baseType: !273, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !447, file: !363, line: 168, baseType: !273, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !362, file: !363, line: 325, baseType: !453, size: 32, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !455, line: 5073, size: 192, elements: !456)
!455 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!456 = !{!457, !466, !467}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !454, file: !455, line: 5074, baseType: !458, size: 96)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !459, line: 56, size: 96, elements: !460)
!459 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !{!461, !464, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !458, file: !459, line: 57, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !459, line: 57, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !458, file: !459, line: 58, baseType: !102, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !458, file: !459, line: 59, baseType: !273, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !454, file: !455, line: 5075, baseType: !398, size: 64, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !454, file: !455, line: 5076, baseType: !468, size: 32, offset: 160)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, size: 32, elements: !469)
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !468, file: !232, line: 52, baseType: !22, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !362, file: !363, line: 343, baseType: !472, size: 64, offset: 928)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !432, line: 60, size: 64, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !472, file: !432, line: 63, baseType: !119, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !472, file: !432, line: 66, baseType: !119, size: 32, offset: 32)
!476 = !{!477, !478}
!477 = !DILocalVariable(name: "thread", arg: 1, scope: !357, file: !358, line: 175, type: !361)
!478 = !DILocalVariable(name: "region_num", scope: !357, file: !358, line: 200, type: !244)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, elements: !321)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !481, line: 52, size: 96, elements: !482)
!481 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !480, file: !481, line: 53, baseType: !22, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !480, file: !481, line: 54, baseType: !273, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !480, file: !481, line: 55, baseType: !486, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !487, line: 304, baseType: !488)
!487 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !487, line: 301, size: 32, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !488, file: !487, line: 302, baseType: !171, size: 16)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !488, file: !487, line: 303, baseType: !171, size: 16, offset: 16)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 96, elements: !248)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !496, file: !552, line: 39, type: !244, isLocal: true, isDefinition: true)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !498, globals: !543, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!498 = !{!499, !102, !103, !527}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !501, line: 1495, baseType: !502)
!501 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 1474, size: 448, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !517}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !502, file: !501, line: 1476, baseType: !133, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !502, file: !501, line: 1477, baseType: !134, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !502, file: !501, line: 1478, baseType: !134, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !502, file: !501, line: 1479, baseType: !134, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !502, file: !501, line: 1480, baseType: !134, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !502, file: !501, line: 1481, baseType: !134, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !502, file: !501, line: 1482, baseType: !134, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !502, file: !501, line: 1483, baseType: !134, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !502, file: !501, line: 1484, baseType: !134, size: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !502, file: !501, line: 1485, baseType: !134, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !502, file: !501, line: 1486, baseType: !134, size: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !502, file: !501, line: 1487, baseType: !516, size: 32, offset: 352)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !248)
!517 = !DIDerivedType(tag: DW_TAG_member, scope: !502, file: !501, line: 1488, baseType: !518, size: 64, offset: 384)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !502, file: !501, line: 1488, size: 64, elements: !519)
!519 = !{!520, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !518, file: !501, line: 1489, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !394)
!522 = !DIDerivedType(tag: DW_TAG_member, scope: !518, file: !501, line: 1490, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !501, line: 1490, size: 64, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !523, file: !501, line: 1491, baseType: !134, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !523, file: !501, line: 1492, baseType: !134, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !530, line: 27, size: 128, elements: !531)
!530 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !{!532, !533, !536}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !529, file: !530, line: 29, baseType: !119, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !529, file: !530, line: 31, baseType: !534, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !529, file: !530, line: 37, baseType: !537, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !487, line: 298, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !487, line: 289, size: 64, elements: !539)
!539 = !{!540, !541, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !538, file: !487, line: 291, baseType: !244, size: 5, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !538, file: !487, line: 293, baseType: !244, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !538, file: !487, line: 295, baseType: !119, size: 32, offset: 32)
!543 = !{!494, !544}
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !496, file: !546, line: 31, type: !547, isLocal: true, isDefinition: true)
!546 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 160, elements: !248)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !546, line: 21, size: 160, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !548, file: !546, line: 22, baseType: !103, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !548, file: !546, line: 23, baseType: !529, size: 128, offset: 32)
!552 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !555, file: !562, line: 21, type: !106, isLocal: true, isDefinition: true)
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !557, globals: !561, splitDebugInlining: false, nameTableKind: None)
!556 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!557 = !{!558, !103, !102}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !560, line: 22, baseType: !103)
!560 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!561 = !{!553}
!562 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !565, file: !570, line: 13, type: !589, isLocal: true, isDefinition: true)
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !567, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!567 = !{!568, !563}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "mpu_config", scope: !565, file: !570, line: 37, type: !571, isLocal: false, isDefinition: true)
!570 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !530, line: 41, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !572, file: !530, line: 43, baseType: !119, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !572, file: !530, line: 45, baseType: !576, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !530, line: 27, size: 128, elements: !579)
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !578, file: !530, line: 29, baseType: !119, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !578, file: !530, line: 31, baseType: !534, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !578, file: !530, line: 37, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !487, line: 298, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !487, line: 289, size: 64, elements: !585)
!585 = !{!586, !587, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !584, file: !487, line: 291, baseType: !244, size: 5, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !584, file: !487, line: 293, baseType: !244, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !584, file: !487, line: 295, baseType: !119, size: 32, offset: 32)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 256, elements: !394)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_som_init", scope: !592, file: !693, line: 39, type: !694, isLocal: true, isDefinition: true, align: 32)
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !594, retainedTypes: !606, globals: !692, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_som/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!594 = !{!595, !601}
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !596, line: 506, baseType: !32, size: 32, elements: !597)
!596 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!597 = !{!598, !599, !600}
!598 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!599 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!600 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!601 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !596, line: 512, baseType: !32, size: 32, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!604 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!605 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!606 = !{!607, !681, !686, !647, !601, !595, !691, !102}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !596, line: 523, size: 288, elements: !610)
!610 = !{!611, !637, !643, !648, !652, !653, !654, !658, !677}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !609, file: !596, line: 524, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{!103, !615, !635, !636}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !618, line: 378, size: 192, elements: !619)
!618 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!619 = !{!620, !621, !622, !623, !630, !631}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !617, file: !618, line: 380, baseType: !534, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !617, file: !618, line: 382, baseType: !13, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !617, file: !618, line: 384, baseType: !13, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !617, file: !618, line: 386, baseType: !624, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !618, line: 351, size: 16, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !625, file: !618, line: 359, baseType: !244, size: 8)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !625, file: !618, line: 364, baseType: !629, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!629 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !617, file: !618, line: 388, baseType: !102, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !617, file: !618, line: 396, baseType: !632, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !618, line: 43, baseType: !271)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !596, line: 237, baseType: !244)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !596, line: 257, baseType: !119)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !609, file: !596, line: 530, baseType: !638, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DISubroutineType(types: !640)
!640 = !{!103, !615, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !596, line: 229, baseType: !119)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !609, file: !596, line: 532, baseType: !644, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DISubroutineType(types: !646)
!646 = !{!103, !615, !647, !642}
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !596, line: 216, baseType: !119)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !609, file: !596, line: 535, baseType: !649, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DISubroutineType(types: !651)
!651 = !{!103, !615, !647}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !609, file: !596, line: 537, baseType: !649, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !609, file: !596, line: 539, baseType: !649, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !609, file: !596, line: 541, baseType: !655, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DISubroutineType(types: !657)
!657 = !{!103, !615, !635, !595, !601}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !609, file: !596, line: 544, baseType: !659, size: 32, offset: 224)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DISubroutineType(types: !661)
!661 = !{!103, !615, !662, !629}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !596, line: 478, size: 96, elements: !664)
!664 = !{!665, !671, !676}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !663, file: !596, line: 482, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !213, line: 30, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !663, file: !596, line: 485, baseType: !672, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !596, line: 464, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !615, !662, !647}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !663, file: !596, line: 493, baseType: !647, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !609, file: !596, line: 547, baseType: !678, size: 32, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DISubroutineType(types: !680)
!680 = !{!119, !615}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !596, line: 428, size: 32, elements: !684)
!684 = !{!685}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !683, file: !596, line: 434, baseType: !647, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !596, line: 441, size: 32, elements: !689)
!689 = !{!690}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !688, file: !596, line: 447, baseType: !647, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!692 = !{!590}
!693 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_som/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !696)
!696 = !{!697, !701}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !695, file: !176, line: 60, baseType: !698, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = !DISubroutineType(types: !700)
!700 = !{!103, !615}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !695, file: !176, line: 65, baseType: !615, size: 32, offset: 32)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "__device_dts_ord_29", scope: !704, file: !908, line: 733, type: !1013, isLocal: false, isDefinition: true, align: 32)
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !706, retainedTypes: !824, globals: !904, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/tmp108")
!706 = !{!707, !713, !30, !718, !723, !727, !731, !735, !741, !745, !789, !796, !815}
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !708, line: 23, baseType: !32, size: 32, elements: !709)
!708 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!709 = !{!710, !711, !712}
!710 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!711 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!712 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !708, line: 48, baseType: !32, size: 32, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!716 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!717 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !719, line: 167, baseType: !32, size: 32, elements: !720)
!719 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!720 = !{!721, !722}
!721 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!722 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !719, line: 107, baseType: !32, size: 32, elements: !724)
!724 = !{!725, !726}
!725 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!726 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !719, line: 208, baseType: !32, size: 32, elements: !728)
!728 = !{!729, !730}
!729 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!730 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !719, line: 261, baseType: !32, size: 32, elements: !732)
!732 = !{!733, !734}
!733 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!734 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!735 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !719, line: 237, baseType: !32, size: 32, elements: !736)
!736 = !{!737, !738, !739, !740}
!737 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!738 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!739 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!740 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !719, line: 152, baseType: !32, size: 32, elements: !742)
!742 = !{!743, !744}
!743 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!744 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 71, baseType: !103, size: 32, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!747 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!748 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!749 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!750 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!751 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!752 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!753 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!754 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!755 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!756 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!757 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!758 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!759 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!760 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!761 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!762 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!763 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!764 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!765 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!766 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!767 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!768 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!769 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!770 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!771 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!772 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!773 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!774 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!775 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!776 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!777 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!778 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!779 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!780 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!781 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!782 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!783 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!784 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!785 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!786 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!787 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!788 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !790, line: 44, baseType: !32, size: 32, elements: !791)
!790 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!791 = !{!792, !793, !794, !795}
!792 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!793 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!794 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!795 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !797, line: 54, baseType: !32, size: 32, elements: !798)
!797 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!799 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!800 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!801 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!802 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!803 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!804 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!805 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!806 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!807 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!808 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!809 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!810 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!811 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!812 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!813 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!814 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!815 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !816, line: 53, baseType: !32, size: 32, elements: !817)
!816 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!817 = !{!818, !819, !820, !821, !822, !823}
!818 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!819 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!820 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!821 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!822 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!823 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!824 = !{!707, !102, !103, !825, !867, !868, !869, !870, !203, !119, !225, !629, !871, !872, !286, !873, !903, !273}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !128, line: 923, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 883, size: 10464, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !837, !838, !839, !840, !841, !842, !843, !844, !848, !849, !850, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !827, file: !128, line: 884, baseType: !134, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !827, file: !128, line: 885, baseType: !134, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !827, file: !128, line: 886, baseType: !134, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !827, file: !128, line: 887, baseType: !134, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !827, file: !128, line: 888, baseType: !834, size: 896, offset: 128)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 28)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !827, file: !128, line: 889, baseType: !134, size: 32, offset: 1024)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !827, file: !128, line: 890, baseType: !134, size: 32, offset: 1056)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !827, file: !128, line: 891, baseType: !134, size: 32, offset: 1088)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !827, file: !128, line: 892, baseType: !134, size: 32, offset: 1120)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !827, file: !128, line: 893, baseType: !834, size: 896, offset: 1152)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !827, file: !128, line: 894, baseType: !134, size: 32, offset: 2048)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !827, file: !128, line: 895, baseType: !134, size: 32, offset: 2080)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !827, file: !128, line: 896, baseType: !845, size: 960, offset: 2112)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 960, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 30)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !827, file: !128, line: 897, baseType: !134, size: 32, offset: 3072)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !827, file: !128, line: 898, baseType: !134, size: 32, offset: 3104)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !827, file: !128, line: 899, baseType: !851, size: 3008, offset: 3136)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3008, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 94)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !827, file: !128, line: 900, baseType: !134, size: 32, offset: 6144)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !827, file: !128, line: 901, baseType: !134, size: 32, offset: 6176)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !827, file: !128, line: 902, baseType: !134, size: 32, offset: 6208)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !827, file: !128, line: 903, baseType: !133, size: 32, offset: 6240)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !827, file: !128, line: 904, baseType: !141, size: 1984, offset: 6272)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !827, file: !128, line: 905, baseType: !133, size: 32, offset: 8256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !827, file: !128, line: 907, baseType: !133, size: 32, offset: 8288)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !827, file: !128, line: 910, baseType: !133, size: 32, offset: 8320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !827, file: !128, line: 911, baseType: !133, size: 32, offset: 8352)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !827, file: !128, line: 913, baseType: !133, size: 32, offset: 8384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !827, file: !128, line: 917, baseType: !133, size: 32, offset: 8416)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !827, file: !128, line: 919, baseType: !141, size: 1984, offset: 8448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !827, file: !128, line: 920, baseType: !134, size: 32, offset: 10432)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !719, line: 146, baseType: !723)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !719, line: 164, baseType: !741)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !501, line: 485, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 468, size: 28704, elements: !876)
!876 = !{!877, !881, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !898, !902}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !875, file: !501, line: 470, baseType: !878, size: 512)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 16)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !875, file: !501, line: 471, baseType: !882, size: 512, offset: 512)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !879)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !875, file: !501, line: 472, baseType: !878, size: 512, offset: 1024)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !875, file: !501, line: 473, baseType: !882, size: 512, offset: 1536)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !875, file: !501, line: 474, baseType: !878, size: 512, offset: 2048)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !875, file: !501, line: 475, baseType: !882, size: 512, offset: 2560)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !875, file: !501, line: 476, baseType: !878, size: 512, offset: 3072)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !875, file: !501, line: 477, baseType: !882, size: 512, offset: 3584)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !875, file: !501, line: 478, baseType: !878, size: 512, offset: 4096)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !875, file: !501, line: 479, baseType: !882, size: 512, offset: 4608)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !875, file: !501, line: 480, baseType: !878, size: 512, offset: 5120)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !875, file: !501, line: 481, baseType: !882, size: 512, offset: 5632)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !875, file: !501, line: 482, baseType: !894, size: 3968, offset: 6144)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 3968, elements: !896)
!895 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !244)
!896 = !{!897}
!897 = !DISubrange(count: 496)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !875, file: !501, line: 483, baseType: !899, size: 18560, offset: 10112)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 18560, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 580)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !875, file: !501, line: 484, baseType: !134, size: 32, offset: 28672)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !790, line: 56, baseType: !102)
!904 = !{!905, !957, !998, !702, !1003, !1028, !1030, !1047, !1049, !1059, !1062, !1077, !1115, !1129}
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "on", scope: !907, file: !908, line: 549, type: !261, isLocal: true, isDefinition: true)
!907 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !908, file: !908, line: 547, type: !909, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !704, retainedNodes: !911)
!908 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!909 = !DISubroutineType(types: !910)
!910 = !{null, !713}
!911 = !{!912, !913, !916}
!912 = !DILocalVariable(name: "start_mode", arg: 1, scope: !907, file: !908, line: 547, type: !713)
!913 = !DILocalVariable(name: "err", scope: !914, file: !908, line: 553, type: !103)
!914 = distinct !DILexicalBlock(scope: !915, file: !908, line: 552, column: 31)
!915 = distinct !DILexicalBlock(scope: !907, file: !908, line: 552, column: 6)
!916 = !DILocalVariable(name: "mgr", scope: !914, file: !908, line: 554, type: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !919, line: 154, size: 256, elements: !920)
!919 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!920 = !{!921, !933, !934, !950, !954, !955, !956}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !918, file: !919, line: 158, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !924)
!924 = !{!925, !932}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !923, file: !213, line: 36, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !928, file: !213, line: 30, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !923, file: !213, line: 37, baseType: !926, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !918, file: !919, line: 163, baseType: !922, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !918, file: !919, line: 166, baseType: !935, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !919, line: 133, size: 96, elements: !938)
!938 = !{!939, !948, !949}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !937, file: !919, line: 135, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !919, line: 129, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !917, !944}
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !919, line: 101, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !917, !103}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !937, file: !919, line: 138, baseType: !940, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !937, file: !919, line: 143, baseType: !940, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !918, file: !919, line: 169, baseType: !951, size: 32, offset: 160)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, size: 32, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !951, file: !232, line: 52, baseType: !22, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !918, file: !919, line: 172, baseType: !103, size: 32, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !918, file: !919, line: 175, baseType: !171, size: 16, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !918, file: !919, line: 178, baseType: !171, size: 16, offset: 240)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "cli", scope: !907, file: !908, line: 550, type: !959, isLocal: true, isDefinition: true)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !919, line: 273, size: 128, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !959, file: !919, line: 280, baseType: !927, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !959, file: !919, line: 283, baseType: !963, size: 96, offset: 32)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !964, line: 138, size: 96, elements: !965)
!964 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!965 = !{!966, !995, !996}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !963, file: !964, line: 149, baseType: !967, size: 32)
!967 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !964, line: 139, size: 32, elements: !968)
!968 = !{!969, !990}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !967, file: !964, line: 145, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !455, line: 5397, size: 128, elements: !972)
!972 = !{!973, !988, !989}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !971, file: !455, line: 5399, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !373, line: 48, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !373, line: 37, size: 64, elements: !976)
!976 = !{!977, !983}
!977 = !DIDerivedType(tag: DW_TAG_member, scope: !975, file: !373, line: 38, baseType: !978, size: 32)
!978 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !975, file: !373, line: 38, size: 32, elements: !979)
!979 = !{!980, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !978, file: !373, line: 39, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !978, file: !373, line: 40, baseType: !981, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, scope: !975, file: !373, line: 42, baseType: !984, size: 32, offset: 32)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !975, file: !373, line: 42, size: 32, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !984, file: !373, line: 43, baseType: !981, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !984, file: !373, line: 44, baseType: !981, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !971, file: !455, line: 5405, baseType: !32, size: 32, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !971, file: !455, line: 5408, baseType: !103, size: 32, offset: 96)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !967, file: !964, line: 148, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !964, line: 98, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{null, null}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !963, file: !964, line: 165, baseType: !134, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !963, file: !964, line: 174, baseType: !997, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_29", scope: !704, file: !908, line: 733, type: !1000, isLocal: false, isDefinition: true, align: 16)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 80, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 5)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_29", scope: !704, file: !908, line: 733, type: !1005, isLocal: true, isDefinition: true, align: 32)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !1007)
!1007 = !{!1008, !1027}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1006, file: !176, line: 60, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!103, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !618, line: 378, size: 192, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1025, !1026}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1014, file: !618, line: 380, baseType: !534, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1014, file: !618, line: 382, baseType: !13, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1014, file: !618, line: 384, baseType: !13, size: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1014, file: !618, line: 386, baseType: !1020, size: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !618, line: 351, size: 16, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1021, file: !618, line: 359, baseType: !244, size: 8)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1021, file: !618, line: 364, baseType: !629, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1014, file: !618, line: 388, baseType: !102, size: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1014, file: !618, line: 396, baseType: !632, size: 32, offset: 160)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1006, file: !176, line: 65, baseType: !1012, size: 32, offset: 32)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !704, file: !908, line: 79, type: !261, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "data", scope: !704, file: !908, line: 702, type: !1032, isLocal: true, isDefinition: true)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !908, line: 69, size: 704, elements: !1033)
!1033 = !{!1034, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1032, file: !908, line: 70, baseType: !1035, size: 512)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 512, elements: !394)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1032, file: !908, line: 71, baseType: !1037, size: 192, offset: 512)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 192, elements: !394)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !908, line: 52, size: 96, elements: !1039)
!1039 = !{!1040, !1045, !1046}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1038, file: !908, line: 53, baseType: !1041, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !790, line: 72, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !1012, !903, !102}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1038, file: !908, line: 54, baseType: !102, size: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1038, file: !908, line: 55, baseType: !119, size: 32, offset: 64)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_29", scope: !704, file: !908, line: 733, type: !1021, isLocal: true, isDefinition: true, align: 8)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "d", scope: !1051, file: !908, line: 476, type: !1057, isLocal: true, isDefinition: true)
!1051 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !908, file: !908, line: 474, type: !909, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !704, retainedNodes: !1052)
!1052 = !{!1053, !1054, !1055, !1056}
