; ModuleID = 'build/96b_wistrio/ipm_mcux/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "gcounter", scope: !27, file: !170, line: 12, type: !103, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !169, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !{!110, !143, !154, !159, !164}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 99, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!103, !115, !103, !142, !13, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !124, !125, !126, !135, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 380, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 386, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !128, file: !118, line: 359, baseType: !131, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !128, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !117, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !118, line: 43, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !141)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !107, file: !108, line: 100, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !115, !148, !104}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !115, !104, !142, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !107, file: !108, line: 101, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!103, !115}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !107, file: !108, line: 102, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!142, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !107, file: !108, line: 103, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !115, !103}
!169 = !{!25}
!170 = !DIFile(filename: "zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "_char_out", scope: !173, file: !177, line: 54, type: !178, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!175 = !{!104, !103}
!176 = !{!171}
!177 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!103, !103}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !183, file: !213, line: 60, type: !214, isLocal: true, isDefinition: true, align: 32)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !185, globals: !212, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!185 = !{!186, !206}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !188, line: 386, baseType: !189)
!188 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 370, size: 448, elements: !190)
!190 = !{!191, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !189, file: !188, line: 372, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !189, file: !188, line: 373, baseType: !192, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !189, file: !188, line: 374, baseType: !192, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !189, file: !188, line: 375, baseType: !192, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !189, file: !188, line: 376, baseType: !192, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !189, file: !188, line: 377, baseType: !192, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !189, file: !188, line: 378, baseType: !192, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !189, file: !188, line: 379, baseType: !192, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !189, file: !188, line: 380, baseType: !192, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !189, file: !188, line: 381, baseType: !192, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !189, file: !188, line: 382, baseType: !192, size: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !189, file: !188, line: 383, baseType: !192, size: 32, offset: 352)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !189, file: !188, line: 384, baseType: !192, size: 32, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !189, file: !188, line: 385, baseType: !192, size: 32, offset: 416)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !188, line: 364, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 360, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !208, file: !188, line: 362, baseType: !192, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !208, file: !188, line: 363, baseType: !192, size: 32, offset: 32)
!212 = !{!181}
!213 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !216, line: 51, size: 64, elements: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !{!218, !237}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !215, file: !216, line: 60, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{!103, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !225)
!225 = !{!226, !227, !228, !229, !235, !236}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !224, file: !118, line: 380, baseType: !121, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !224, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !224, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !224, file: !118, line: 386, baseType: !230, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !231, file: !118, line: 359, baseType: !131, size: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !231, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !224, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !215, file: !216, line: 65, baseType: !222, size: 32, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !240, file: !243, line: 71, type: !244, isLocal: true, isDefinition: true, align: 32)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !242, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!242 = !{!238}
!243 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !216, line: 51, size: 64, elements: !246)
!246 = !{!247, !266}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !245, file: !216, line: 60, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{!103, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !254)
!254 = !{!255, !256, !257, !258, !264, !265}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !118, line: 380, baseType: !121, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !253, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !253, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !253, file: !118, line: 386, baseType: !259, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !260, file: !118, line: 359, baseType: !131, size: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !260, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !253, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !253, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !245, file: !216, line: 65, baseType: !251, size: 32, offset: 32)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "static_regions", scope: !269, file: !278, line: 62, type: !419, isLocal: true, isDefinition: true)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !271, globals: !274, splitDebugInlining: false, nameTableKind: None)
!270 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!271 = !{!272, !103, !142, !104}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !{!275, !267}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !277, file: !278, line: 198, type: !405, isLocal: true, isDefinition: true)
!277 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !278, file: !278, line: 175, type: !279, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !269, retainedNodes: !400)
!278 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !DISubroutineType(types: !280)
!280 = !{null, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !283, line: 245, size: 1024, elements: !284)
!283 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!284 = !{!285, !354, !367, !368, !369, !370, !376, !395}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !282, file: !283, line: 247, baseType: !286, size: 384)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !283, line: 57, size: 384, elements: !287)
!287 = !{!288, !316, !324, !325, !326, !339, !340, !341}
!288 = !DIDerivedType(tag: DW_TAG_member, scope: !286, file: !283, line: 60, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !286, file: !283, line: 60, size: 64, elements: !290)
!290 = !{!291, !307}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !289, file: !283, line: 61, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !293, line: 49, baseType: !294)
!293 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !293, line: 37, size: 64, elements: !295)
!295 = !{!296, !302}
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !294, file: !293, line: 38, baseType: !297, size: 32)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !294, file: !293, line: 38, size: 32, elements: !298)
!298 = !{!299, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !297, file: !293, line: 39, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !293, line: 40, baseType: !300, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, scope: !294, file: !293, line: 42, baseType: !303, size: 32, offset: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !294, file: !293, line: 42, size: 32, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !303, file: !293, line: 43, baseType: !300, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !303, file: !293, line: 44, baseType: !300, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !289, file: !283, line: 62, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !309, line: 49, size: 64, elements: !310)
!309 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !308, file: !309, line: 50, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 64, elements: !314)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!314 = !{!315}
!315 = !DISubrange(count: 2)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !286, file: !283, line: 68, baseType: !317, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !319, line: 233, baseType: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 231, size: 64, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !320, file: !319, line: 232, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !293, line: 48, baseType: !294)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !286, file: !283, line: 71, baseType: !131, size: 8, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !286, file: !283, line: 74, baseType: !131, size: 8, offset: 104)
!326 = !DIDerivedType(tag: DW_TAG_member, scope: !286, file: !283, line: 90, baseType: !327, size: 16, offset: 112)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !286, file: !283, line: 90, size: 16, elements: !328)
!328 = !{!329, !336}
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !283, line: 91, baseType: !330, size: 16)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !283, line: 91, size: 16, elements: !331)
!331 = !{!332, !335}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !330, file: !283, line: 96, baseType: !333, size: 8)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !334)
!334 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !330, file: !283, line: 97, baseType: !131, size: 8, offset: 8)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !327, file: !283, line: 100, baseType: !337, size: 16)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !338)
!338 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !286, file: !283, line: 107, baseType: !142, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !286, file: !283, line: 127, baseType: !104, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !286, file: !283, line: 131, baseType: !342, size: 192, offset: 192)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !319, line: 244, size: 192, elements: !343)
!343 = !{!344, !345, !351}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !342, file: !319, line: 245, baseType: !292, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !342, file: !319, line: 246, baseType: !346, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !319, line: 242, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !342, file: !319, line: 249, baseType: !352, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !353)
!353 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !282, file: !283, line: 250, baseType: !355, size: 288, offset: 384)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !356, line: 25, size: 288, elements: !357)
!356 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !355, file: !356, line: 26, baseType: !142, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !355, file: !356, line: 27, baseType: !142, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !355, file: !356, line: 28, baseType: !142, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !355, file: !356, line: 29, baseType: !142, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !355, file: !356, line: 30, baseType: !142, size: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !355, file: !356, line: 31, baseType: !142, size: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !355, file: !356, line: 32, baseType: !142, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !355, file: !356, line: 33, baseType: !142, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !355, file: !356, line: 34, baseType: !142, size: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !282, file: !283, line: 253, baseType: !104, size: 32, offset: 672)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !282, file: !283, line: 256, baseType: !318, size: 64, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !282, file: !283, line: 294, baseType: !103, size: 32, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !282, file: !283, line: 300, baseType: !371, size: 96, offset: 800)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !283, line: 149, size: 96, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !371, file: !283, line: 153, baseType: !22, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !371, file: !283, line: 162, baseType: !272, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !371, file: !283, line: 168, baseType: !272, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !282, file: !283, line: 325, baseType: !377, size: 32, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !379, line: 5073, size: 160, elements: !380)
!379 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!380 = !{!381, !390, !391}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !378, file: !379, line: 5074, baseType: !382, size: 96)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !383, line: 56, size: 96, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{!385, !388, !389}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !382, file: !383, line: 57, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !383, line: 57, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !382, file: !383, line: 58, baseType: !104, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !382, file: !383, line: 59, baseType: !272, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !378, file: !379, line: 5075, baseType: !318, size: 64, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !378, file: !379, line: 5076, baseType: !392, offset: 160)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !393, line: 43, elements: !394)
!393 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !{}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !282, file: !283, line: 343, baseType: !396, size: 64, offset: 928)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !356, line: 60, size: 64, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !396, file: !356, line: 63, baseType: !142, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !396, file: !356, line: 66, baseType: !142, size: 32, offset: 32)
!400 = !{!401, !402, !403, !404}
!401 = !DILocalVariable(name: "thread", arg: 1, scope: !277, file: !278, line: 175, type: !281)
!402 = !DILocalVariable(name: "region_num", scope: !277, file: !278, line: 200, type: !131)
!403 = !DILocalVariable(name: "guard_start", scope: !277, file: !278, line: 265, type: !22)
!404 = !DILocalVariable(name: "guard_size", scope: !277, file: !278, line: 266, type: !272)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 96, elements: !417)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !407, line: 52, size: 96, elements: !408)
!407 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !406, file: !407, line: 53, baseType: !22, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !406, file: !407, line: 54, baseType: !272, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !406, file: !407, line: 55, baseType: !412, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !413, line: 151, baseType: !414)
!413 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 149, size: 32, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !414, file: !413, line: 150, baseType: !142, size: 32)
!417 = !{!418}
!418 = !DISubrange(count: 1)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 96, elements: !417)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !423, file: !456, line: 39, type: !131, isLocal: true, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !425, globals: !455, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!425 = !{!426, !104, !103, !443, !131}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !428, line: 1168, baseType: !429)
!428 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 1155, size: 352, elements: !430)
!430 = !{!431, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !429, file: !428, line: 1157, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !429, file: !428, line: 1158, baseType: !192, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !429, file: !428, line: 1159, baseType: !192, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !429, file: !428, line: 1160, baseType: !192, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !429, file: !428, line: 1161, baseType: !192, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !429, file: !428, line: 1162, baseType: !192, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !429, file: !428, line: 1163, baseType: !192, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !429, file: !428, line: 1164, baseType: !192, size: 32, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !429, file: !428, line: 1165, baseType: !192, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !429, file: !428, line: 1166, baseType: !192, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !429, file: !428, line: 1167, baseType: !192, size: 32, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !446, line: 27, size: 96, elements: !447)
!446 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !{!448, !449, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !445, file: !446, line: 29, baseType: !142, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !446, line: 31, baseType: !121, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !445, file: !446, line: 37, baseType: !451, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !413, line: 146, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !413, line: 141, size: 32, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !452, file: !413, line: 143, baseType: !142, size: 32)
!455 = !{!421}
!456 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !459, file: !466, line: 21, type: !178, isLocal: true, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !461, globals: !465, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!461 = !{!462, !103, !104}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !464, line: 22, baseType: !103)
!464 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!465 = !{!457}
!466 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !469, file: !474, line: 13, type: !491, isLocal: true, isDefinition: true)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !471, splitDebugInlining: false, nameTableKind: None)
!470 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!471 = !{!472, !467}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "mpu_config", scope: !469, file: !474, line: 37, type: !475, isLocal: false, isDefinition: true)
!474 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !446, line: 41, size: 64, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !476, file: !446, line: 43, baseType: !142, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !476, file: !446, line: 45, baseType: !480, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !446, line: 27, size: 96, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !482, file: !446, line: 29, baseType: !142, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !482, file: !446, line: 31, baseType: !121, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !482, file: !446, line: 37, baseType: !487, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !413, line: 146, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !413, line: 141, size: 32, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !488, file: !413, line: 143, baseType: !142, size: 32)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 192, elements: !314)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !494, file: !591, line: 36, type: !592, isLocal: true, isDefinition: true, align: 32)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !496, retainedTypes: !508, globals: !590, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!496 = !{!497, !503}
!497 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !498, line: 506, baseType: !32, size: 32, elements: !499)
!498 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!499 = !{!500, !501, !502}
!500 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!501 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!502 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!503 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !498, line: 512, baseType: !32, size: 32, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!506 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!507 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!508 = !{!509, !579, !584, !544, !503, !497, !589, !104}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !498, line: 523, size: 288, elements: !512)
!512 = !{!513, !534, !540, !545, !549, !550, !551, !555, !575}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !511, file: !498, line: 524, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DISubroutineType(types: !516)
!516 = !{!103, !517, !532, !533}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !520)
!520 = !{!521, !522, !523, !524, !530, !531}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !519, file: !118, line: 380, baseType: !121, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !519, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !519, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !519, file: !118, line: 386, baseType: !525, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !526, file: !118, line: 359, baseType: !131, size: 8)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !526, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !519, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !519, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !498, line: 237, baseType: !131)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !498, line: 257, baseType: !142)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !511, file: !498, line: 530, baseType: !535, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DISubroutineType(types: !537)
!537 = !{!103, !517, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !498, line: 229, baseType: !142)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !511, file: !498, line: 532, baseType: !541, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DISubroutineType(types: !543)
!543 = !{!103, !517, !544, !539}
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !498, line: 216, baseType: !142)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !511, file: !498, line: 535, baseType: !546, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DISubroutineType(types: !548)
!548 = !{!103, !517, !544}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !511, file: !498, line: 537, baseType: !546, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !511, file: !498, line: 539, baseType: !546, size: 32, offset: 160)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !511, file: !498, line: 541, baseType: !552, size: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DISubroutineType(types: !554)
!554 = !{!103, !517, !532, !497, !503}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !511, file: !498, line: 544, baseType: !556, size: 32, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DISubroutineType(types: !558)
!558 = !{!103, !517, !559, !134}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !498, line: 478, size: 96, elements: !561)
!561 = !{!562, !569, !574}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !560, file: !498, line: 482, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !564, line: 33, baseType: !565)
!564 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !564, line: 29, size: 32, elements: !566)
!566 = !{!567}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !564, line: 30, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !560, file: !498, line: 485, baseType: !570, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !498, line: 464, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !517, !559, !544}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !560, file: !498, line: 493, baseType: !544, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !511, file: !498, line: 547, baseType: !576, size: 32, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DISubroutineType(types: !578)
!578 = !{!142, !517}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !498, line: 428, size: 32, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !581, file: !498, line: 434, baseType: !544, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !498, line: 441, size: 32, elements: !587)
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !586, file: !498, line: 447, baseType: !544, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!590 = !{!492}
!591 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !216, line: 51, size: 64, elements: !594)
!594 = !{!595, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !593, file: !216, line: 60, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DISubroutineType(types: !598)
!598 = !{!103, !517}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !593, file: !216, line: 65, baseType: !517, size: 32, offset: 32)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !602, file: !674, line: 48, type: !750, isLocal: true, isDefinition: true)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !604, retainedTypes: !660, globals: !671, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!604 = !{!30, !605}
!605 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !188, line: 69, baseType: !103, size: 32, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!607 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!608 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!609 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!610 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!611 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!612 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!613 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!614 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!615 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!616 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!617 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!618 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!619 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!620 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!621 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!622 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!623 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!624 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!625 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!626 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!627 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!628 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!629 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!630 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!631 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!632 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!633 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!634 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!635 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!636 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!637 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!638 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!639 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!640 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!641 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!642 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!643 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!644 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!645 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!646 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!647 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!648 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!649 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!650 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!651 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!652 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!653 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!654 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!655 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!656 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!657 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!658 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!659 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!660 = !{!272, !103, !104, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !188, line: 270, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 262, size: 192, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !663, file: !188, line: 264, baseType: !192, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !663, file: !188, line: 265, baseType: !192, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !663, file: !188, line: 266, baseType: !192, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !663, file: !188, line: 267, baseType: !192, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !663, file: !188, line: 268, baseType: !192, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !663, file: !188, line: 269, baseType: !192, size: 32, offset: 160)
!671 = !{!672, !678, !694, !705, !722, !600, !724, !738, !740, !742, !744, !746, !748}
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !602, file: !674, line: 424, type: !675, isLocal: false, isDefinition: true, align: 16)
!674 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 4)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !602, file: !674, line: 424, type: !680, isLocal: false, isDefinition: true, align: 32)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !682)
!682 = !{!683, !684, !685, !686, !692, !693}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !118, line: 380, baseType: !121, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !681, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !681, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !681, file: !118, line: 386, baseType: !687, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !688, file: !118, line: 359, baseType: !131, size: 8)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !688, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !681, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !681, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !602, file: !674, line: 424, type: !696, isLocal: true, isDefinition: true, align: 32)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !216, line: 51, size: 64, elements: !698)
!698 = !{!699, !704}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !697, file: !216, line: 60, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = !DISubroutineType(types: !702)
!702 = !{!103, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !697, file: !216, line: 65, baseType: !703, size: 32, offset: 32)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "exti_data", scope: !602, file: !674, line: 423, type: !707, isLocal: true, isDefinition: true)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !674, line: 107, size: 1024, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !707, file: !674, line: 109, baseType: !710, size: 1024)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 1024, elements: !720)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !674, line: 101, size: 64, elements: !712)
!712 = !{!713, !719}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !711, file: !674, line: 102, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !715, line: 63, baseType: !716)
!715 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !103, !104}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !711, file: !674, line: 103, baseType: !104, size: 32, offset: 32)
!720 = !{!721}
!721 = !DISubrange(count: 16)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !602, file: !674, line: 424, type: !688, isLocal: true, isDefinition: true, align: 8)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !726, file: !674, line: 493, type: !731, isLocal: true, isDefinition: true, align: 32)
!726 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !674, file: !674, line: 460, type: !727, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !703}
!729 = !{!730}
!730 = !DILocalVariable(name: "dev", arg: 1, scope: !726, file: !674, line: 460, type: !703)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !732)
!732 = !{!733, !735, !736, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !731, file: !10, line: 55, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !731, file: !10, line: 57, baseType: !734, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !731, file: !10, line: 59, baseType: !104, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !731, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !726, file: !674, line: 497, type: !731, isLocal: true, isDefinition: true, align: 32)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !726, file: !674, line: 507, type: !731, isLocal: true, isDefinition: true, align: 32)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !726, file: !674, line: 512, type: !731, isLocal: true, isDefinition: true, align: 32)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !726, file: !674, line: 516, type: !731, isLocal: true, isDefinition: true, align: 32)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !726, file: !674, line: 523, type: !731, isLocal: true, isDefinition: true, align: 32)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !726, file: !674, line: 527, type: !731, isLocal: true, isDefinition: true, align: 32)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 512, elements: !720)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !188, line: 127, baseType: !605)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !755, file: !760, line: 21, type: !780, isLocal: false, isDefinition: true, align: 16)
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !757, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!757 = !{!758, !753, !764, !766, !768, !770, !772, !774, !776, !778}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !755, file: !760, line: 16, type: !761, isLocal: false, isDefinition: true, align: 16)
!760 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 176, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 11)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !755, file: !760, line: 28, type: !675, isLocal: false, isDefinition: true, align: 16)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !755, file: !760, line: 35, type: !675, isLocal: false, isDefinition: true, align: 16)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !755, file: !760, line: 42, type: !675, isLocal: false, isDefinition: true, align: 16)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !755, file: !760, line: 49, type: !675, isLocal: false, isDefinition: true, align: 16)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !755, file: !760, line: 56, type: !675, isLocal: false, isDefinition: true, align: 16)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !755, file: !760, line: 63, type: !675, isLocal: false, isDefinition: true, align: 16)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !755, file: !760, line: 70, type: !675, isLocal: false, isDefinition: true, align: 16)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !755, file: !760, line: 77, type: !675, isLocal: false, isDefinition: true, align: 16)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 48, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 3)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !785, file: !829, line: 398, type: !862, isLocal: true, isDefinition: true)
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !787, retainedTypes: !800, globals: !826, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!787 = !{!788, !30, !793}
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 190, baseType: !32, size: 32, elements: !790)
!789 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = !{!791, !792}
!791 = !DIEnumerator(name: "SUCCESS", value: 0)
!792 = !DIEnumerator(name: "ERROR", value: 1)
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !794, line: 44, baseType: !32, size: 32, elements: !795)
!794 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!795 = !{!796, !797, !798, !799}
!796 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!797 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!798 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!799 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!800 = !{!104, !103, !142, !801, !819, !825}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !188, line: 386, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 370, size: 448, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !803, file: !188, line: 372, baseType: !192, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !803, file: !188, line: 373, baseType: !192, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !803, file: !188, line: 374, baseType: !192, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !803, file: !188, line: 375, baseType: !192, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !803, file: !188, line: 376, baseType: !192, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !803, file: !188, line: 377, baseType: !192, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !803, file: !188, line: 378, baseType: !192, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !803, file: !188, line: 379, baseType: !192, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !803, file: !188, line: 380, baseType: !192, size: 32, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !803, file: !188, line: 381, baseType: !192, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !803, file: !188, line: 382, baseType: !192, size: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !803, file: !188, line: 383, baseType: !192, size: 32, offset: 352)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !803, file: !188, line: 384, baseType: !192, size: 32, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !803, file: !188, line: 385, baseType: !192, size: 32, offset: 416)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !821, line: 343, size: 64, elements: !822)
!821 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !820, file: !821, line: 344, baseType: !142, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !820, file: !821, line: 345, baseType: !142, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!826 = !{!827, !833, !849, !860, !783}
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !785, file: !829, line: 752, type: !830, isLocal: false, isDefinition: true, align: 16)
!829 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 512, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 32)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !785, file: !829, line: 752, type: !835, isLocal: false, isDefinition: true, align: 32)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !837)
!837 = !{!838, !839, !840, !841, !847, !848}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !836, file: !118, line: 380, baseType: !121, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !836, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !836, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !836, file: !118, line: 386, baseType: !842, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !843, file: !118, line: 359, baseType: !131, size: 8)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !843, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !836, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !836, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !785, file: !829, line: 752, type: !851, isLocal: true, isDefinition: true, align: 32)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !216, line: 51, size: 64, elements: !853)
!853 = !{!854, !859}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !852, file: !216, line: 60, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DISubroutineType(types: !857)
!857 = !{!103, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !852, file: !216, line: 65, baseType: !858, size: 32, offset: 32)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !785, file: !829, line: 752, type: !843, isLocal: true, isDefinition: true, align: 8)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !794, line: 100, size: 224, elements: !863)
!863 = !{!864, !870, !871, !880, !885, !890, !896}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !862, file: !794, line: 101, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !794, line: 76, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!103, !858, !869}
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !794, line: 56, baseType: !104)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !862, file: !794, line: 102, baseType: !865, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !862, file: !794, line: 103, baseType: !872, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !794, line: 83, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DISubroutineType(types: !875)
!875 = !{!103, !858, !869, !876, !104}
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !794, line: 72, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !858, !869, !104}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !862, file: !794, line: 104, baseType: !881, size: 32, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !794, line: 79, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DISubroutineType(types: !884)
!884 = !{!103, !858, !869, !825}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !862, file: !794, line: 105, baseType: !886, size: 32, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !794, line: 88, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DISubroutineType(types: !889)
!889 = !{!793, !858, !869}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !862, file: !794, line: 106, baseType: !891, size: 32, offset: 160)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !794, line: 92, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(types: !894)
!894 = !{!103, !858, !869, !895}
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !794, line: 64, baseType: !104)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !862, file: !794, line: 107, baseType: !897, size: 32, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !794, line: 96, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{!103, !858, !869, !104}
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !903, file: !960, line: 603, type: !962, isLocal: true, isDefinition: true, align: 32)
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !905, globals: !957, splitDebugInlining: false, nameTableKind: None)
!904 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!905 = !{!104, !103, !906}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !909, line: 336, size: 160, elements: !910)
!909 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = !{!911, !931, !935, !939, !952}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !908, file: !909, line: 365, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(types: !914)
!914 = !{!103, !915, !930}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !918)
!918 = !{!919, !920, !921, !922, !928, !929}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !917, file: !118, line: 380, baseType: !121, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !917, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !917, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !917, file: !118, line: 386, baseType: !923, size: 32, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !924, file: !118, line: 359, baseType: !131, size: 8)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !924, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !917, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !917, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !908, file: !909, line: 366, baseType: !932, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !915, !132}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !908, file: !909, line: 374, baseType: !936, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!103, !915}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !908, file: !909, line: 377, baseType: !940, size: 32, offset: 96)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{!103, !915, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !909, line: 122, size: 64, elements: !946)
!946 = !{!947, !948, !949, !950, !951}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !945, file: !909, line: 123, baseType: !142, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !945, file: !909, line: 124, baseType: !131, size: 8, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !945, file: !909, line: 125, baseType: !131, size: 8, offset: 40)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !945, file: !909, line: 126, baseType: !131, size: 8, offset: 48)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !945, file: !909, line: 127, baseType: !131, size: 8, offset: 56)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !908, file: !909, line: 379, baseType: !953, size: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DISubroutineType(types: !955)
!955 = !{!103, !915, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!957 = !{!901, !958}
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !903, file: !960, line: 38, type: !961, isLocal: true, isDefinition: true)
!960 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !216, line: 51, size: 64, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !963, file: !216, line: 60, baseType: !936, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !963, file: !216, line: 65, baseType: !915, size: 32, offset: 32)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !969, file: !1120, line: 762, type: !1218, isLocal: true, isDefinition: true)
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !971, retainedTypes: !978, globals: !1117, splitDebugInlining: false, nameTableKind: None)
!970 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/ipm_mcux")
!971 = !{!30, !497, !503, !972, !793}
!972 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !715, line: 43, baseType: !32, size: 32, elements: !973)
!973 = !{!974, !975, !976, !977}
!974 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!975 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!976 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!977 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!978 = !{!104, !103, !979, !1043, !1048, !544, !503, !497, !1053, !1054, !142, !1068, !1024, !1076, !1077, !1078}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !498, line: 523, size: 288, elements: !982)
!982 = !{!983, !1002, !1006, !1010, !1014, !1015, !1016, !1020, !1039}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !981, file: !498, line: 524, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!103, !987, !532, !533}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !990)
!990 = !{!991, !992, !993, !994, !1000, !1001}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !118, line: 380, baseType: !121, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !989, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !989, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !989, file: !118, line: 386, baseType: !995, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !996, file: !118, line: 359, baseType: !131, size: 8)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !996, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !989, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !989, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !981, file: !498, line: 530, baseType: !1003, size: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!103, !987, !538}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !981, file: !498, line: 532, baseType: !1007, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!103, !987, !544, !539}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !981, file: !498, line: 535, baseType: !1011, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!103, !987, !544}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !981, file: !498, line: 537, baseType: !1011, size: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !981, file: !498, line: 539, baseType: !1011, size: 32, offset: 160)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !981, file: !498, line: 541, baseType: !1017, size: 32, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!103, !987, !532, !497, !503}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !981, file: !498, line: 544, baseType: !1021, size: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!103, !987, !1024, !134}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !498, line: 478, size: 96, elements: !1026)
!1026 = !{!1027, !1033, !1038}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1025, file: !498, line: 482, baseType: !1028, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !564, line: 33, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !564, line: 29, size: 32, elements: !1030)
!1030 = !{!1031}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1029, file: !564, line: 30, baseType: !1032, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1025, file: !498, line: 485, baseType: !1034, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !498, line: 464, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !987, !1024, !544}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1025, file: !498, line: 493, baseType: !544, size: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !981, file: !498, line: 547, baseType: !1040, size: 32, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!142, !987}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !498, line: 428, size: 32, elements: !1046)
!1046 = !{!1047}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1045, file: !498, line: 434, baseType: !544, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !498, line: 441, size: 32, elements: !1051)
!1051 = !{!1052}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1050, file: !498, line: 447, baseType: !544, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !188, line: 314, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 303, size: 320, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !1056, file: !188, line: 305, baseType: !192, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !1056, file: !188, line: 306, baseType: !192, size: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !1056, file: !188, line: 307, baseType: !192, size: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !1056, file: !188, line: 308, baseType: !192, size: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !1056, file: !188, line: 309, baseType: !192, size: 32, offset: 128)
