; ModuleID = 'build/actinius_icarus/boards/stm32/power_mgmt/blinky/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %union.anon, %struct.k_thread*, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !111, file: !173, line: 65, type: !174, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !166, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!113 = !{!102, !103, !114, !119, !126}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !116, file: !115, line: 167, baseType: !125)
!115 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !115, file: !115, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!120 = !{!121, !122, !124}
!121 = !DILocalVariable(name: "time_us", arg: 1, scope: !116, file: !115, line: 134, type: !119)
!122 = !DILocalVariable(name: "delay_cycles", scope: !116, file: !115, line: 168, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!124 = !DILocalVariable(name: "cycles", scope: !116, file: !115, line: 171, type: !119)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !128, line: 1928, baseType: !129)
!128 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 1909, size: 11360, elements: !130)
!130 = !{!131, !137, !138, !139, !140, !144, !145, !146, !147, !151, !152, !156, !157, !158, !159, !160, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !129, file: !128, line: 1910, baseType: !132, size: 8192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !119)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !129, file: !128, line: 1911, baseType: !133, size: 32, offset: 8192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !129, file: !128, line: 1912, baseType: !133, size: 32, offset: 8224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !129, file: !128, line: 1913, baseType: !133, size: 32, offset: 8256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !129, file: !128, line: 1914, baseType: !141, size: 1984, offset: 8288)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1984, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 62)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !129, file: !128, line: 1915, baseType: !134, size: 32, offset: 10272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !129, file: !128, line: 1916, baseType: !133, size: 32, offset: 10304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !129, file: !128, line: 1917, baseType: !134, size: 32, offset: 10336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !129, file: !128, line: 1918, baseType: !148, size: 96, offset: 10368)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !129, file: !128, line: 1919, baseType: !134, size: 32, offset: 10464)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !129, file: !128, line: 1920, baseType: !153, size: 256, offset: 10496)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !129, file: !128, line: 1921, baseType: !134, size: 32, offset: 10752)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !129, file: !128, line: 1922, baseType: !133, size: 32, offset: 10784)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !129, file: !128, line: 1923, baseType: !134, size: 32, offset: 10816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !129, file: !128, line: 1924, baseType: !134, size: 32, offset: 10848)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !129, file: !128, line: 1925, baseType: !161, size: 416, offset: 10880)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !129, file: !128, line: 1926, baseType: !134, size: 32, offset: 11296)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !129, file: !128, line: 1927, baseType: !134, size: 32, offset: 11328)
!166 = !{!109, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !116, file: !115, line: 161, type: !169, isLocal: true, isDefinition: true, align: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !149)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !177)
!176 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !{!178, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !176, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !175, file: !176, line: 65, baseType: !182, size: 32, offset: 32)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !188, file: !243, line: 27, type: !272, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !215, globals: !240, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!190 = !{!191, !202, !209, !30}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !192, line: 27, baseType: !32, size: 32, elements: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!195 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!196 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!197 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!198 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!199 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!200 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!201 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !203, line: 53, baseType: !32, size: 32, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206, !207, !208}
!205 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!206 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!207 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!208 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !203, line: 75, baseType: !32, size: 32, elements: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!212 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!213 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!214 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!215 = !{!102, !216, !103, !24, !220, !236, !119, !238}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !217, line: 46, baseType: !218)
!217 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !219)
!219 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !222, line: 54, size: 96, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !231, !235}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !221, file: !222, line: 55, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !226, line: 33, baseType: !227)
!226 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !226, line: 29, size: 32, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !226, line: 30, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !221, file: !222, line: 60, baseType: !232, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !191}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !221, file: !222, line: 65, baseType: !232, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !239)
!239 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!240 = !{!186, !241, !247, !249, !262, !264}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !188, file: !243, line: 44, type: !244, isLocal: true, isDefinition: true)
!243 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{}
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !188, file: !243, line: 49, type: !244, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !188, file: !243, line: 36, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 128, elements: !260)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !253)
!253 = !{!254, !255, !258, !259}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !252, file: !192, line: 115, baseType: !191, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !252, file: !192, line: 141, baseType: !256, size: 8, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !257)
!257 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !252, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !252, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!260 = !{!261}
!261 = !DISubrange(count: 1)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !188, file: !243, line: 40, type: !251, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !188, file: !243, line: 28, type: !266, isLocal: true, isDefinition: true)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !226, line: 40, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !226, line: 35, size: 64, elements: !268)
!268 = !{!269, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !267, file: !226, line: 36, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !267, file: !226, line: 37, baseType: !270, size: 32, offset: 32)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 32, elements: !260)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !274, line: 22, baseType: !275)
!274 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!275 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!276 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!277 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !280, file: !312, line: 50, type: !299, isLocal: true, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !282, retainedTypes: !283, globals: !309, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!282 = !{!191, !30}
!283 = !{!284, !216, !286, !103, !102, !119, !238, !288, !236, !299, !300}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !285)
!285 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !287, line: 214, baseType: !32)
!287 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !290, line: 45, size: 64, elements: !291)
!290 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = !{!292, !298}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !289, file: !290, line: 46, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !226, line: 33, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !226, line: 29, size: 32, elements: !295)
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !226, line: 30, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !289, file: !290, line: 48, baseType: !119, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !290, line: 38, size: 64, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !301, file: !290, line: 39, baseType: !293, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !301, file: !290, line: 41, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !290, line: 35, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !299}
!309 = !{!310, !314, !322, !278, !324, !334}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "latency_lock", scope: !280, file: !312, line: 44, type: !313, isLocal: true, isDefinition: true)
!312 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, elements: !246)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !280, file: !312, line: 46, type: !316, isLocal: true, isDefinition: true)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !226, line: 40, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !226, line: 35, size: 64, elements: !318)
!318 = !{!319, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !317, file: !226, line: 36, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !317, file: !226, line: 37, baseType: !320, size: 32, offset: 32)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "latency_subs", scope: !280, file: !312, line: 52, type: !316, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !280, file: !312, line: 39, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, elements: !332)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 35, size: 96, elements: !328)
!328 = !{!329, !330, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !327, file: !312, line: 36, baseType: !191, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !327, file: !312, line: 37, baseType: !256, size: 8, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !327, file: !312, line: 38, baseType: !273, size: 32, offset: 64)
!332 = !{!333}
!333 = !DISubrange(count: 0)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !280, file: !312, line: 48, type: !299, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !338, file: !345, line: 47, type: !359, isLocal: true, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !341, globals: !342, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!340 = !{!191}
!341 = !{!286, !103}
!342 = !{!343, !336, !355}
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "cpus_states", scope: !338, file: !345, line: 50, type: !346, isLocal: true, isDefinition: true)
!345 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 32, elements: !260)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !350)
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !349, file: !192, line: 115, baseType: !191, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !349, file: !192, line: 141, baseType: !256, size: 8, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !349, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !349, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !338, file: !345, line: 55, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 8, elements: !260)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, elements: !332)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "action_target_state", scope: !362, file: !378, line: 14, type: !379, isLocal: true, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !374, globals: !375, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!364 = !{!202, !209, !365, !30}
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_flag", file: !203, line: 30, baseType: !32, size: 32, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373}
!367 = !DIEnumerator(name: "PM_DEVICE_FLAG_BUSY", value: 0)
!368 = !DIEnumerator(name: "PM_DEVICE_FLAG_TURN_ON_FAILED", value: 1)
!369 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_CAPABLE", value: 2)
!370 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_ENABLED", value: 3)
!371 = !DIEnumerator(name: "PM_DEVICE_FLAG_RUNTIME_ENABLED", value: 4)
!372 = !DIEnumerator(name: "PM_DEVICE_FLAG_STATE_LOCKED", value: 5)
!373 = !DIEnumerator(name: "PM_DEVICE_FLAG_PD", value: 6)
!374 = !{!102, !103, !24, !286}
!375 = !{!360, !376}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "action_expected_state", scope: !362, file: !378, line: 20, type: !379, isLocal: true, isDefinition: true)
!378 = !DIFile(filename: "zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 128, elements: !381)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!381 = !{!382}
!382 = !DISubrange(count: 4)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "static_regions", scope: !385, file: !392, line: 62, type: !524, isLocal: true, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !387, globals: !388, splitDebugInlining: false, nameTableKind: None)
!386 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!387 = !{!286, !103, !119, !102}
!388 = !{!389, !383}
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !391, file: !392, line: 198, type: !511, isLocal: true, isDefinition: true)
!391 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !392, file: !392, line: 175, type: !393, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !385, retainedNodes: !508)
!392 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !DISubroutineType(types: !394)
!394 = !{null, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !397, line: 245, size: 1024, elements: !398)
!397 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !{!399, !464, !477, !478, !479, !480, !486, !503}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !396, file: !397, line: 247, baseType: !400, size: 384)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !397, line: 57, size: 384, elements: !401)
!401 = !{!402, !430, !438, !439, !440, !451, !452, !453}
!402 = !DIDerivedType(tag: DW_TAG_member, scope: !400, file: !397, line: 60, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !397, line: 60, size: 64, elements: !404)
!404 = !{!405, !421}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !403, file: !397, line: 61, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !407, line: 49, baseType: !408)
!407 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !407, line: 37, size: 64, elements: !409)
!409 = !{!410, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !407, line: 38, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !407, line: 38, size: 32, elements: !412)
!412 = !{!413, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !411, file: !407, line: 39, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !407, line: 40, baseType: !414, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !407, line: 42, baseType: !417, size: 32, offset: 32)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !407, line: 42, size: 32, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !417, file: !407, line: 43, baseType: !414, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !407, line: 44, baseType: !414, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !403, file: !397, line: 62, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !423, line: 49, size: 64, elements: !424)
!423 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !422, file: !423, line: 50, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 64, elements: !428)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!428 = !{!429}
!429 = !DISubrange(count: 2)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !400, file: !397, line: 68, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !433, line: 233, baseType: !434)
!433 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 231, size: 64, elements: !435)
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !434, file: !433, line: 232, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !407, line: 48, baseType: !408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !400, file: !397, line: 71, baseType: !256, size: 8, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !400, file: !397, line: 74, baseType: !256, size: 8, offset: 104)
!440 = !DIDerivedType(tag: DW_TAG_member, scope: !400, file: !397, line: 90, baseType: !441, size: 16, offset: 112)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !397, line: 90, size: 16, elements: !442)
!442 = !{!443, !450}
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !397, line: 91, baseType: !444, size: 16)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !397, line: 91, size: 16, elements: !445)
!445 = !{!446, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !444, file: !397, line: 96, baseType: !447, size: 8)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !448)
!448 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !444, file: !397, line: 97, baseType: !256, size: 8, offset: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !441, file: !397, line: 100, baseType: !171, size: 16)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !400, file: !397, line: 107, baseType: !119, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !400, file: !397, line: 127, baseType: !102, size: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !400, file: !397, line: 131, baseType: !454, size: 192, offset: 192)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !433, line: 244, size: 192, elements: !455)
!455 = !{!456, !457, !463}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !454, file: !433, line: 245, baseType: !406, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !454, file: !433, line: 246, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !433, line: 242, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !454, file: !433, line: 249, baseType: !218, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !396, file: !397, line: 250, baseType: !465, size: 288, offset: 384)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !466, line: 25, size: 288, elements: !467)
!466 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !465, file: !466, line: 26, baseType: !119, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !465, file: !466, line: 27, baseType: !119, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !465, file: !466, line: 28, baseType: !119, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !465, file: !466, line: 29, baseType: !119, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !465, file: !466, line: 30, baseType: !119, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !465, file: !466, line: 31, baseType: !119, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !465, file: !466, line: 32, baseType: !119, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !465, file: !466, line: 33, baseType: !119, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !465, file: !466, line: 34, baseType: !119, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !396, file: !397, line: 253, baseType: !102, size: 32, offset: 672)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !396, file: !397, line: 256, baseType: !432, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !396, file: !397, line: 294, baseType: !103, size: 32, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !396, file: !397, line: 300, baseType: !481, size: 96, offset: 800)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !397, line: 149, size: 96, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !481, file: !397, line: 153, baseType: !22, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !481, file: !397, line: 162, baseType: !286, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !481, file: !397, line: 168, baseType: !286, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !396, file: !397, line: 325, baseType: !487, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !489, line: 5073, size: 160, elements: !490)
!489 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!490 = !{!491, !500, !501}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !488, file: !489, line: 5074, baseType: !492, size: 96)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !493, line: 56, size: 96, elements: !494)
!493 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!494 = !{!495, !498, !499}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !492, file: !493, line: 57, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !493, line: 57, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !492, file: !493, line: 58, baseType: !102, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !492, file: !493, line: 59, baseType: !286, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !488, file: !489, line: 5075, baseType: !432, size: 64, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !488, file: !489, line: 5076, baseType: !502, offset: 160)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, elements: !246)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !396, file: !397, line: 343, baseType: !504, size: 64, offset: 928)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !466, line: 60, size: 64, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !504, file: !466, line: 63, baseType: !119, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !504, file: !466, line: 66, baseType: !119, size: 32, offset: 32)
!508 = !{!509, !510}
!509 = !DILocalVariable(name: "thread", arg: 1, scope: !391, file: !392, line: 175, type: !395)
!510 = !DILocalVariable(name: "region_num", scope: !391, file: !392, line: 200, type: !256)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, elements: !332)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !513, line: 52, size: 96, elements: !514)
!513 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !512, file: !513, line: 53, baseType: !22, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !512, file: !513, line: 54, baseType: !286, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !512, file: !513, line: 55, baseType: !518, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !519, line: 304, baseType: !520)
!519 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 301, size: 32, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !520, file: !519, line: 302, baseType: !171, size: 16)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !520, file: !519, line: 303, baseType: !171, size: 16, offset: 16)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 96, elements: !260)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !528, file: !584, line: 39, type: !256, isLocal: true, isDefinition: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !530, globals: !575, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!530 = !{!531, !102, !103, !559}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !533, line: 1495, baseType: !534)
!533 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 1474, size: 448, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !549}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !534, file: !533, line: 1476, baseType: !133, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !534, file: !533, line: 1477, baseType: !134, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !534, file: !533, line: 1478, baseType: !134, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !534, file: !533, line: 1479, baseType: !134, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !534, file: !533, line: 1480, baseType: !134, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !534, file: !533, line: 1481, baseType: !134, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !534, file: !533, line: 1482, baseType: !134, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !534, file: !533, line: 1483, baseType: !134, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !534, file: !533, line: 1484, baseType: !134, size: 32, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !534, file: !533, line: 1485, baseType: !134, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !534, file: !533, line: 1486, baseType: !134, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !534, file: !533, line: 1487, baseType: !548, size: 32, offset: 352)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !260)
!549 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !533, line: 1488, baseType: !550, size: 64, offset: 384)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !533, line: 1488, size: 64, elements: !551)
!551 = !{!552, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !550, file: !533, line: 1489, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !428)
!554 = !DIDerivedType(tag: DW_TAG_member, scope: !550, file: !533, line: 1490, baseType: !555, size: 64)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !550, file: !533, line: 1490, size: 64, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !555, file: !533, line: 1491, baseType: !134, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !555, file: !533, line: 1492, baseType: !134, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !562, line: 27, size: 128, elements: !563)
!562 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!563 = !{!564, !565, !568}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !561, file: !562, line: 29, baseType: !119, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !561, file: !562, line: 31, baseType: !566, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !561, file: !562, line: 37, baseType: !569, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !519, line: 298, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !519, line: 289, size: 64, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !570, file: !519, line: 291, baseType: !256, size: 5, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !570, file: !519, line: 293, baseType: !256, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !570, file: !519, line: 295, baseType: !119, size: 32, offset: 32)
!575 = !{!526, !576}
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !528, file: !578, line: 31, type: !579, isLocal: true, isDefinition: true)
!578 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 160, elements: !260)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !578, line: 21, size: 160, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !580, file: !578, line: 22, baseType: !103, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !580, file: !578, line: 23, baseType: !561, size: 128, offset: 32)
!584 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !587, file: !594, line: 21, type: !106, isLocal: true, isDefinition: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !589, globals: !593, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!589 = !{!590, !103, !102}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !592, line: 22, baseType: !103)
!592 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!593 = !{!585}
!594 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !597, file: !602, line: 13, type: !621, isLocal: true, isDefinition: true)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !599, splitDebugInlining: false, nameTableKind: None)
!598 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!599 = !{!600, !595}
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "mpu_config", scope: !597, file: !602, line: 37, type: !603, isLocal: false, isDefinition: true)
!602 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !562, line: 41, size: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !604, file: !562, line: 43, baseType: !119, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !604, file: !562, line: 45, baseType: !608, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !562, line: 27, size: 128, elements: !611)
!611 = !{!612, !613, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !610, file: !562, line: 29, baseType: !119, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !562, line: 31, baseType: !566, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !610, file: !562, line: 37, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !519, line: 298, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !519, line: 289, size: 64, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !616, file: !519, line: 291, baseType: !256, size: 5, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !616, file: !519, line: 293, baseType: !256, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !616, file: !519, line: 295, baseType: !119, size: 32, offset: 32)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 256, elements: !428)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "__device_dts_ord_65", scope: !624, file: !829, line: 733, type: !935, isLocal: false, isDefinition: true, align: 32)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !626, retainedTypes: !744, globals: !825, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/stm32/power_mgmt/blinky")
!626 = !{!627, !633, !30, !638, !643, !647, !651, !655, !661, !665, !709, !716, !735}
!627 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !628, line: 23, baseType: !32, size: 32, elements: !629)
!628 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!629 = !{!630, !631, !632}
!630 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!631 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!632 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !628, line: 48, baseType: !32, size: 32, elements: !634)
!634 = !{!635, !636, !637}
!635 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!636 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!637 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 167, baseType: !32, size: 32, elements: !640)
!639 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = !{!641, !642}
!641 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!642 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 107, baseType: !32, size: 32, elements: !644)
!644 = !{!645, !646}
!645 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!646 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 208, baseType: !32, size: 32, elements: !648)
!648 = !{!649, !650}
!649 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!650 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 261, baseType: !32, size: 32, elements: !652)
!652 = !{!653, !654}
!653 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!654 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 237, baseType: !32, size: 32, elements: !656)
!656 = !{!657, !658, !659, !660}
!657 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!658 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!659 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!660 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!661 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 152, baseType: !32, size: 32, elements: !662)
!662 = !{!663, !664}
!663 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!664 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 71, baseType: !103, size: 32, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!667 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!668 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!669 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!670 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!671 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!672 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!673 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!674 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!675 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!676 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!677 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!678 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!679 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!680 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!681 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!682 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!683 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!684 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!685 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!686 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!687 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!688 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!689 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!690 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!691 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!692 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!693 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!694 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!695 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!696 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!697 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!698 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!699 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!700 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!701 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!702 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!703 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!704 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!705 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!706 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!707 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!708 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!709 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !710, line: 44, baseType: !32, size: 32, elements: !711)
!710 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !{!712, !713, !714, !715}
!712 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!713 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!714 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!715 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !717, line: 54, baseType: !32, size: 32, elements: !718)
!717 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!719 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!720 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!721 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!722 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!723 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!724 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!725 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!726 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!727 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!728 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!729 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!730 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!731 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!732 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!733 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!734 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!735 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 53, baseType: !32, size: 32, elements: !737)
!736 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!737 = !{!738, !739, !740, !741, !742, !743}
!738 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!739 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!740 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!741 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!742 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!743 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!744 = !{!627, !102, !103, !745, !787, !788, !789, !790, !216, !119, !238, !791, !792, !793, !299, !794, !824, !286}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !128, line: 923, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 883, size: 10464, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !757, !758, !759, !760, !761, !762, !763, !764, !768, !769, !770, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !747, file: !128, line: 884, baseType: !134, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !747, file: !128, line: 885, baseType: !134, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !747, file: !128, line: 886, baseType: !134, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !747, file: !128, line: 887, baseType: !134, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !747, file: !128, line: 888, baseType: !754, size: 896, offset: 128)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 28)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !747, file: !128, line: 889, baseType: !134, size: 32, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !747, file: !128, line: 890, baseType: !134, size: 32, offset: 1056)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !747, file: !128, line: 891, baseType: !134, size: 32, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !747, file: !128, line: 892, baseType: !134, size: 32, offset: 1120)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !747, file: !128, line: 893, baseType: !754, size: 896, offset: 1152)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !747, file: !128, line: 894, baseType: !134, size: 32, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !747, file: !128, line: 895, baseType: !134, size: 32, offset: 2080)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !747, file: !128, line: 896, baseType: !765, size: 960, offset: 2112)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 960, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 30)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !747, file: !128, line: 897, baseType: !134, size: 32, offset: 3072)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !747, file: !128, line: 898, baseType: !134, size: 32, offset: 3104)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !747, file: !128, line: 899, baseType: !771, size: 3008, offset: 3136)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3008, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 94)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !747, file: !128, line: 900, baseType: !134, size: 32, offset: 6144)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !747, file: !128, line: 901, baseType: !134, size: 32, offset: 6176)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !747, file: !128, line: 902, baseType: !134, size: 32, offset: 6208)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !747, file: !128, line: 903, baseType: !133, size: 32, offset: 6240)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !747, file: !128, line: 904, baseType: !141, size: 1984, offset: 6272)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !747, file: !128, line: 905, baseType: !133, size: 32, offset: 8256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !747, file: !128, line: 907, baseType: !133, size: 32, offset: 8288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !747, file: !128, line: 910, baseType: !133, size: 32, offset: 8320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !747, file: !128, line: 911, baseType: !133, size: 32, offset: 8352)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !747, file: !128, line: 913, baseType: !133, size: 32, offset: 8384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !747, file: !128, line: 917, baseType: !133, size: 32, offset: 8416)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !747, file: !128, line: 919, baseType: !141, size: 1984, offset: 8448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !747, file: !128, line: 920, baseType: !134, size: 32, offset: 10432)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !639, line: 146, baseType: !643)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !639, line: 164, baseType: !661)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!791 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !533, line: 485, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 468, size: 28704, elements: !797)
!797 = !{!798, !802, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !819, !823}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !796, file: !533, line: 470, baseType: !799, size: 512)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 16)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !796, file: !533, line: 471, baseType: !803, size: 512, offset: 512)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !796, file: !533, line: 472, baseType: !799, size: 512, offset: 1024)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !796, file: !533, line: 473, baseType: !803, size: 512, offset: 1536)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !796, file: !533, line: 474, baseType: !799, size: 512, offset: 2048)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !796, file: !533, line: 475, baseType: !803, size: 512, offset: 2560)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !796, file: !533, line: 476, baseType: !799, size: 512, offset: 3072)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !796, file: !533, line: 477, baseType: !803, size: 512, offset: 3584)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !796, file: !533, line: 478, baseType: !799, size: 512, offset: 4096)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !796, file: !533, line: 479, baseType: !803, size: 512, offset: 4608)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !796, file: !533, line: 480, baseType: !799, size: 512, offset: 5120)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !796, file: !533, line: 481, baseType: !803, size: 512, offset: 5632)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !796, file: !533, line: 482, baseType: !815, size: 3968, offset: 6144)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 3968, elements: !817)
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !256)
!817 = !{!818}
!818 = !DISubrange(count: 496)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !796, file: !533, line: 483, baseType: !820, size: 18560, offset: 10112)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 18560, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 580)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !796, file: !533, line: 484, baseType: !134, size: 32, offset: 28672)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !710, line: 56, baseType: !102)
!825 = !{!826, !876, !917, !622, !925, !954, !956, !973, !975, !985, !988, !1003, !1041, !1055}
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "on", scope: !828, file: !829, line: 549, type: !273, isLocal: true, isDefinition: true)
!828 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !829, file: !829, line: 547, type: !830, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !624, retainedNodes: !832)
!829 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!830 = !DISubroutineType(types: !831)
!831 = !{null, !633}
!832 = !{!833, !834, !837}
!833 = !DILocalVariable(name: "start_mode", arg: 1, scope: !828, file: !829, line: 547, type: !633)
!834 = !DILocalVariable(name: "err", scope: !835, file: !829, line: 553, type: !103)
!835 = distinct !DILexicalBlock(scope: !836, file: !829, line: 552, column: 31)
!836 = distinct !DILexicalBlock(scope: !828, file: !829, line: 552, column: 6)
!837 = !DILocalVariable(name: "mgr", scope: !835, file: !829, line: 554, type: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !840, line: 154, size: 224, elements: !841)
!840 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !{!842, !854, !855, !871, !873, !874, !875}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !839, file: !840, line: 158, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !226, line: 40, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !226, line: 35, size: 64, elements: !845)
!845 = !{!846, !853}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !844, file: !226, line: 36, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !226, line: 33, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !226, line: 29, size: 32, elements: !850)
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !849, file: !226, line: 30, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !844, file: !226, line: 37, baseType: !847, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !839, file: !840, line: 163, baseType: !843, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !839, file: !840, line: 166, baseType: !856, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !840, line: 133, size: 96, elements: !859)
!859 = !{!860, !869, !870}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !858, file: !840, line: 135, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !840, line: 129, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !838, !865}
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !840, line: 101, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !838, !103}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !858, file: !840, line: 138, baseType: !861, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !858, file: !840, line: 143, baseType: !861, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !839, file: !840, line: 169, baseType: !872, offset: 160)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, elements: !246)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !839, file: !840, line: 172, baseType: !103, size: 32, offset: 160)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !839, file: !840, line: 175, baseType: !171, size: 16, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !839, file: !840, line: 178, baseType: !171, size: 16, offset: 208)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "cli", scope: !828, file: !829, line: 550, type: !878, isLocal: true, isDefinition: true)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !840, line: 273, size: 128, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !878, file: !840, line: 280, baseType: !848, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !878, file: !840, line: 283, baseType: !882, size: 96, offset: 32)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !883, line: 138, size: 96, elements: !884)
!883 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = !{!885, !914, !915}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !882, file: !883, line: 149, baseType: !886, size: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !883, line: 139, size: 32, elements: !887)
!887 = !{!888, !909}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !886, file: !883, line: 145, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !489, line: 5397, size: 128, elements: !891)
!891 = !{!892, !907, !908}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !890, file: !489, line: 5399, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !407, line: 48, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !407, line: 37, size: 64, elements: !895)
!895 = !{!896, !902}
!896 = !DIDerivedType(tag: DW_TAG_member, scope: !894, file: !407, line: 38, baseType: !897, size: 32)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !894, file: !407, line: 38, size: 32, elements: !898)
!898 = !{!899, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !897, file: !407, line: 39, baseType: !900, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !897, file: !407, line: 40, baseType: !900, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, scope: !894, file: !407, line: 42, baseType: !903, size: 32, offset: 32)
!903 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !894, file: !407, line: 42, size: 32, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !903, file: !407, line: 43, baseType: !900, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !903, file: !407, line: 44, baseType: !900, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !890, file: !489, line: 5405, baseType: !32, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !890, file: !489, line: 5408, baseType: !103, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !886, file: !883, line: 148, baseType: !910, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !883, line: 98, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DISubroutineType(types: !913)
!913 = !{null, null}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !882, file: !883, line: 165, baseType: !134, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !882, file: !883, line: 174, baseType: !916, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !624, file: !829, line: 733, type: !919, isLocal: false, isDefinition: true, align: 16)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 80, elements: !923)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !922, line: 43, baseType: !284)
!922 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!923 = !{!924}
!924 = !DISubrange(count: 5)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_65", scope: !624, file: !829, line: 733, type: !927, isLocal: true, isDefinition: true, align: 32)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !929)
!929 = !{!930, !953}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !928, file: !176, line: 60, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!103, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !922, line: 378, size: 224, elements: !937)
!937 = !{!938, !939, !940, !941, !947, !948, !950}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !922, line: 380, baseType: !566, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !936, file: !922, line: 382, baseType: !13, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !936, file: !922, line: 384, baseType: !13, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !936, file: !922, line: 386, baseType: !942, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !922, line: 351, size: 16, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !943, file: !922, line: 359, baseType: !256, size: 8)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !943, file: !922, line: 364, baseType: !791, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !936, file: !922, line: 388, baseType: !102, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !936, file: !922, line: 396, baseType: !949, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !936, file: !922, line: 403, baseType: !951, size: 32, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !922, line: 367, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !928, file: !176, line: 65, baseType: !934, size: 32, offset: 32)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !624, file: !829, line: 79, type: !273, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "data", scope: !624, file: !829, line: 702, type: !958, isLocal: true, isDefinition: true)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !829, line: 69, size: 640, elements: !959)
!959 = !{!960, !962}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !958, file: !829, line: 70, baseType: !961, size: 448)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 448, elements: !428)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !958, file: !829, line: 71, baseType: !963, size: 192, offset: 448)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 192, elements: !428)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !829, line: 52, size: 96, elements: !965)
!965 = !{!966, !971, !972}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !964, file: !829, line: 53, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !710, line: 72, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !934, !824, !102}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !964, file: !829, line: 54, baseType: !102, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !829, line: 55, baseType: !119, size: 32, offset: 64)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_65", scope: !624, file: !829, line: 733, type: !943, isLocal: true, isDefinition: true, align: 8)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "d", scope: !977, file: !829, line: 476, type: !983, isLocal: true, isDefinition: true)
!977 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !829, file: !829, line: 474, type: !830, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !624, retainedNodes: !978)
!978 = !{!979, !980, !981, !982}
!979 = !DILocalVariable(name: "mode", arg: 1, scope: !977, file: !829, line: 474, type: !633)
!980 = !DILocalVariable(name: "type", scope: !977, file: !829, line: 486, type: !787)
!981 = !DILocalVariable(name: "isr_mode", scope: !977, file: !829, line: 500, type: !791)
!982 = !DILocalVariable(name: "key", scope: !977, file: !829, line: 501, type: !103)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !639, line: 177, baseType: !638)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "target_type", scope: !977, file: !829, line: 477, type: !987, isLocal: true, isDefinition: true)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "config", scope: !624, file: !829, line: 704, type: !990, isLocal: true, isDefinition: true)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !829, line: 74, size: 128, elements: !992)
!992 = !{!993}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !991, file: !829, line: 76, baseType: !994, size: 128)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 128, elements: !428)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !829, line: 61, size: 64, elements: !996)
!996 = !{!997, !1002}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !995, file: !829, line: 62, baseType: !998, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !829, line: 58, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{null}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !995, file: !829, line: 63, baseType: !998, size: 32, offset: 32)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !624, file: !829, line: 695, type: !1005, isLocal: true, isDefinition: true)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !710, line: 100, size: 224, elements: !1007)
!1007 = !{!1008, !1013, !1014, !1019, !1025, !1030, !1036}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1006, file: !710, line: 101, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !710, line: 76, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!103, !934, !824}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1006, file: !710, line: 102, baseType: !1009, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1006, file: !710, line: 103, baseType: !1015, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !710, line: 83, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!103, !934, !824, !967, !102}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1006, file: !710, line: 104, baseType: !1020, size: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !710, line: 79, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!103, !934, !824, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1006, file: !710, line: 105, baseType: !1026, size: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !710, line: 88, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!709, !934, !824}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1006, file: !710, line: 106, baseType: !1031, size: 32, offset: 160)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !710, line: 92, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!103, !934, !824, !1035}
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !710, line: 64, baseType: !102)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1006, file: !710, line: 107, baseType: !1037, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !710, line: 96, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!103, !934, !824, !102}
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "transitions", scope: !1043, file: !829, line: 655, type: !857, isLocal: true, isDefinition: true)
!1043 = distinct !DISubprogram(name: "clk_init", scope: !829, file: !829, line: 651, type: !932, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !624, retainedNodes: !1044)
!1044 = !{!1045, !1046, !1048, !1049, !1051}
!1045 = !DILocalVariable(name: "dev", arg: 1, scope: !1043, file: !829, line: 651, type: !934)
!1046 = !DILocalVariable(name: "nrfx_err", scope: !1043, file: !829, line: 653, type: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !717, line: 72, baseType: !716)
!1048 = !DILocalVariable(name: "err", scope: !1043, file: !829, line: 654, type: !103)
!1049 = !DILocalVariable(name: "i", scope: !1050, file: !829, line: 678, type: !627)
!1050 = distinct !DILexicalBlock(scope: !1043, file: !829, line: 678, column: 2)
!1051 = !DILocalVariable(name: "subdata", scope: !1052, file: !829, line: 680, type: !1054)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !829, line: 679, column: 42)
!1053 = distinct !DILexicalBlock(scope: !1050, file: !829, line: 678, column: 2)
