; ModuleID = './build/ept_configure_pins_by_ept.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.GPIO_REGISTER_T = type { [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIN_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [4 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [2 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [7 x %struct.GPIO_DIR_REGISTER_T], [144 x i8], [4 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [6 x %struct.GPIO_DIN_REGISTER_T] }
%struct.GPIO_DIN_REGISTER_T = type { i32, [12 x i8] }
%struct.GPIO_DIR_REGISTER_T = type { i32, i32, i32, [4 x i8] }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "gpio_base_add", scope: !2, file: !3, line: 41, type: !5, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/ept/src/bsp_gpio_ept_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!4 = !{!0}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !7, line: 1554, baseType: !8)
!7 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1522, size: 29440, elements: !9)
!9 = !{!10, !33, !37, !46, !47, !56, !57, !66, !67, !77, !78, !87, !88, !97, !98, !107, !108, !117, !121, !130, !131, !140, !141, !150, !159, !160, !171, !175, !184, !185}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !8, file: !7, line: 1523, baseType: !11, size: 256)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 256, elements: !31)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !7, line: 1400, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1395, size: 128, elements: !14)
!14 = !{!15, !22, !23, !24}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !13, file: !7, line: 1396, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 48, baseType: !19)
!18 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 79, baseType: !21)
!20 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !13, file: !7, line: 1397, baseType: !16, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !13, file: !7, line: 1398, baseType: !16, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !13, file: !7, line: 1399, baseType: !25, size: 32, offset: 96)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !29)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 43, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !{!30}
!30 = !DISubrange(count: 4)
!31 = !{!32}
!32 = !DISubrange(count: 2)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !8, file: !7, line: 1524, baseType: !34, size: 1792, offset: 256)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1792, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 224)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !8, file: !7, line: 1525, baseType: !38, size: 256, offset: 2048)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !31)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !7, line: 1409, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1404, size: 128, elements: !41)
!41 = !{!42, !43, !44, !45}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !40, file: !7, line: 1405, baseType: !16, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !40, file: !7, line: 1406, baseType: !16, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !40, file: !7, line: 1407, baseType: !16, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !40, file: !7, line: 1408, baseType: !25, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !8, file: !7, line: 1526, baseType: !34, size: 1792, offset: 2304)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !8, file: !7, line: 1527, baseType: !48, size: 256, offset: 4096)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 256, elements: !31)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !7, line: 1417, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1412, size: 128, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !50, file: !7, line: 1413, baseType: !16, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !50, file: !7, line: 1414, baseType: !16, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !50, file: !7, line: 1415, baseType: !16, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !50, file: !7, line: 1416, baseType: !25, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !8, file: !7, line: 1528, baseType: !34, size: 1792, offset: 4352)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !8, file: !7, line: 1529, baseType: !58, size: 256, offset: 6144)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !31)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !7, line: 1426, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1421, size: 128, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !60, file: !7, line: 1422, baseType: !16, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !60, file: !7, line: 1423, baseType: !16, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !60, file: !7, line: 1424, baseType: !16, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !60, file: !7, line: 1425, baseType: !25, size: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !8, file: !7, line: 1530, baseType: !34, size: 1792, offset: 6400)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !8, file: !7, line: 1531, baseType: !68, size: 256, offset: 8192)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !31)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !7, line: 1432, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1429, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !70, file: !7, line: 1430, baseType: !16, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !70, file: !7, line: 1431, baseType: !74, size: 96, offset: 32)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 12)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !8, file: !7, line: 1532, baseType: !34, size: 1792, offset: 8448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !8, file: !7, line: 1533, baseType: !79, size: 256, offset: 10240)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 256, elements: !31)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !7, line: 1440, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1435, size: 128, elements: !82)
!82 = !{!83, !84, !85, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !81, file: !7, line: 1436, baseType: !16, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !81, file: !7, line: 1437, baseType: !16, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !81, file: !7, line: 1438, baseType: !16, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !81, file: !7, line: 1439, baseType: !25, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !8, file: !7, line: 1534, baseType: !34, size: 1792, offset: 10496)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !8, file: !7, line: 1535, baseType: !89, size: 256, offset: 12288)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 256, elements: !31)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !7, line: 1448, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1443, size: 128, elements: !92)
!92 = !{!93, !94, !95, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !91, file: !7, line: 1444, baseType: !16, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !91, file: !7, line: 1445, baseType: !16, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !91, file: !7, line: 1446, baseType: !16, size: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !91, file: !7, line: 1447, baseType: !25, size: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !8, file: !7, line: 1536, baseType: !34, size: 1792, offset: 12544)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !8, file: !7, line: 1537, baseType: !99, size: 256, offset: 14336)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 256, elements: !31)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !7, line: 1455, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1450, size: 128, elements: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !101, file: !7, line: 1451, baseType: !16, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !101, file: !7, line: 1452, baseType: !16, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !101, file: !7, line: 1453, baseType: !16, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !101, file: !7, line: 1454, baseType: !25, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !8, file: !7, line: 1538, baseType: !34, size: 1792, offset: 14592)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !8, file: !7, line: 1539, baseType: !109, size: 512, offset: 16384)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 512, elements: !29)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !7, line: 1463, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1458, size: 128, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !111, file: !7, line: 1459, baseType: !16, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !111, file: !7, line: 1460, baseType: !16, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !111, file: !7, line: 1461, baseType: !16, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !111, file: !7, line: 1462, baseType: !25, size: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !8, file: !7, line: 1540, baseType: !118, size: 1536, offset: 16896)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1536, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !8, file: !7, line: 1541, baseType: !122, size: 256, offset: 18432)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 256, elements: !31)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !7, line: 1471, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1466, size: 128, elements: !125)
!125 = !{!126, !127, !128, !129}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !124, file: !7, line: 1467, baseType: !16, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !124, file: !7, line: 1468, baseType: !16, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !124, file: !7, line: 1469, baseType: !16, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !124, file: !7, line: 1470, baseType: !25, size: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !8, file: !7, line: 1542, baseType: !34, size: 1792, offset: 18688)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !8, file: !7, line: 1543, baseType: !132, size: 256, offset: 20480)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !31)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !7, line: 1480, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1475, size: 128, elements: !135)
!135 = !{!136, !137, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !134, file: !7, line: 1476, baseType: !16, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !134, file: !7, line: 1477, baseType: !16, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !134, file: !7, line: 1478, baseType: !16, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !134, file: !7, line: 1479, baseType: !25, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !8, file: !7, line: 1544, baseType: !34, size: 1792, offset: 20736)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !8, file: !7, line: 1545, baseType: !142, size: 256, offset: 22528)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 256, elements: !31)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !7, line: 1489, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1484, size: 128, elements: !145)
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !144, file: !7, line: 1485, baseType: !16, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !144, file: !7, line: 1486, baseType: !16, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !144, file: !7, line: 1487, baseType: !16, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !144, file: !7, line: 1488, baseType: !25, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !8, file: !7, line: 1546, baseType: !151, size: 256, offset: 22784)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 256, elements: !31)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !7, line: 1497, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1492, size: 128, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !153, file: !7, line: 1493, baseType: !16, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !153, file: !7, line: 1494, baseType: !16, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !153, file: !7, line: 1495, baseType: !16, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !153, file: !7, line: 1496, baseType: !25, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !8, file: !7, line: 1547, baseType: !118, size: 1536, offset: 23040)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !8, file: !7, line: 1548, baseType: !161, size: 896, offset: 24576)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 896, elements: !169)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !7, line: 1505, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1500, size: 128, elements: !164)
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !163, file: !7, line: 1501, baseType: !16, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !163, file: !7, line: 1502, baseType: !16, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !163, file: !7, line: 1503, baseType: !16, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !163, file: !7, line: 1504, baseType: !25, size: 32, offset: 96)
!169 = !{!170}
!170 = !DISubrange(count: 7)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !8, file: !7, line: 1549, baseType: !172, size: 1152, offset: 25472)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1152, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 144)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !8, file: !7, line: 1550, baseType: !176, size: 512, offset: 26624)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 512, elements: !29)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !7, line: 1513, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1508, size: 128, elements: !179)
!179 = !{!180, !181, !182, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !178, file: !7, line: 1509, baseType: !16, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !178, file: !7, line: 1510, baseType: !16, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !178, file: !7, line: 1511, baseType: !16, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !178, file: !7, line: 1512, baseType: !25, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !8, file: !7, line: 1551, baseType: !118, size: 1536, offset: 27136)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !8, file: !7, line: 1552, baseType: !186, size: 768, offset: 28672)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 768, elements: !192)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !7, line: 1519, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1516, size: 128, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !188, file: !7, line: 1517, baseType: !16, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !188, file: !7, line: 1518, baseType: !74, size: 96, offset: 32)
!192 = !{!193}
!193 = !DISubrange(count: 6)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !196, file: !197, line: 51, type: !277, isLocal: false, isDefinition: true)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !198, retainedTypes: !246, globals: !276, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!198 = !{!199, !211, !230, !237}
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !200, line: 163, baseType: !201, size: 32, elements: !202)
!200 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!201 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210}
!203 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!204 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!205 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!206 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!207 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!208 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!209 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!210 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !200, line: 186, baseType: !21, size: 32, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!213 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!214 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!215 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!216 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!217 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!218 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!219 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!220 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!221 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!222 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!223 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!224 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!225 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!226 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!227 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!228 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!229 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !200, line: 176, baseType: !21, size: 32, elements: !231)
!231 = !{!232, !233, !234, !235, !236}
!232 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!233 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!234 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!235 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!236 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !238, line: 98, baseType: !21, size: 32, elements: !239)
!238 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!239 = !{!240, !241, !242, !243, !244, !245}
!240 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!241 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!242 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!243 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!244 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!245 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!246 = !{!247, !275}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !7, line: 276, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 260, size: 525312, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !265, !266, !270, !274}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !249, file: !7, line: 261, baseType: !16, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !249, file: !7, line: 262, baseType: !16, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !249, file: !7, line: 263, baseType: !16, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !249, file: !7, line: 264, baseType: !16, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !249, file: !7, line: 265, baseType: !16, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !249, file: !7, line: 266, baseType: !16, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !249, file: !7, line: 267, baseType: !16, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !249, file: !7, line: 268, baseType: !16, size: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !249, file: !7, line: 269, baseType: !16, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !249, file: !7, line: 270, baseType: !16, size: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !249, file: !7, line: 271, baseType: !262, size: 32, offset: 320)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 1)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !249, file: !7, line: 272, baseType: !16, size: 32, offset: 352)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !249, file: !7, line: 273, baseType: !267, size: 523904, offset: 384)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 523904, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 16372)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !249, file: !7, line: 274, baseType: !271, size: 512, offset: 524288)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 16)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !249, file: !7, line: 275, baseType: !271, size: 512, offset: 524800)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!276 = !{!194}
!277 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !278)
!278 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !281, file: !282, line: 48, type: !526, isLocal: false, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !283, retainedTypes: !450, globals: !465, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!283 = !{!284, !344, !349, !355, !432, !441, !446}
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 1170, baseType: !21, size: 32, elements: !286)
!285 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!287 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!288 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!289 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!290 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!291 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!292 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!293 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!294 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!295 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!296 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!297 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!298 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!299 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!300 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!301 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!302 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!303 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!304 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!305 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!306 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!307 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!308 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!309 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!310 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!311 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!312 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!313 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!314 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!315 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!316 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!317 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!318 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!319 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!320 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!321 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!322 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!323 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!324 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!325 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!326 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!327 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!328 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!329 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!330 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!331 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!332 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!333 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!334 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!335 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!336 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!337 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!338 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!339 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!340 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!341 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!342 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!343 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !345, line: 82, baseType: !21, size: 32, elements: !346)
!345 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!346 = !{!347, !348}
!347 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!348 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !345, line: 75, baseType: !21, size: 32, elements: !350)
!350 = !{!351, !352, !353, !354}
!351 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!352 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!353 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!354 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !7, line: 44, baseType: !201, size: 32, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431}
!357 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!358 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!359 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!360 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!361 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!362 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!363 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!364 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!365 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!366 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!367 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!368 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!369 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!370 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!371 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!372 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!373 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!374 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!375 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!376 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!377 = !DIEnumerator(name: "KP_IRQn", value: 10)
!378 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!379 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!380 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!381 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!382 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!383 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!384 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!385 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!386 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!387 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!388 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!389 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!390 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!391 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!392 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!393 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!394 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!395 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!396 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!397 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!398 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!399 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!400 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!401 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!402 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!403 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!404 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!405 = !DIEnumerator(name: "SF_IRQn", value: 38)
!406 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!407 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!408 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!409 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!410 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!411 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!412 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!413 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!414 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!415 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!416 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!417 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!418 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!419 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!420 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!421 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!422 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!423 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!424 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!425 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!426 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!427 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!428 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!429 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!430 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!431 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 846, baseType: !21, size: 32, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440}
!434 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!435 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!436 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!437 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!438 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!439 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!440 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!441 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !442, line: 380, baseType: !21, size: 32, elements: !443)
!442 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!443 = !{!444, !445}
!444 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!445 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !442, line: 397, baseType: !21, size: 32, elements: !447)
!447 = !{!448, !449}
!448 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!449 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!450 = !{!17, !451, !275}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !7, line: 1272, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1262, size: 288, elements: !454)
!454 = !{!455, !456, !457, !458, !460, !461, !462, !463, !464}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !453, file: !7, line: 1263, baseType: !16, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !453, file: !7, line: 1264, baseType: !16, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !453, file: !7, line: 1265, baseType: !16, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !453, file: !7, line: 1266, baseType: !459, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !453, file: !7, line: 1267, baseType: !16, size: 32, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !453, file: !7, line: 1268, baseType: !16, size: 32, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !453, file: !7, line: 1269, baseType: !16, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !453, file: !7, line: 1270, baseType: !16, size: 32, offset: 224)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !453, file: !7, line: 1271, baseType: !16, size: 32, offset: 256)
!465 = !{!279, !466, !475, !481, !501, !524}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !281, file: !282, line: 49, type: !468, isLocal: false, isDefinition: true)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !7, line: 1260, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1256, size: 96, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !470, file: !7, line: 1257, baseType: !459, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !470, file: !7, line: 1258, baseType: !16, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !470, file: !7, line: 1259, baseType: !16, size: 32, offset: 64)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "flag", scope: !477, file: !282, line: 88, type: !278, isLocal: true, isDefinition: true)
!477 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !282, file: !282, line: 86, type: !478, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !281, retainedNodes: !480)
!478 = !DISubroutineType(types: !479)
!479 = !{null}
!480 = !{}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !281, file: !282, line: 51, type: !483, isLocal: false, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 768, elements: !192)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !345, line: 116, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 111, size: 128, elements: !486)
!486 = !{!487, !489, !499, !500}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !485, file: !345, line: 112, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !442, line: 400, baseType: !446)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !485, file: !345, line: 113, baseType: !490, size: 64, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !345, line: 109, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 106, size: 64, elements: !492)
!492 = !{!493, !498}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !491, file: !345, line: 107, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !442, line: 371, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !275}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !491, file: !345, line: 108, baseType: !275, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !485, file: !345, line: 114, baseType: !278, size: 8, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !485, file: !345, line: 115, baseType: !278, size: 8, offset: 104)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !281, file: !282, line: 52, type: !503, isLocal: false, isDefinition: true)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !345, line: 134, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 125, size: 4256, elements: !505)
!505 = !{!506, !517, !518, !519, !520, !521, !522, !523}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !504, file: !345, line: 126, baseType: !507, size: 4096)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 4096, elements: !515)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !345, line: 123, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 118, size: 128, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !509, file: !345, line: 119, baseType: !490, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !509, file: !345, line: 120, baseType: !17, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !509, file: !345, line: 121, baseType: !278, size: 8, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !509, file: !345, line: 122, baseType: !278, size: 8, offset: 104)
!515 = !{!516}
!516 = !DISubrange(count: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !504, file: !345, line: 127, baseType: !17, size: 32, offset: 4096)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !504, file: !345, line: 128, baseType: !17, size: 32, offset: 4128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !504, file: !345, line: 129, baseType: !17, size: 32, offset: 4160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !504, file: !345, line: 130, baseType: !17, size: 32, offset: 4192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !504, file: !345, line: 131, baseType: !278, size: 8, offset: 4224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !504, file: !345, line: 132, baseType: !278, size: 8, offset: 4232)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !504, file: !345, line: 133, baseType: !278, size: 8, offset: 4240)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !281, file: !282, line: 53, type: !17, isLocal: false, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 192, elements: !192)
!527 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !530, file: !531, line: 64, type: !631, isLocal: false, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !532, retainedTypes: !626, globals: !630, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!532 = !{!533, !585, !592, !596, !602, !606, !615, !620}
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 339, baseType: !21, size: 32, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!535 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!536 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!537 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!538 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!539 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!540 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!541 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!542 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!543 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!544 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!545 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!546 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!547 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!548 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!549 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!550 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!551 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!552 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!553 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!554 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!555 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!556 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!557 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!558 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!559 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!560 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!561 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!562 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!563 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!564 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!565 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!566 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!567 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!568 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!569 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!570 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!571 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!572 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!573 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!574 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!575 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!576 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!577 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!578 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!579 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!580 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!581 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!582 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!583 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!584 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !586, line: 224, baseType: !201, size: 32, elements: !587)
!586 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!587 = !{!588, !589, !590, !591}
!588 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!589 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!590 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!591 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !586, line: 210, baseType: !21, size: 32, elements: !593)
!593 = !{!594, !595}
!594 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!595 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !586, line: 233, baseType: !201, size: 32, elements: !597)
!597 = !{!598, !599, !600, !601}
!598 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!599 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!600 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!601 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !586, line: 217, baseType: !21, size: 32, elements: !603)
!603 = !{!604, !605}
!604 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!605 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 415, baseType: !21, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614}
!608 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!609 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!610 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!611 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!612 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!613 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!614 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 427, baseType: !21, size: 32, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!618 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!619 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !586, line: 242, baseType: !21, size: 32, elements: !621)
!621 = !{!622, !623, !624, !625}
!622 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!623 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!624 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!625 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!626 = !{!275, !627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !586, line: 213, baseType: !592)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !586, line: 220, baseType: !602)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !586, line: 247, baseType: !620)
!630 = !{!528}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !7, line: 1554, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1522, size: 29440, elements: !634)
!634 = !{!635, !644, !645, !654, !655, !664, !665, !674, !675, !682, !683, !692, !693, !702, !703, !712, !713, !722, !723, !732, !733, !742, !743, !752, !761, !762, !771, !772, !781, !782}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !633, file: !7, line: 1523, baseType: !636, size: 256)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 256, elements: !31)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !7, line: 1400, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1395, size: 128, elements: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !638, file: !7, line: 1396, baseType: !16, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !638, file: !7, line: 1397, baseType: !16, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !638, file: !7, line: 1398, baseType: !16, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !638, file: !7, line: 1399, baseType: !25, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !633, file: !7, line: 1524, baseType: !34, size: 1792, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !633, file: !7, line: 1525, baseType: !646, size: 256, offset: 2048)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 256, elements: !31)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !7, line: 1409, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1404, size: 128, elements: !649)
!649 = !{!650, !651, !652, !653}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !648, file: !7, line: 1405, baseType: !16, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !648, file: !7, line: 1406, baseType: !16, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !648, file: !7, line: 1407, baseType: !16, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !648, file: !7, line: 1408, baseType: !25, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !633, file: !7, line: 1526, baseType: !34, size: 1792, offset: 2304)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !633, file: !7, line: 1527, baseType: !656, size: 256, offset: 4096)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 256, elements: !31)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !7, line: 1417, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1412, size: 128, elements: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !658, file: !7, line: 1413, baseType: !16, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !658, file: !7, line: 1414, baseType: !16, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !658, file: !7, line: 1415, baseType: !16, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !658, file: !7, line: 1416, baseType: !25, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !633, file: !7, line: 1528, baseType: !34, size: 1792, offset: 4352)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !633, file: !7, line: 1529, baseType: !666, size: 256, offset: 6144)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 256, elements: !31)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !7, line: 1426, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1421, size: 128, elements: !669)
!669 = !{!670, !671, !672, !673}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !668, file: !7, line: 1422, baseType: !16, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !668, file: !7, line: 1423, baseType: !16, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !668, file: !7, line: 1424, baseType: !16, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !668, file: !7, line: 1425, baseType: !25, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !633, file: !7, line: 1530, baseType: !34, size: 1792, offset: 6400)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !633, file: !7, line: 1531, baseType: !676, size: 256, offset: 8192)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 256, elements: !31)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !7, line: 1432, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1429, size: 128, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !678, file: !7, line: 1430, baseType: !16, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !678, file: !7, line: 1431, baseType: !74, size: 96, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !633, file: !7, line: 1532, baseType: !34, size: 1792, offset: 8448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !633, file: !7, line: 1533, baseType: !684, size: 256, offset: 10240)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 256, elements: !31)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !7, line: 1440, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1435, size: 128, elements: !687)
!687 = !{!688, !689, !690, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !686, file: !7, line: 1436, baseType: !16, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !686, file: !7, line: 1437, baseType: !16, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !686, file: !7, line: 1438, baseType: !16, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !686, file: !7, line: 1439, baseType: !25, size: 32, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !633, file: !7, line: 1534, baseType: !34, size: 1792, offset: 10496)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !633, file: !7, line: 1535, baseType: !694, size: 256, offset: 12288)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 256, elements: !31)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !7, line: 1448, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1443, size: 128, elements: !697)
!697 = !{!698, !699, !700, !701}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !696, file: !7, line: 1444, baseType: !16, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !696, file: !7, line: 1445, baseType: !16, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !696, file: !7, line: 1446, baseType: !16, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !696, file: !7, line: 1447, baseType: !25, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !633, file: !7, line: 1536, baseType: !34, size: 1792, offset: 12544)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !633, file: !7, line: 1537, baseType: !704, size: 256, offset: 14336)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 256, elements: !31)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !7, line: 1455, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1450, size: 128, elements: !707)
!707 = !{!708, !709, !710, !711}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !706, file: !7, line: 1451, baseType: !16, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !706, file: !7, line: 1452, baseType: !16, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !706, file: !7, line: 1453, baseType: !16, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !706, file: !7, line: 1454, baseType: !25, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !633, file: !7, line: 1538, baseType: !34, size: 1792, offset: 14592)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !633, file: !7, line: 1539, baseType: !714, size: 512, offset: 16384)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 512, elements: !29)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !7, line: 1463, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1458, size: 128, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !716, file: !7, line: 1459, baseType: !16, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !716, file: !7, line: 1460, baseType: !16, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !716, file: !7, line: 1461, baseType: !16, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !716, file: !7, line: 1462, baseType: !25, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !633, file: !7, line: 1540, baseType: !118, size: 1536, offset: 16896)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !633, file: !7, line: 1541, baseType: !724, size: 256, offset: 18432)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 256, elements: !31)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !7, line: 1471, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1466, size: 128, elements: !727)
!727 = !{!728, !729, !730, !731}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !726, file: !7, line: 1467, baseType: !16, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !726, file: !7, line: 1468, baseType: !16, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !726, file: !7, line: 1469, baseType: !16, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !726, file: !7, line: 1470, baseType: !25, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !633, file: !7, line: 1542, baseType: !34, size: 1792, offset: 18688)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !633, file: !7, line: 1543, baseType: !734, size: 256, offset: 20480)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 256, elements: !31)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !7, line: 1480, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1475, size: 128, elements: !737)
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !736, file: !7, line: 1476, baseType: !16, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !736, file: !7, line: 1477, baseType: !16, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !736, file: !7, line: 1478, baseType: !16, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !736, file: !7, line: 1479, baseType: !25, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !633, file: !7, line: 1544, baseType: !34, size: 1792, offset: 20736)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !633, file: !7, line: 1545, baseType: !744, size: 256, offset: 22528)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 256, elements: !31)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !7, line: 1489, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1484, size: 128, elements: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !746, file: !7, line: 1485, baseType: !16, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !746, file: !7, line: 1486, baseType: !16, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !746, file: !7, line: 1487, baseType: !16, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !746, file: !7, line: 1488, baseType: !25, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !633, file: !7, line: 1546, baseType: !753, size: 256, offset: 22784)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 256, elements: !31)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !7, line: 1497, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1492, size: 128, elements: !756)
!756 = !{!757, !758, !759, !760}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !755, file: !7, line: 1493, baseType: !16, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !755, file: !7, line: 1494, baseType: !16, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !755, file: !7, line: 1495, baseType: !16, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !755, file: !7, line: 1496, baseType: !25, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !633, file: !7, line: 1547, baseType: !118, size: 1536, offset: 23040)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !633, file: !7, line: 1548, baseType: !763, size: 896, offset: 24576)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 896, elements: !169)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !7, line: 1505, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1500, size: 128, elements: !766)
!766 = !{!767, !768, !769, !770}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !765, file: !7, line: 1501, baseType: !16, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !765, file: !7, line: 1502, baseType: !16, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !765, file: !7, line: 1503, baseType: !16, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !765, file: !7, line: 1504, baseType: !25, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !633, file: !7, line: 1549, baseType: !172, size: 1152, offset: 25472)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !633, file: !7, line: 1550, baseType: !773, size: 512, offset: 26624)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 512, elements: !29)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !7, line: 1513, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1508, size: 128, elements: !776)
!776 = !{!777, !778, !779, !780}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !775, file: !7, line: 1509, baseType: !16, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !775, file: !7, line: 1510, baseType: !16, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !775, file: !7, line: 1511, baseType: !16, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !775, file: !7, line: 1512, baseType: !25, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !633, file: !7, line: 1551, baseType: !118, size: 1536, offset: 27136)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !633, file: !7, line: 1552, baseType: !783, size: 768, offset: 28672)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 768, elements: !192)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !7, line: 1519, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 1516, size: 128, elements: !786)
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !785, file: !7, line: 1517, baseType: !16, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !785, file: !7, line: 1518, baseType: !74, size: 96, offset: 32)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !791, file: !792, line: 101, type: !940, isLocal: true, isDefinition: true)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !793, retainedTypes: !890, globals: !899, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!793 = !{!794, !801, !816, !822, !828, !833, !840, !856, !862, !866, !871, !878, !886}
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 180, baseType: !21, size: 32, elements: !795)
!795 = !{!796, !797, !798, !799, !800}
!796 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!797 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!798 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!799 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!800 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !802, line: 189, baseType: !21, size: 32, elements: !803)
!802 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!804 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!805 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!806 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!807 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!808 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!809 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!810 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!811 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!812 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!813 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!814 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!815 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!816 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 355, baseType: !201, size: 32, elements: !818)
!817 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!818 = !{!819, !820, !821}
!819 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!820 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!821 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!822 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !802, line: 206, baseType: !201, size: 32, elements: !823)
!823 = !{!824, !825, !826, !827}
!824 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!825 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!826 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!827 = !DIEnumerator(name: "VDMA_OK", value: 0)
!828 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !792, line: 65, baseType: !21, size: 32, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!831 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!832 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 345, baseType: !201, size: 32, elements: !834)
!834 = !{!835, !836, !837, !838, !839}
!835 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!836 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!837 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!838 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!839 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!840 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 302, baseType: !21, size: 32, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!842 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!843 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!844 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!845 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!846 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!847 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!848 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!849 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!850 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!851 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!852 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!853 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!854 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!855 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 321, baseType: !21, size: 32, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!859 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!860 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!861 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 330, baseType: !21, size: 32, elements: !863)
!863 = !{!864, !865}
!864 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!865 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 337, baseType: !21, size: 32, elements: !867)
!867 = !{!868, !869, !870}
!868 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!869 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!870 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!871 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !872, line: 101, baseType: !201, size: 32, elements: !873)
!872 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!873 = !{!874, !875, !876, !877}
!874 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!875 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!876 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!877 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !879, line: 152, baseType: !201, size: 32, elements: !880)
!879 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!880 = !{!881, !882, !883, !884, !885}
!881 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!882 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!883 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!884 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!885 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !802, line: 222, baseType: !201, size: 32, elements: !887)
!887 = !{!888, !889}
!888 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!889 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!890 = !{!275, !17, !891}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !893, line: 96, baseType: !894)
!893 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !893, line: 93, size: 64, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !894, file: !893, line: 94, baseType: !278, size: 8)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !894, file: !893, line: 95, baseType: !898, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !285, line: 186, baseType: !794)
!899 = !{!789, !900, !913, !918, !932, !938}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !791, file: !792, line: 102, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 256, elements: !29)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !792, line: 74, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !792, line: 71, size: 64, elements: !905)
!905 = !{!906, !912}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !904, file: !792, line: 72, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !817, line: 410, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !911, !275}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !817, line: 359, baseType: !816)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !904, file: !792, line: 73, baseType: !275, size: 32, offset: 32)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !791, file: !792, line: 103, type: !915, isLocal: true, isDefinition: true)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 512, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 8)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !791, file: !792, line: 104, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 896, elements: !29)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !817, line: 390, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !817, line: 382, size: 224, elements: !923)
!923 = !{!924, !926, !927, !928, !929, !930, !931}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !922, file: !817, line: 383, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !922, file: !817, line: 384, baseType: !17, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !922, file: !817, line: 385, baseType: !17, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !922, file: !817, line: 386, baseType: !925, size: 32, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !922, file: !817, line: 387, baseType: !17, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !922, file: !817, line: 388, baseType: !17, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !922, file: !817, line: 389, baseType: !17, size: 32, offset: 192)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !791, file: !792, line: 105, type: !934, isLocal: true, isDefinition: true)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 416, elements: !936)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!936 = !{!937}
!937 = !DISubrange(count: 13)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !791, file: !792, line: 90, type: !278, isLocal: true, isDefinition: true)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 128, elements: !29)
!941 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !792, line: 69, baseType: !828)
!943 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !946, file: !947, line: 53, type: !1027, isLocal: false, isDefinition: true)
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !948, retainedTypes: !959, globals: !1015, splitDebugInlining: false, nameTableKind: None)
!947 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!948 = !{!284, !355, !801, !794, !949}
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !893, line: 46, baseType: !21, size: 32, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958}
!951 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!952 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!953 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!954 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!955 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!956 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!957 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!958 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !7, line: 588, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 542, size: 800, elements: !963)
!963 = !{!964, !970, !975, !981, !982, !987, !992, !993, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !962, file: !7, line: 547, baseType: !965, size: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !7, line: 543, size: 32, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !965, file: !7, line: 544, baseType: !459, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !965, file: !7, line: 545, baseType: !16, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !965, file: !7, line: 546, baseType: !16, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !962, file: !7, line: 551, baseType: !971, size: 32, offset: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !7, line: 548, size: 32, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !971, file: !7, line: 549, baseType: !16, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !971, file: !7, line: 550, baseType: !16, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !962, file: !7, line: 556, baseType: !976, size: 32, offset: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !7, line: 552, size: 32, elements: !977)
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !976, file: !7, line: 553, baseType: !459, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !976, file: !7, line: 554, baseType: !16, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !976, file: !7, line: 555, baseType: !16, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !962, file: !7, line: 557, baseType: !16, size: 32, offset: 96)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !962, file: !7, line: 561, baseType: !983, size: 32, offset: 128)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !7, line: 558, size: 32, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !983, file: !7, line: 559, baseType: !16, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !983, file: !7, line: 560, baseType: !16, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !962, file: !7, line: 565, baseType: !988, size: 32, offset: 160)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !7, line: 562, size: 32, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !988, file: !7, line: 563, baseType: !459, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !988, file: !7, line: 564, baseType: !16, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !962, file: !7, line: 566, baseType: !16, size: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !962, file: !7, line: 570, baseType: !994, size: 32, offset: 224)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !7, line: 567, size: 32, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !994, file: !7, line: 568, baseType: !16, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !994, file: !7, line: 569, baseType: !16, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !962, file: !7, line: 571, baseType: !16, size: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !962, file: !7, line: 572, baseType: !16, size: 32, offset: 288)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !962, file: !7, line: 573, baseType: !16, size: 32, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !962, file: !7, line: 574, baseType: !16, size: 32, offset: 352)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !962, file: !7, line: 575, baseType: !459, size: 32, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !962, file: !7, line: 576, baseType: !16, size: 32, offset: 416)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !962, file: !7, line: 577, baseType: !16, size: 32, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !962, file: !7, line: 578, baseType: !16, size: 32, offset: 480)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !962, file: !7, line: 579, baseType: !16, size: 32, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !962, file: !7, line: 580, baseType: !16, size: 32, offset: 544)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !962, file: !7, line: 581, baseType: !16, size: 32, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !962, file: !7, line: 582, baseType: !16, size: 32, offset: 608)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !962, file: !7, line: 583, baseType: !16, size: 32, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !962, file: !7, line: 584, baseType: !16, size: 32, offset: 672)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !962, file: !7, line: 585, baseType: !16, size: 32, offset: 704)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !962, file: !7, line: 586, baseType: !459, size: 32, offset: 736)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !962, file: !7, line: 587, baseType: !16, size: 32, offset: 768)
!1015 = !{!944, !1016, !1021}
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !946, file: !947, line: 54, type: !1018, isLocal: false, isDefinition: true)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 128, elements: !29)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !285, line: 1237, baseType: !284)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !946, file: !947, line: 55, type: !1023, isLocal: false, isDefinition: true)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 128, elements: !29)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !7, line: 125, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !7, line: 123, baseType: !355)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 128, elements: !29)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1030 = distinct !DIGlobalVariable(name: "priority_set", scope: !1031, file: !1032, line: 128, type: !17, isLocal: true, isDefinition: true)
!1031 = distinct !DISubprogram(name: "hal_nvic_init", scope: !1032, file: !1032, line: 126, type: !1033, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1036, retainedNodes: !1123)
!1032 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_status_t", file: !879, line: 158, baseType: !878)
!1036 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1032, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1037, retainedTypes: !1038, globals: !1105, splitDebugInlining: false, nameTableKind: None)
!1037 = !{!878, !355}
!1038 = !{!1025, !1039, !17, !1073, !1103}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !1041, line: 418, baseType: !1042)
!1041 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/ept_configure_pins_by_ept/GCC")
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1041, line: 395, size: 1120, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1062, !1063, !1064, !1066, !1070, !1072}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1042, file: !1041, line: 397, baseType: !459, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1042, file: !1041, line: 398, baseType: !16, size: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1042, file: !1041, line: 399, baseType: !16, size: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1042, file: !1041, line: 400, baseType: !16, size: 32, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1042, file: !1041, line: 401, baseType: !16, size: 32, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1042, file: !1041, line: 402, baseType: !16, size: 32, offset: 160)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1042, file: !1041, line: 403, baseType: !1051, size: 96, offset: 192)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 96, elements: !75)
!1052 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !26)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1042, file: !1041, line: 404, baseType: !16, size: 32, offset: 288)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1042, file: !1041, line: 405, baseType: !16, size: 32, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1042, file: !1041, line: 406, baseType: !16, size: 32, offset: 352)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1042, file: !1041, line: 407, baseType: !16, size: 32, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1042, file: !1041, line: 408, baseType: !16, size: 32, offset: 416)
