; ModuleID = 'build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.osSemaphoreAttr_t = type { i8*, i32, i8*, i32 }
%struct.osThreadAttr_t = type { i8*, i32, i8*, i32, i8*, i32, i32, i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.cv2_thread = type { %struct._dnode, %struct.k_thread, %struct.k_poll_signal, %struct.k_poll_event, i32, [16 x i8], i32, %struct.k_sem, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, %struct.z_poller, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "sema_attr", scope: !27, file: !212, line: 36, type: !213, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !168, globals: !175, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!29 = !{!30, !42, !113}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 195, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os2.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osError", value: -1)
!36 = !DIEnumerator(name: "osErrorTimeout", value: -2)
!37 = !DIEnumerator(name: "osErrorResource", value: -3)
!38 = !DIEnumerator(name: "osErrorParameter", value: -4)
!39 = !DIEnumerator(name: "osErrorNoMemory", value: -5)
!40 = !DIEnumerator(name: "osErrorISR", value: -6)
!41 = !DIEnumerator(name: "osStatusReserved", value: 2147483647)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !43, line: 27, baseType: !44, size: 32, elements: !45)
!43 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!44 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!46 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!47 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!48 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!49 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!50 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!51 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!52 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!53 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!54 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!55 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!56 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!57 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!58 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!59 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!60 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!61 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!62 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!112 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 101, baseType: !32, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!115 = !DIEnumerator(name: "osPriorityNone", value: 0)
!116 = !DIEnumerator(name: "osPriorityIdle", value: 1)
!117 = !DIEnumerator(name: "osPriorityLow", value: 8)
!118 = !DIEnumerator(name: "osPriorityLow1", value: 9)
!119 = !DIEnumerator(name: "osPriorityLow2", value: 10)
!120 = !DIEnumerator(name: "osPriorityLow3", value: 11)
!121 = !DIEnumerator(name: "osPriorityLow4", value: 12)
!122 = !DIEnumerator(name: "osPriorityLow5", value: 13)
!123 = !DIEnumerator(name: "osPriorityLow6", value: 14)
!124 = !DIEnumerator(name: "osPriorityLow7", value: 15)
!125 = !DIEnumerator(name: "osPriorityBelowNormal", value: 16)
!126 = !DIEnumerator(name: "osPriorityBelowNormal1", value: 17)
!127 = !DIEnumerator(name: "osPriorityBelowNormal2", value: 18)
!128 = !DIEnumerator(name: "osPriorityBelowNormal3", value: 19)
!129 = !DIEnumerator(name: "osPriorityBelowNormal4", value: 20)
!130 = !DIEnumerator(name: "osPriorityBelowNormal5", value: 21)
!131 = !DIEnumerator(name: "osPriorityBelowNormal6", value: 22)
!132 = !DIEnumerator(name: "osPriorityBelowNormal7", value: 23)
!133 = !DIEnumerator(name: "osPriorityNormal", value: 24)
!134 = !DIEnumerator(name: "osPriorityNormal1", value: 25)
!135 = !DIEnumerator(name: "osPriorityNormal2", value: 26)
!136 = !DIEnumerator(name: "osPriorityNormal3", value: 27)
!137 = !DIEnumerator(name: "osPriorityNormal4", value: 28)
!138 = !DIEnumerator(name: "osPriorityNormal5", value: 29)
!139 = !DIEnumerator(name: "osPriorityNormal6", value: 30)
!140 = !DIEnumerator(name: "osPriorityNormal7", value: 31)
!141 = !DIEnumerator(name: "osPriorityAboveNormal", value: 32)
!142 = !DIEnumerator(name: "osPriorityAboveNormal1", value: 33)
!143 = !DIEnumerator(name: "osPriorityAboveNormal2", value: 34)
!144 = !DIEnumerator(name: "osPriorityAboveNormal3", value: 35)
!145 = !DIEnumerator(name: "osPriorityAboveNormal4", value: 36)
!146 = !DIEnumerator(name: "osPriorityAboveNormal5", value: 37)
!147 = !DIEnumerator(name: "osPriorityAboveNormal6", value: 38)
!148 = !DIEnumerator(name: "osPriorityAboveNormal7", value: 39)
!149 = !DIEnumerator(name: "osPriorityHigh", value: 40)
!150 = !DIEnumerator(name: "osPriorityHigh1", value: 41)
!151 = !DIEnumerator(name: "osPriorityHigh2", value: 42)
!152 = !DIEnumerator(name: "osPriorityHigh3", value: 43)
!153 = !DIEnumerator(name: "osPriorityHigh4", value: 44)
!154 = !DIEnumerator(name: "osPriorityHigh5", value: 45)
!155 = !DIEnumerator(name: "osPriorityHigh6", value: 46)
!156 = !DIEnumerator(name: "osPriorityHigh7", value: 47)
!157 = !DIEnumerator(name: "osPriorityRealtime", value: 48)
!158 = !DIEnumerator(name: "osPriorityRealtime1", value: 49)
!159 = !DIEnumerator(name: "osPriorityRealtime2", value: 50)
!160 = !DIEnumerator(name: "osPriorityRealtime3", value: 51)
!161 = !DIEnumerator(name: "osPriorityRealtime4", value: 52)
!162 = !DIEnumerator(name: "osPriorityRealtime5", value: 53)
!163 = !DIEnumerator(name: "osPriorityRealtime6", value: 54)
!164 = !DIEnumerator(name: "osPriorityRealtime7", value: 55)
!165 = !DIEnumerator(name: "osPriorityISR", value: 56)
!166 = !DIEnumerator(name: "osPriorityError", value: -1)
!167 = !DIEnumerator(name: "osPriorityReserved", value: 2147483647)
!168 = !{!169, !171, !32, !172, !173}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !170)
!170 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !44)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !174)
!174 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!175 = !{!25, !176, !183, !203}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !178, line: 66, type: !179, isLocal: false, isDefinition: true)
!178 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 192, elements: !181)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreId_t", file: !31, line: 220, baseType: !171)
!181 = !{!182}
!182 = !DISubrange(count: 6)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "thread_attr", scope: !27, file: !178, line: 72, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 1728, elements: !181)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadAttr_t", file: !31, line: 247, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 237, size: 288, elements: !188)
!188 = !{!189, !193, !194, !195, !196, !197, !198, !200, !202}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !31, line: 238, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !187, file: !31, line: 239, baseType: !172, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !187, file: !31, line: 240, baseType: !171, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !187, file: !31, line: 241, baseType: !172, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !187, file: !31, line: 242, baseType: !171, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !187, file: !31, line: 243, baseType: !172, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !187, file: !31, line: 244, baseType: !199, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "osPriority_t", file: !31, line: 155, baseType: !113)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tz_module", scope: !187, file: !31, line: 245, baseType: !201, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "TZ_ModuleId_t", file: !31, line: 232, baseType: !172)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !187, file: !31, line: 246, baseType: !172, size: 32, offset: 256)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !178, line: 71, type: !205, isLocal: true, isDefinition: true, align: 512)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 101376, elements: !210)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !207, line: 47, size: 8, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !207, line: 48, baseType: !192, size: 8)
!210 = !{!182, !211}
!211 = !DISubrange(count: 2112)
!212 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 768, elements: !181)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreAttr_t", file: !31, line: 279, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 274, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !31, line: 275, baseType: !190, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !215, file: !31, line: 276, baseType: !172, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !215, file: !31, line: 277, baseType: !171, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !215, file: !31, line: 278, baseType: !172, size: 32, offset: 96)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "_char_out", scope: !223, file: !228, line: 54, type: !229, isLocal: false, isDefinition: true)
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !226, globals: !227, splitDebugInlining: false, nameTableKind: None)
!224 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!225 = !{!42}
!226 = !{!171, !32}
!227 = !{!221}
!228 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DISubroutineType(types: !231)
!231 = !{!32, !32}
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !234, file: !264, line: 60, type: !265, isLocal: true, isDefinition: true, align: 32)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !236, globals: !263, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!236 = !{!237, !257}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !239, line: 386, baseType: !240)
!239 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 370, size: 448, elements: !241)
!241 = !{!242, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !240, file: !239, line: 372, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !172)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !240, file: !239, line: 373, baseType: !243, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !240, file: !239, line: 374, baseType: !243, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !240, file: !239, line: 375, baseType: !243, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !240, file: !239, line: 376, baseType: !243, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !240, file: !239, line: 377, baseType: !243, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !240, file: !239, line: 378, baseType: !243, size: 32, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !240, file: !239, line: 379, baseType: !243, size: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !240, file: !239, line: 380, baseType: !243, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !240, file: !239, line: 381, baseType: !243, size: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !240, file: !239, line: 382, baseType: !243, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !240, file: !239, line: 383, baseType: !243, size: 32, offset: 352)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !240, file: !239, line: 384, baseType: !243, size: 32, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !240, file: !239, line: 385, baseType: !243, size: 32, offset: 416)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !239, line: 364, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 360, size: 64, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !259, file: !239, line: 362, baseType: !243, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !259, file: !239, line: 363, baseType: !243, size: 32, offset: 32)
!263 = !{!232}
!264 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !267, line: 51, size: 64, elements: !268)
!267 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !{!269, !297}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !266, file: !267, line: 60, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DISubroutineType(types: !272)
!272 = !{!32, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !276, line: 378, size: 192, elements: !277)
!276 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = !{!278, !279, !280, !281, !290, !291}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !275, file: !276, line: 380, baseType: !190, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !275, file: !276, line: 382, baseType: !13, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !275, file: !276, line: 384, baseType: !13, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !275, file: !276, line: 386, baseType: !282, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !276, line: 351, size: 16, elements: !284)
!284 = !{!285, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !283, file: !276, line: 359, baseType: !286, size: 8)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !287)
!287 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !283, file: !276, line: 364, baseType: !289, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!289 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !276, line: 388, baseType: !171, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !275, file: !276, line: 396, baseType: !292, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !276, line: 43, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !296)
!296 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !266, file: !267, line: 65, baseType: !273, size: 32, offset: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !300, file: !303, line: 71, type: !304, isLocal: true, isDefinition: true, align: 32)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !302, splitDebugInlining: false, nameTableKind: None)
!301 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!302 = !{!298}
!303 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !267, line: 51, size: 64, elements: !306)
!306 = !{!307, !326}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !305, file: !267, line: 60, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{!32, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !276, line: 378, size: 192, elements: !314)
!314 = !{!315, !316, !317, !318, !324, !325}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !276, line: 380, baseType: !190, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !313, file: !276, line: 382, baseType: !13, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !313, file: !276, line: 384, baseType: !13, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !276, line: 386, baseType: !319, size: 32, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !276, line: 351, size: 16, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !320, file: !276, line: 359, baseType: !286, size: 8)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !320, file: !276, line: 364, baseType: !289, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !276, line: 388, baseType: !171, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !313, file: !276, line: 396, baseType: !292, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !305, file: !267, line: 65, baseType: !311, size: 32, offset: 32)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "static_regions", scope: !329, file: !338, line: 62, type: !502, isLocal: true, isDefinition: true)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !331, globals: !334, splitDebugInlining: false, nameTableKind: None)
!330 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!331 = !{!332, !32, !172, !171}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !333, line: 214, baseType: !44)
!333 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!334 = !{!335, !327}
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !337, file: !338, line: 198, type: !488, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !338, file: !338, line: 175, type: !339, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !329, retainedNodes: !483)
!338 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = !DISubroutineType(types: !340)
!340 = !{null, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !343, line: 245, size: 1472, elements: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = !{!345, !414, !427, !428, !429, !434, !446, !447, !451, !452, !458, !478}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !342, file: !343, line: 247, baseType: !346, size: 384)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !343, line: 57, size: 384, elements: !347)
!347 = !{!348, !376, !384, !385, !386, !399, !400, !401}
!348 = !DIDerivedType(tag: DW_TAG_member, scope: !346, file: !343, line: 60, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !346, file: !343, line: 60, size: 64, elements: !350)
!350 = !{!351, !367}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !349, file: !343, line: 61, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !353, line: 49, baseType: !354)
!353 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !353, line: 37, size: 64, elements: !355)
!355 = !{!356, !362}
!356 = !DIDerivedType(tag: DW_TAG_member, scope: !354, file: !353, line: 38, baseType: !357, size: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !354, file: !353, line: 38, size: 32, elements: !358)
!358 = !{!359, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !357, file: !353, line: 39, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !353, line: 40, baseType: !360, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, scope: !354, file: !353, line: 42, baseType: !363, size: 32, offset: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !354, file: !353, line: 42, size: 32, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !363, file: !353, line: 43, baseType: !360, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !363, file: !353, line: 44, baseType: !360, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !349, file: !343, line: 62, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !369, line: 49, size: 64, elements: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !368, file: !369, line: 50, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 64, elements: !374)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!374 = !{!375}
!375 = !DISubrange(count: 2)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !346, file: !343, line: 68, baseType: !377, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !379, line: 233, baseType: !380)
!379 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 231, size: 64, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !380, file: !379, line: 232, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !353, line: 48, baseType: !354)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !346, file: !343, line: 71, baseType: !286, size: 8, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !346, file: !343, line: 74, baseType: !286, size: 8, offset: 104)
!386 = !DIDerivedType(tag: DW_TAG_member, scope: !346, file: !343, line: 90, baseType: !387, size: 16, offset: 112)
!387 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !346, file: !343, line: 90, size: 16, elements: !388)
!388 = !{!389, !396}
!389 = !DIDerivedType(tag: DW_TAG_member, scope: !387, file: !343, line: 91, baseType: !390, size: 16)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !343, line: 91, size: 16, elements: !391)
!391 = !{!392, !395}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !390, file: !343, line: 96, baseType: !393, size: 8)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !394)
!394 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !390, file: !343, line: 97, baseType: !286, size: 8, offset: 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !387, file: !343, line: 100, baseType: !397, size: 16)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !398)
!398 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !346, file: !343, line: 107, baseType: !172, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !346, file: !343, line: 127, baseType: !171, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !346, file: !343, line: 131, baseType: !402, size: 192, offset: 192)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !379, line: 244, size: 192, elements: !403)
!403 = !{!404, !405, !411}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !402, file: !379, line: 245, baseType: !352, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !402, file: !379, line: 246, baseType: !406, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !379, line: 242, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !402, file: !379, line: 249, baseType: !412, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !413)
!413 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !342, file: !343, line: 250, baseType: !415, size: 288, offset: 384)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !416, line: 25, size: 288, elements: !417)
!416 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !415, file: !416, line: 26, baseType: !172, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !415, file: !416, line: 27, baseType: !172, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !415, file: !416, line: 28, baseType: !172, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !415, file: !416, line: 29, baseType: !172, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !415, file: !416, line: 30, baseType: !172, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !415, file: !416, line: 31, baseType: !172, size: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !415, file: !416, line: 32, baseType: !172, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !415, file: !416, line: 33, baseType: !172, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !415, file: !416, line: 34, baseType: !172, size: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !342, file: !343, line: 253, baseType: !171, size: 32, offset: 672)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !342, file: !343, line: 256, baseType: !378, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !342, file: !343, line: 259, baseType: !430, size: 16, offset: 768)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !343, line: 236, size: 16, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !430, file: !343, line: 237, baseType: !289, size: 8)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !430, file: !343, line: 238, baseType: !286, size: 8, offset: 8)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !342, file: !343, line: 271, baseType: !435, size: 128, offset: 800)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !343, line: 34, size: 128, elements: !436)
!436 = !{!437, !443, !444, !445}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !435, file: !343, line: 35, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !439, line: 46, baseType: !440)
!439 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !171, !171, !171}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !435, file: !343, line: 36, baseType: !171, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !435, file: !343, line: 37, baseType: !171, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !435, file: !343, line: 38, baseType: !171, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !342, file: !343, line: 274, baseType: !341, size: 32, offset: 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !343, line: 279, baseType: !448, size: 256, offset: 960)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !342, file: !343, line: 294, baseType: !32, size: 32, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !342, file: !343, line: 300, baseType: !453, size: 96, offset: 1248)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !343, line: 149, size: 96, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !453, file: !343, line: 153, baseType: !22, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !453, file: !343, line: 162, baseType: !332, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !453, file: !343, line: 168, baseType: !332, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !342, file: !343, line: 325, baseType: !459, size: 32, offset: 1344)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !461, line: 5073, size: 192, elements: !462)
!461 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!462 = !{!463, !472, !473}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !460, file: !461, line: 5074, baseType: !464, size: 96)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !465, line: 56, size: 96, elements: !466)
!465 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !{!467, !470, !471}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !464, file: !465, line: 57, baseType: !468, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !465, line: 57, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !464, file: !465, line: 58, baseType: !171, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !464, file: !465, line: 59, baseType: !332, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !460, file: !461, line: 5075, baseType: !378, size: 64, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !460, file: !461, line: 5076, baseType: !474, size: 32, offset: 160)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !475, line: 43, size: 32, elements: !476)
!475 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !474, file: !475, line: 52, baseType: !22, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !342, file: !343, line: 343, baseType: !479, size: 64, offset: 1376)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !416, line: 60, size: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !479, file: !416, line: 63, baseType: !172, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !479, file: !416, line: 66, baseType: !172, size: 32, offset: 32)
!483 = !{!484, !485, !486, !487}
!484 = !DILocalVariable(name: "thread", arg: 1, scope: !337, file: !338, line: 175, type: !341)
!485 = !DILocalVariable(name: "region_num", scope: !337, file: !338, line: 200, type: !286)
!486 = !DILocalVariable(name: "guard_start", scope: !337, file: !338, line: 265, type: !22)
!487 = !DILocalVariable(name: "guard_size", scope: !337, file: !338, line: 266, type: !332)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 96, elements: !500)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !490, line: 52, size: 96, elements: !491)
!490 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !489, file: !490, line: 53, baseType: !22, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !489, file: !490, line: 54, baseType: !332, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !489, file: !490, line: 55, baseType: !495, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !496, line: 151, baseType: !497)
!496 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 149, size: 32, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !497, file: !496, line: 150, baseType: !172, size: 32)
!500 = !{!501}
!501 = !DISubrange(count: 1)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 96, elements: !500)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !506, file: !539, line: 39, type: !286, isLocal: true, isDefinition: true)
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !508, globals: !538, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!508 = !{!509, !171, !32, !526, !286}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !511, line: 1168, baseType: !512)
!511 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 1155, size: 352, elements: !513)
!513 = !{!514, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !512, file: !511, line: 1157, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !512, file: !511, line: 1158, baseType: !243, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !512, file: !511, line: 1159, baseType: !243, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !512, file: !511, line: 1160, baseType: !243, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !512, file: !511, line: 1161, baseType: !243, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !512, file: !511, line: 1162, baseType: !243, size: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !512, file: !511, line: 1163, baseType: !243, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !512, file: !511, line: 1164, baseType: !243, size: 32, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !512, file: !511, line: 1165, baseType: !243, size: 32, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !512, file: !511, line: 1166, baseType: !243, size: 32, offset: 288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !512, file: !511, line: 1167, baseType: !243, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !529, line: 27, size: 96, elements: !530)
!529 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !528, file: !529, line: 29, baseType: !172, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !529, line: 31, baseType: !190, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !528, file: !529, line: 37, baseType: !534, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !496, line: 146, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !496, line: 141, size: 32, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !535, file: !496, line: 143, baseType: !172, size: 32)
!538 = !{!504}
!539 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !542, file: !549, line: 21, type: !229, isLocal: true, isDefinition: true)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !544, globals: !548, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!544 = !{!545, !32, !171}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !547, line: 22, baseType: !32)
!547 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !{!540}
!549 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !552, file: !557, line: 13, type: !574, isLocal: true, isDefinition: true)
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !554, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!554 = !{!555, !550}
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "mpu_config", scope: !552, file: !557, line: 37, type: !558, isLocal: false, isDefinition: true)
!557 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !529, line: 41, size: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !559, file: !529, line: 43, baseType: !172, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !559, file: !529, line: 45, baseType: !563, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !529, line: 27, size: 96, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !565, file: !529, line: 29, baseType: !172, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !529, line: 31, baseType: !190, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !565, file: !529, line: 37, baseType: !570, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !496, line: 146, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !496, line: 141, size: 32, elements: !572)
!572 = !{!573}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !571, file: !496, line: 143, baseType: !172, size: 32)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 192, elements: !374)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !577, file: !674, line: 36, type: !675, isLocal: true, isDefinition: true, align: 32)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, retainedTypes: !591, globals: !673, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!579 = !{!580, !586}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !581, line: 506, baseType: !44, size: 32, elements: !582)
!581 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = !{!583, !584, !585}
!583 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!584 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!585 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!586 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !581, line: 512, baseType: !44, size: 32, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!589 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!590 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!591 = !{!592, !662, !667, !627, !586, !580, !672, !171}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !581, line: 523, size: 288, elements: !595)
!595 = !{!596, !617, !623, !628, !632, !633, !634, !638, !658}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !594, file: !581, line: 524, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!32, !600, !615, !616}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !276, line: 378, size: 192, elements: !603)
!603 = !{!604, !605, !606, !607, !613, !614}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !276, line: 380, baseType: !190, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !602, file: !276, line: 382, baseType: !13, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !602, file: !276, line: 384, baseType: !13, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !602, file: !276, line: 386, baseType: !608, size: 32, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !276, line: 351, size: 16, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !609, file: !276, line: 359, baseType: !286, size: 8)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !609, file: !276, line: 364, baseType: !289, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !602, file: !276, line: 388, baseType: !171, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !602, file: !276, line: 396, baseType: !292, size: 32, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !581, line: 237, baseType: !286)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !581, line: 257, baseType: !172)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !594, file: !581, line: 530, baseType: !618, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DISubroutineType(types: !620)
!620 = !{!32, !600, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !581, line: 229, baseType: !172)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !594, file: !581, line: 532, baseType: !624, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = !DISubroutineType(types: !626)
!626 = !{!32, !600, !627, !622}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !581, line: 216, baseType: !172)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !594, file: !581, line: 535, baseType: !629, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DISubroutineType(types: !631)
!631 = !{!32, !600, !627}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !594, file: !581, line: 537, baseType: !629, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !594, file: !581, line: 539, baseType: !629, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !594, file: !581, line: 541, baseType: !635, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DISubroutineType(types: !637)
!637 = !{!32, !600, !615, !580, !586}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !594, file: !581, line: 544, baseType: !639, size: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DISubroutineType(types: !641)
!641 = !{!32, !600, !642, !289}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !581, line: 478, size: 96, elements: !644)
!644 = !{!645, !652, !657}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !643, file: !581, line: 482, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !647, line: 33, baseType: !648)
!647 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !647, line: 29, size: 32, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !648, file: !647, line: 30, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !643, file: !581, line: 485, baseType: !653, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !581, line: 464, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !600, !642, !627}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !643, file: !581, line: 493, baseType: !627, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !594, file: !581, line: 547, baseType: !659, size: 32, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DISubroutineType(types: !661)
!661 = !{!172, !600}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !581, line: 428, size: 32, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !664, file: !581, line: 434, baseType: !627, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !581, line: 441, size: 32, elements: !670)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !669, file: !581, line: 447, baseType: !627, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!673 = !{!575}
!674 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !267, line: 51, size: 64, elements: !677)
!677 = !{!678, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !676, file: !267, line: 60, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DISubroutineType(types: !681)
!681 = !{!32, !600}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !676, file: !267, line: 65, baseType: !600, size: 32, offset: 32)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "thread_list", scope: !685, file: !925, line: 27, type: !752, isLocal: true, isDefinition: true)
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !687, retainedTypes: !710, globals: !921, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/thread.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!687 = !{!113, !688, !697, !30, !701, !42}
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_poll_types_bits", file: !461, line: 5298, baseType: !44, size: 32, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696}
!690 = !DIEnumerator(name: "_POLL_TYPE_IGNORE", value: 0)
!691 = !DIEnumerator(name: "_POLL_TYPE_SIGNAL", value: 1)
!692 = !DIEnumerator(name: "_POLL_TYPE_SEM_AVAILABLE", value: 2)
!693 = !DIEnumerator(name: "_POLL_TYPE_DATA_AVAILABLE", value: 3)
!694 = !DIEnumerator(name: "_POLL_TYPE_MSGQ_DATA_AVAILABLE", value: 4)
!695 = !DIEnumerator(name: "_POLL_TYPE_PIPE_DATA_AVAILABLE", value: 5)
!696 = !DIEnumerator(name: "_POLL_NUM_TYPES", value: 6)
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_poll_modes", file: !461, line: 5379, baseType: !44, size: 32, elements: !698)
!698 = !{!699, !700}
!699 = !DIEnumerator(name: "K_POLL_MODE_NOTIFY_ONLY", value: 0)
!700 = !DIEnumerator(name: "K_POLL_NUM_MODES", value: 1)
!701 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 90, baseType: !32, size: 32, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709}
!703 = !DIEnumerator(name: "osThreadInactive", value: 0)
!704 = !DIEnumerator(name: "osThreadReady", value: 1)
!705 = !DIEnumerator(name: "osThreadRunning", value: 2)
!706 = !DIEnumerator(name: "osThreadBlocked", value: 3)
!707 = !DIEnumerator(name: "osThreadTerminated", value: 4)
!708 = !DIEnumerator(name: "osThreadError", value: -1)
!709 = !DIEnumerator(name: "osThreadReserved", value: 2147483647)
!710 = !{!171, !711, !898, !913, !914, !438, !917, !172, !918, !32, !920}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_thread", file: !713, line: 16, size: 2240, elements: !714)
!713 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/wrapper.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!714 = !{!715, !730, !833, !839, !905, !906, !910, !911, !912}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !712, file: !713, line: 17, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !353, line: 49, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !353, line: 37, size: 64, elements: !718)
!718 = !{!719, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, scope: !717, file: !353, line: 38, baseType: !720, size: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !353, line: 38, size: 32, elements: !721)
!721 = !{!722, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !720, file: !353, line: 39, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !353, line: 40, baseType: !723, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, scope: !717, file: !353, line: 42, baseType: !726, size: 32, offset: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !353, line: 42, size: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !726, file: !353, line: 43, baseType: !723, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !726, file: !353, line: 44, baseType: !723, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "z_thread", scope: !712, file: !713, line: 18, baseType: !731, size: 1472, offset: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !343, line: 245, size: 1472, elements: !732)
!732 = !{!733, !777, !789, !790, !791, !796, !803, !805, !806, !807, !813, !828}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !731, file: !343, line: 247, baseType: !734, size: 384)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !343, line: 57, size: 384, elements: !735)
!735 = !{!736, !746, !753, !754, !755, !764, !765, !766}
!736 = !DIDerivedType(tag: DW_TAG_member, scope: !734, file: !343, line: 60, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !734, file: !343, line: 60, size: 64, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !737, file: !343, line: 61, baseType: !716, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !737, file: !343, line: 62, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !369, line: 49, size: 64, elements: !742)
!742 = !{!743}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !741, file: !369, line: 50, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 64, elements: !374)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !734, file: !343, line: 68, baseType: !747, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !379, line: 233, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 231, size: 64, elements: !750)
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !749, file: !379, line: 232, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !353, line: 48, baseType: !717)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !734, file: !343, line: 71, baseType: !286, size: 8, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !734, file: !343, line: 74, baseType: !286, size: 8, offset: 104)
!755 = !DIDerivedType(tag: DW_TAG_member, scope: !734, file: !343, line: 90, baseType: !756, size: 16, offset: 112)
!756 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !734, file: !343, line: 90, size: 16, elements: !757)
!757 = !{!758, !763}
!758 = !DIDerivedType(tag: DW_TAG_member, scope: !756, file: !343, line: 91, baseType: !759, size: 16)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !756, file: !343, line: 91, size: 16, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !759, file: !343, line: 96, baseType: !393, size: 8)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !759, file: !343, line: 97, baseType: !286, size: 8, offset: 8)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !756, file: !343, line: 100, baseType: !397, size: 16)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !734, file: !343, line: 107, baseType: !172, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !734, file: !343, line: 127, baseType: !171, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !734, file: !343, line: 131, baseType: !767, size: 192, offset: 192)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !379, line: 244, size: 192, elements: !768)
!768 = !{!769, !770, !776}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !767, file: !379, line: 245, baseType: !716, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !767, file: !379, line: 246, baseType: !771, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !379, line: 242, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !767, file: !379, line: 249, baseType: !412, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !731, file: !343, line: 250, baseType: !778, size: 288, offset: 384)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !416, line: 25, size: 288, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !778, file: !416, line: 26, baseType: !172, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !778, file: !416, line: 27, baseType: !172, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !778, file: !416, line: 28, baseType: !172, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !778, file: !416, line: 29, baseType: !172, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !778, file: !416, line: 30, baseType: !172, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !778, file: !416, line: 31, baseType: !172, size: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !778, file: !416, line: 32, baseType: !172, size: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !778, file: !416, line: 33, baseType: !172, size: 32, offset: 224)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !778, file: !416, line: 34, baseType: !172, size: 32, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !731, file: !343, line: 253, baseType: !171, size: 32, offset: 672)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !731, file: !343, line: 256, baseType: !748, size: 64, offset: 704)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !731, file: !343, line: 259, baseType: !792, size: 16, offset: 768)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !343, line: 236, size: 16, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !792, file: !343, line: 237, baseType: !289, size: 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !792, file: !343, line: 238, baseType: !286, size: 8, offset: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !731, file: !343, line: 271, baseType: !797, size: 128, offset: 800)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !343, line: 34, size: 128, elements: !798)
!798 = !{!799, !800, !801, !802}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !797, file: !343, line: 35, baseType: !438, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !797, file: !343, line: 36, baseType: !171, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !797, file: !343, line: 37, baseType: !171, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !797, file: !343, line: 38, baseType: !171, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !731, file: !343, line: 274, baseType: !804, size: 32, offset: 928)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !731, file: !343, line: 279, baseType: !448, size: 256, offset: 960)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !731, file: !343, line: 294, baseType: !32, size: 32, offset: 1216)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !731, file: !343, line: 300, baseType: !808, size: 96, offset: 1248)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !343, line: 149, size: 96, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !808, file: !343, line: 153, baseType: !22, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !808, file: !343, line: 162, baseType: !332, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !808, file: !343, line: 168, baseType: !332, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !731, file: !343, line: 325, baseType: !814, size: 32, offset: 1344)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !461, line: 5073, size: 192, elements: !816)
!816 = !{!817, !823, !824}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !815, file: !461, line: 5074, baseType: !818, size: 96)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !465, line: 56, size: 96, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !818, file: !465, line: 57, baseType: !468, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !818, file: !465, line: 58, baseType: !171, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !818, file: !465, line: 59, baseType: !332, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !815, file: !461, line: 5075, baseType: !748, size: 64, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !815, file: !461, line: 5076, baseType: !825, size: 32, offset: 160)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !475, line: 43, size: 32, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !825, file: !475, line: 52, baseType: !22, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !731, file: !343, line: 343, baseType: !829, size: 64, offset: 1376)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !416, line: 60, size: 64, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !829, file: !416, line: 63, baseType: !172, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !829, file: !416, line: 66, baseType: !172, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "poll_signal", scope: !712, file: !713, line: 19, baseType: !834, size: 128, offset: 1536)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !461, line: 5397, size: 128, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !834, file: !461, line: 5399, baseType: !752, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !834, file: !461, line: 5405, baseType: !44, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !834, file: !461, line: 5408, baseType: !32, size: 32, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !712, file: !713, line: 20, baseType: !840, size: 160, offset: 1664)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_event", file: !461, line: 5421, size: 160, elements: !841)
!841 = !{!842, !843, !845, !846, !847, !848, !849, !850}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !840, file: !461, line: 5423, baseType: !716, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !840, file: !461, line: 5426, baseType: !844, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !840, file: !461, line: 5429, baseType: !172, size: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !840, file: !461, line: 5432, baseType: !172, size: 6, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !840, file: !461, line: 5435, baseType: !172, size: 7, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !840, file: !461, line: 5438, baseType: !172, size: 1, offset: 117, flags: DIFlagBitField, extraData: i64 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !840, file: !461, line: 5441, baseType: !172, size: 10, offset: 118, flags: DIFlagBitField, extraData: i64 96)
!850 = !DIDerivedType(tag: DW_TAG_member, scope: !840, file: !461, line: 5444, baseType: !851, size: 32, offset: 128)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !840, file: !461, line: 5444, size: 32, elements: !852)
!852 = !{!853, !854, !856, !864, !887, !889}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !851, file: !461, line: 5445, baseType: !171, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !851, file: !461, line: 5446, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !851, file: !461, line: 5447, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !461, line: 2909, size: 192, elements: !859)
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !858, file: !461, line: 2910, baseType: !748, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !858, file: !461, line: 2911, baseType: !44, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !858, file: !461, line: 2912, baseType: !44, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !858, file: !461, line: 2914, baseType: !752, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !851, file: !461, line: 5448, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !461, line: 2208, size: 224, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !866, file: !461, line: 2209, baseType: !869, size: 224)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !461, line: 1709, size: 224, elements: !870)
!870 = !{!871, !884, !885, !886}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !869, file: !461, line: 1710, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !873, line: 46, baseType: !874)
!873 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !873, line: 41, size: 64, elements: !875)
!875 = !{!876, !883}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !874, file: !873, line: 42, baseType: !877, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !873, line: 39, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !873, line: 35, size: 32, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !879, file: !873, line: 36, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !873, line: 32, baseType: !172)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !874, file: !873, line: 43, baseType: !877, size: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !869, file: !461, line: 1711, baseType: !825, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !869, file: !461, line: 1712, baseType: !748, size: 64, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !869, file: !461, line: 1714, baseType: !752, size: 64, offset: 160)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !851, file: !461, line: 5449, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !851, file: !461, line: 5450, baseType: !890, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !461, line: 4204, size: 416, elements: !892)
!892 = !{!893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !891, file: !461, line: 4206, baseType: !748, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !891, file: !461, line: 4208, baseType: !825, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !891, file: !461, line: 4210, baseType: !332, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !891, file: !461, line: 4212, baseType: !172, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !891, file: !461, line: 4214, baseType: !898, size: 32, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !891, file: !461, line: 4216, baseType: !898, size: 32, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !891, file: !461, line: 4218, baseType: !898, size: 32, offset: 224)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !891, file: !461, line: 4220, baseType: !898, size: 32, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !891, file: !461, line: 4222, baseType: !172, size: 32, offset: 288)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !891, file: !461, line: 4224, baseType: !752, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !891, file: !461, line: 4227, baseType: !286, size: 8, offset: 384)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "signal_results", scope: !712, file: !713, line: 21, baseType: !172, size: 32, offset: 1824)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !713, line: 22, baseType: !907, size: 128, offset: 1856)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 16)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !712, file: !713, line: 23, baseType: !172, size: 32, offset: 1984)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "join_guard", scope: !712, file: !713, line: 24, baseType: !858, size: 192, offset: 2016)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "has_joined", scope: !712, file: !713, line: 25, baseType: !192, size: 8, offset: 2208)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadId_t", file: !31, line: 208, baseType: !171)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !916, line: 22, baseType: !170)
!916 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !343, line: 347, baseType: !804)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !919, line: 46, baseType: !412)
!919 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!921 = !{!922, !683, !957, !962, !964, !966}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "one_time", scope: !924, file: !925, line: 109, type: !172, isLocal: true, isDefinition: true)
!924 = distinct !DISubprogram(name: "osThreadNew", scope: !925, file: !925, line: 103, type: !926, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !685, retainedNodes: !946)
!925 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/thread.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = !DISubroutineType(types: !927)
!927 = !{!913, !928, !171, !932}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadFunc_t", file: !31, line: 158, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !171}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadAttr_t", file: !31, line: 247, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 237, size: 288, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !31, line: 238, baseType: !190, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !935, file: !31, line: 239, baseType: !172, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !935, file: !31, line: 240, baseType: !171, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !935, file: !31, line: 241, baseType: !172, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !935, file: !31, line: 242, baseType: !171, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !935, file: !31, line: 243, baseType: !172, size: 32, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !935, file: !31, line: 244, baseType: !199, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tz_module", scope: !935, file: !31, line: 245, baseType: !201, size: 32, offset: 224)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !935, file: !31, line: 246, baseType: !172, size: 32, offset: 256)
!946 = !{!947, !948, !949, !950, !952, !953, !954, !955, !956}
!947 = !DILocalVariable(name: "threadfunc", arg: 1, scope: !924, file: !925, line: 103, type: !928)
!948 = !DILocalVariable(name: "arg", arg: 2, scope: !924, file: !925, line: 103, type: !171)
!949 = !DILocalVariable(name: "attr", arg: 3, scope: !924, file: !925, line: 104, type: !932)
!950 = !DILocalVariable(name: "prio", scope: !924, file: !925, line: 106, type: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !32)
!952 = !DILocalVariable(name: "cv2_prio", scope: !924, file: !925, line: 107, type: !199)
!953 = !DILocalVariable(name: "tid", scope: !924, file: !925, line: 108, type: !711)
!954 = !DILocalVariable(name: "stack", scope: !924, file: !925, line: 110, type: !171)
!955 = !DILocalVariable(name: "stack_size", scope: !924, file: !925, line: 111, type: !332)
!956 = !DILocalVariable(name: "this_thread_num", scope: !924, file: !925, line: 112, type: !172)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "cv2_thread_pool", scope: !685, file: !925, line: 28, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 33600, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 15)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "thread_num", scope: !685, file: !925, line: 29, type: !915, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "thread_num_dynamic", scope: !685, file: !925, line: 30, type: !915, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "init_thread_attrs", scope: !685, file: !925, line: 15, type: !933, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "cv2_semaphore_slab", scope: !971, file: !1008, line: 11, type: !1022, isLocal: false, isDefinition: true, align: 32)
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !973, retainedTypes: !974, globals: !1005, splitDebugInlining: false, nameTableKind: None)
!972 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/semaphore.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/portability/cmsis_rtos_v2/philosophers")
!973 = !{!30, !42}
!974 = !{!171, !975, !918, !180, !976, !32, !172, !173}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_sem", file: !713, line: 43, size: 320, elements: !978)
!978 = !{!979, !1004}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "z_semaphore", scope: !977, file: !713, line: 44, baseType: !980, size: 192)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !461, line: 2909, size: 192, elements: !981)
!981 = !{!982, !1001, !1002, !1003}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !980, file: !461, line: 2910, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !379, line: 233, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 231, size: 64, elements: !985)
!985 = !{!986}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !984, file: !379, line: 232, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !353, line: 48, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !353, line: 37, size: 64, elements: !989)
!989 = !{!990, !996}
!990 = !DIDerivedType(tag: DW_TAG_member, scope: !988, file: !353, line: 38, baseType: !991, size: 32)
!991 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !988, file: !353, line: 38, size: 32, elements: !992)
!992 = !{!993, !995}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !991, file: !353, line: 39, baseType: !994, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !991, file: !353, line: 40, baseType: !994, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, scope: !988, file: !353, line: 42, baseType: !997, size: 32, offset: 32)
!997 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !988, file: !353, line: 42, size: 32, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !997, file: !353, line: 43, baseType: !994, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !997, file: !353, line: 44, baseType: !994, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !980, file: !461, line: 2911, baseType: !44, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !980, file: !461, line: 2912, baseType: !44, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !980, file: !461, line: 2914, baseType: !987, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !713, line: 45, baseType: !907, size: 128, offset: 192)
!1005 = !{!969, !1006, !1012}
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_semaphore_slab", scope: !971, file: !1008, line: 11, type: !1009, isLocal: false, isDefinition: true, align: 32)
!1008 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/semaphore.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 1600, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 200)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "init_sema_attrs", scope: !971, file: !1008, line: 14, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreAttr_t", file: !31, line: 279, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 274, size: 128, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !31, line: 275, baseType: !190, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !1016, file: !31, line: 276, baseType: !172, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !1016, file: !31, line: 277, baseType: !171, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !1016, file: !31, line: 278, baseType: !172, size: 32, offset: 96)
