; ModuleID = 'build/arduino_nano_33_ble/subsys/tracing/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !114, line: 63, type: !115, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/tracing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !141, !287, !291, !296, !298, !300}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !114, line: 64, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/tracing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !116, line: 2909, size: 128, elements: !117)
!116 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !{!118, !139, !140}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !115, file: !116, line: 2910, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !120, line: 233, baseType: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 231, size: 64, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !121, file: !120, line: 232, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !125, line: 48, baseType: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !125, line: 37, size: 64, elements: !127)
!127 = !{!128, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !125, line: 38, baseType: !129, size: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !125, line: 38, size: 32, elements: !130)
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !125, line: 39, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !125, line: 40, baseType: !132, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !125, line: 42, baseType: !135, size: 32, offset: 32)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !125, line: 42, size: 32, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !135, file: !125, line: 43, baseType: !132, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !125, line: 44, baseType: !132, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !115, file: !116, line: 2911, baseType: !32, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !115, file: !116, line: 2912, baseType: !32, size: 32, offset: 96)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_a", scope: !27, file: !114, line: 111, type: !143, isLocal: false, isDefinition: true, align: 32)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !116, line: 620, size: 384, elements: !144)
!144 = !{!145, !264, !271, !272, !273, !274, !275, !276, !277, !278, !280, !284}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !143, file: !116, line: 621, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !148, line: 245, size: 1408, elements: !149)
!148 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!149 = !{!150, !199, !212, !213, !214, !226, !227, !232, !233, !241, !259}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !147, file: !148, line: 247, baseType: !151, size: 384)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !148, line: 57, size: 384, elements: !152)
!152 = !{!153, !167, !169, !172, !173, !186, !187, !188}
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !148, line: 60, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !148, line: 60, size: 64, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !154, file: !148, line: 61, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !125, line: 49, baseType: !126)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !154, file: !148, line: 62, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !160, line: 49, size: 64, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !159, file: !160, line: 50, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !165)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!165 = !{!166}
!166 = !DISubrange(count: 2)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !151, file: !148, line: 68, baseType: !168, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !151, file: !148, line: 71, baseType: !170, size: 8, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !171)
!171 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !151, file: !148, line: 74, baseType: !170, size: 8, offset: 104)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !148, line: 90, baseType: !174, size: 16, offset: 112)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !148, line: 90, size: 16, elements: !175)
!175 = !{!176, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !148, line: 91, baseType: !177, size: 16)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !174, file: !148, line: 91, size: 16, elements: !178)
!178 = !{!179, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !177, file: !148, line: 96, baseType: !180, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !181)
!181 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !177, file: !148, line: 97, baseType: !170, size: 8, offset: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !174, file: !148, line: 100, baseType: !184, size: 16)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !185)
!185 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !151, file: !148, line: 107, baseType: !108, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !151, file: !148, line: 127, baseType: !106, size: 32, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !151, file: !148, line: 131, baseType: !189, size: 192, offset: 192)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !120, line: 244, size: 192, elements: !190)
!190 = !{!191, !192, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !189, file: !120, line: 245, baseType: !157, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !189, file: !120, line: 246, baseType: !193, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !120, line: 242, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !189, file: !120, line: 249, baseType: !104, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !147, file: !148, line: 250, baseType: !200, size: 288, offset: 384)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !201, line: 25, size: 288, elements: !202)
!201 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !200, file: !201, line: 26, baseType: !108, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !200, file: !201, line: 27, baseType: !108, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !200, file: !201, line: 28, baseType: !108, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !200, file: !201, line: 29, baseType: !108, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !200, file: !201, line: 30, baseType: !108, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !200, file: !201, line: 31, baseType: !108, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !200, file: !201, line: 32, baseType: !108, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !200, file: !201, line: 33, baseType: !108, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !200, file: !201, line: 34, baseType: !108, size: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !147, file: !148, line: 253, baseType: !106, size: 32, offset: 672)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !147, file: !148, line: 256, baseType: !119, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !147, file: !148, line: 271, baseType: !215, size: 128, offset: 768)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !148, line: 34, size: 128, elements: !216)
!216 = !{!217, !223, !224, !225}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !215, file: !148, line: 35, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !219, line: 46, baseType: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !106, !106, !106}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !215, file: !148, line: 36, baseType: !106, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !215, file: !148, line: 37, baseType: !106, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !215, file: !148, line: 38, baseType: !106, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !147, file: !148, line: 274, baseType: !146, size: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 279, baseType: !228, size: 256, offset: 928)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 256, elements: !230)
!229 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!230 = !{!231}
!231 = !DISubrange(count: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !147, file: !148, line: 294, baseType: !107, size: 32, offset: 1184)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !147, file: !148, line: 300, baseType: !234, size: 96, offset: 1216)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !148, line: 149, size: 96, elements: !235)
!235 = !{!236, !237, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !234, file: !148, line: 153, baseType: !22, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !234, file: !148, line: 162, baseType: !238, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !239, line: 214, baseType: !32)
!239 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !234, file: !148, line: 168, baseType: !238, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !147, file: !148, line: 325, baseType: !242, size: 32, offset: 1312)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !116, line: 5073, size: 160, elements: !244)
!244 = !{!245, !254, !255}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !243, file: !116, line: 5074, baseType: !246, size: 96)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !247, line: 56, size: 96, elements: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = !{!249, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !246, file: !247, line: 57, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !247, line: 57, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !246, file: !247, line: 58, baseType: !106, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !246, file: !247, line: 59, baseType: !238, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !243, file: !116, line: 5075, baseType: !119, size: 64, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !243, file: !116, line: 5076, baseType: !256, offset: 160)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!257 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !{}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !147, file: !148, line: 343, baseType: !260, size: 64, offset: 1344)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !201, line: 60, size: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !260, file: !201, line: 63, baseType: !108, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !260, file: !201, line: 66, baseType: !108, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !143, file: !116, line: 622, baseType: !265, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !219, line: 44, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !268, line: 47, size: 8, elements: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !268, line: 48, baseType: !229, size: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !143, file: !116, line: 623, baseType: !32, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !143, file: !116, line: 624, baseType: !218, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !143, file: !116, line: 625, baseType: !106, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !143, file: !116, line: 626, baseType: !106, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !143, file: !116, line: 627, baseType: !106, size: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !143, file: !116, line: 628, baseType: !107, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !143, file: !116, line: 629, baseType: !108, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !143, file: !116, line: 630, baseType: !279, size: 32, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !143, file: !116, line: 631, baseType: !281, size: 32, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{null}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !143, file: !116, line: 632, baseType: !285, size: 32, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "thread_a", scope: !27, file: !114, line: 111, type: !289, isLocal: false, isDefinition: true)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !148, line: 347, baseType: !146)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !114, line: 79, type: !293, isLocal: false, isDefinition: true, align: 512)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 16896, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 2112)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !114, line: 80, type: !147, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_a", scope: !27, file: !114, line: 111, type: !293, isLocal: false, isDefinition: true, align: 512)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_a", scope: !27, file: !114, line: 111, type: !147, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "_char_out", scope: !304, file: !308, line: 54, type: !309, isLocal: false, isDefinition: true)
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !306, globals: !307, splitDebugInlining: false, nameTableKind: None)
!305 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!306 = !{!106, !107}
!307 = !{!302}
!308 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{!107, !107}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "_kernel_thread_info_offsets", scope: !314, file: !319, line: 41, type: !322, isLocal: false, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !306, globals: !316, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!316 = !{!312, !317, !320}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "_kernel_thread_info_num_offsets", scope: !314, file: !319, line: 140, type: !238, isLocal: false, isDefinition: true)
!319 = !DIFile(filename: "zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "_kernel_thread_info_size_t_size", scope: !314, file: !319, line: 145, type: !170, isLocal: false, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 448, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 14)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !327, file: !362, line: 27, type: !387, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !341, globals: !359, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!329 = !{!330, !30}
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !331, line: 27, baseType: !32, size: 32, elements: !332)
!331 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340}
!333 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!334 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!335 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!336 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!337 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!338 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!339 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!340 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!341 = !{!106, !102, !107, !24, !342, !358, !108, !109}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !344, line: 54, size: 96, elements: !345)
!344 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !{!346, !353, !357}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !343, file: !344, line: 55, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !348, line: 33, baseType: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !348, line: 29, size: 32, elements: !350)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !348, line: 30, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !343, file: !344, line: 60, baseType: !354, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !330}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !343, file: !344, line: 65, baseType: !354, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!359 = !{!325, !360, !364, !366, !377, !379}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !327, file: !362, line: 44, type: !363, isLocal: true, isDefinition: true)
!362 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !327, file: !362, line: 49, type: !363, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !327, file: !362, line: 36, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 128, elements: !375)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !331, line: 114, size: 128, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !369, file: !331, line: 115, baseType: !330, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !369, file: !331, line: 141, baseType: !170, size: 8, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !369, file: !331, line: 149, baseType: !108, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !369, file: !331, line: 156, baseType: !108, size: 32, offset: 96)
!375 = !{!376}
!376 = !DISubrange(count: 1)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !327, file: !362, line: 40, type: !368, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !327, file: !362, line: 28, type: !381, isLocal: true, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !348, line: 40, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !348, line: 35, size: 64, elements: !383)
!383 = !{!384, !386}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !382, file: !348, line: 36, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !382, file: !348, line: 37, baseType: !385, size: 32, offset: 32)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 32, elements: !375)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !389, line: 22, baseType: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!391 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!392 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !395, file: !423, line: 50, type: !279, isLocal: true, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !397, globals: !420, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!397 = !{!398, !102, !238, !107, !106, !108, !109, !400, !358, !279, !411}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !399)
!399 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !402, line: 45, size: 64, elements: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !410}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !401, file: !402, line: 46, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !348, line: 33, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !348, line: 29, size: 32, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !348, line: 30, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !401, file: !402, line: 48, baseType: !108, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !402, line: 38, size: 64, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !412, file: !402, line: 39, baseType: !405, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !412, file: !402, line: 41, baseType: !416, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !402, line: 35, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !279}
!420 = !{!421, !425, !433, !393, !435, !445}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "latency_lock", scope: !395, file: !423, line: 44, type: !424, isLocal: true, isDefinition: true)
!423 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !395, file: !423, line: 46, type: !427, isLocal: true, isDefinition: true)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !348, line: 40, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !348, line: 35, size: 64, elements: !429)
!429 = !{!430, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !428, file: !348, line: 36, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !428, file: !348, line: 37, baseType: !431, size: 32, offset: 32)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "latency_subs", scope: !395, file: !423, line: 52, type: !427, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !395, file: !423, line: 39, type: !437, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, elements: !443)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 35, size: 96, elements: !439)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !438, file: !423, line: 36, baseType: !330, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !438, file: !423, line: 37, baseType: !170, size: 8, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !438, file: !423, line: 38, baseType: !388, size: 32, offset: 64)
!443 = !{!444}
!444 = !DISubrange(count: 0)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !395, file: !423, line: 48, type: !279, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !449, file: !456, line: 47, type: !470, isLocal: true, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !451, retainedTypes: !452, globals: !453, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!451 = !{!330}
!452 = !{!238, !107}
!453 = !{!454, !447, !466}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "cpus_states", scope: !449, file: !456, line: 50, type: !457, isLocal: true, isDefinition: true)
!456 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 32, elements: !375)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !331, line: 114, size: 128, elements: !461)
!461 = !{!462, !463, !464, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !460, file: !331, line: 115, baseType: !330, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !460, file: !331, line: 141, baseType: !170, size: 8, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !460, file: !331, line: 149, baseType: !108, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !460, file: !331, line: 156, baseType: !108, size: 32, offset: 96)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !449, file: !456, line: 55, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 8, elements: !375)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, elements: !443)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "static_regions", scope: !473, file: !480, line: 62, type: !609, isLocal: true, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !475, globals: !476, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!475 = !{!238, !107, !108, !106}
!476 = !{!477, !471}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !479, file: !480, line: 198, type: !597, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !480, file: !480, line: 175, type: !481, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !473, retainedNodes: !592)
!480 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!481 = !DISubroutineType(types: !482)
!482 = !{null, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !148, line: 245, size: 1408, elements: !485)
!485 = !{!486, !544, !556, !557, !558, !565, !566, !567, !568, !574, !587}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !484, file: !148, line: 247, baseType: !487, size: 384)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !148, line: 57, size: 384, elements: !488)
!488 = !{!489, !513, !520, !521, !522, !531, !532, !533}
!489 = !DIDerivedType(tag: DW_TAG_member, scope: !487, file: !148, line: 60, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !487, file: !148, line: 60, size: 64, elements: !491)
!491 = !{!492, !507}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !490, file: !148, line: 61, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !125, line: 49, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !125, line: 37, size: 64, elements: !495)
!495 = !{!496, !502}
!496 = !DIDerivedType(tag: DW_TAG_member, scope: !494, file: !125, line: 38, baseType: !497, size: 32)
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !494, file: !125, line: 38, size: 32, elements: !498)
!498 = !{!499, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !497, file: !125, line: 39, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !125, line: 40, baseType: !500, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, scope: !494, file: !125, line: 42, baseType: !503, size: 32, offset: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !494, file: !125, line: 42, size: 32, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !503, file: !125, line: 43, baseType: !500, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !503, file: !125, line: 44, baseType: !500, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !490, file: !148, line: 62, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !160, line: 49, size: 64, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !508, file: !160, line: 50, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 64, elements: !165)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !487, file: !148, line: 68, baseType: !514, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !120, line: 233, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 231, size: 64, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !516, file: !120, line: 232, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !125, line: 48, baseType: !494)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !487, file: !148, line: 71, baseType: !170, size: 8, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !487, file: !148, line: 74, baseType: !170, size: 8, offset: 104)
!522 = !DIDerivedType(tag: DW_TAG_member, scope: !487, file: !148, line: 90, baseType: !523, size: 16, offset: 112)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !487, file: !148, line: 90, size: 16, elements: !524)
!524 = !{!525, !530}
!525 = !DIDerivedType(tag: DW_TAG_member, scope: !523, file: !148, line: 91, baseType: !526, size: 16)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !523, file: !148, line: 91, size: 16, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !526, file: !148, line: 96, baseType: !180, size: 8)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !526, file: !148, line: 97, baseType: !170, size: 8, offset: 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !523, file: !148, line: 100, baseType: !184, size: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !487, file: !148, line: 107, baseType: !108, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !487, file: !148, line: 127, baseType: !106, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !487, file: !148, line: 131, baseType: !534, size: 192, offset: 192)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !120, line: 244, size: 192, elements: !535)
!535 = !{!536, !537, !543}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !534, file: !120, line: 245, baseType: !493, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !534, file: !120, line: 246, baseType: !538, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !120, line: 242, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !534, file: !120, line: 249, baseType: !104, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !484, file: !148, line: 250, baseType: !545, size: 288, offset: 384)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !201, line: 25, size: 288, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !545, file: !201, line: 26, baseType: !108, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !545, file: !201, line: 27, baseType: !108, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !545, file: !201, line: 28, baseType: !108, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !545, file: !201, line: 29, baseType: !108, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !545, file: !201, line: 30, baseType: !108, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !545, file: !201, line: 31, baseType: !108, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !545, file: !201, line: 32, baseType: !108, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !545, file: !201, line: 33, baseType: !108, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !545, file: !201, line: 34, baseType: !108, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !484, file: !148, line: 253, baseType: !106, size: 32, offset: 672)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !484, file: !148, line: 256, baseType: !515, size: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !484, file: !148, line: 271, baseType: !559, size: 128, offset: 768)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !148, line: 34, size: 128, elements: !560)
!560 = !{!561, !562, !563, !564}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !559, file: !148, line: 35, baseType: !218, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !559, file: !148, line: 36, baseType: !106, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !559, file: !148, line: 37, baseType: !106, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !559, file: !148, line: 38, baseType: !106, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !484, file: !148, line: 274, baseType: !483, size: 32, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !148, line: 279, baseType: !228, size: 256, offset: 928)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !484, file: !148, line: 294, baseType: !107, size: 32, offset: 1184)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !484, file: !148, line: 300, baseType: !569, size: 96, offset: 1216)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !148, line: 149, size: 96, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !569, file: !148, line: 153, baseType: !22, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !569, file: !148, line: 162, baseType: !238, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !569, file: !148, line: 168, baseType: !238, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !484, file: !148, line: 325, baseType: !575, size: 32, offset: 1312)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !116, line: 5073, size: 160, elements: !577)
!577 = !{!578, !584, !585}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !576, file: !116, line: 5074, baseType: !579, size: 96)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !247, line: 56, size: 96, elements: !580)
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !579, file: !247, line: 57, baseType: !250, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !579, file: !247, line: 58, baseType: !106, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !579, file: !247, line: 59, baseType: !238, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !576, file: !116, line: 5075, baseType: !515, size: 64, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !576, file: !116, line: 5076, baseType: !586, offset: 160)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !484, file: !148, line: 343, baseType: !588, size: 64, offset: 1344)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !201, line: 60, size: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !588, file: !201, line: 63, baseType: !108, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !588, file: !201, line: 66, baseType: !108, size: 32, offset: 32)
!592 = !{!593, !594, !595, !596}
!593 = !DILocalVariable(name: "thread", arg: 1, scope: !479, file: !480, line: 175, type: !483)
!594 = !DILocalVariable(name: "region_num", scope: !479, file: !480, line: 200, type: !170)
!595 = !DILocalVariable(name: "guard_start", scope: !479, file: !480, line: 265, type: !22)
!596 = !DILocalVariable(name: "guard_size", scope: !479, file: !480, line: 266, type: !238)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 96, elements: !375)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !599, line: 52, size: 96, elements: !600)
!599 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!600 = !{!601, !602, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !598, file: !599, line: 53, baseType: !22, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !598, file: !599, line: 54, baseType: !238, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !598, file: !599, line: 55, baseType: !604, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !605, line: 151, baseType: !606)
!605 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !605, line: 149, size: 32, elements: !607)
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !606, file: !605, line: 150, baseType: !108, size: 32)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 96, elements: !375)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !613, file: !647, line: 39, type: !170, isLocal: true, isDefinition: true)
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !615, globals: !646, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!615 = !{!616, !106, !107, !634, !170}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !618, line: 1226, baseType: !619)
!618 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !618, line: 1213, size: 352, elements: !620)
!620 = !{!621, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !619, file: !618, line: 1215, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !619, file: !618, line: 1216, baseType: !623, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !619, file: !618, line: 1217, baseType: !623, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !619, file: !618, line: 1218, baseType: !623, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !619, file: !618, line: 1219, baseType: !623, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !619, file: !618, line: 1220, baseType: !623, size: 32, offset: 160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !619, file: !618, line: 1221, baseType: !623, size: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !619, file: !618, line: 1222, baseType: !623, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !619, file: !618, line: 1223, baseType: !623, size: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !619, file: !618, line: 1224, baseType: !623, size: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !619, file: !618, line: 1225, baseType: !623, size: 32, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !637, line: 27, size: 96, elements: !638)
!637 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !636, file: !637, line: 29, baseType: !108, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !636, file: !637, line: 31, baseType: !285, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !636, file: !637, line: 37, baseType: !642, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !605, line: 146, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !605, line: 141, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !643, file: !605, line: 143, baseType: !108, size: 32)
!646 = !{!611}
!647 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !650, file: !657, line: 21, type: !309, isLocal: true, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !652, globals: !656, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!652 = !{!653, !107, !106}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !655, line: 22, baseType: !107)
!655 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = !{!648}
!657 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !660, file: !665, line: 13, type: !682, isLocal: true, isDefinition: true)
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !662, splitDebugInlining: false, nameTableKind: None)
!661 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!662 = !{!663, !658}
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "mpu_config", scope: !660, file: !665, line: 37, type: !666, isLocal: false, isDefinition: true)
!665 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !637, line: 41, size: 64, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !667, file: !637, line: 43, baseType: !108, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !667, file: !637, line: 45, baseType: !671, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !637, line: 27, size: 96, elements: !674)
!674 = !{!675, !676, !677}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !673, file: !637, line: 29, baseType: !108, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !637, line: 31, baseType: !285, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !673, file: !637, line: 37, baseType: !678, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !605, line: 146, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !605, line: 141, size: 32, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !679, file: !605, line: 143, baseType: !108, size: 32)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 192, elements: !165)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !685, file: !855, line: 93, type: !856, isLocal: true, isDefinition: true, align: 32)
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !687, globals: !850, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!687 = !{!688, !170, !106, !107, !768, !108, !769, !805, !816}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !690, line: 1071, baseType: !691)
!690 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !690, line: 1035, size: 19584, elements: !692)
!692 = !{!693, !697, !698, !699, !703, !704, !706, !707, !708, !709, !710, !711, !715, !716, !717, !721, !722, !726, !727, !731, !732, !736, !737, !738, !739, !740, !741, !742, !746, !747, !748, !749, !753, !754, !758}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !691, file: !690, line: 1036, baseType: !694, size: 960)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 960, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 30)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !691, file: !690, line: 1037, baseType: !623, size: 32, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !691, file: !690, line: 1038, baseType: !623, size: 32, offset: 992)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !691, file: !690, line: 1039, baseType: !700, size: 1088, offset: 1024)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1088, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 34)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !691, file: !690, line: 1040, baseType: !623, size: 32, offset: 2112)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !691, file: !690, line: 1041, baseType: !705, size: 64, offset: 2144)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 64, elements: !165)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !691, file: !690, line: 1042, baseType: !623, size: 32, offset: 2208)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !691, file: !690, line: 1043, baseType: !623, size: 32, offset: 2240)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !691, file: !690, line: 1044, baseType: !623, size: 32, offset: 2272)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !691, file: !690, line: 1045, baseType: !623, size: 32, offset: 2304)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !691, file: !690, line: 1046, baseType: !623, size: 32, offset: 2336)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !691, file: !690, line: 1047, baseType: !712, size: 3808, offset: 2368)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 3808, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 119)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !691, file: !690, line: 1048, baseType: !623, size: 32, offset: 6176)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !691, file: !690, line: 1049, baseType: !623, size: 32, offset: 6208)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !691, file: !690, line: 1050, baseType: !718, size: 1952, offset: 6240)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1952, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 61)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !691, file: !690, line: 1051, baseType: !623, size: 32, offset: 8192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !691, file: !690, line: 1052, baseType: !723, size: 288, offset: 8224)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 288, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 9)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !691, file: !690, line: 1053, baseType: !622, size: 32, offset: 8512)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !691, file: !690, line: 1054, baseType: !728, size: 96, offset: 8544)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 96, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 3)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !691, file: !690, line: 1055, baseType: !622, size: 32, offset: 8640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !691, file: !690, line: 1056, baseType: !733, size: 1568, offset: 8672)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1568, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 49)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !691, file: !690, line: 1057, baseType: !623, size: 32, offset: 10240)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !691, file: !690, line: 1058, baseType: !728, size: 96, offset: 10272)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !691, file: !690, line: 1059, baseType: !623, size: 32, offset: 10368)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !691, file: !690, line: 1060, baseType: !705, size: 64, offset: 10400)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !691, file: !690, line: 1061, baseType: !623, size: 32, offset: 10464)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !691, file: !690, line: 1062, baseType: !623, size: 32, offset: 10496)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !691, file: !690, line: 1063, baseType: !743, size: 672, offset: 10528)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 672, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 21)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !691, file: !690, line: 1064, baseType: !623, size: 32, offset: 11200)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !691, file: !690, line: 1065, baseType: !622, size: 32, offset: 11232)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !691, file: !690, line: 1066, baseType: !623, size: 32, offset: 11264)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !691, file: !690, line: 1067, baseType: !750, size: 1504, offset: 11296)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1504, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 47)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !691, file: !690, line: 1068, baseType: !622, size: 32, offset: 12800)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !691, file: !690, line: 1069, baseType: !755, size: 5600, offset: 12832)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 5600, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 175)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !691, file: !690, line: 1070, baseType: !759, size: 1152, offset: 18432)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 1152, elements: !724)
!760 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !690, line: 278, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !690, line: 272, size: 128, elements: !763)
!763 = !{!764, !765, !766, !767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !762, file: !690, line: 273, baseType: !623, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !762, file: !690, line: 274, baseType: !623, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !762, file: !690, line: 275, baseType: !623, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !762, file: !690, line: 277, baseType: !622, size: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !618, line: 468, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !618, line: 445, size: 1120, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !798, !802, !804}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !771, file: !618, line: 447, baseType: !622, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !771, file: !618, line: 448, baseType: !623, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !771, file: !618, line: 449, baseType: !623, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !771, file: !618, line: 450, baseType: !623, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !771, file: !618, line: 451, baseType: !623, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !771, file: !618, line: 452, baseType: !623, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !771, file: !618, line: 453, baseType: !780, size: 96, offset: 192)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 96, elements: !782)
!781 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!782 = !{!783}
!783 = !DISubrange(count: 12)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !771, file: !618, line: 454, baseType: !623, size: 32, offset: 288)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !771, file: !618, line: 455, baseType: !623, size: 32, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !771, file: !618, line: 456, baseType: !623, size: 32, offset: 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !771, file: !618, line: 457, baseType: !623, size: 32, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !771, file: !618, line: 458, baseType: !623, size: 32, offset: 416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !771, file: !618, line: 459, baseType: !623, size: 32, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !771, file: !618, line: 460, baseType: !623, size: 32, offset: 480)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !771, file: !618, line: 461, baseType: !705, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !771, file: !618, line: 462, baseType: !622, size: 32, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !771, file: !618, line: 463, baseType: !622, size: 32, offset: 608)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !771, file: !618, line: 464, baseType: !795, size: 128, offset: 640)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 128, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 4)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !771, file: !618, line: 465, baseType: !799, size: 160, offset: 768)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 160, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 5)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !771, file: !618, line: 466, baseType: !803, size: 160, offset: 928)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 160, elements: !800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !771, file: !618, line: 467, baseType: !623, size: 32, offset: 1088)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !807, file: !806, line: 167, baseType: !815)
!806 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!807 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !806, file: !806, line: 134, type: !808, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !685, retainedNodes: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !108}
!810 = !{!811, !812, !814}
!811 = !DILocalVariable(name: "time_us", arg: 1, scope: !807, file: !806, line: 134, type: !108)
!812 = !DILocalVariable(name: "delay_cycles", scope: !807, file: !806, line: 168, type: !813)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!814 = !DILocalVariable(name: "cycles", scope: !807, file: !806, line: 171, type: !108)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !690, line: 2399, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !690, line: 2373, size: 10880, elements: !819)
!819 = !{!820, !824, !825, !826, !827, !831, !832, !837, !838, !839, !840, !841, !842, !846, !847, !848, !849}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !818, file: !690, line: 2374, baseType: !821, size: 8192)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 8192, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !818, file: !690, line: 2375, baseType: !622, size: 32, offset: 8192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !818, file: !690, line: 2376, baseType: !622, size: 32, offset: 8224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !818, file: !690, line: 2377, baseType: !622, size: 32, offset: 8256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !818, file: !690, line: 2378, baseType: !828, size: 1984, offset: 8288)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1984, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 62)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !818, file: !690, line: 2379, baseType: !623, size: 32, offset: 10272)
!832 = !DIDerivedType(tag: DW_TAG_member, scope: !818, file: !690, line: 2381, baseType: !833, size: 32, offset: 10304)
!833 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !818, file: !690, line: 2381, size: 32, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !833, file: !690, line: 2382, baseType: !623, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !833, file: !690, line: 2383, baseType: !623, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !818, file: !690, line: 2386, baseType: !623, size: 32, offset: 10336)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !818, file: !690, line: 2387, baseType: !623, size: 32, offset: 10368)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !818, file: !690, line: 2389, baseType: !623, size: 32, offset: 10400)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !818, file: !690, line: 2391, baseType: !623, size: 32, offset: 10432)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !818, file: !690, line: 2393, baseType: !623, size: 32, offset: 10464)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !818, file: !690, line: 2394, baseType: !843, size: 256, offset: 10496)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 256, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 8)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !818, file: !690, line: 2395, baseType: !623, size: 32, offset: 10752)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !818, file: !690, line: 2396, baseType: !622, size: 32, offset: 10784)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !818, file: !690, line: 2397, baseType: !623, size: 32, offset: 10816)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !818, file: !690, line: 2398, baseType: !623, size: 32, offset: 10848)
!850 = !{!683, !851}
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !807, file: !806, line: 161, type: !853, isLocal: true, isDefinition: true, align: 128)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 48, elements: !729)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!855 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !858, line: 51, size: 64, elements: !859)
!858 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !{!860, !867}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !857, file: !858, line: 60, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{!107, !864}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !858, line: 48, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !857, file: !858, line: 65, baseType: !864, size: 32, offset: 32)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !870, file: !974, line: 36, type: !989, isLocal: true, isDefinition: true, align: 32)
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !872, retainedTypes: !884, globals: !970, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!872 = !{!873, !879}
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !874, line: 506, baseType: !32, size: 32, elements: !875)
!874 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!875 = !{!876, !877, !878}
!876 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!877 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!878 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !874, line: 512, baseType: !32, size: 32, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!882 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!883 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!884 = !{!885, !959, !964, !925, !879, !873, !969, !106}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !874, line: 523, size: 288, elements: !888)
!888 = !{!889, !915, !921, !926, !930, !931, !932, !936, !955}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !887, file: !874, line: 524, baseType: !890, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DISubroutineType(types: !892)
!892 = !{!107, !893, !913, !914}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !896, line: 378, size: 192, elements: !897)
!896 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!897 = !{!898, !899, !900, !901, !908, !909}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !895, file: !896, line: 380, baseType: !285, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !895, file: !896, line: 382, baseType: !13, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !895, file: !896, line: 384, baseType: !13, size: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !895, file: !896, line: 386, baseType: !902, size: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !896, line: 351, size: 16, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !903, file: !896, line: 359, baseType: !170, size: 8)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !903, file: !896, line: 364, baseType: !907, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!907 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !895, file: !896, line: 388, baseType: !106, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !895, file: !896, line: 396, baseType: !910, size: 32, offset: 160)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !896, line: 43, baseType: !398)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !874, line: 237, baseType: !170)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !874, line: 257, baseType: !108)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !887, file: !874, line: 530, baseType: !916, size: 32, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DISubroutineType(types: !918)
!918 = !{!107, !893, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !874, line: 229, baseType: !108)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !887, file: !874, line: 532, baseType: !922, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!107, !893, !925, !920}
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !874, line: 216, baseType: !108)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !887, file: !874, line: 535, baseType: !927, size: 32, offset: 96)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DISubroutineType(types: !929)
!929 = !{!107, !893, !925}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !887, file: !874, line: 537, baseType: !927, size: 32, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !887, file: !874, line: 539, baseType: !927, size: 32, offset: 160)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !887, file: !874, line: 541, baseType: !933, size: 32, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DISubroutineType(types: !935)
!935 = !{!107, !893, !913, !873, !879}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !887, file: !874, line: 544, baseType: !937, size: 32, offset: 224)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{!107, !893, !940, !907}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !874, line: 478, size: 96, elements: !942)
!942 = !{!943, !949, !954}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !941, file: !874, line: 482, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !348, line: 33, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !348, line: 29, size: 32, elements: !946)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !945, file: !348, line: 30, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !941, file: !874, line: 485, baseType: !950, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !874, line: 464, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !893, !940, !925}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !941, file: !874, line: 493, baseType: !925, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !887, file: !874, line: 547, baseType: !956, size: 32, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DISubroutineType(types: !958)
!958 = !{!108, !893}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !874, line: 428, size: 32, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !961, file: !874, line: 434, baseType: !925, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !874, line: 441, size: 32, elements: !967)
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !966, file: !874, line: 447, baseType: !925, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!970 = !{!868, !971, !987}
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "pull_up", scope: !973, file: !974, line: 15, type: !980, isLocal: true, isDefinition: true)
!973 = distinct !DISubprogram(name: "board_init", scope: !974, file: !974, line: 10, type: !975, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !870, retainedNodes: !977)
!974 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!975 = !DISubroutineType(types: !976)
!976 = !{!107, !893}
!977 = !{!978, !979}
!978 = !DILocalVariable(name: "dev", arg: 1, scope: !973, file: !974, line: 10, type: !893)
!979 = !DILocalVariable(name: "res", scope: !973, file: !974, line: 14, type: !107)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !874, line: 271, size: 64, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !981, file: !874, line: 273, baseType: !893, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !981, file: !874, line: 275, baseType: !913, size: 8, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !981, file: !874, line: 277, baseType: !986, size: 16, offset: 48)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !874, line: 249, baseType: !184)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "user_led", scope: !973, file: !974, line: 17, type: !980, isLocal: true, isDefinition: true)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !858, line: 51, size: 64, elements: !991)
!991 = !{!992, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !990, file: !858, line: 60, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !990, file: !858, line: 65, baseType: !893, size: 32, offset: 32)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !997, file: !1232, line: 733, type: !1333, isLocal: false, isDefinition: true, align: 32)
!997 = distinct !DICompileUnit(language: DW_LANG_C99, file: !998, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !999, retainedTypes: !1142, globals: !1228, splitDebugInlining: false, nameTableKind: None)
!998 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/tracing")
!999 = !{!1000, !1006, !30, !1011, !1016, !1023, !1031, !1039, !1048, !1052, !1107, !1114, !1133}
!1000 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !1001, line: 23, baseType: !32, size: 32, elements: !1002)
!1001 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1002 = !{!1003, !1004, !1005}
!1003 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!1004 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!1005 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !1001, line: 48, baseType: !32, size: 32, elements: !1007)
!1007 = !{!1008, !1009, !1010}
!1008 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!1009 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
