; ModuleID = 'build/adafruit_trinket_m0/subsys/logging/logger/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.log_source_dynamic_data = type { i32 }
%struct.sample_instance = type { %struct.log_source_dynamic_data*, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_handler", scope: !27, file: !114, line: 9, type: !115, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !110, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/logger/src/ext_log_system.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!29 = !{!30, !40}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ext_log_level", file: !31, line: 14, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/ext_log_system.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39}
!34 = !DIEnumerator(name: "EXT_LOG_CRITICAL", value: 0)
!35 = !DIEnumerator(name: "EXT_LOG_ERROR", value: 1)
!36 = !DIEnumerator(name: "EXT_LOG_WARNING", value: 2)
!37 = !DIEnumerator(name: "EXT_LOG_NOTICE", value: 3)
!38 = !DIEnumerator(name: "EXT_LOG_INFO", value: 4)
!39 = !DIEnumerator(name: "EXT_LOG_DEBUG", value: 5)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !41, line: 27, baseType: !32, size: 32, elements: !42)
!41 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!43 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!44 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!45 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!46 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!47 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!48 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!49 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!50 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!51 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!52 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!53 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!54 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!55 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!56 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!57 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!58 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!59 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!109 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!112 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!113 = !{!25}
!114 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/ext_log_system.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ext_log_handler", file: !31, line: 24, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !30, !119, null}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "log_const_ext_log_system", scope: !124, file: !130, line: 13, type: !144, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, globals: !127, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/logger/src/ext_log_system_adapter.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!126 = !{!30}
!127 = !{!122, !128, !136}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "log_dynamic_ext_log_system", scope: !124, file: !130, line: 13, type: !131, isLocal: false, isDefinition: true)
!130 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/ext_log_system_adapter.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !131, file: !132, line: 30, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "log_level_lut", scope: !124, file: !130, line: 16, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 48, elements: !142)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !141)
!141 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!142 = !{!143}
!143 = !DISubrange(count: 6)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !132, line: 16, size: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !132, line: 17, baseType: !119, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !145, file: !132, line: 18, baseType: !140, size: 8, offset: 32)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "log_const_main", scope: !151, file: !221, line: 18, type: !222, isLocal: false, isDefinition: true)
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !153, retainedTypes: !165, globals: !218, splitDebugInlining: false, nameTableKind: None)
!152 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/logger/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!153 = !{!40, !154, !160}
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !155, line: 121, baseType: !32, size: 32, elements: !156)
!155 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!156 = !{!157, !158, !159}
!157 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!158 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!159 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !161, line: 33, baseType: !32, size: 32, elements: !162)
!161 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!162 = !{!163, !164}
!163 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!164 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!165 = !{!111, !112, !166, !135, !170, !172, !184, !140, !185, !213, !217}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !167, line: 46, baseType: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !169)
!169 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !171)
!171 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !174, line: 78, size: 32, elements: !175)
!174 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!175 = !{!176, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !173, file: !174, line: 80, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !174, line: 45, size: 32, elements: !178)
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !177, file: !174, line: 47, baseType: !140, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !177, file: !174, line: 50, baseType: !140, size: 8, offset: 8)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !177, file: !174, line: 53, baseType: !140, size: 8, offset: 16)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !177, file: !174, line: 56, baseType: !140, size: 8, offset: 24)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !173, file: !174, line: 82, baseType: !111, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !155, line: 88, size: 128, elements: !187)
!187 = !{!188, !205, !209}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !186, file: !155, line: 89, baseType: !189, size: 96)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !155, line: 66, size: 96, elements: !190)
!190 = !{!191, !202, !203}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !189, file: !155, line: 67, baseType: !192, size: 32)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !155, line: 51, size: 32, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !192, file: !155, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !192, file: !155, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !155, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !192, file: !155, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !192, file: !155, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !192, file: !155, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !192, file: !155, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !192, file: !155, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !189, file: !155, line: 75, baseType: !13, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !189, file: !155, line: 76, baseType: !204, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !155, line: 35, baseType: !135)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !186, file: !155, line: 93, baseType: !206, size: 32, offset: 96)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 32, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 4)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !155, line: 94, baseType: !210, offset: 128)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: -1)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !214, file: !132, line: 30, baseType: !135, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!218 = !{!149, !219, !227, !234, !236, !238, !382, !386, !388, !390, !392, !397, !399, !542, !544, !547, !676}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "log_const_sample_instance_inst1", scope: !151, file: !221, line: 38, type: !222, isLocal: false, isDefinition: true)
!221 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !132, line: 16, size: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !132, line: 17, baseType: !119, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !223, file: !132, line: 18, baseType: !140, size: 8, offset: 32)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "inst1", scope: !151, file: !221, line: 38, type: !229, isLocal: false, isDefinition: true)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sample_instance", file: !230, line: 15, size: 64, elements: !231)
!230 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/sample_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !229, file: !230, line: 16, baseType: !213, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !229, file: !230, line: 17, baseType: !135, size: 32, offset: 32)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "log_const_sample_instance_inst2", scope: !151, file: !221, line: 41, type: !222, isLocal: false, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "inst2", scope: !151, file: !221, line: 41, type: !229, isLocal: false, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "_k_thread_data_log_demo_thread_id", scope: !151, file: !221, line: 328, type: !240, isLocal: false, isDefinition: true, align: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !241, line: 620, size: 384, elements: !242)
!241 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !{!243, !356, !364, !365, !370, !371, !372, !373, !374, !375, !377, !381}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !240, file: !241, line: 621, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !246, line: 245, size: 896, elements: !247)
!246 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!247 = !{!248, !315, !328, !329, !330, !331, !351}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !245, file: !246, line: 247, baseType: !249, size: 384)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !246, line: 57, size: 384, elements: !250)
!250 = !{!251, !279, !287, !288, !289, !302, !303, !304}
!251 = !DIDerivedType(tag: DW_TAG_member, scope: !249, file: !246, line: 60, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !246, line: 60, size: 64, elements: !253)
!253 = !{!254, !270}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !252, file: !246, line: 61, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !256, line: 49, baseType: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !256, line: 37, size: 64, elements: !258)
!258 = !{!259, !265}
!259 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !256, line: 38, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !256, line: 38, size: 32, elements: !261)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !260, file: !256, line: 39, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !256, line: 40, baseType: !263, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !256, line: 42, baseType: !266, size: 32, offset: 32)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !256, line: 42, size: 32, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !266, file: !256, line: 43, baseType: !263, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !266, file: !256, line: 44, baseType: !263, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !252, file: !246, line: 62, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !272, line: 49, size: 64, elements: !273)
!272 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !271, file: !272, line: 50, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, elements: !277)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!277 = !{!278}
!278 = !DISubrange(count: 2)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !249, file: !246, line: 68, baseType: !280, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !282, line: 233, baseType: !283)
!282 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 231, size: 64, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !283, file: !282, line: 232, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !256, line: 48, baseType: !257)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !249, file: !246, line: 71, baseType: !140, size: 8, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !249, file: !246, line: 74, baseType: !140, size: 8, offset: 104)
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !249, file: !246, line: 90, baseType: !290, size: 16, offset: 112)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !246, line: 90, size: 16, elements: !291)
!291 = !{!292, !299}
!292 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !246, line: 91, baseType: !293, size: 16)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !246, line: 91, size: 16, elements: !294)
!294 = !{!295, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !293, file: !246, line: 96, baseType: !296, size: 8)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !297)
!297 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !293, file: !246, line: 97, baseType: !140, size: 8, offset: 8)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !290, file: !246, line: 100, baseType: !300, size: 16)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !301)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !249, file: !246, line: 107, baseType: !135, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !249, file: !246, line: 127, baseType: !111, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !249, file: !246, line: 131, baseType: !305, size: 192, offset: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !282, line: 244, size: 192, elements: !306)
!306 = !{!307, !308, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !282, line: 245, baseType: !255, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !305, file: !282, line: 246, baseType: !309, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !282, line: 242, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !305, file: !282, line: 249, baseType: !168, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !245, file: !246, line: 250, baseType: !316, size: 288, offset: 384)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !317, line: 25, size: 288, elements: !318)
!317 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !316, file: !317, line: 26, baseType: !135, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !316, file: !317, line: 27, baseType: !135, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !316, file: !317, line: 28, baseType: !135, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !316, file: !317, line: 29, baseType: !135, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !316, file: !317, line: 30, baseType: !135, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !316, file: !317, line: 31, baseType: !135, size: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !316, file: !317, line: 32, baseType: !135, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !316, file: !317, line: 33, baseType: !135, size: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !316, file: !317, line: 34, baseType: !135, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !245, file: !246, line: 253, baseType: !111, size: 32, offset: 672)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !245, file: !246, line: 256, baseType: !281, size: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !245, file: !246, line: 294, baseType: !112, size: 32, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !245, file: !246, line: 325, baseType: !332, size: 32, offset: 800)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !241, line: 5073, size: 160, elements: !334)
!334 = !{!335, !346, !347}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !333, file: !241, line: 5074, baseType: !336, size: 96)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !337, line: 56, size: 96, elements: !338)
!337 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !{!339, !342, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !336, file: !337, line: 57, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !337, line: 57, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !336, file: !337, line: 58, baseType: !111, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !336, file: !337, line: 59, baseType: !344, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !345, line: 214, baseType: !32)
!345 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !333, file: !241, line: 5075, baseType: !281, size: 64, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !333, file: !241, line: 5076, baseType: !348, offset: 160)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !349, line: 43, elements: !350)
!349 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!350 = !{}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !245, file: !246, line: 343, baseType: !352, size: 64, offset: 832)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !317, line: 60, size: 64, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !352, file: !317, line: 63, baseType: !135, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !352, file: !317, line: 66, baseType: !135, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !240, file: !241, line: 622, baseType: !357, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !359, line: 44, baseType: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !361, line: 47, size: 8, elements: !362)
!361 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !360, file: !361, line: 48, baseType: !121, size: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !240, file: !241, line: 623, baseType: !32, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !240, file: !241, line: 624, baseType: !366, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !359, line: 46, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !111, !111, !111}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !240, file: !241, line: 625, baseType: !111, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !240, file: !241, line: 626, baseType: !111, size: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !240, file: !241, line: 627, baseType: !111, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !240, file: !241, line: 628, baseType: !112, size: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !240, file: !241, line: 629, baseType: !135, size: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !240, file: !241, line: 630, baseType: !376, size: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !112)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !240, file: !241, line: 631, baseType: !378, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = !DISubroutineType(types: !380)
!380 = !{null}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !240, file: !241, line: 632, baseType: !119, size: 32, offset: 352)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "log_demo_thread_id", scope: !151, file: !221, line: 328, type: !384, isLocal: false, isDefinition: true)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !246, line: 347, baseType: !244)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "log_dynamic_main", scope: !151, file: !221, line: 18, type: !214, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "log_dynamic_sample_instance_inst1", scope: !151, file: !221, line: 38, type: !214, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "log_dynamic_sample_instance_inst2", scope: !151, file: !221, line: 41, type: !214, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "_k_thread_stack_log_demo_thread_id", scope: !151, file: !221, line: 328, type: !394, isLocal: false, isDefinition: true, align: 64)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 8192, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 1024)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "_k_thread_obj_log_demo_thread_id", scope: !151, file: !221, line: 328, type: !245, isLocal: false, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !401, file: !402, line: 22, type: !541, isLocal: true, isDefinition: true)
!401 = distinct !DISubprogram(name: "inline_func", scope: !402, file: !402, line: 20, type: !379, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !151, retainedNodes: !403)
!402 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/sample_module.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !407, !408, !409, !410, !413, !415, !419, !420, !424, !425, !426, !427, !429, !430, !431, !432, !433, !434, !435, !436, !437, !441, !445, !449, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !466, !469, !470, !471, !474, !476, !478, !481, !482, !483, !487, !488, !493, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !526, !528, !529, !530, !533, !535, !537, !540}
!404 = !DILocalVariable(name: "is_user_context", scope: !405, file: !402, line: 24, type: !406)
!405 = distinct !DILexicalBlock(scope: !401, file: !402, line: 24, column: 2)
!406 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!407 = !DILocalVariable(name: "filters", scope: !405, file: !402, line: 24, type: !135)
!408 = !DILocalVariable(name: "_mode", scope: !405, file: !402, line: 24, type: !112)
!409 = !DILocalVariable(name: "_src", scope: !405, file: !402, line: 24, type: !111)
!410 = !DILocalVariable(name: "has_rw_str", scope: !411, file: !402, line: 24, type: !406)
!411 = distinct !DILexicalBlock(scope: !412, file: !402, line: 24, column: 2)
!412 = distinct !DILexicalBlock(scope: !405, file: !402, line: 24, column: 2)
!413 = !DILocalVariable(name: "_rv", scope: !414, file: !402, line: 24, type: !112)
!414 = distinct !DILexicalBlock(scope: !411, file: !402, line: 24, column: 2)
!415 = !DILocalVariable(name: "_plen", scope: !416, file: !402, line: 24, type: !112)
!416 = distinct !DILexicalBlock(scope: !417, file: !402, line: 24, column: 2)
!417 = distinct !DILexicalBlock(scope: !418, file: !402, line: 24, column: 2)
!418 = distinct !DILexicalBlock(scope: !411, file: !402, line: 24, column: 2)
!419 = !DILocalVariable(name: "flags", scope: !416, file: !402, line: 24, type: !135)
!420 = !DILocalVariable(name: "_flags", scope: !421, file: !402, line: 24, type: !135)
!421 = distinct !DILexicalBlock(scope: !422, file: !402, line: 24, column: 2)
!422 = distinct !DILexicalBlock(scope: !423, file: !402, line: 24, column: 2)
!423 = distinct !DILexicalBlock(scope: !416, file: !402, line: 24, column: 2)
!424 = !DILocalVariable(name: "_ros_pos_en", scope: !421, file: !402, line: 24, type: !406)
!425 = !DILocalVariable(name: "_rws_pos_en", scope: !421, file: !402, line: 24, type: !406)
!426 = !DILocalVariable(name: "_cros_en", scope: !421, file: !402, line: 24, type: !406)
!427 = !DILocalVariable(name: "_pbuf", scope: !421, file: !402, line: 24, type: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!429 = !DILocalVariable(name: "_rws_pos_idx", scope: !421, file: !402, line: 24, type: !140)
!430 = !DILocalVariable(name: "_ros_pos_idx", scope: !421, file: !402, line: 24, type: !140)
!431 = !DILocalVariable(name: "_alls_cnt", scope: !421, file: !402, line: 24, type: !140)
!432 = !DILocalVariable(name: "_fros_cnt", scope: !421, file: !402, line: 24, type: !140)
!433 = !DILocalVariable(name: "_rws_cnt", scope: !421, file: !402, line: 24, type: !140)
!434 = !DILocalVariable(name: "_ros_cnt", scope: !421, file: !402, line: 24, type: !140)
!435 = !DILocalVariable(name: "_ros_pos_buf", scope: !421, file: !402, line: 24, type: !428)
!436 = !DILocalVariable(name: "_ros_pos_buf_buf4", scope: !421, file: !402, line: 24, type: !206)
!437 = !DILocalVariable(name: "_ros_pos_buf_buf8", scope: !421, file: !402, line: 24, type: !438)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 8)
!441 = !DILocalVariable(name: "_ros_pos_buf_buf12", scope: !421, file: !402, line: 24, type: !442)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 96, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 12)
!445 = !DILocalVariable(name: "_ros_pos_buf_buf16", scope: !421, file: !402, line: 24, type: !446)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 16)
!449 = !DILocalVariable(name: "_ros_pos_buf_buf32", scope: !421, file: !402, line: 24, type: !450)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 256, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 32)
!453 = !DILocalVariable(name: "_rws_buffer", scope: !421, file: !402, line: 24, type: !428)
!454 = !DILocalVariable(name: "_rws_buffer_buf4", scope: !421, file: !402, line: 24, type: !206)
!455 = !DILocalVariable(name: "_rws_buffer_buf8", scope: !421, file: !402, line: 24, type: !438)
!456 = !DILocalVariable(name: "_rws_buffer_buf12", scope: !421, file: !402, line: 24, type: !442)
!457 = !DILocalVariable(name: "_rws_buffer_buf16", scope: !421, file: !402, line: 24, type: !446)
!458 = !DILocalVariable(name: "_rws_buffer_buf32", scope: !421, file: !402, line: 24, type: !450)
!459 = !DILocalVariable(name: "_pmax", scope: !421, file: !402, line: 24, type: !344)
!460 = !DILocalVariable(name: "_pkg_len", scope: !421, file: !402, line: 24, type: !112)
!461 = !DILocalVariable(name: "_total_len", scope: !421, file: !402, line: 24, type: !112)
!462 = !DILocalVariable(name: "_pkg_offset", scope: !421, file: !402, line: 24, type: !112)
!463 = !DILocalVariable(name: "_len_loc", scope: !421, file: !402, line: 24, type: !172)
!464 = !DILocalVariable(name: "_arg_size", scope: !465, file: !402, line: 24, type: !135)
!465 = distinct !DILexicalBlock(scope: !421, file: !402, line: 24, column: 2)
!466 = !DILocalVariable(name: "__v", scope: !467, file: !402, line: 24, type: !468)
!467 = distinct !DILexicalBlock(scope: !465, file: !402, line: 24, column: 2)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!469 = !DILocalVariable(name: "__arg_size", scope: !467, file: !402, line: 24, type: !344)
!470 = !DILocalVariable(name: "_loc", scope: !465, file: !402, line: 24, type: !135)
!471 = !DILocalVariable(name: "_pbuf_loc", scope: !472, file: !402, line: 24, type: !428)
!472 = distinct !DILexicalBlock(scope: !473, file: !402, line: 24, column: 2)
!473 = distinct !DILexicalBlock(scope: !421, file: !402, line: 24, column: 2)
!474 = !DILocalVariable(name: "i", scope: !475, file: !402, line: 24, type: !344)
!475 = distinct !DILexicalBlock(scope: !472, file: !402, line: 24, column: 2)
!476 = !DILocalVariable(name: "i", scope: !477, file: !402, line: 24, type: !344)
!477 = distinct !DILexicalBlock(scope: !472, file: !402, line: 24, column: 2)
!478 = !DILocalVariable(name: "hdr", scope: !479, file: !402, line: 24, type: !173)
!479 = distinct !DILexicalBlock(scope: !480, file: !402, line: 24, column: 2)
!480 = distinct !DILexicalBlock(scope: !421, file: !402, line: 24, column: 2)
!481 = !DILocalVariable(name: "_msg", scope: !416, file: !402, line: 24, type: !185)
!482 = !DILocalVariable(name: "__vla_expr0", scope: !416, type: !32, flags: DIFlagArtificial)
!483 = !DILocalVariable(name: "_ll_buf", scope: !416, file: !402, line: 24, type: !484)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: !482)
!487 = !DILocalVariable(name: "__vla_expr1", scope: !416, type: !32, flags: DIFlagArtificial)
!488 = !DILocalVariable(name: "_ld_buf", scope: !416, file: !402, line: 24, type: !489)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, elements: !491)
!490 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!491 = !{!492}
!492 = !DISubrange(count: !487)
!493 = !DILocalVariable(name: "_flags", scope: !494, file: !402, line: 24, type: !135)
!494 = distinct !DILexicalBlock(scope: !495, file: !402, line: 24, column: 2)
!495 = distinct !DILexicalBlock(scope: !496, file: !402, line: 24, column: 2)
!496 = distinct !DILexicalBlock(scope: !416, file: !402, line: 24, column: 2)
!497 = !DILocalVariable(name: "_ros_pos_en", scope: !494, file: !402, line: 24, type: !406)
!498 = !DILocalVariable(name: "_rws_pos_en", scope: !494, file: !402, line: 24, type: !406)
!499 = !DILocalVariable(name: "_cros_en", scope: !494, file: !402, line: 24, type: !406)
!500 = !DILocalVariable(name: "_pbuf", scope: !494, file: !402, line: 24, type: !428)
!501 = !DILocalVariable(name: "_rws_pos_idx", scope: !494, file: !402, line: 24, type: !140)
!502 = !DILocalVariable(name: "_ros_pos_idx", scope: !494, file: !402, line: 24, type: !140)
!503 = !DILocalVariable(name: "_alls_cnt", scope: !494, file: !402, line: 24, type: !140)
!504 = !DILocalVariable(name: "_fros_cnt", scope: !494, file: !402, line: 24, type: !140)
!505 = !DILocalVariable(name: "_rws_cnt", scope: !494, file: !402, line: 24, type: !140)
!506 = !DILocalVariable(name: "_ros_cnt", scope: !494, file: !402, line: 24, type: !140)
!507 = !DILocalVariable(name: "_ros_pos_buf", scope: !494, file: !402, line: 24, type: !428)
!508 = !DILocalVariable(name: "_ros_pos_buf_buf4", scope: !494, file: !402, line: 24, type: !206)
!509 = !DILocalVariable(name: "_ros_pos_buf_buf8", scope: !494, file: !402, line: 24, type: !438)
!510 = !DILocalVariable(name: "_ros_pos_buf_buf12", scope: !494, file: !402, line: 24, type: !442)
!511 = !DILocalVariable(name: "_ros_pos_buf_buf16", scope: !494, file: !402, line: 24, type: !446)
!512 = !DILocalVariable(name: "_ros_pos_buf_buf32", scope: !494, file: !402, line: 24, type: !450)
!513 = !DILocalVariable(name: "_rws_buffer", scope: !494, file: !402, line: 24, type: !428)
!514 = !DILocalVariable(name: "_rws_buffer_buf4", scope: !494, file: !402, line: 24, type: !206)
!515 = !DILocalVariable(name: "_rws_buffer_buf8", scope: !494, file: !402, line: 24, type: !438)
!516 = !DILocalVariable(name: "_rws_buffer_buf12", scope: !494, file: !402, line: 24, type: !442)
!517 = !DILocalVariable(name: "_rws_buffer_buf16", scope: !494, file: !402, line: 24, type: !446)
!518 = !DILocalVariable(name: "_rws_buffer_buf32", scope: !494, file: !402, line: 24, type: !450)
!519 = !DILocalVariable(name: "_pmax", scope: !494, file: !402, line: 24, type: !344)
!520 = !DILocalVariable(name: "_pkg_len", scope: !494, file: !402, line: 24, type: !112)
!521 = !DILocalVariable(name: "_total_len", scope: !494, file: !402, line: 24, type: !112)
!522 = !DILocalVariable(name: "_pkg_offset", scope: !494, file: !402, line: 24, type: !112)
!523 = !DILocalVariable(name: "_len_loc", scope: !494, file: !402, line: 24, type: !172)
!524 = !DILocalVariable(name: "_arg_size", scope: !525, file: !402, line: 24, type: !135)
!525 = distinct !DILexicalBlock(scope: !494, file: !402, line: 24, column: 2)
!526 = !DILocalVariable(name: "__v", scope: !527, file: !402, line: 24, type: !468)
!527 = distinct !DILexicalBlock(scope: !525, file: !402, line: 24, column: 2)
!528 = !DILocalVariable(name: "__arg_size", scope: !527, file: !402, line: 24, type: !344)
!529 = !DILocalVariable(name: "_loc", scope: !525, file: !402, line: 24, type: !135)
!530 = !DILocalVariable(name: "_pbuf_loc", scope: !531, file: !402, line: 24, type: !428)
!531 = distinct !DILexicalBlock(scope: !532, file: !402, line: 24, column: 2)
!532 = distinct !DILexicalBlock(scope: !494, file: !402, line: 24, column: 2)
!533 = !DILocalVariable(name: "i", scope: !534, file: !402, line: 24, type: !344)
!534 = distinct !DILexicalBlock(scope: !531, file: !402, line: 24, column: 2)
!535 = !DILocalVariable(name: "i", scope: !536, file: !402, line: 24, type: !344)
!536 = distinct !DILexicalBlock(scope: !531, file: !402, line: 24, column: 2)
!537 = !DILocalVariable(name: "hdr", scope: !538, file: !402, line: 24, type: !173)
!538 = distinct !DILexicalBlock(scope: !539, file: !402, line: 24, column: 2)
!539 = distinct !DILexicalBlock(scope: !494, file: !402, line: 24, column: 2)
!540 = !DILocalVariable(name: "_desc", scope: !416, file: !402, line: 24, type: !192)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !401, file: !402, line: 22, type: !213, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "__log_level", scope: !401, file: !402, line: 22, type: !546, isLocal: true, isDefinition: true)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "__log_level", scope: !549, file: !230, line: 30, type: !546, isLocal: true, isDefinition: true)
!549 = distinct !DISubprogram(name: "sample_instance_inline_call", scope: !230, file: !230, line: 28, type: !550, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !151, retainedNodes: !553)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!553 = !{!554, !555, !557, !558, !559, !560, !563, !565, !569, !570, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !603, !605, !606, !607, !610, !612, !614, !617, !618, !619, !623, !624, !628, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !661, !663, !664, !665, !668, !670, !672, !675}
!554 = !DILocalVariable(name: "inst", arg: 1, scope: !549, file: !230, line: 28, type: !552)
!555 = !DILocalVariable(name: "is_user_context", scope: !556, file: !230, line: 32, type: !406)
!556 = distinct !DILexicalBlock(scope: !549, file: !230, line: 32, column: 2)
!557 = !DILocalVariable(name: "filters", scope: !556, file: !230, line: 32, type: !135)
!558 = !DILocalVariable(name: "_mode", scope: !556, file: !230, line: 32, type: !112)
!559 = !DILocalVariable(name: "_src", scope: !556, file: !230, line: 32, type: !111)
!560 = !DILocalVariable(name: "has_rw_str", scope: !561, file: !230, line: 32, type: !406)
!561 = distinct !DILexicalBlock(scope: !562, file: !230, line: 32, column: 2)
!562 = distinct !DILexicalBlock(scope: !556, file: !230, line: 32, column: 2)
!563 = !DILocalVariable(name: "_rv", scope: !564, file: !230, line: 32, type: !112)
!564 = distinct !DILexicalBlock(scope: !561, file: !230, line: 32, column: 2)
!565 = !DILocalVariable(name: "_plen", scope: !566, file: !230, line: 32, type: !112)
!566 = distinct !DILexicalBlock(scope: !567, file: !230, line: 32, column: 2)
!567 = distinct !DILexicalBlock(scope: !568, file: !230, line: 32, column: 2)
!568 = distinct !DILexicalBlock(scope: !561, file: !230, line: 32, column: 2)
!569 = !DILocalVariable(name: "flags", scope: !566, file: !230, line: 32, type: !135)
!570 = !DILocalVariable(name: "_flags", scope: !571, file: !230, line: 32, type: !135)
!571 = distinct !DILexicalBlock(scope: !572, file: !230, line: 32, column: 2)
!572 = distinct !DILexicalBlock(scope: !573, file: !230, line: 32, column: 2)
!573 = distinct !DILexicalBlock(scope: !566, file: !230, line: 32, column: 2)
!574 = !DILocalVariable(name: "_ros_pos_en", scope: !571, file: !230, line: 32, type: !406)
!575 = !DILocalVariable(name: "_rws_pos_en", scope: !571, file: !230, line: 32, type: !406)
!576 = !DILocalVariable(name: "_cros_en", scope: !571, file: !230, line: 32, type: !406)
!577 = !DILocalVariable(name: "_pbuf", scope: !571, file: !230, line: 32, type: !428)
!578 = !DILocalVariable(name: "_rws_pos_idx", scope: !571, file: !230, line: 32, type: !140)
!579 = !DILocalVariable(name: "_ros_pos_idx", scope: !571, file: !230, line: 32, type: !140)
!580 = !DILocalVariable(name: "_alls_cnt", scope: !571, file: !230, line: 32, type: !140)
!581 = !DILocalVariable(name: "_fros_cnt", scope: !571, file: !230, line: 32, type: !140)
!582 = !DILocalVariable(name: "_rws_cnt", scope: !571, file: !230, line: 32, type: !140)
!583 = !DILocalVariable(name: "_ros_cnt", scope: !571, file: !230, line: 32, type: !140)
!584 = !DILocalVariable(name: "_ros_pos_buf", scope: !571, file: !230, line: 32, type: !428)
!585 = !DILocalVariable(name: "_ros_pos_buf_buf4", scope: !571, file: !230, line: 32, type: !206)
!586 = !DILocalVariable(name: "_ros_pos_buf_buf8", scope: !571, file: !230, line: 32, type: !438)
!587 = !DILocalVariable(name: "_ros_pos_buf_buf12", scope: !571, file: !230, line: 32, type: !442)
!588 = !DILocalVariable(name: "_ros_pos_buf_buf16", scope: !571, file: !230, line: 32, type: !446)
!589 = !DILocalVariable(name: "_ros_pos_buf_buf32", scope: !571, file: !230, line: 32, type: !450)
!590 = !DILocalVariable(name: "_rws_buffer", scope: !571, file: !230, line: 32, type: !428)
!591 = !DILocalVariable(name: "_rws_buffer_buf4", scope: !571, file: !230, line: 32, type: !206)
!592 = !DILocalVariable(name: "_rws_buffer_buf8", scope: !571, file: !230, line: 32, type: !438)
!593 = !DILocalVariable(name: "_rws_buffer_buf12", scope: !571, file: !230, line: 32, type: !442)
!594 = !DILocalVariable(name: "_rws_buffer_buf16", scope: !571, file: !230, line: 32, type: !446)
!595 = !DILocalVariable(name: "_rws_buffer_buf32", scope: !571, file: !230, line: 32, type: !450)
!596 = !DILocalVariable(name: "_pmax", scope: !571, file: !230, line: 32, type: !344)
!597 = !DILocalVariable(name: "_pkg_len", scope: !571, file: !230, line: 32, type: !112)
!598 = !DILocalVariable(name: "_total_len", scope: !571, file: !230, line: 32, type: !112)
!599 = !DILocalVariable(name: "_pkg_offset", scope: !571, file: !230, line: 32, type: !112)
!600 = !DILocalVariable(name: "_len_loc", scope: !571, file: !230, line: 32, type: !172)
!601 = !DILocalVariable(name: "_arg_size", scope: !602, file: !230, line: 32, type: !135)
!602 = distinct !DILexicalBlock(scope: !571, file: !230, line: 32, column: 2)
!603 = !DILocalVariable(name: "__v", scope: !604, file: !230, line: 32, type: !468)
!604 = distinct !DILexicalBlock(scope: !602, file: !230, line: 32, column: 2)
!605 = !DILocalVariable(name: "__arg_size", scope: !604, file: !230, line: 32, type: !344)
!606 = !DILocalVariable(name: "_loc", scope: !602, file: !230, line: 32, type: !135)
!607 = !DILocalVariable(name: "_pbuf_loc", scope: !608, file: !230, line: 32, type: !428)
!608 = distinct !DILexicalBlock(scope: !609, file: !230, line: 32, column: 2)
!609 = distinct !DILexicalBlock(scope: !571, file: !230, line: 32, column: 2)
!610 = !DILocalVariable(name: "i", scope: !611, file: !230, line: 32, type: !344)
!611 = distinct !DILexicalBlock(scope: !608, file: !230, line: 32, column: 2)
!612 = !DILocalVariable(name: "i", scope: !613, file: !230, line: 32, type: !344)
!613 = distinct !DILexicalBlock(scope: !608, file: !230, line: 32, column: 2)
!614 = !DILocalVariable(name: "hdr", scope: !615, file: !230, line: 32, type: !173)
!615 = distinct !DILexicalBlock(scope: !616, file: !230, line: 32, column: 2)
!616 = distinct !DILexicalBlock(scope: !571, file: !230, line: 32, column: 2)
!617 = !DILocalVariable(name: "_msg", scope: !566, file: !230, line: 32, type: !185)
!618 = !DILocalVariable(name: "__vla_expr0", scope: !566, type: !32, flags: DIFlagArtificial)
!619 = !DILocalVariable(name: "_ll_buf", scope: !566, file: !230, line: 32, type: !620)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: !618)
!623 = !DILocalVariable(name: "__vla_expr1", scope: !566, type: !32, flags: DIFlagArtificial)
!624 = !DILocalVariable(name: "_ld_buf", scope: !566, file: !230, line: 32, type: !625)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: !623)
!628 = !DILocalVariable(name: "_flags", scope: !629, file: !230, line: 32, type: !135)
!629 = distinct !DILexicalBlock(scope: !630, file: !230, line: 32, column: 2)
!630 = distinct !DILexicalBlock(scope: !631, file: !230, line: 32, column: 2)
!631 = distinct !DILexicalBlock(scope: !566, file: !230, line: 32, column: 2)
!632 = !DILocalVariable(name: "_ros_pos_en", scope: !629, file: !230, line: 32, type: !406)
!633 = !DILocalVariable(name: "_rws_pos_en", scope: !629, file: !230, line: 32, type: !406)
!634 = !DILocalVariable(name: "_cros_en", scope: !629, file: !230, line: 32, type: !406)
!635 = !DILocalVariable(name: "_pbuf", scope: !629, file: !230, line: 32, type: !428)
!636 = !DILocalVariable(name: "_rws_pos_idx", scope: !629, file: !230, line: 32, type: !140)
!637 = !DILocalVariable(name: "_ros_pos_idx", scope: !629, file: !230, line: 32, type: !140)
!638 = !DILocalVariable(name: "_alls_cnt", scope: !629, file: !230, line: 32, type: !140)
!639 = !DILocalVariable(name: "_fros_cnt", scope: !629, file: !230, line: 32, type: !140)
!640 = !DILocalVariable(name: "_rws_cnt", scope: !629, file: !230, line: 32, type: !140)
!641 = !DILocalVariable(name: "_ros_cnt", scope: !629, file: !230, line: 32, type: !140)
!642 = !DILocalVariable(name: "_ros_pos_buf", scope: !629, file: !230, line: 32, type: !428)
!643 = !DILocalVariable(name: "_ros_pos_buf_buf4", scope: !629, file: !230, line: 32, type: !206)
!644 = !DILocalVariable(name: "_ros_pos_buf_buf8", scope: !629, file: !230, line: 32, type: !438)
!645 = !DILocalVariable(name: "_ros_pos_buf_buf12", scope: !629, file: !230, line: 32, type: !442)
!646 = !DILocalVariable(name: "_ros_pos_buf_buf16", scope: !629, file: !230, line: 32, type: !446)
!647 = !DILocalVariable(name: "_ros_pos_buf_buf32", scope: !629, file: !230, line: 32, type: !450)
!648 = !DILocalVariable(name: "_rws_buffer", scope: !629, file: !230, line: 32, type: !428)
!649 = !DILocalVariable(name: "_rws_buffer_buf4", scope: !629, file: !230, line: 32, type: !206)
!650 = !DILocalVariable(name: "_rws_buffer_buf8", scope: !629, file: !230, line: 32, type: !438)
!651 = !DILocalVariable(name: "_rws_buffer_buf12", scope: !629, file: !230, line: 32, type: !442)
!652 = !DILocalVariable(name: "_rws_buffer_buf16", scope: !629, file: !230, line: 32, type: !446)
!653 = !DILocalVariable(name: "_rws_buffer_buf32", scope: !629, file: !230, line: 32, type: !450)
!654 = !DILocalVariable(name: "_pmax", scope: !629, file: !230, line: 32, type: !344)
!655 = !DILocalVariable(name: "_pkg_len", scope: !629, file: !230, line: 32, type: !112)
!656 = !DILocalVariable(name: "_total_len", scope: !629, file: !230, line: 32, type: !112)
!657 = !DILocalVariable(name: "_pkg_offset", scope: !629, file: !230, line: 32, type: !112)
!658 = !DILocalVariable(name: "_len_loc", scope: !629, file: !230, line: 32, type: !172)
!659 = !DILocalVariable(name: "_arg_size", scope: !660, file: !230, line: 32, type: !135)
!660 = distinct !DILexicalBlock(scope: !629, file: !230, line: 32, column: 2)
!661 = !DILocalVariable(name: "__v", scope: !662, file: !230, line: 32, type: !468)
!662 = distinct !DILexicalBlock(scope: !660, file: !230, line: 32, column: 2)
!663 = !DILocalVariable(name: "__arg_size", scope: !662, file: !230, line: 32, type: !344)
!664 = !DILocalVariable(name: "_loc", scope: !660, file: !230, line: 32, type: !135)
!665 = !DILocalVariable(name: "_pbuf_loc", scope: !666, file: !230, line: 32, type: !428)
!666 = distinct !DILexicalBlock(scope: !667, file: !230, line: 32, column: 2)
!667 = distinct !DILexicalBlock(scope: !629, file: !230, line: 32, column: 2)
!668 = !DILocalVariable(name: "i", scope: !669, file: !230, line: 32, type: !344)
!669 = distinct !DILexicalBlock(scope: !666, file: !230, line: 32, column: 2)
!670 = !DILocalVariable(name: "i", scope: !671, file: !230, line: 32, type: !344)
!671 = distinct !DILexicalBlock(scope: !666, file: !230, line: 32, column: 2)
!672 = !DILocalVariable(name: "hdr", scope: !673, file: !230, line: 32, type: !173)
!673 = distinct !DILexicalBlock(scope: !674, file: !230, line: 32, column: 2)
!674 = distinct !DILexicalBlock(scope: !629, file: !230, line: 32, column: 2)
!675 = !DILocalVariable(name: "_desc", scope: !566, file: !230, line: 32, type: !192)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !151, file: !221, line: 18, type: !213, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "log_const_sample_module", scope: !680, file: !720, line: 10, type: !727, isLocal: false, isDefinition: true)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !683, globals: !717, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/logger/src/sample_module.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!682 = !{!154, !40}
!683 = !{!111, !684, !112, !184, !695, !140, !696, !135}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !174, line: 78, size: 32, elements: !686)
!686 = !{!687, !694}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !685, file: !174, line: 80, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !174, line: 45, size: 32, elements: !689)
!689 = !{!690, !691, !692, !693}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !688, file: !174, line: 47, baseType: !140, size: 8)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !688, file: !174, line: 50, baseType: !140, size: 8, offset: 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !688, file: !174, line: 53, baseType: !140, size: 8, offset: 16)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !688, file: !174, line: 56, baseType: !140, size: 8, offset: 24)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !685, file: !174, line: 82, baseType: !111, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !155, line: 88, size: 128, elements: !698)
!698 = !{!699, !715, !716}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !697, file: !155, line: 89, baseType: !700, size: 96)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !155, line: 66, size: 96, elements: !701)
!701 = !{!702, !713, !714}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !700, file: !155, line: 67, baseType: !703, size: 32)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !155, line: 51, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !703, file: !155, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !703, file: !155, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !703, file: !155, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !703, file: !155, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !703, file: !155, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !703, file: !155, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !703, file: !155, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !703, file: !155, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !700, file: !155, line: 75, baseType: !13, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !700, file: !155, line: 76, baseType: !204, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !697, file: !155, line: 93, baseType: !206, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !155, line: 94, baseType: !210, offset: 128)
!717 = !{!678, !718, !724}
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "log_dynamic_sample_module", scope: !680, file: !720, line: 10, type: !721, isLocal: false, isDefinition: true)
!720 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/sample_module.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !721, file: !132, line: 30, baseType: !135, size: 32)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !680, file: !720, line: 10, type: !726, isLocal: true, isDefinition: true)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !132, line: 16, size: 64, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !728, file: !132, line: 17, baseType: !119, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !728, file: !132, line: 18, baseType: !140, size: 8, offset: 32)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !734, file: !781, line: 18, type: !788, isLocal: false, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !736, retainedTypes: !737, globals: !778, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!736 = !{!154}
!737 = !{!22, !111, !24, !738, !739, !741, !344, !112, !695, !742, !744, !745, !468, !428, !300, !746, !184, !140, !757, !135, !119}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !174, line: 78, size: 32, elements: !748)
!748 = !{!749, !756}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !747, file: !174, line: 80, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !174, line: 45, size: 32, elements: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !750, file: !174, line: 47, baseType: !140, size: 8)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !750, file: !174, line: 50, baseType: !140, size: 8, offset: 8)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !750, file: !174, line: 53, baseType: !140, size: 8, offset: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !750, file: !174, line: 56, baseType: !140, size: 8, offset: 24)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !747, file: !174, line: 82, baseType: !111, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !155, line: 88, size: 128, elements: !759)
!759 = !{!760, !776, !777}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !758, file: !155, line: 89, baseType: !761, size: 96)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !155, line: 66, size: 96, elements: !762)
!762 = !{!763, !774, !775}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !761, file: !155, line: 67, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !155, line: 51, size: 32, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !764, file: !155, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !764, file: !155, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !155, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !764, file: !155, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !764, file: !155, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !764, file: !155, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !764, file: !155, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !764, file: !155, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !761, file: !155, line: 75, baseType: !13, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !761, file: !155, line: 76, baseType: !204, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !758, file: !155, line: 93, baseType: !206, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !758, file: !155, line: 94, baseType: !210, offset: 128)
!778 = !{!732, !779, !785}
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "log_dynamic_cbprintf_package", scope: !734, file: !781, line: 18, type: !782, isLocal: false, isDefinition: true)
!781 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !783)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !782, file: !132, line: 30, baseType: !135, size: 32)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !734, file: !781, line: 18, type: !787, isLocal: true, isDefinition: true)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !132, line: 16, size: 64, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !789, file: !132, line: 17, baseType: !119, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !789, file: !132, line: 18, baseType: !140, size: 8, offset: 32)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "_char_out", scope: !795, file: !799, line: 54, type: !800, isLocal: false, isDefinition: true)
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !797, retainedTypes: !110, globals: !798, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!797 = !{!40}
!798 = !{!793}
!799 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DISubroutineType(types: !802)
!802 = !{!112, !112}
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !805, file: !1531, line: 202, type: !1532, isLocal: true, isDefinition: true, align: 32)
!805 = distinct !DICompileUnit(language: DW_LANG_C99, file: !806, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !797, retainedTypes: !807, globals: !1530, splitDebugInlining: false, nameTableKind: None)
!806 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/logging/logger")
!807 = !{!111, !112, !808, !930, !1267, !1268, !1335}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !810, line: 335, baseType: !811)
!810 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !810, line: 320, size: 288, elements: !812)
!812 = !{!813, !824, !830, !844, !855, !866, !870, !881, !882, !893, !894, !909, !910, !920}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !811, file: !810, line: 321, baseType: !814, size: 16)
!814 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !810, line: 50, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 43, size: 16, elements: !817)
!817 = !{!818, !823}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !816, file: !810, line: 48, baseType: !819, size: 16)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !810, line: 44, size: 16, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !819, file: !810, line: 45, baseType: !300, size: 7, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !819, file: !810, line: 47, baseType: !300, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !816, file: !810, line: 49, baseType: !300, size: 16)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !811, file: !810, line: 322, baseType: !825, size: 16, offset: 16)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 16, elements: !277)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !827, line: 52, baseType: !828)
!827 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21e18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !140)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !811, file: !810, line: 323, baseType: !831, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !810, line: 107, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 94, size: 32, elements: !834)
!834 = !{!835, !843}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !833, file: !810, line: 105, baseType: !836, size: 32)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !833, file: !810, line: 95, size: 32, elements: !837)
!837 = !{!838, !839, !840, !841, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !836, file: !810, line: 97, baseType: !135, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !836, file: !810, line: 99, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !836, file: !810, line: 100, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !836, file: !810, line: 102, baseType: !135, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !836, file: !810, line: 103, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !833, file: !810, line: 106, baseType: !135, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !811, file: !810, line: 324, baseType: !845, size: 32, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !810, line: 155, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 148, size: 32, elements: !848)
!848 = !{!849, !854}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !847, file: !810, line: 153, baseType: !850, size: 32)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !810, line: 149, size: 32, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !850, file: !810, line: 150, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !850, file: !810, line: 151, baseType: !135, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !847, file: !810, line: 154, baseType: !135, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !811, file: !810, line: 325, baseType: !856, size: 8, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !810, line: 194, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 187, size: 8, elements: !859)
!859 = !{!860, !865}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !858, file: !810, line: 192, baseType: !861, size: 8)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !858, file: !810, line: 188, size: 8, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !861, file: !810, line: 189, baseType: !140, size: 1, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !861, file: !810, line: 190, baseType: !140, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !858, file: !810, line: 193, baseType: !140, size: 8)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !811, file: !810, line: 326, baseType: !867, size: 24, offset: 104)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 24, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 3)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !811, file: !810, line: 327, baseType: !871, size: 8, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !810, line: 215, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 208, size: 8, elements: !874)
!874 = !{!875, !880}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !873, file: !810, line: 213, baseType: !876, size: 8)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !873, file: !810, line: 209, size: 8, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !876, file: !810, line: 210, baseType: !140, size: 1, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !876, file: !810, line: 211, baseType: !140, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !873, file: !810, line: 214, baseType: !140, size: 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !811, file: !810, line: 328, baseType: !867, size: 24, offset: 136)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !811, file: !810, line: 329, baseType: !883, size: 8, offset: 160)
!883 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !810, line: 236, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 229, size: 8, elements: !886)
!886 = !{!887, !892}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !885, file: !810, line: 234, baseType: !888, size: 8)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !885, file: !810, line: 230, size: 8, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !888, file: !810, line: 231, baseType: !828, size: 1, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !888, file: !810, line: 232, baseType: !828, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !885, file: !810, line: 235, baseType: !140, size: 8)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !811, file: !810, line: 330, baseType: !867, size: 24, offset: 168)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !811, file: !810, line: 331, baseType: !895, size: 16, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !810, line: 262, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 250, size: 16, elements: !898)
!898 = !{!899, !908}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !897, file: !810, line: 260, baseType: !900, size: 16)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !810, line: 251, size: 16, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !900, file: !810, line: 252, baseType: !300, size: 1, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !900, file: !810, line: 253, baseType: !300, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !900, file: !810, line: 254, baseType: !300, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !900, file: !810, line: 255, baseType: !300, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !900, file: !810, line: 256, baseType: !300, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !900, file: !810, line: 258, baseType: !300, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !897, file: !810, line: 261, baseType: !300, size: 16)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !811, file: !810, line: 332, baseType: !825, size: 16, offset: 208)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !811, file: !810, line: 333, baseType: !911, size: 32, offset: 224)
!911 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !810, line: 290, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 284, size: 32, elements: !914)
!914 = !{!915, !919}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !913, file: !810, line: 288, baseType: !916, size: 32)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !913, file: !810, line: 285, size: 32, elements: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !916, file: !810, line: 286, baseType: !135, size: 22, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !913, file: !810, line: 289, baseType: !135, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !811, file: !810, line: 334, baseType: !921, size: 16, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !810, line: 308, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !810, line: 303, size: 16, elements: !924)
!924 = !{!925, !929}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !923, file: !810, line: 306, baseType: !926, size: 16)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !923, file: !810, line: 304, size: 16, elements: !927)
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !926, file: !810, line: 305, baseType: !300, size: 16, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !923, file: !810, line: 307, baseType: !300, size: 16)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !932, line: 928, baseType: !933)
!932 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !932, line: 899, size: 672, elements: !934)
!934 = !{!935, !959, !983, !1009, !1034, !1050, !1051, !1069, !1070, !1087, !1098, !1099, !1114, !1134, !1135, !1147, !1159, !1169, !1170, !1187, !1189, !1200, !1201, !1213, !1225, !1226, !1237, !1253}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !933, file: !932, line: 900, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !932, line: 64, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !932, line: 43, size: 32, elements: !939)
!939 = !{!940, !958}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !938, file: !932, line: 62, baseType: !941, size: 32)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !938, file: !932, line: 44, size: 32, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !941, file: !932, line: 45, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !941, file: !932, line: 46, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !941, file: !932, line: 47, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !941, file: !932, line: 48, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !941, file: !932, line: 49, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !941, file: !932, line: 50, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !941, file: !932, line: 51, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !941, file: !932, line: 52, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !941, file: !932, line: 53, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !941, file: !932, line: 54, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !941, file: !932, line: 55, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !941, file: !932, line: 56, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !941, file: !932, line: 58, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !941, file: !932, line: 59, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !941, file: !932, line: 60, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !938, file: !932, line: 63, baseType: !135, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !933, file: !932, line: 901, baseType: !960, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !932, line: 125, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !932, line: 104, size: 32, elements: !963)
!963 = !{!964, !982}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !962, file: !932, line: 123, baseType: !965, size: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !962, file: !932, line: 105, size: 32, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !965, file: !932, line: 106, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !965, file: !932, line: 107, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !965, file: !932, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !965, file: !932, line: 109, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !965, file: !932, line: 110, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !965, file: !932, line: 111, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !965, file: !932, line: 112, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !965, file: !932, line: 113, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !965, file: !932, line: 114, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !965, file: !932, line: 115, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !965, file: !932, line: 116, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !965, file: !932, line: 117, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !965, file: !932, line: 119, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !965, file: !932, line: 120, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !965, file: !932, line: 121, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !962, file: !932, line: 124, baseType: !135, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !933, file: !932, line: 902, baseType: !984, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !932, line: 186, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !932, line: 165, size: 32, elements: !987)
!987 = !{!988, !1008}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !986, file: !932, line: 184, baseType: !989, size: 32)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !986, file: !932, line: 166, size: 32, elements: !990)
!990 = !{!991, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !989, file: !932, line: 167, baseType: !992, size: 1, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !989, file: !932, line: 168, baseType: !992, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
