; ModuleID = './build/accdet_detect_earphone_status.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.accdet_callback_t = type { void (i32, i8*)*, i8* }
%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }
%struct.GPIO_REGISTER_T = type { [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIN_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [4 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [2 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [7 x %struct.GPIO_DIR_REGISTER_T], [144 x i8], [4 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [6 x %struct.GPIO_DIN_REGISTER_T] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_accdet_status", scope: !2, file: !3, line: 58, type: !95, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !33, globals: !74, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_accdet.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!4 = !{!5, !13, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 145, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/inc/hal_accdet.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "HAL_ACCDET_EVENT_HOOK_KEY", value: 0)
!10 = !DIEnumerator(name: "HAL_ACCDET_EVENT_PLUG_IN", value: 1)
!11 = !DIEnumerator(name: "HAL_ACCDET_EVENT_ERROR", value: 2)
!12 = !DIEnumerator(name: "HAL_ACCDET_EVENT_PLUG_OUT", value: 3)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 154, baseType: !14, size: 32, elements: !15)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "HAL_ACCDET_STATUS_INVALID_PARAMETER", value: -3)
!17 = !DIEnumerator(name: "HAL_ACCDET_STATUS_ERROR_BUSY", value: -2)
!18 = !DIEnumerator(name: "HAL_ACCDET_STATUS_ERROR", value: -1)
!19 = !DIEnumerator(name: "HAL_ACCDET_STATUS_OK", value: 0)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 88, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pmu_wrap_interface.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!23 = !DIEnumerator(name: "DRIVER_DVFS", value: 0)
!24 = !DIEnumerator(name: "DRIVER_BT", value: 1)
!25 = !DIEnumerator(name: "DRIVER_AUDIO", value: 2)
!26 = !DIEnumerator(name: "DRIVER_USB", value: 3)
!27 = !DIEnumerator(name: "DRIVER_CAMERA", value: 4)
!28 = !DIEnumerator(name: "DRIVER_MSDC", value: 5)
!29 = !DIEnumerator(name: "DRIVER_VIBR", value: 6)
!30 = !DIEnumerator(name: "DRIVER_ACCDET", value: 7)
!31 = !DIEnumerator(name: "DRIVER_ADC", value: 8)
!32 = !DIEnumerator(name: "DRIVER_DAC", value: 9)
!33 = !{!34, !40, !73}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !37, line: 48, baseType: !38)
!37 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !39, line: 79, baseType: !7)
!39 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ACCDET_REGISTER_T", file: !42, line: 481, baseType: !43)
!42 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 459, size: 768, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !50, !54, !55, !56, !57, !58, !62, !63, !64, !66, !67, !68, !69, !70, !71, !72}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_RSTB", scope: !43, file: !42, line: 460, baseType: !35, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_CTRL", scope: !43, file: !42, line: 461, baseType: !35, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_STATE_SWCTRL", scope: !43, file: !42, line: 462, baseType: !35, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_PWM_WIDTH", scope: !43, file: !42, line: 463, baseType: !35, size: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_PWM_THRESH", scope: !43, file: !42, line: 464, baseType: !35, size: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !43, file: !42, line: 465, baseType: !51, size: 128, offset: 160)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 4)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_EN_DELAY_NUM", scope: !43, file: !42, line: 466, baseType: !35, size: 32, offset: 288)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_PWM_IDLE_VALUE", scope: !43, file: !42, line: 467, baseType: !35, size: 32, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_DEBOUNCE0", scope: !43, file: !42, line: 468, baseType: !35, size: 32, offset: 352)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_DEBOUNCE1", scope: !43, file: !42, line: 469, baseType: !35, size: 32, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !43, file: !42, line: 470, baseType: !59, size: 32, offset: 416)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 1)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_DEBOUNCE3", scope: !43, file: !42, line: 471, baseType: !35, size: 32, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_IRQ_STS", scope: !43, file: !42, line: 472, baseType: !35, size: 32, offset: 480)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_CURR_IN", scope: !43, file: !42, line: 473, baseType: !65, size: 32, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_SAMPLE_IN", scope: !43, file: !42, line: 474, baseType: !65, size: 32, offset: 544)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_MEMORIZED_IN", scope: !43, file: !42, line: 475, baseType: !65, size: 32, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_LAST_MEMORIZED_IN", scope: !43, file: !42, line: 476, baseType: !65, size: 32, offset: 608)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_FSM_STATE", scope: !43, file: !42, line: 477, baseType: !65, size: 32, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_CURR_DEBOUNCE", scope: !43, file: !42, line: 478, baseType: !65, size: 32, offset: 672)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_VERSION", scope: !43, file: !42, line: 479, baseType: !65, size: 32, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ACCDET_IN_DEFAULT", scope: !43, file: !42, line: 480, baseType: !35, size: 32, offset: 736)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!74 = !{!0, !75, !88, !91}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "g_accdet_call_back", scope: !2, file: !3, line: 60, type: !77, isLocal: false, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "accdet_callback_t", file: !78, line: 66, baseType: !79)
!78 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_accdet_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 63, size: 64, elements: !80)
!80 = !{!81, !87}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !79, file: !78, line: 64, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_accdet_callback_t", file: !6, line: 189, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !73}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_accdet_callback_event_t", file: !6, line: 150, baseType: !5)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !79, file: !78, line: 65, baseType: !73, size: 32, offset: 32)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "g_accdet_last_event", scope: !2, file: !3, line: 59, type: !90, isLocal: false, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "g_accdet_is_plug_in", scope: !2, file: !3, line: 65, type: !93, isLocal: false, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !94)
!94 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!95 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !37, line: 24, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !39, line: 43, baseType: !98)
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_name", scope: !101, file: !102, line: 46, type: !168, isLocal: true, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !103, retainedTypes: !157, globals: !162, splitDebugInlining: false, nameTableKind: None)
!102 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!103 = !{!104, !112, !122, !126, !130, !149, !153}
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 387, baseType: !14, size: 32, elements: !106)
!105 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!106 = !{!107, !108, !109, !110, !111}
!107 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!108 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!109 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!110 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!111 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 846, baseType: !7, size: 32, elements: !114)
!113 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!114 = !{!115, !116, !117, !118, !119, !120, !121}
!115 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!116 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!117 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!118 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!119 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!120 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!121 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 397, baseType: !7, size: 32, elements: !123)
!123 = !{!124, !125}
!124 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!125 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 857, baseType: !7, size: 32, elements: !127)
!127 = !{!128, !129}
!128 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!129 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 87, baseType: !7, size: 32, elements: !132)
!131 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!133 = !DIEnumerator(name: "GPT_DIVIDE_1", value: 0)
!134 = !DIEnumerator(name: "GPT_DIVIDE_2", value: 1)
!135 = !DIEnumerator(name: "GPT_DIVIDE_3", value: 2)
!136 = !DIEnumerator(name: "GPT_DIVIDE_4", value: 3)
!137 = !DIEnumerator(name: "GPT_DIVIDE_5", value: 4)
!138 = !DIEnumerator(name: "GPT_DIVIDE_6", value: 5)
!139 = !DIEnumerator(name: "GPT_DIVIDE_7", value: 6)
!140 = !DIEnumerator(name: "GPT_DIVIDE_8", value: 7)
!141 = !DIEnumerator(name: "GPT_DIVIDE_9", value: 8)
!142 = !DIEnumerator(name: "GPT_DIVIDE_10", value: 9)
!143 = !DIEnumerator(name: "GPT_DIVIDE_11", value: 10)
!144 = !DIEnumerator(name: "GPT_DIVIDE_12", value: 11)
!145 = !DIEnumerator(name: "GPT_DIVIDE_13", value: 12)
!146 = !DIEnumerator(name: "GPT_DIVIDE_16", value: 13)
!147 = !DIEnumerator(name: "GPT_DIVIDE_32", value: 14)
!148 = !DIEnumerator(name: "GPT_DIVIDE_64", value: 15)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 380, baseType: !7, size: 32, elements: !150)
!150 = !{!151, !152}
!151 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!152 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 82, baseType: !7, size: 32, elements: !154)
!154 = !{!155, !156}
!155 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!156 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!157 = !{!36, !73, !158}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !105, line: 371, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !73}
!162 = !{!163, !99}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_handle", scope: !101, file: !102, line: 47, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 6)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 192, elements: !166)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !174, file: !175, line: 48, type: !390, isLocal: false, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !176, retainedTypes: !319, globals: !333, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!176 = !{!177, !153, !236, !242, !112, !149, !122}
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 1170, baseType: !7, size: 32, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!179 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!180 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!181 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!182 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!183 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!184 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!185 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!186 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!187 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!188 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!189 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!190 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!191 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!192 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!193 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!194 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!195 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!196 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!197 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!198 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!199 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!200 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!201 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!202 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!203 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!204 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!205 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!206 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!207 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!208 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!209 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!210 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!211 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!212 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!213 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!214 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!215 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!216 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!217 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!218 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!219 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!220 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!221 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!222 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!223 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!224 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!225 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!226 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!227 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!228 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!229 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!230 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!231 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!232 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!233 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!234 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!235 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 75, baseType: !7, size: 32, elements: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!239 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!240 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!241 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !42, line: 44, baseType: !14, size: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!244 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!245 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!246 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!247 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!248 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!249 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!250 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!251 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!252 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!253 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!254 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!255 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!256 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!257 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!258 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!259 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!260 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!261 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!262 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!263 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!264 = !DIEnumerator(name: "KP_IRQn", value: 10)
!265 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!266 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!267 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!268 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!269 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!270 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!271 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!272 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!273 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!274 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!275 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!276 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!277 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!278 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!279 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!280 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!281 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!282 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!283 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!284 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!285 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!286 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!287 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!288 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!289 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!290 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!291 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!292 = !DIEnumerator(name: "SF_IRQn", value: 38)
!293 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!294 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!295 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!296 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!297 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!298 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!299 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!300 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!301 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!302 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!303 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!304 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!305 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!306 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!307 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!308 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!309 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!310 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!311 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!312 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!313 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!314 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!315 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!316 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!317 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!318 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!319 = !{!36, !320, !73}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !42, line: 1272, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1262, size: 288, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !322, file: !42, line: 1263, baseType: !35, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !322, file: !42, line: 1264, baseType: !35, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !322, file: !42, line: 1265, baseType: !35, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !322, file: !42, line: 1266, baseType: !65, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !322, file: !42, line: 1267, baseType: !35, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !322, file: !42, line: 1268, baseType: !35, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !322, file: !42, line: 1269, baseType: !35, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !322, file: !42, line: 1270, baseType: !35, size: 32, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !322, file: !42, line: 1271, baseType: !35, size: 32, offset: 256)
!333 = !{!172, !334, !343, !349, !365, !388}
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !174, file: !175, line: 49, type: !336, isLocal: false, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !42, line: 1260, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1256, size: 96, elements: !339)
!339 = !{!340, !341, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !338, file: !42, line: 1257, baseType: !65, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !338, file: !42, line: 1258, baseType: !35, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !338, file: !42, line: 1259, baseType: !35, size: 32, offset: 64)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "flag", scope: !345, file: !175, line: 88, type: !94, isLocal: true, isDefinition: true)
!345 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !175, file: !175, line: 86, type: !346, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{null}
!348 = !{}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !174, file: !175, line: 51, type: !351, isLocal: false, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 768, elements: !166)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !131, line: 116, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 111, size: 128, elements: !354)
!354 = !{!355, !357, !363, !364}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !353, file: !131, line: 112, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !105, line: 400, baseType: !122)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !353, file: !131, line: 113, baseType: !358, size: 64, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !131, line: 109, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 106, size: 64, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !359, file: !131, line: 107, baseType: !158, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !359, file: !131, line: 108, baseType: !73, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !353, file: !131, line: 114, baseType: !94, size: 8, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !353, file: !131, line: 115, baseType: !94, size: 8, offset: 104)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !174, file: !175, line: 52, type: !367, isLocal: false, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !131, line: 134, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 125, size: 4256, elements: !369)
!369 = !{!370, !381, !382, !383, !384, !385, !386, !387}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !368, file: !131, line: 126, baseType: !371, size: 4096)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 4096, elements: !379)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !131, line: 123, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 118, size: 128, elements: !374)
!374 = !{!375, !376, !377, !378}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !373, file: !131, line: 119, baseType: !358, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !373, file: !131, line: 120, baseType: !36, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !373, file: !131, line: 121, baseType: !94, size: 8, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !373, file: !131, line: 122, baseType: !94, size: 8, offset: 104)
!379 = !{!380}
!380 = !DISubrange(count: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !368, file: !131, line: 127, baseType: !36, size: 32, offset: 4096)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !368, file: !131, line: 128, baseType: !36, size: 32, offset: 4128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !368, file: !131, line: 129, baseType: !36, size: 32, offset: 4160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !368, file: !131, line: 130, baseType: !36, size: 32, offset: 4192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !368, file: !131, line: 131, baseType: !94, size: 8, offset: 4224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !368, file: !131, line: 132, baseType: !94, size: 8, offset: 4232)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !368, file: !131, line: 133, baseType: !94, size: 8, offset: 4240)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !174, file: !175, line: 53, type: !36, isLocal: false, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 192, elements: !166)
!391 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !394, file: !395, line: 64, type: !495, isLocal: false, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !396, retainedTypes: !490, globals: !494, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!396 = !{!397, !449, !456, !460, !466, !470, !479, !484}
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 339, baseType: !7, size: 32, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!399 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!400 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!401 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!402 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!403 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!404 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!405 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!406 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!407 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!408 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!409 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!410 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!411 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!412 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!413 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!414 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!415 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!416 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!417 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!418 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!419 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!420 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!421 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!422 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!423 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!424 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!425 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!426 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!427 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!428 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!429 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!430 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!431 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!432 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!433 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!434 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!435 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!436 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!437 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!438 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!439 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!440 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!441 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!442 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!443 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!444 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!445 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!446 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!447 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!448 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 224, baseType: !14, size: 32, elements: !451)
!450 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!451 = !{!452, !453, !454, !455}
!452 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!453 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!454 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!455 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!456 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 210, baseType: !7, size: 32, elements: !457)
!457 = !{!458, !459}
!458 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!459 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!460 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 233, baseType: !14, size: 32, elements: !461)
!461 = !{!462, !463, !464, !465}
!462 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!463 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!464 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!465 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 217, baseType: !7, size: 32, elements: !467)
!467 = !{!468, !469}
!468 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!469 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 415, baseType: !7, size: 32, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478}
!472 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!473 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!474 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!475 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!476 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!477 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!478 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 427, baseType: !7, size: 32, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!482 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!483 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 242, baseType: !7, size: 32, elements: !485)
!485 = !{!486, !487, !488, !489}
!486 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!487 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!488 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!489 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!490 = !{!73, !491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !450, line: 213, baseType: !456)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !450, line: 220, baseType: !466)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !450, line: 247, baseType: !484)
!494 = !{!392}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !42, line: 1554, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1522, size: 29440, elements: !498)
!498 = !{!499, !511, !515, !524, !525, !534, !535, !544, !545, !555, !556, !565, !566, !575, !576, !585, !586, !595, !599, !608, !609, !618, !619, !628, !637, !638, !649, !653, !662, !663}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !497, file: !42, line: 1523, baseType: !500, size: 256)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 256, elements: !509)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !42, line: 1400, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1395, size: 128, elements: !503)
!503 = !{!504, !505, !506, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !502, file: !42, line: 1396, baseType: !35, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !502, file: !42, line: 1397, baseType: !35, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !502, file: !42, line: 1398, baseType: !35, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !502, file: !42, line: 1399, baseType: !508, size: 32, offset: 96)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, elements: !52)
!509 = !{!510}
!510 = !DISubrange(count: 2)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !497, file: !42, line: 1524, baseType: !512, size: 1792, offset: 256)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1792, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 224)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !497, file: !42, line: 1525, baseType: !516, size: 256, offset: 2048)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 256, elements: !509)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !42, line: 1409, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1404, size: 128, elements: !519)
!519 = !{!520, !521, !522, !523}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !518, file: !42, line: 1405, baseType: !35, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !518, file: !42, line: 1406, baseType: !35, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !518, file: !42, line: 1407, baseType: !35, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !518, file: !42, line: 1408, baseType: !508, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !497, file: !42, line: 1526, baseType: !512, size: 1792, offset: 2304)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !497, file: !42, line: 1527, baseType: !526, size: 256, offset: 4096)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 256, elements: !509)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !42, line: 1417, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1412, size: 128, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !528, file: !42, line: 1413, baseType: !35, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !528, file: !42, line: 1414, baseType: !35, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !528, file: !42, line: 1415, baseType: !35, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !528, file: !42, line: 1416, baseType: !508, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !497, file: !42, line: 1528, baseType: !512, size: 1792, offset: 4352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !497, file: !42, line: 1529, baseType: !536, size: 256, offset: 6144)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 256, elements: !509)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !42, line: 1426, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1421, size: 128, elements: !539)
!539 = !{!540, !541, !542, !543}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !538, file: !42, line: 1422, baseType: !35, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !538, file: !42, line: 1423, baseType: !35, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !538, file: !42, line: 1424, baseType: !35, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !538, file: !42, line: 1425, baseType: !508, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !497, file: !42, line: 1530, baseType: !512, size: 1792, offset: 6400)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !497, file: !42, line: 1531, baseType: !546, size: 256, offset: 8192)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 256, elements: !509)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !42, line: 1432, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1429, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !548, file: !42, line: 1430, baseType: !35, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !548, file: !42, line: 1431, baseType: !552, size: 96, offset: 32)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 96, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 12)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !497, file: !42, line: 1532, baseType: !512, size: 1792, offset: 8448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !497, file: !42, line: 1533, baseType: !557, size: 256, offset: 10240)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 256, elements: !509)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !42, line: 1440, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1435, size: 128, elements: !560)
!560 = !{!561, !562, !563, !564}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !559, file: !42, line: 1436, baseType: !35, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !559, file: !42, line: 1437, baseType: !35, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !559, file: !42, line: 1438, baseType: !35, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !559, file: !42, line: 1439, baseType: !508, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !497, file: !42, line: 1534, baseType: !512, size: 1792, offset: 10496)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !497, file: !42, line: 1535, baseType: !567, size: 256, offset: 12288)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 256, elements: !509)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !42, line: 1448, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1443, size: 128, elements: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !569, file: !42, line: 1444, baseType: !35, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !569, file: !42, line: 1445, baseType: !35, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !569, file: !42, line: 1446, baseType: !35, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !569, file: !42, line: 1447, baseType: !508, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !497, file: !42, line: 1536, baseType: !512, size: 1792, offset: 12544)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !497, file: !42, line: 1537, baseType: !577, size: 256, offset: 14336)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 256, elements: !509)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !42, line: 1455, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1450, size: 128, elements: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !579, file: !42, line: 1451, baseType: !35, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !579, file: !42, line: 1452, baseType: !35, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !579, file: !42, line: 1453, baseType: !35, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !579, file: !42, line: 1454, baseType: !508, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !497, file: !42, line: 1538, baseType: !512, size: 1792, offset: 14592)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !497, file: !42, line: 1539, baseType: !587, size: 512, offset: 16384)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 512, elements: !52)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !42, line: 1463, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1458, size: 128, elements: !590)
!590 = !{!591, !592, !593, !594}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !589, file: !42, line: 1459, baseType: !35, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !589, file: !42, line: 1460, baseType: !35, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !589, file: !42, line: 1461, baseType: !35, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !589, file: !42, line: 1462, baseType: !508, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !497, file: !42, line: 1540, baseType: !596, size: 1536, offset: 16896)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1536, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !497, file: !42, line: 1541, baseType: !600, size: 256, offset: 18432)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 256, elements: !509)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !42, line: 1471, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1466, size: 128, elements: !603)
!603 = !{!604, !605, !606, !607}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !602, file: !42, line: 1467, baseType: !35, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !602, file: !42, line: 1468, baseType: !35, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !602, file: !42, line: 1469, baseType: !35, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !602, file: !42, line: 1470, baseType: !508, size: 32, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !497, file: !42, line: 1542, baseType: !512, size: 1792, offset: 18688)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !497, file: !42, line: 1543, baseType: !610, size: 256, offset: 20480)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 256, elements: !509)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !42, line: 1480, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1475, size: 128, elements: !613)
!613 = !{!614, !615, !616, !617}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !612, file: !42, line: 1476, baseType: !35, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !612, file: !42, line: 1477, baseType: !35, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !612, file: !42, line: 1478, baseType: !35, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !612, file: !42, line: 1479, baseType: !508, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !497, file: !42, line: 1544, baseType: !512, size: 1792, offset: 20736)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !497, file: !42, line: 1545, baseType: !620, size: 256, offset: 22528)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 256, elements: !509)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !42, line: 1489, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1484, size: 128, elements: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !622, file: !42, line: 1485, baseType: !35, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !622, file: !42, line: 1486, baseType: !35, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !622, file: !42, line: 1487, baseType: !35, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !622, file: !42, line: 1488, baseType: !508, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !497, file: !42, line: 1546, baseType: !629, size: 256, offset: 22784)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 256, elements: !509)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !42, line: 1497, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1492, size: 128, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !631, file: !42, line: 1493, baseType: !35, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !631, file: !42, line: 1494, baseType: !35, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !631, file: !42, line: 1495, baseType: !35, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !631, file: !42, line: 1496, baseType: !508, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !497, file: !42, line: 1547, baseType: !596, size: 1536, offset: 23040)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !497, file: !42, line: 1548, baseType: !639, size: 896, offset: 24576)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 896, elements: !647)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !42, line: 1505, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1500, size: 128, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !641, file: !42, line: 1501, baseType: !35, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !641, file: !42, line: 1502, baseType: !35, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !641, file: !42, line: 1503, baseType: !35, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !641, file: !42, line: 1504, baseType: !508, size: 32, offset: 96)
!647 = !{!648}
!648 = !DISubrange(count: 7)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !497, file: !42, line: 1549, baseType: !650, size: 1152, offset: 25472)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1152, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 144)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !497, file: !42, line: 1550, baseType: !654, size: 512, offset: 26624)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 512, elements: !52)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !42, line: 1513, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1508, size: 128, elements: !657)
!657 = !{!658, !659, !660, !661}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !656, file: !42, line: 1509, baseType: !35, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !656, file: !42, line: 1510, baseType: !35, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !656, file: !42, line: 1511, baseType: !35, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !656, file: !42, line: 1512, baseType: !508, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !497, file: !42, line: 1551, baseType: !596, size: 1536, offset: 27136)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !497, file: !42, line: 1552, baseType: !664, size: 768, offset: 28672)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 768, elements: !166)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !42, line: 1519, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1516, size: 128, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !666, file: !42, line: 1517, baseType: !35, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !666, file: !42, line: 1518, baseType: !552, size: 96, offset: 32)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !672, file: !673, line: 101, type: !865, isLocal: true, isDefinition: true)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !674, retainedTypes: !776, globals: !786, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!674 = !{!675, !682, !697, !703, !709, !714, !719, !726, !742, !748, !752, !757, !764, !772}
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 180, baseType: !7, size: 32, elements: !676)
!676 = !{!677, !678, !679, !680, !681}
!677 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!678 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!679 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!680 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!681 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !683, line: 189, baseType: !7, size: 32, elements: !684)
!683 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!685 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!686 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!687 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!688 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!689 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!690 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!691 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!692 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!693 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!694 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!695 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!696 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !698, line: 355, baseType: !14, size: 32, elements: !699)
!698 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!699 = !{!700, !701, !702}
!700 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!701 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!702 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !683, line: 206, baseType: !14, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708}
!705 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!706 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!707 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!708 = !DIEnumerator(name: "VDMA_OK", value: 0)
!709 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 65, baseType: !7, size: 32, elements: !710)
!710 = !{!711, !712, !713}
!711 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!712 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!713 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!714 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 77, baseType: !7, size: 32, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIEnumerator(name: "UART_FLOWCONTROL_NONE", value: 0)
!717 = !DIEnumerator(name: "UART_FLOWCONTROL_SOFTWARE", value: 1)
!718 = !DIEnumerator(name: "UART_FLOWCONTROL_HARDWARE", value: 2)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !698, line: 345, baseType: !14, size: 32, elements: !720)
!720 = !{!721, !722, !723, !724, !725}
!721 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!722 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!723 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!724 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!725 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !698, line: 302, baseType: !7, size: 32, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!728 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!729 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!730 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!731 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!732 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!733 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!734 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!735 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!736 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!737 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!738 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!739 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!740 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!741 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !698, line: 321, baseType: !7, size: 32, elements: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!745 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!746 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!747 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !698, line: 330, baseType: !7, size: 32, elements: !749)
!749 = !{!750, !751}
!750 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!751 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !698, line: 337, baseType: !7, size: 32, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!755 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!756 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !758, line: 101, baseType: !14, size: 32, elements: !759)
!758 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!759 = !{!760, !761, !762, !763}
!760 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!761 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!762 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!763 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!764 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !765, line: 152, baseType: !14, size: 32, elements: !766)
!765 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!766 = !{!767, !768, !769, !770, !771}
!767 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!768 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!769 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!770 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!771 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !683, line: 222, baseType: !14, size: 32, elements: !773)
!773 = !{!774, !775}
!774 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!775 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!776 = !{!73, !777, !36, !778}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !780, line: 96, baseType: !781)
!780 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !780, line: 93, size: 64, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !781, file: !780, line: 94, baseType: !94, size: 8)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !781, file: !780, line: 95, baseType: !785, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !113, line: 186, baseType: !675)
!786 = !{!787, !790, !792, !794, !796, !800, !809, !823, !670, !825, !838, !843, !857, !863}
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !672, file: !673, line: 92, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 32, elements: !52)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "g_uart_restore_init", scope: !672, file: !673, line: 93, type: !94, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !672, file: !673, line: 94, type: !789, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !672, file: !673, line: 95, type: !508, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "g_uart_flowcontrol_status", scope: !672, file: !673, line: 96, type: !798, isLocal: true, isDefinition: true)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 128, elements: !52)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_flowcontrol_t", file: !673, line: 81, baseType: !714)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "g_uart_sw_flowcontrol_config", scope: !672, file: !673, line: 97, type: !802, isLocal: true, isDefinition: true)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 96, elements: !52)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_sw_flowcontrol_config_t", file: !673, line: 87, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 83, size: 24, elements: !805)
!805 = !{!806, !807, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "xon", scope: !804, file: !673, line: 84, baseType: !96, size: 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !804, file: !673, line: 85, baseType: !96, size: 8, offset: 8)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "escape_character", scope: !804, file: !673, line: 86, baseType: !96, size: 8, offset: 16)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "g_uart_config", scope: !672, file: !673, line: 98, type: !811, isLocal: true, isDefinition: true)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 512, elements: !52)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !698, line: 378, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 373, size: 128, elements: !814)
!814 = !{!815, !817, !819, !821}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !813, file: !698, line: 374, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !698, line: 317, baseType: !726)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !813, file: !698, line: 375, baseType: !818, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !698, line: 326, baseType: !742)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !813, file: !698, line: 376, baseType: !820, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !698, line: 333, baseType: !748)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !813, file: !698, line: 377, baseType: !822, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !698, line: 341, baseType: !752)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "g_uart_irq_pending_status", scope: !672, file: !673, line: 99, type: !789, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !672, file: !673, line: 102, type: !827, isLocal: true, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 256, elements: !52)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !673, line: 74, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 71, size: 64, elements: !830)
!830 = !{!831, !837}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !829, file: !673, line: 72, baseType: !832, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !698, line: 410, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !836, !73}
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !698, line: 359, baseType: !697)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !829, file: !673, line: 73, baseType: !73, size: 32, offset: 32)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !672, file: !673, line: 103, type: !840, isLocal: true, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 512, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 8)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !672, file: !673, line: 104, type: !845, isLocal: true, isDefinition: true)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 896, elements: !52)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !698, line: 390, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 382, size: 224, elements: !848)
!848 = !{!849, !851, !852, !853, !854, !855, !856}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !847, file: !698, line: 383, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !847, file: !698, line: 384, baseType: !36, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !847, file: !698, line: 385, baseType: !36, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !847, file: !698, line: 386, baseType: !850, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !847, file: !698, line: 387, baseType: !36, size: 32, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !847, file: !698, line: 388, baseType: !36, size: 32, offset: 160)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !847, file: !698, line: 389, baseType: !36, size: 32, offset: 192)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !672, file: !673, line: 105, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 416, elements: !861)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!861 = !{!862}
!862 = !DISubrange(count: 13)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !672, file: !673, line: 90, type: !94, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 128, elements: !52)
!866 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !673, line: 69, baseType: !709)
!868 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !872, file: !873, line: 53, type: !957, isLocal: false, isDefinition: true)
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !874, retainedTypes: !885, globals: !941, splitDebugInlining: false, nameTableKind: None)
!873 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!874 = !{!177, !242, !682, !675, !875}
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !780, line: 46, baseType: !7, size: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884}
!877 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!878 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!879 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!880 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!881 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!882 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!883 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!884 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !42, line: 588, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 542, size: 800, elements: !889)
!889 = !{!890, !896, !901, !907, !908, !913, !918, !919, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !888, file: !42, line: 547, baseType: !891, size: 32)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !42, line: 543, size: 32, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !891, file: !42, line: 544, baseType: !65, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !891, file: !42, line: 545, baseType: !35, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !891, file: !42, line: 546, baseType: !35, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !888, file: !42, line: 551, baseType: !897, size: 32, offset: 32)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !42, line: 548, size: 32, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !897, file: !42, line: 549, baseType: !35, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !897, file: !42, line: 550, baseType: !35, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !888, file: !42, line: 556, baseType: !902, size: 32, offset: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !42, line: 552, size: 32, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !902, file: !42, line: 553, baseType: !65, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !902, file: !42, line: 554, baseType: !35, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !902, file: !42, line: 555, baseType: !35, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !888, file: !42, line: 557, baseType: !35, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !888, file: !42, line: 561, baseType: !909, size: 32, offset: 128)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !42, line: 558, size: 32, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !909, file: !42, line: 559, baseType: !35, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !909, file: !42, line: 560, baseType: !35, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !888, file: !42, line: 565, baseType: !914, size: 32, offset: 160)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !42, line: 562, size: 32, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !914, file: !42, line: 563, baseType: !65, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !914, file: !42, line: 564, baseType: !35, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !888, file: !42, line: 566, baseType: !35, size: 32, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !888, file: !42, line: 570, baseType: !920, size: 32, offset: 224)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !42, line: 567, size: 32, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !920, file: !42, line: 568, baseType: !35, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !920, file: !42, line: 569, baseType: !35, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !888, file: !42, line: 571, baseType: !35, size: 32, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !888, file: !42, line: 572, baseType: !35, size: 32, offset: 288)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !888, file: !42, line: 573, baseType: !35, size: 32, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !888, file: !42, line: 574, baseType: !35, size: 32, offset: 352)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !888, file: !42, line: 575, baseType: !65, size: 32, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !888, file: !42, line: 576, baseType: !35, size: 32, offset: 416)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !888, file: !42, line: 577, baseType: !35, size: 32, offset: 448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !888, file: !42, line: 578, baseType: !35, size: 32, offset: 480)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !888, file: !42, line: 579, baseType: !35, size: 32, offset: 512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !888, file: !42, line: 580, baseType: !35, size: 32, offset: 544)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !888, file: !42, line: 581, baseType: !35, size: 32, offset: 576)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !888, file: !42, line: 582, baseType: !35, size: 32, offset: 608)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !888, file: !42, line: 583, baseType: !35, size: 32, offset: 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !888, file: !42, line: 584, baseType: !35, size: 32, offset: 672)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !888, file: !42, line: 585, baseType: !35, size: 32, offset: 704)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !888, file: !42, line: 586, baseType: !65, size: 32, offset: 736)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !888, file: !42, line: 587, baseType: !35, size: 32, offset: 768)
!941 = !{!870, !942, !947, !953}
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !872, file: !873, line: 54, type: !944, isLocal: false, isDefinition: true)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, elements: !52)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !113, line: 1237, baseType: !177)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !872, file: !873, line: 55, type: !949, isLocal: false, isDefinition: true)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 128, elements: !52)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !42, line: 125, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !42, line: 123, baseType: !242)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !872, file: !873, line: 57, type: !955, isLocal: false, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 128, elements: !52)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 128, elements: !52)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "g_i2c_tx_dma_channel", scope: !961, file: !962, line: 47, type: !1075, isLocal: false, isDefinition: true)
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !963, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_i2c_master_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!963 = !{!964, !177, !974, !984, !1001}
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !683, line: 137, baseType: !7, size: 32, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973}
!966 = !DIEnumerator(name: "PDMA_START_CHANNEL", value: 1)
!967 = !DIEnumerator(name: "PDMA_MSDC1", value: 1)
!968 = !DIEnumerator(name: "PDMA_MSDC2", value: 2)
!969 = !DIEnumerator(name: "PDMA_I2C0_TX", value: 3)
!970 = !DIEnumerator(name: "PDMA_I2C0_RX", value: 4)
!971 = !DIEnumerator(name: "PDMA_I2C1_TX", value: 5)
!972 = !DIEnumerator(name: "PDMA_I2C1_RX", value: 6)
!973 = !DIEnumerator(name: "PDMA_END_CHANNEL", value: 7)
!974 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 132, baseType: !7, size: 32, elements: !976)
!975 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_i2c_master_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/accdet_detect_earphone_status/GCC")
!976 = !{!977, !978, !979, !980, !981, !982, !983}
!977 = !DIEnumerator(name: "I2C_FREQUENCY_50K", value: 50)
!978 = !DIEnumerator(name: "I2C_FREQUENCY_100K", value: 100)
!979 = !DIEnumerator(name: "I2C_FREQUENCY_200K", value: 200)
!980 = !DIEnumerator(name: "I2C_FREQUENCY_300K", value: 300)
!981 = !DIEnumerator(name: "I2C_FREQUENCY_400K", value: 400)
!982 = !DIEnumerator(name: "I2C_FREQUENCY_1M", value: 1000)
!983 = !DIEnumerator(name: "I2C_FREQUENCY_MAX", value: 1001)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 142, baseType: !7, size: 32, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!986 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_POLLING", value: 0)
!987 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_DMA", value: 1)
!988 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_POLLING", value: 2)
!989 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_DMA", value: 3)
!990 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_POLLING", value: 4)
!991 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_DMA", value: 5)
!992 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_POLLING", value: 6)
!993 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA", value: 7)
!994 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_POLLING", value: 8)
!995 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA", value: 9)
!996 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_POLLING", value: 10)
!997 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA", value: 11)
!998 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA_EXTEND", value: 12)
!999 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA_EXTEND", value: 13)
!1000 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA_EXTEND", value: 14)
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 162, baseType: !14, size: 32, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007}
!1003 = !DIEnumerator(name: "I2C_TRANSACTION_UNKNOWN_ERROR", value: -4)
!1004 = !DIEnumerator(name: "I2C_TRANSACTION_ACK_ERROR", value: -3)
!1005 = !DIEnumerator(name: "I2C_TRANSACTION_NACK_ERROR", value: -2)
!1006 = !DIEnumerator(name: "I2C_TRANSACTION_TIMEOUT_ERROR", value: -1)
!1007 = !DIEnumerator(name: "I2C_TRANSACTION_SUCCESS", value: 0)
!1008 = !{!1009, !959, !1073, !1078, !1080}
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "i2c_master_register", scope: !961, file: !962, line: 46, type: !1011, isLocal: false, isDefinition: true)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 128, elements: !52)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2C_REGISTER_T", file: !42, line: 1885, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 1833, size: 960, elements: !1016)
!1016 = !{!1017, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "DATA_PORT", scope: !1015, file: !42, line: 1834, baseType: !1018, size: 16)
!1018 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !37, line: 36, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !39, line: 57, baseType: !1021)
!1021 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1015, file: !42, line: 1835, baseType: !1018, size: 16, offset: 16)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "SLAVE_ADDR", scope: !1015, file: !42, line: 1836, baseType: !1018, size: 16, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1015, file: !42, line: 1837, baseType: !1018, size: 16, offset: 48)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_MASK", scope: !1015, file: !42, line: 1838, baseType: !1018, size: 16, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1015, file: !42, line: 1839, baseType: !1018, size: 16, offset: 80)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_STAT", scope: !1015, file: !42, line: 1840, baseType: !1018, size: 16, offset: 96)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1015, file: !42, line: 1841, baseType: !1018, size: 16, offset: 112)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "CONTROL", scope: !1015, file: !42, line: 1842, baseType: !1018, size: 16, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1015, file: !42, line: 1843, baseType: !1018, size: 16, offset: 144)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN", scope: !1015, file: !42, line: 1844, baseType: !1018, size: 16, offset: 160)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1015, file: !42, line: 1845, baseType: !1018, size: 16, offset: 176)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSAC_LEN", scope: !1015, file: !42, line: 1846, baseType: !1018, size: 16, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !1015, file: !42, line: 1847, baseType: !1018, size: 16, offset: 208)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "DELAY_LEN", scope: !1015, file: !42, line: 1848, baseType: !1018, size: 16, offset: 224)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !1015, file: !42, line: 1849, baseType: !1018, size: 16, offset: 240)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "TIMING", scope: !1015, file: !42, line: 1850, baseType: !1018, size: 16, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !1015, file: !42, line: 1851, baseType: !1018, size: 16, offset: 272)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "START", scope: !1015, file: !42, line: 1852, baseType: !1018, size: 16, offset: 288)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !1015, file: !42, line: 1853, baseType: !1018, size: 16, offset: 304)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !1015, file: !42, line: 1854, baseType: !1042, size: 32, offset: 320)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 32, elements: !509)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "CLOCK_DIV", scope: !1015, file: !42, line: 1855, baseType: !1018, size: 16, offset: 352)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !1015, file: !42, line: 1856, baseType: !1018, size: 16, offset: 368)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_STAT", scope: !1015, file: !42, line: 1857, baseType: !1018, size: 16, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !1015, file: !42, line: 1858, baseType: !1018, size: 16, offset: 400)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_THRESH", scope: !1015, file: !42, line: 1859, baseType: !1018, size: 16, offset: 416)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !1015, file: !42, line: 1860, baseType: !1018, size: 16, offset: 432)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_ADDR_CLR", scope: !1015, file: !42, line: 1861, baseType: !1018, size: 16, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED15", scope: !1015, file: !42, line: 1862, baseType: !1018, size: 16, offset: 464)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED16", scope: !1015, file: !42, line: 1863, baseType: !1042, size: 32, offset: 480)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "IO_CONFIG", scope: !1015, file: !42, line: 1864, baseType: !1018, size: 16, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED17", scope: !1015, file: !42, line: 1865, baseType: !1018, size: 16, offset: 528)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED18", scope: !1015, file: !42, line: 1866, baseType: !1042, size: 32, offset: 544)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "HS", scope: !1015, file: !42, line: 1867, baseType: !1018, size: 16, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED19", scope: !1015, file: !42, line: 1868, baseType: !1018, size: 16, offset: 592)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED20", scope: !1015, file: !42, line: 1869, baseType: !1042, size: 32, offset: 608)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "SOFTRESET", scope: !1015, file: !42, line: 1870, baseType: !1018, size: 16, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED21", scope: !1015, file: !42, line: 1871, baseType: !1018, size: 16, offset: 656)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED22", scope: !1015, file: !42, line: 1872, baseType: !1061, size: 96, offset: 672)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 96, elements: !166)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "SPARE", scope: !1015, file: !42, line: 1873, baseType: !1018, size: 16, offset: 768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED23", scope: !1015, file: !42, line: 1874, baseType: !1018, size: 16, offset: 784)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGSTAT", scope: !1015, file: !42, line: 1875, baseType: !1018, size: 16, offset: 800)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED24", scope: !1015, file: !42, line: 1876, baseType: !1018, size: 16, offset: 816)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGCTRL", scope: !1015, file: !42, line: 1877, baseType: !1018, size: 16, offset: 832)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED25", scope: !1015, file: !42, line: 1878, baseType: !1018, size: 16, offset: 848)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN_AUX", scope: !1015, file: !42, line: 1879, baseType: !1018, size: 16, offset: 864)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED26", scope: !1015, file: !42, line: 1880, baseType: !1018, size: 16, offset: 880)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED27", scope: !1015, file: !42, line: 1881, baseType: !1042, size: 32, offset: 896)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "TIMEOUT", scope: !1015, file: !42, line: 1882, baseType: !1018, size: 16, offset: 928)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED28", scope: !1015, file: !42, line: 1883, baseType: !1018, size: 16, offset: 944)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
