; ModuleID = 'build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.osTimerAttr_t = type { i8*, i32, i8*, i32 }
%struct.osMessageQueueAttr_t = type { i8*, i32, i8*, i32, i8*, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.k_mem_slab = type { %union.anon, %struct.k_spinlock, i32, i32, i8*, i8*, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.pinctrl_soc_pinmux = type { i32, i32, i32, i8 }
%struct.imx_gpio_config = type { %struct.k_spinlock, %struct.GPIO_Type*, %struct.pinctrl_soc_pinmux*, i8 }
%struct.GPIO_Type = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.gpio_driver_api = type { i32 (%struct.device*, i8, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, i32, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i8, i32, i32)*, i32 (%struct.device*, %struct.gpio_callback*, i1)*, i32 (%struct.device*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "timer_attr", scope: !27, file: !122, line: 20, type: !147, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !117, globals: !119, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v2/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!29 = !{!30, !42, !47}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 195, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os2.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osError", value: -1)
!36 = !DIEnumerator(name: "osErrorTimeout", value: -2)
!37 = !DIEnumerator(name: "osErrorResource", value: -3)
!38 = !DIEnumerator(name: "osErrorParameter", value: -4)
!39 = !DIEnumerator(name: "osErrorNoMemory", value: -5)
!40 = !DIEnumerator(name: "osErrorISR", value: -6)
!41 = !DIEnumerator(name: "osStatusReserved", value: 2147483647)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 164, baseType: !43, size: 32, elements: !44)
!43 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "osTimerOnce", value: 0)
!46 = !DIEnumerator(name: "osTimerPeriodic", value: 1)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !48, line: 27, baseType: !43, size: 32, elements: !49)
!48 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!50 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!51 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!52 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!53 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!54 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!55 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!56 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!57 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!58 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!59 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!60 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!61 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!62 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!63 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!64 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!65 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!66 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!116 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!117 = !{!118, !32}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!119 = !{!25, !120, !124, !127, !142}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "message_id", scope: !27, file: !122, line: 24, type: !123, isLocal: false, isDefinition: true)
!122 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueId_t", file: !31, line: 226, baseType: !118)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "data", scope: !27, file: !122, line: 26, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !43)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "mem_attrs", scope: !27, file: !122, line: 30, type: !129, isLocal: true, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueAttr_t", file: !31, line: 299, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 292, size: 192, elements: !132)
!132 = !{!133, !137, !138, !139, !140, !141}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !31, line: 293, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !131, file: !31, line: 294, baseType: !126, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !131, file: !31, line: 295, baseType: !118, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !131, file: !31, line: 296, baseType: !126, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mq_mem", scope: !131, file: !31, line: 297, baseType: !118, size: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mq_size", scope: !131, file: !31, line: 298, baseType: !126, size: 32, offset: 160)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "sample_mem", scope: !27, file: !122, line: 28, type: !144, isLocal: true, isDefinition: true, align: 32)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 4)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerAttr_t", file: !31, line: 255, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 250, size: 128, elements: !150)
!150 = !{!151, !152, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !31, line: 251, baseType: !134, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !149, file: !31, line: 252, baseType: !126, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !149, file: !31, line: 253, baseType: !118, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !149, file: !31, line: 254, baseType: !126, size: 32, offset: 96)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "_char_out", scope: !157, file: !161, line: 54, type: !162, isLocal: false, isDefinition: true)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !117, globals: !160, splitDebugInlining: false, nameTableKind: None)
!158 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!159 = !{!47}
!160 = !{!155}
!161 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!32, !32}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !167, file: !585, line: 258, type: !586, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !452, globals: !584, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!169 = !{!170, !202, !212, !261, !267, !388, !423}
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !171, line: 54, baseType: !43, size: 32, elements: !172)
!171 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!173 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!174 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!175 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!176 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!177 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!178 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!179 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!180 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!181 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!182 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!183 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!184 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!185 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!186 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!187 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!188 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!189 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!190 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!191 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!192 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!193 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!194 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!195 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!196 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!197 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!198 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!199 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!200 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!201 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !171, line: 224, baseType: !43, size: 32, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211}
!204 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!205 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!206 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!207 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!208 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!209 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!210 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!211 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !171, line: 275, baseType: !43, size: 32, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!214 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!215 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!216 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!217 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!218 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!219 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!220 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!221 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!222 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!223 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!224 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!225 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!226 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!227 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!228 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!229 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!230 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!231 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!232 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!233 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!234 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!235 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!236 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!237 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!238 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!239 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!240 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!241 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!242 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!243 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!244 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!245 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!246 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!247 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!248 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!249 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!250 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!251 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!252 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!253 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!254 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!255 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!256 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!257 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!258 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!259 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!260 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !171, line: 327, baseType: !43, size: 32, elements: !262)
!262 = !{!263, !264, !265, !266}
!263 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!264 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!265 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!266 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !268, line: 76, baseType: !43, size: 32, elements: !269)
!268 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!270 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!271 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!272 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!273 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!274 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!275 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!276 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!277 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!278 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!279 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!280 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!281 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!282 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!283 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!284 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!285 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!286 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!287 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!288 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!289 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!290 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!291 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!292 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!293 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!294 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!295 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!296 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!297 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!298 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!299 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!300 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!301 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!302 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!303 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!304 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!305 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!306 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!307 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!308 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!309 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!310 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!311 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!312 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!313 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!314 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!315 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!316 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!317 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!318 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!319 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!320 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!321 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!322 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!323 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!324 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!325 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!326 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!327 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!328 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!329 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!330 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!331 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!332 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!333 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!334 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!335 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!336 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!337 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!338 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!339 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!340 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!341 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!342 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!343 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!344 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!345 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!346 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!347 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!348 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!349 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!350 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!351 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!352 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!353 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!354 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!355 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!356 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!357 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!358 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!359 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!360 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!361 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!362 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!363 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!364 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!365 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!366 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!367 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!368 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!369 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!370 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!371 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!372 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!373 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!374 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!375 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!376 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!377 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!378 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!379 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!380 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!381 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!382 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!383 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!384 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!385 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!386 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!387 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !171, line: 237, baseType: !43, size: 32, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!390 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!391 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!392 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!393 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!394 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!395 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!396 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!397 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!398 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!399 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!400 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!401 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!402 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!403 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!404 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!405 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!406 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!407 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!408 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!409 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!410 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!411 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!412 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!413 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!414 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!415 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!416 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!417 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!418 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!419 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!420 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!421 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!422 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !268, line: 44, baseType: !43, size: 32, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!425 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!426 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!427 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!428 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!429 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!430 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!431 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!432 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!433 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!434 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!435 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!436 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!437 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!438 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!439 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!440 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!441 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!442 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!443 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!444 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!445 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!446 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!447 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!448 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!449 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!450 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!451 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!452 = !{!453, !527, !570, !583, !126}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !455, line: 4575, baseType: !456)
!455 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 4532, size: 390144, elements: !457)
!457 = !{!458, !460, !461, !462, !463, !469, !479, !483, !493, !497}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !456, file: !455, line: 4533, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !456, file: !455, line: 4534, baseType: !459, size: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !456, file: !455, line: 4535, baseType: !459, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !456, file: !455, line: 4536, baseType: !459, size: 32, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !456, file: !455, line: 4537, baseType: !464, size: 16256, offset: 128)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 16256, elements: !467)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !466)
!466 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!467 = !{!468}
!468 = !DISubrange(count: 2032)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !456, file: !455, line: 4543, baseType: !470, size: 4224, offset: 16384)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 4224, elements: !477)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !455, line: 4538, size: 128, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !471, file: !455, line: 4539, baseType: !459, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !471, file: !455, line: 4540, baseType: !459, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !471, file: !455, line: 4541, baseType: !459, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !471, file: !455, line: 4542, baseType: !459, size: 32, offset: 96)
!477 = !{!478}
!478 = !DISubrange(count: 33)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !456, file: !455, line: 4544, baseType: !480, size: 110464, offset: 20608)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 110464, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 13808)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !456, file: !455, line: 4550, baseType: !484, size: 24448, offset: 131072)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 24448, elements: !491)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !455, line: 4545, size: 128, elements: !486)
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !485, file: !455, line: 4546, baseType: !459, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !485, file: !455, line: 4547, baseType: !459, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !485, file: !455, line: 4548, baseType: !459, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !485, file: !455, line: 4549, baseType: !459, size: 32, offset: 96)
!491 = !{!492}
!492 = !DISubrange(count: 191)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !456, file: !455, line: 4551, baseType: !494, size: 106624, offset: 155520)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 106624, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 13328)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !456, file: !455, line: 4574, baseType: !498, size: 128000, offset: 262144)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 128000, elements: !525)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !455, line: 4552, size: 1024, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !521, !522, !523, !524}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !499, file: !455, line: 4553, baseType: !459, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !499, file: !455, line: 4554, baseType: !459, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !499, file: !455, line: 4555, baseType: !459, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !499, file: !455, line: 4556, baseType: !459, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !499, file: !455, line: 4557, baseType: !459, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !499, file: !455, line: 4558, baseType: !459, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !499, file: !455, line: 4559, baseType: !459, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !499, file: !455, line: 4560, baseType: !459, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !499, file: !455, line: 4561, baseType: !459, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !499, file: !455, line: 4562, baseType: !459, size: 32, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !499, file: !455, line: 4563, baseType: !459, size: 32, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !499, file: !455, line: 4564, baseType: !459, size: 32, offset: 352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !499, file: !455, line: 4565, baseType: !459, size: 32, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !499, file: !455, line: 4566, baseType: !459, size: 32, offset: 416)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !499, file: !455, line: 4567, baseType: !459, size: 32, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !499, file: !455, line: 4568, baseType: !459, size: 32, offset: 480)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !499, file: !455, line: 4569, baseType: !518, size: 384, offset: 512)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 384, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 48)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !499, file: !455, line: 4570, baseType: !459, size: 32, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !499, file: !455, line: 4571, baseType: !459, size: 32, offset: 928)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !499, file: !455, line: 4572, baseType: !459, size: 32, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !499, file: !455, line: 4573, baseType: !459, size: 32, offset: 992)
!525 = !{!526}
!526 = !DISubrange(count: 125)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !455, line: 38320, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 38303, size: 23040, elements: !530)
!530 = !{!531, !533, !537, !538, !539, !540, !544, !548, !552, !556, !560}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !529, file: !455, line: 38304, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !529, file: !455, line: 38305, baseType: !534, size: 256, offset: 32)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 256, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !529, file: !455, line: 38306, baseType: !459, size: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !529, file: !455, line: 38307, baseType: !459, size: 32, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !529, file: !455, line: 38308, baseType: !459, size: 32, offset: 352)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !529, file: !455, line: 38309, baseType: !541, size: 3712, offset: 384)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 3712, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 464)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !529, file: !455, line: 38310, baseType: !545, size: 864, offset: 4096)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 864, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 27)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !529, file: !455, line: 38311, baseType: !549, size: 3232, offset: 4960)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 3232, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 404)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !529, file: !455, line: 38312, baseType: !553, size: 3776, offset: 8192)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 3776, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 118)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !529, file: !455, line: 38313, baseType: !557, size: 4416, offset: 11968)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 4416, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 552)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !529, file: !455, line: 38319, baseType: !561, size: 6656, offset: 16384)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 6656, elements: !568)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !529, file: !455, line: 38314, size: 128, elements: !563)
!563 = !{!564, !565, !566, !567}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !562, file: !455, line: 38315, baseType: !459, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !562, file: !455, line: 38316, baseType: !459, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !562, file: !455, line: 38317, baseType: !459, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !562, file: !455, line: 38318, baseType: !459, size: 32, offset: 96)
!568 = !{!569}
!569 = !DISubrange(count: 52)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !455, line: 43319, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 43313, size: 80, elements: !573)
!573 = !{!574, !578, !579, !581, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !572, file: !455, line: 43314, baseType: !575, size: 16)
!575 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !577)
!577 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !572, file: !455, line: 43315, baseType: !575, size: 16, offset: 16)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !572, file: !455, line: 43316, baseType: !580, size: 16, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !572, file: !455, line: 43317, baseType: !575, size: 16, offset: 48)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !572, file: !455, line: 43318, baseType: !575, size: 16, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!584 = !{!165}
!585 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !588, line: 51, size: 64, elements: !589)
!588 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!589 = !{!590, !597}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !587, file: !588, line: 60, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DISubroutineType(types: !593)
!593 = !{!32, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !588, line: 48, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !587, file: !588, line: 65, baseType: !594, size: 32, offset: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !600, file: !607, line: 21, type: !162, isLocal: true, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !602, globals: !606, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!602 = !{!603, !32, !118}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !605, line: 22, baseType: !32)
!605 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!606 = !{!598}
!607 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "cv2_timer_slab", scope: !610, file: !692, line: 16, type: !706, isLocal: false, isDefinition: true, align: 32)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !612, retainedTypes: !613, globals: !689, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!612 = !{!42, !30, !47}
!613 = !{!118, !614, !615, !619, !620, !32, !126, !686, !688}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !616, line: 46, baseType: !617)
!616 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !618)
!618 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerId_t", file: !31, line: 211, baseType: !118)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_timer", file: !622, line: 28, size: 704, elements: !623)
!622 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/wrapper.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!623 = !{!624, !674, !676, !677, !681, !685}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "z_timer", scope: !621, file: !622, line: 29, baseType: !625, size: 448)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !626, line: 1318, size: 448, elements: !627)
!626 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!627 = !{!628, !655, !661, !666, !667, !672, !673}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !625, file: !626, line: 1324, baseType: !629, size: 192)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !630, line: 244, size: 192, elements: !631)
!630 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!631 = !{!632, !648, !654}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !629, file: !630, line: 245, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !634, line: 49, baseType: !635)
!634 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !634, line: 37, size: 64, elements: !636)
!636 = !{!637, !643}
!637 = !DIDerivedType(tag: DW_TAG_member, scope: !635, file: !634, line: 38, baseType: !638, size: 32)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !635, file: !634, line: 38, size: 32, elements: !639)
!639 = !{!640, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !638, file: !634, line: 39, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !638, file: !634, line: 40, baseType: !641, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, scope: !635, file: !634, line: 42, baseType: !644, size: 32, offset: 32)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !635, file: !634, line: 42, size: 32, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !644, file: !634, line: 43, baseType: !641, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !644, file: !634, line: 44, baseType: !641, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !629, file: !630, line: 246, baseType: !649, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !630, line: 242, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !629, file: !630, line: 249, baseType: !617, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !625, file: !626, line: 1327, baseType: !656, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !630, line: 233, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 231, size: 64, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !657, file: !630, line: 232, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !634, line: 48, baseType: !635)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !625, file: !626, line: 1330, baseType: !662, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !625, file: !626, line: 1333, baseType: !662, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !625, file: !626, line: 1336, baseType: !668, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !616, line: 67, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 65, size: 64, elements: !670)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !669, file: !616, line: 66, baseType: !615, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !625, file: !626, line: 1339, baseType: !126, size: 32, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !625, file: !626, line: 1342, baseType: !118, size: 32, offset: 416)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !621, file: !622, line: 30, baseType: !675, size: 32, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerType_t", file: !31, line: 167, baseType: !42)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !621, file: !622, line: 31, baseType: !126, size: 32, offset: 480)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !622, line: 32, baseType: !678, size: 128, offset: 512)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 16)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "callback_function", scope: !621, file: !622, line: 33, baseType: !682, size: 32, offset: 640)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !118}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !621, file: !622, line: 34, baseType: !118, size: 32, offset: 672)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !687)
!687 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!689 = !{!608, !690, !696}
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_timer_slab", scope: !610, file: !692, line: 16, type: !693, isLocal: false, isDefinition: true, align: 32)
!692 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 3520, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 440)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "init_timer_attrs", scope: !610, file: !692, line: 19, type: !698, isLocal: true, isDefinition: true)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerAttr_t", file: !31, line: 255, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 250, size: 128, elements: !701)
!701 = !{!702, !703, !704, !705}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !700, file: !31, line: 251, baseType: !134, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !700, file: !31, line: 252, baseType: !126, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !700, file: !31, line: 253, baseType: !118, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !700, file: !31, line: 254, baseType: !126, size: 32, offset: 96)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !626, line: 4836, size: 256, elements: !707)
!707 = !{!708, !709, !714, !715, !718, !719, !720}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !706, file: !626, line: 4837, baseType: !656, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !706, file: !626, line: 4838, baseType: !710, size: 32, offset: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !711, line: 43, size: 32, elements: !712)
!711 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !710, file: !711, line: 52, baseType: !22, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !706, file: !626, line: 4839, baseType: !126, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !706, file: !626, line: 4840, baseType: !716, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !717, line: 214, baseType: !43)
!717 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!718 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !706, file: !626, line: 4841, baseType: !688, size: 32, offset: 160)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !706, file: !626, line: 4842, baseType: !688, size: 32, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !706, file: !626, line: 4843, baseType: !126, size: 32, offset: 224)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "cv2_msgq_slab", scope: !723, file: !771, line: 11, type: !787, isLocal: false, isDefinition: true, align: 32)
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !725, retainedTypes: !726, globals: !768, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/msgq.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!725 = !{!30, !47}
!726 = !{!118, !614, !615, !123, !727, !32, !126, !686}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_msgq", file: !622, line: 55, size: 608, elements: !729)
!729 = !{!730, !765, !766, !767}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "z_msgq", scope: !728, file: !622, line: 56, baseType: !731, size: 416)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !626, line: 4204, size: 416, elements: !732)
!732 = !{!733, !752, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !731, file: !626, line: 4206, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !630, line: 233, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 231, size: 64, elements: !736)
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !735, file: !630, line: 232, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !634, line: 48, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !634, line: 37, size: 64, elements: !740)
!740 = !{!741, !747}
!741 = !DIDerivedType(tag: DW_TAG_member, scope: !739, file: !634, line: 38, baseType: !742, size: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !739, file: !634, line: 38, size: 32, elements: !743)
!743 = !{!744, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !742, file: !634, line: 39, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !742, file: !634, line: 40, baseType: !745, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, scope: !739, file: !634, line: 42, baseType: !748, size: 32, offset: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !739, file: !634, line: 42, size: 32, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !748, file: !634, line: 43, baseType: !745, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !748, file: !634, line: 44, baseType: !745, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !731, file: !626, line: 4208, baseType: !753, size: 32, offset: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !711, line: 43, size: 32, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !753, file: !711, line: 52, baseType: !22, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !731, file: !626, line: 4210, baseType: !716, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !731, file: !626, line: 4212, baseType: !126, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !731, file: !626, line: 4214, baseType: !688, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !731, file: !626, line: 4216, baseType: !688, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !731, file: !626, line: 4218, baseType: !688, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !731, file: !626, line: 4220, baseType: !688, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !731, file: !626, line: 4222, baseType: !126, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !731, file: !626, line: 4224, baseType: !738, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !731, file: !626, line: 4227, baseType: !465, size: 8, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !728, file: !622, line: 57, baseType: !118, size: 32, offset: 416)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "is_dynamic_allocation", scope: !728, file: !622, line: 58, baseType: !136, size: 8, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !728, file: !622, line: 59, baseType: !678, size: 128, offset: 456)
!768 = !{!721, !769, !775}
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_msgq_slab", scope: !723, file: !771, line: 11, type: !772, isLocal: false, isDefinition: true, align: 32)
!771 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/msgq.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 3040, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 380)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "init_msgq_attrs", scope: !723, file: !771, line: 14, type: !777, isLocal: true, isDefinition: true)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueAttr_t", file: !31, line: 299, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 292, size: 192, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !779, file: !31, line: 293, baseType: !134, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !779, file: !31, line: 294, baseType: !126, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !779, file: !31, line: 295, baseType: !118, size: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !779, file: !31, line: 296, baseType: !126, size: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mq_mem", scope: !779, file: !31, line: 297, baseType: !118, size: 32, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mq_size", scope: !779, file: !31, line: 298, baseType: !126, size: 32, offset: 160)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !626, line: 4836, size: 256, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !787, file: !626, line: 4837, baseType: !734, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !787, file: !626, line: 4838, baseType: !753, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !787, file: !626, line: 4839, baseType: !126, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !787, file: !626, line: 4840, baseType: !716, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !787, file: !626, line: 4841, baseType: !688, size: 32, offset: 160)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !787, file: !626, line: 4842, baseType: !688, size: 32, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !787, file: !626, line: 4843, baseType: !126, size: 32, offset: 224)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !798, file: !896, line: 603, type: !898, isLocal: true, isDefinition: true, align: 32)
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !800, globals: !893, splitDebugInlining: false, nameTableKind: None)
!799 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!800 = !{!118, !32, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !804, line: 336, size: 608, elements: !805)
!804 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!805 = !{!806, !833, !837, !841, !854, !859, !865, !871, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !803, file: !804, line: 365, baseType: !807, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DISubroutineType(types: !809)
!809 = !{!32, !810, !832}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !813, line: 378, size: 192, elements: !814)
!813 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!814 = !{!815, !816, !817, !818, !825, !826}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !812, file: !813, line: 380, baseType: !134, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !812, file: !813, line: 382, baseType: !13, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !812, file: !813, line: 384, baseType: !13, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !812, file: !813, line: 386, baseType: !819, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !813, line: 351, size: 16, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !820, file: !813, line: 359, baseType: !465, size: 8)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !820, file: !813, line: 364, baseType: !824, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!824 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !812, file: !813, line: 388, baseType: !118, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !812, file: !813, line: 396, baseType: !827, size: 32, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !813, line: 43, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !831)
!831 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !803, file: !804, line: 366, baseType: !834, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !810, !466}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !803, file: !804, line: 374, baseType: !838, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{!32, !810}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !803, file: !804, line: 377, baseType: !842, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DISubroutineType(types: !844)
!844 = !{!32, !810, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !804, line: 122, size: 64, elements: !848)
!848 = !{!849, !850, !851, !852, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !847, file: !804, line: 123, baseType: !126, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !847, file: !804, line: 124, baseType: !465, size: 8, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !847, file: !804, line: 125, baseType: !465, size: 8, offset: 40)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !847, file: !804, line: 126, baseType: !465, size: 8, offset: 48)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !847, file: !804, line: 127, baseType: !465, size: 8, offset: 56)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !803, file: !804, line: 379, baseType: !855, size: 32, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DISubroutineType(types: !857)
!857 = !{!32, !810, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !803, file: !804, line: 384, baseType: !860, size: 32, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!32, !810, !863, !32}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !803, file: !804, line: 393, baseType: !866, size: 32, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!32, !810, !869, !870}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !803, file: !804, line: 402, baseType: !872, size: 32, offset: 224)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !810}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !803, file: !804, line: 405, baseType: !872, size: 32, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !803, file: !804, line: 408, baseType: !838, size: 32, offset: 288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !803, file: !804, line: 411, baseType: !872, size: 32, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !803, file: !804, line: 414, baseType: !872, size: 32, offset: 352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !803, file: !804, line: 417, baseType: !838, size: 32, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !803, file: !804, line: 420, baseType: !838, size: 32, offset: 416)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !803, file: !804, line: 423, baseType: !872, size: 32, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !803, file: !804, line: 426, baseType: !872, size: 32, offset: 480)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !803, file: !804, line: 429, baseType: !838, size: 32, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !803, file: !804, line: 432, baseType: !838, size: 32, offset: 544)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !803, file: !804, line: 435, baseType: !886, size: 32, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !810, !889, !118}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !804, line: 142, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !810, !118}
!893 = !{!796, !894}
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !798, file: !896, line: 38, type: !897, isLocal: true, isDefinition: true)
!896 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !588, line: 51, size: 64, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !899, file: !588, line: 60, baseType: !838, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !899, file: !588, line: 65, baseType: !810, size: 32, offset: 32)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !905, file: !1009, line: 318, type: !1086, isLocal: false, isDefinition: true)
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !907, retainedTypes: !924, globals: !1006, splitDebugInlining: false, nameTableKind: None)
!906 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!907 = !{!908, !914, !919}
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !909, line: 506, baseType: !43, size: 32, elements: !910)
!909 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = !{!911, !912, !913}
!911 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!912 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!913 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !909, line: 512, baseType: !43, size: 32, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!917 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!918 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !920, line: 66, baseType: !43, size: 32, elements: !921)
!920 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!921 = !{!922, !923}
!922 = !DIEnumerator(name: "gpioPinClear", value: 0)
!923 = !DIEnumerator(name: "gpioPinSet", value: 1)
!924 = !{!925, !995, !1000, !960, !914, !908, !1005, !118, !583, !975, !688}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !909, line: 523, size: 288, elements: !928)
!928 = !{!929, !950, !956, !961, !965, !966, !967, !971, !991}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !927, file: !909, line: 524, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DISubroutineType(types: !932)
!932 = !{!32, !933, !948, !949}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !813, line: 378, size: 192, elements: !936)
!936 = !{!937, !938, !939, !940, !946, !947}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !813, line: 380, baseType: !134, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !935, file: !813, line: 382, baseType: !13, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !935, file: !813, line: 384, baseType: !13, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !935, file: !813, line: 386, baseType: !941, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !813, line: 351, size: 16, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !942, file: !813, line: 359, baseType: !465, size: 8)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !942, file: !813, line: 364, baseType: !824, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !935, file: !813, line: 388, baseType: !118, size: 32, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !935, file: !813, line: 396, baseType: !827, size: 32, offset: 160)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !909, line: 237, baseType: !465)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !909, line: 257, baseType: !126)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !927, file: !909, line: 530, baseType: !951, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{!32, !933, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !909, line: 229, baseType: !126)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !927, file: !909, line: 532, baseType: !957, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{!32, !933, !960, !955}
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !909, line: 216, baseType: !126)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !927, file: !909, line: 535, baseType: !962, size: 32, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{!32, !933, !960}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !927, file: !909, line: 537, baseType: !962, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !927, file: !909, line: 539, baseType: !962, size: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !927, file: !909, line: 541, baseType: !968, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DISubroutineType(types: !970)
!970 = !{!32, !933, !948, !908, !914}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !927, file: !909, line: 544, baseType: !972, size: 32, offset: 224)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{!32, !933, !975, !824}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !909, line: 478, size: 96, elements: !977)
!977 = !{!978, !985, !990}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !976, file: !909, line: 482, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !980, line: 33, baseType: !981)
!980 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !980, line: 29, size: 32, elements: !982)
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !981, file: !980, line: 30, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !976, file: !909, line: 485, baseType: !986, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !909, line: 464, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !933, !975, !960}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !976, file: !909, line: 493, baseType: !960, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !927, file: !909, line: 547, baseType: !992, size: 32, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{!126, !933}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !909, line: 428, size: 32, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !997, file: !909, line: 434, baseType: !960, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !909, line: 441, size: 32, elements: !1003)
!1003 = !{!1004}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1002, file: !909, line: 447, baseType: !960, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1006 = !{!903, !1007, !1013, !1015, !1025, !1037, !1039, !1070, !1072, !1084}
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !905, file: !1009, line: 318, type: !1010, isLocal: false, isDefinition: true, align: 16)
!1009 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 400, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 25)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !905, file: !1009, line: 318, type: !934, isLocal: false, isDefinition: true, align: 32)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !905, file: !1009, line: 318, type: !1017, isLocal: true, isDefinition: true, align: 32)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !588, line: 51, size: 64, elements: !1019)
!1019 = !{!1020, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1018, file: !588, line: 60, baseType: !1021, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!32, !933}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1018, file: !588, line: 65, baseType: !933, size: 32, offset: 32)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !905, file: !1009, line: 318, type: !1027, isLocal: true, isDefinition: true)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !1009, line: 33, size: 96, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1027, file: !1009, line: 35, baseType: !1002, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1027, file: !1009, line: 37, baseType: !1031, size: 64, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !980, line: 40, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !980, line: 35, size: 64, elements: !1033)
!1033 = !{!1034, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1032, file: !980, line: 36, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1032, file: !980, line: 37, baseType: !1035, size: 32, offset: 32)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !905, file: !1009, line: 318, type: !942, isLocal: true, isDefinition: true, align: 8)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !905, file: !1009, line: 318, type: !1041, isLocal: true, isDefinition: true)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !1009, line: 23, size: 128, elements: !1043)
!1043 = !{!1044, !1045, !1058, !1069}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1042, file: !1009, line: 25, baseType: !997, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1042, file: !1009, line: 26, baseType: !1046, size: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !455, line: 19729, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 19720, size: 256, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !1048, file: !455, line: 19721, baseType: !459, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !1048, file: !455, line: 19722, baseType: !459, size: 32, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !1048, file: !455, line: 19723, baseType: !532, size: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !1048, file: !455, line: 19724, baseType: !459, size: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !1048, file: !455, line: 19725, baseType: !459, size: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !1048, file: !455, line: 19726, baseType: !459, size: 32, offset: 160)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !1048, file: !455, line: 19727, baseType: !459, size: 32, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !1048, file: !455, line: 19728, baseType: !459, size: 32, offset: 224)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !1042, file: !1009, line: 28, baseType: !1059, size: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !1062, line: 51, size: 128, elements: !1063)
!1062 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1063 = !{!1064, !1065, !1066, !1067, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !1061, file: !1062, line: 52, baseType: !126, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !1061, file: !1062, line: 53, baseType: !126, size: 32, offset: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !1061, file: !1062, line: 54, baseType: !126, size: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !1061, file: !1062, line: 55, baseType: !465, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !1061, file: !1062, line: 56, baseType: !126, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mux_count", scope: !1042, file: !1009, line: 29, baseType: !465, size: 8, offset: 96)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "imx_gpio_driver_api", scope: !905, file: !1009, line: 249, type: !926, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_0", scope: !1074, file: !1009, line: 318, type: !1077, isLocal: true, isDefinition: true, align: 32)
!1074 = distinct !DISubprogram(name: "imx_gpio_0_init", scope: !1009, file: !1009, line: 318, type: !1022, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !905, retainedNodes: !1075)
!1075 = !{!1076}
!1076 = !DILocalVariable(name: "port", arg: 1, scope: !1074, file: !1009, line: 318, type: !933)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1078)
!1078 = !{!1079, !1081, !1082, !1083}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1077, file: !10, line: 55, baseType: !1080, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !10, line: 57, baseType: !1080, size: 32, offset: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1077, file: !10, line: 59, baseType: !118, size: 32, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1077, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_1", scope: !1074, file: !1009, line: 318, type: !1077, isLocal: true, isDefinition: true, align: 32)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 2048, elements: !679)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !1089, file: !1094, line: 7, type: !1095, isLocal: false, isDefinition: true, align: 16)
!1089 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1090, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1091, splitDebugInlining: false, nameTableKind: None)
!1090 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!1091 = !{!1087, !1092}
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_198", scope: !1089, file: !1094, line: 12, type: !1095, isLocal: false, isDefinition: true, align: 16)
!1094 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 48, elements: !1096)
!1096 = !{!1097}
!1097 = !DISubrange(count: 3)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(name: "imx_uart_0_config", scope: !1100, file: !1297, line: 339, type: !1295, isLocal: true, isDefinition: true)
!1100 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1101, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1102, retainedTypes: !1188, globals: !1333, splitDebugInlining: false, nameTableKind: None)
!1101 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!1102 = !{!47, !1103, !1141, !1169, !1173, !1177, !1182}
!1103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_status_flag", file: !1104, line: 122, baseType: !43, size: 32, elements: !1105)
!1104 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./uart_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140}
!1106 = !DIEnumerator(name: "uartStatusRxCharReady", value: 15)
!1107 = !DIEnumerator(name: "uartStatusRxError", value: 14)
!1108 = !DIEnumerator(name: "uartStatusRxOverrunError", value: 13)
!1109 = !DIEnumerator(name: "uartStatusRxFrameError", value: 12)
!1110 = !DIEnumerator(name: "uartStatusRxBreakDetect", value: 11)
!1111 = !DIEnumerator(name: "uartStatusRxParityError", value: 10)
!1112 = !DIEnumerator(name: "uartStatusParityError", value: 9699343)
!1113 = !DIEnumerator(name: "uartStatusRtsStatus", value: 9699342)
!1114 = !DIEnumerator(name: "uartStatusTxReady", value: 9699341)
!1115 = !DIEnumerator(name: "uartStatusRtsDelta", value: 9699340)
!1116 = !DIEnumerator(name: "uartStatusEscape", value: 9699339)
!1117 = !DIEnumerator(name: "uartStatusFrameError", value: 9699338)
!1118 = !DIEnumerator(name: "uartStatusRxReady", value: 9699337)
!1119 = !DIEnumerator(name: "uartStatusAgingTimer", value: 9699336)
!1120 = !DIEnumerator(name: "uartStatusDtrDelta", value: 9699335)
!1121 = !DIEnumerator(name: "uartStatusRxDs", value: 9699334)
