; ModuleID = './build/md5_get_hash.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_aes_buffer_t = type { i8*, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.hal_md5_context_t = type { [4 x i32], i64, i8*, [64 x i8], i32 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !2, file: !3, line: 71, type: !79, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !62, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 121, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!10 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !12, line: 47, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!15 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!16 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!17 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!18 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!19 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!20 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!21 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!22 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!23 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!24 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!25 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!26 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!27 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!28 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!29 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!30 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!31 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!32 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!33 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!34 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!35 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!36 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!37 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!38 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!39 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!40 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!41 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!42 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!43 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!44 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!45 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!46 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!47 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!48 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!49 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!50 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!51 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!52 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!53 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!54 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!55 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!56 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!57 = !{!58, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !6, line: 116, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !12, line: 95, baseType: !11)
!62 = !{!0, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !2, file: !3, line: 67, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !66, line: 111, baseType: !67)
!66 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 109, size: 96, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !67, file: !66, line: 110, baseType: !70, size: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !66, line: 106, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 102, size: 96, elements: !72)
!72 = !{!73, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !71, file: !66, line: 103, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !71, file: !66, line: 104, baseType: !74, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !71, file: !66, line: 105, baseType: !74, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !6, line: 62, baseType: !7)
!81 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!82 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !85, file: !86, line: 43, type: !92, isLocal: true, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !87, globals: !97, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!87 = !{!88, !80, !90, !96}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 48, baseType: !94)
!93 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !95, line: 79, baseType: !7)
!95 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!97 = !{!83, !98}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !85, file: !86, line: 44, type: !92, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !102, file: !103, line: 54, type: !92, isLocal: false, isDefinition: true)
!102 = distinct !DICompileUnit(language: DW_LANG_C99, file: !103, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !128, globals: !137, splitDebugInlining: false, nameTableKind: None)
!103 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!104 = !{!105, !111}
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 71, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!107 = !{!108, !109, !110}
!108 = !DIEnumerator(name: "UART_PORT0", value: 0)
!109 = !DIEnumerator(name: "UART_PORT1", value: 1)
!110 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 129, baseType: !7, size: 32, elements: !113)
!112 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!114 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!115 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!116 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!117 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!118 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!119 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!120 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!121 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!122 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!123 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!124 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!125 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!126 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!127 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!128 = !{!88, !92, !129, !131, !133, !135, !80}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !6, line: 113, baseType: !132)
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !6, line: 59, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!137 = !{!100}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "g_crypt_lock", scope: !140, file: !141, line: 48, type: !156, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !148, globals: !152, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_aes.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!142 = !{!143, !11}
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 290, baseType: !13, size: 32, elements: !145)
!144 = !DIFile(filename: "../../../../../driver/chip/inc/hal_aes.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!145 = !{!146, !147}
!146 = !DIEnumerator(name: "HAL_AES_STATUS_ERROR", value: -1)
!147 = !DIEnumerator(name: "HAL_AES_STATUS_OK", value: 0)
!148 = !{!149, !61, !150}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !93, line: 24, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !95, line: 43, baseType: !134)
!152 = !{!138, !153}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "g_aes_op_done", scope: !140, file: !141, line: 71, type: !155, isLocal: true, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !156)
!156 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !159, file: !160, line: 53, type: !248, isLocal: false, isDefinition: true)
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !170, globals: !247, splitDebugInlining: false, nameTableKind: None)
!160 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!161 = !{!162, !11}
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !163, line: 152, baseType: !13, size: 32, elements: !164)
!163 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!164 = !{!165, !166, !167, !168, !169}
!165 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!166 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!167 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!168 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!169 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!170 = !{!171, !149, !92, !172, !174, !208}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !12, line: 97, baseType: !61)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !93, line: 44, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !95, line: 77, baseType: !13)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !176, line: 378, baseType: !177)
!176 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 363, size: 28704, elements: !178)
!178 = !{!179, !183, !187, !188, !189, !190, !191, !192, !193, !194, !198, !203, !207}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !177, file: !176, line: 365, baseType: !180, size: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !177, file: !176, line: 366, baseType: !184, size: 768, offset: 256)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 768, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 24)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !177, file: !176, line: 367, baseType: !180, size: 256, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !177, file: !176, line: 368, baseType: !184, size: 768, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !177, file: !176, line: 369, baseType: !180, size: 256, offset: 2048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !177, file: !176, line: 370, baseType: !184, size: 768, offset: 2304)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !177, file: !176, line: 371, baseType: !180, size: 256, offset: 3072)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !177, file: !176, line: 372, baseType: !184, size: 768, offset: 3328)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !177, file: !176, line: 373, baseType: !180, size: 256, offset: 4096)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !177, file: !176, line: 374, baseType: !195, size: 1792, offset: 4352)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1792, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 56)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !177, file: !176, line: 375, baseType: !199, size: 1920, offset: 6144)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 1920, elements: !201)
!200 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!201 = !{!202}
!202 = !DISubrange(count: 240)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !177, file: !176, line: 376, baseType: !204, size: 20608, offset: 8064)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 20608, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 644)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !177, file: !176, line: 377, baseType: !91, size: 32, offset: 28672)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !176, line: 418, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 395, size: 1120, elements: !211)
!211 = !{!212, !214, !215, !216, !217, !218, !219, !223, !224, !225, !226, !227, !228, !229, !230, !234, !235, !236, !240, !244, !246}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !210, file: !176, line: 397, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !210, file: !176, line: 398, baseType: !91, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !210, file: !176, line: 399, baseType: !91, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !210, file: !176, line: 400, baseType: !91, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !210, file: !176, line: 401, baseType: !91, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !210, file: !176, line: 402, baseType: !91, size: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !210, file: !176, line: 403, baseType: !220, size: 96, offset: 192)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 96, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 12)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !210, file: !176, line: 404, baseType: !91, size: 32, offset: 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !210, file: !176, line: 405, baseType: !91, size: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !210, file: !176, line: 406, baseType: !91, size: 32, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !210, file: !176, line: 407, baseType: !91, size: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !210, file: !176, line: 408, baseType: !91, size: 32, offset: 416)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !210, file: !176, line: 409, baseType: !91, size: 32, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !210, file: !176, line: 410, baseType: !91, size: 32, offset: 480)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !210, file: !176, line: 411, baseType: !231, size: 64, offset: 512)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 64, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 2)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !210, file: !176, line: 412, baseType: !213, size: 32, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !210, file: !176, line: 413, baseType: !213, size: 32, offset: 608)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !210, file: !176, line: 414, baseType: !237, size: 128, offset: 640)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 4)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !210, file: !176, line: 415, baseType: !241, size: 160, offset: 768)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 160, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 5)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !210, file: !176, line: 416, baseType: !245, size: 160, offset: 928)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 160, elements: !242)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !210, file: !176, line: 417, baseType: !91, size: 32, offset: 1088)
!247 = !{!157}
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 6144, elements: !257)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !160, line: 50, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 47, size: 64, elements: !251)
!251 = !{!252, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !250, file: !160, line: 48, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !171}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !250, file: !160, line: 49, baseType: !92, size: 32, offset: 32)
!257 = !{!258}
!258 = !DISubrange(count: 96)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !261, file: !262, line: 77, type: !328, isLocal: true, isDefinition: true)
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !263, retainedTypes: !314, globals: !316, splitDebugInlining: false, nameTableKind: None)
!262 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!263 = !{!264, !272, !278, !294, !300, !304, !105, !111, !309}
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 345, baseType: !13, size: 32, elements: !266)
!265 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!266 = !{!267, !268, !269, !270, !271}
!267 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!268 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!269 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!270 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!271 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !273, line: 109, baseType: !7, size: 32, elements: !274)
!273 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!276 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!277 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 302, baseType: !7, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!280 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!281 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!282 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!283 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!284 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!285 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!286 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!287 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!288 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!289 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!290 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!291 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!292 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!293 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 321, baseType: !7, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!297 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!298 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!299 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 330, baseType: !7, size: 32, elements: !301)
!301 = !{!302, !303}
!302 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!303 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 337, baseType: !7, size: 32, elements: !305)
!305 = !{!306, !307, !308}
!306 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!307 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!308 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 355, baseType: !13, size: 32, elements: !310)
!310 = !{!311, !312, !313}
!311 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!312 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!313 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!314 = !{!7, !149, !134, !315, !150}
!315 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!316 = !{!259, !317}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "func_tbl", scope: !319, file: !262, line: 536, type: !326, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !262, file: !262, line: 534, type: !320, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !261, retainedNodes: !324)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !112, line: 197, baseType: !74)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !273, line: 113, baseType: !272)
!324 = !{!325}
!325 = !DILocalVariable(name: "uart_port", arg: 1, scope: !319, file: !262, line: 534, type: !323)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 64, elements: !232)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 1024, elements: !232)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !262, line: 75, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 68, size: 512, elements: !331)
!331 = !{!332, !333, !345, !346, !357, !358}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !330, file: !262, line: 69, baseType: !156, size: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !330, file: !262, line: 70, baseType: !334, size: 128, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !265, line: 378, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 373, size: 128, elements: !336)
!336 = !{!337, !339, !341, !343}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !335, file: !265, line: 374, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !265, line: 317, baseType: !278)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !335, file: !265, line: 375, baseType: !340, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !265, line: 326, baseType: !294)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !335, file: !265, line: 376, baseType: !342, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !265, line: 333, baseType: !300)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !335, file: !265, line: 377, baseType: !344, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !265, line: 341, baseType: !304)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !330, file: !262, line: 71, baseType: !156, size: 8, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !330, file: !262, line: 72, baseType: !347, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !262, line: 66, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 63, size: 64, elements: !349)
!349 = !{!350, !356}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !348, file: !262, line: 64, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !265, line: 410, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355, !149}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !265, line: 359, baseType: !309)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !348, file: !262, line: 65, baseType: !149, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !330, file: !262, line: 73, baseType: !156, size: 8, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !330, file: !262, line: 74, baseType: !359, size: 224, offset: 288)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !265, line: 390, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 382, size: 224, elements: !361)
!361 = !{!362, !364, !365, !366, !367, !368, !369}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !360, file: !265, line: 383, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !360, file: !265, line: 384, baseType: !92, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !360, file: !265, line: 385, baseType: !92, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !360, file: !265, line: 386, baseType: !363, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !360, file: !265, line: 387, baseType: !92, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !360, file: !265, line: 388, baseType: !92, size: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !360, file: !265, line: 389, baseType: !92, size: 32, offset: 192)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !372, file: !373, line: 59, type: !92, isLocal: false, isDefinition: true)
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !374, globals: !437, splitDebugInlining: false, nameTableKind: None)
!373 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/md5_get_hash/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!374 = !{!375, !383, !408}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !176, line: 656, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 650, size: 128, elements: !378)
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !377, file: !176, line: 652, baseType: !91, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !377, file: !176, line: 653, baseType: !91, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !377, file: !176, line: 654, baseType: !91, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !377, file: !176, line: 655, baseType: !213, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !176, line: 418, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 395, size: 1120, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !385, file: !176, line: 397, baseType: !213, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !385, file: !176, line: 398, baseType: !91, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !385, file: !176, line: 399, baseType: !91, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !385, file: !176, line: 400, baseType: !91, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !385, file: !176, line: 401, baseType: !91, size: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !385, file: !176, line: 402, baseType: !91, size: 32, offset: 160)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !385, file: !176, line: 403, baseType: !220, size: 96, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !385, file: !176, line: 404, baseType: !91, size: 32, offset: 288)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !385, file: !176, line: 405, baseType: !91, size: 32, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !385, file: !176, line: 406, baseType: !91, size: 32, offset: 352)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !385, file: !176, line: 407, baseType: !91, size: 32, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !385, file: !176, line: 408, baseType: !91, size: 32, offset: 416)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !385, file: !176, line: 409, baseType: !91, size: 32, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !385, file: !176, line: 410, baseType: !91, size: 32, offset: 480)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !385, file: !176, line: 411, baseType: !231, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !385, file: !176, line: 412, baseType: !213, size: 32, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !385, file: !176, line: 413, baseType: !213, size: 32, offset: 608)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !385, file: !176, line: 414, baseType: !237, size: 128, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !385, file: !176, line: 415, baseType: !241, size: 160, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !385, file: !176, line: 416, baseType: !245, size: 160, offset: 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !385, file: !176, line: 417, baseType: !91, size: 32, offset: 1088)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !410, line: 72, baseType: !411)
!410 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 56, size: 525312, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !427, !428, !432, !436}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !411, file: !410, line: 57, baseType: !91, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !411, file: !410, line: 58, baseType: !91, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !411, file: !410, line: 59, baseType: !91, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !411, file: !410, line: 60, baseType: !91, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !411, file: !410, line: 61, baseType: !91, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !411, file: !410, line: 62, baseType: !91, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !411, file: !410, line: 63, baseType: !91, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !411, file: !410, line: 64, baseType: !91, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !411, file: !410, line: 65, baseType: !91, size: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !411, file: !410, line: 66, baseType: !91, size: 32, offset: 288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !411, file: !410, line: 67, baseType: !424, size: 32, offset: 320)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 1)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !411, file: !410, line: 68, baseType: !91, size: 32, offset: 352)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !411, file: !410, line: 69, baseType: !429, size: 523904, offset: 384)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 523904, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 16372)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !411, file: !410, line: 70, baseType: !433, size: 512, offset: 524288)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 512, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 16)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !411, file: !410, line: 71, baseType: !433, size: 512, offset: 524800)
!437 = !{!370, !438}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !372, file: !373, line: 61, type: !91, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "heap_end", scope: !442, file: !443, line: 66, type: !448, isLocal: true, isDefinition: true)
!442 = distinct !DISubprogram(name: "_sbrk_r", scope: !443, file: !443, line: 63, type: !444, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !640, retainedNodes: !644)
!443 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/md5_get_hash/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !449, !639}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !447, line: 123, baseType: !448)
!447 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !451, line: 377, size: 1920, elements: !452)
!451 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!452 = !{!453, !454, !528, !529, !530, !531, !532, !533, !534, !537, !558, !562, !563, !564, !565, !575, !588, !589, !594, !613, !614, !621, !622, !638}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !450, file: !451, line: 381, baseType: !13, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !450, file: !451, line: 386, baseType: !455, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !451, line: 292, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !451, line: 186, size: 832, elements: !458)
!458 = !{!459, !461, !462, !463, !465, !466, !471, !472, !473, !474, !478, !484, !491, !495, !496, !497, !498, !502, !504, !505, !506, !508, !514, !527}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !457, file: !451, line: 187, baseType: !460, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !457, file: !451, line: 188, baseType: !13, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !457, file: !451, line: 189, baseType: !13, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !457, file: !451, line: 190, baseType: !464, size: 16, offset: 96)
!464 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !457, file: !451, line: 191, baseType: !464, size: 16, offset: 112)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !457, file: !451, line: 192, baseType: !467, size: 64, offset: 128)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !451, line: 122, size: 64, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !467, file: !451, line: 123, baseType: !460, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !467, file: !451, line: 124, baseType: !13, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !457, file: !451, line: 193, baseType: !13, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !457, file: !451, line: 196, baseType: !449, size: 32, offset: 224)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !457, file: !451, line: 200, baseType: !149, size: 32, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !457, file: !451, line: 202, baseType: !475, size: 32, offset: 288)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DISubroutineType(types: !477)
!477 = !{!13, !449, !149, !448, !13}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !457, file: !451, line: 204, baseType: !479, size: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DISubroutineType(types: !481)
!481 = !{!13, !449, !149, !482, !13}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !457, file: !451, line: 207, baseType: !485, size: 32, offset: 352)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !449, !149, !488, !13}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !489, line: 116, baseType: !490)
!489 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!490 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !457, file: !451, line: 208, baseType: !492, size: 32, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DISubroutineType(types: !494)
!494 = !{!13, !449, !149}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !457, file: !451, line: 211, baseType: !467, size: 64, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !457, file: !451, line: 212, baseType: !460, size: 32, offset: 480)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !457, file: !451, line: 213, baseType: !13, size: 32, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !457, file: !451, line: 216, baseType: !499, size: 24, offset: 544)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 24, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 3)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !457, file: !451, line: 217, baseType: !503, size: 8, offset: 568)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8, elements: !425)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !457, file: !451, line: 220, baseType: !467, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !457, file: !451, line: 223, baseType: !13, size: 32, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !457, file: !451, line: 224, baseType: !507, size: 32, offset: 672)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !489, line: 46, baseType: !490)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !457, file: !451, line: 231, baseType: !509, size: 32, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !451, line: 35, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !511, line: 34, baseType: !512)
!511 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !511, line: 33, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !457, file: !451, line: 233, baseType: !515, size: 64, offset: 736)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !489, line: 170, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 162, size: 64, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !516, file: !489, line: 164, baseType: !13, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !516, file: !489, line: 169, baseType: !520, size: 32, offset: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !516, file: !489, line: 165, size: 32, elements: !521)
!521 = !{!522, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !520, file: !489, line: 167, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !524, line: 116, baseType: !13)
!524 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !520, file: !489, line: 168, baseType: !526, size: 32)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !238)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !457, file: !451, line: 234, baseType: !13, size: 32, offset: 800)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !450, file: !451, line: 386, baseType: !455, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !450, file: !451, line: 386, baseType: !455, size: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !450, file: !451, line: 388, baseType: !13, size: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !450, file: !451, line: 390, baseType: !448, size: 32, offset: 160)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !450, file: !451, line: 392, baseType: !13, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !450, file: !451, line: 394, baseType: !13, size: 32, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !450, file: !451, line: 395, baseType: !535, size: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !451, line: 45, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !450, file: !451, line: 397, baseType: !538, size: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !451, line: 349, size: 128, elements: !540)
!540 = !{!541, !554, !555, !556}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !539, file: !451, line: 352, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !451, line: 52, size: 192, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !543, file: !451, line: 54, baseType: !542, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !543, file: !451, line: 55, baseType: !13, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !543, file: !451, line: 55, baseType: !13, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !543, file: !451, line: 55, baseType: !13, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !543, file: !451, line: 55, baseType: !13, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !543, file: !451, line: 56, baseType: !551, size: 32, offset: 160)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 32, elements: !425)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !451, line: 22, baseType: !553)
!553 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !539, file: !451, line: 353, baseType: !13, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !539, file: !451, line: 354, baseType: !542, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !539, file: !451, line: 355, baseType: !557, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !450, file: !451, line: 399, baseType: !559, size: 32, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !449}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !450, file: !451, line: 401, baseType: !13, size: 32, offset: 352)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !450, file: !451, line: 404, baseType: !13, size: 32, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !450, file: !451, line: 405, baseType: !448, size: 32, offset: 416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !450, file: !451, line: 407, baseType: !566, size: 32, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !451, line: 324, size: 192, elements: !568)
!568 = !{!569, !571, !572, !573}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !567, file: !451, line: 325, baseType: !570, size: 48)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 48, elements: !500)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !567, file: !451, line: 326, baseType: !570, size: 48, offset: 48)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !567, file: !451, line: 327, baseType: !132, size: 16, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !567, file: !451, line: 330, baseType: !574, size: 64, offset: 128)
!574 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !450, file: !451, line: 408, baseType: !576, size: 32, offset: 480)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !451, line: 60, size: 288, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !577, file: !451, line: 62, baseType: !13, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !577, file: !451, line: 63, baseType: !13, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !577, file: !451, line: 64, baseType: !13, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !577, file: !451, line: 65, baseType: !13, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !577, file: !451, line: 66, baseType: !13, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !577, file: !451, line: 67, baseType: !13, size: 32, offset: 160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !577, file: !451, line: 68, baseType: !13, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !577, file: !451, line: 69, baseType: !13, size: 32, offset: 224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !577, file: !451, line: 70, baseType: !13, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !450, file: !451, line: 409, baseType: !448, size: 32, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !450, file: !451, line: 412, baseType: !590, size: 32, offset: 544)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !13}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !450, file: !451, line: 416, baseType: !595, size: 32, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !451, line: 90, size: 1120, elements: !597)
!597 = !{!598, !599, !600, !604}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !596, file: !451, line: 91, baseType: !595, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !596, file: !451, line: 92, baseType: !13, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !596, file: !451, line: 93, baseType: !601, size: 1024, offset: 64)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1024, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !596, file: !451, line: 94, baseType: !605, size: 32, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !451, line: 79, size: 2112, elements: !607)
!607 = !{!608, !610, !611, !612}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !606, file: !451, line: 80, baseType: !609, size: 1024)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 1024, elements: !602)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !606, file: !451, line: 81, baseType: !609, size: 1024, offset: 1024)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !606, file: !451, line: 83, baseType: !552, size: 32, offset: 2048)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !606, file: !451, line: 86, baseType: !552, size: 32, offset: 2080)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !450, file: !451, line: 417, baseType: !596, size: 1120, offset: 608)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !450, file: !451, line: 420, baseType: !615, size: 96, offset: 1728)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !451, line: 296, size: 96, elements: !616)
!616 = !{!617, !619, !620}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !615, file: !451, line: 298, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !615, file: !451, line: 299, baseType: !13, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !615, file: !451, line: 300, baseType: !455, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !450, file: !451, line: 421, baseType: !455, size: 32, offset: 1824)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !450, file: !451, line: 422, baseType: !623, size: 32, offset: 1856)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !451, line: 359, size: 640, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !632, !633, !634, !635, !636, !637}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !624, file: !451, line: 362, baseType: !448, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !624, file: !451, line: 363, baseType: !515, size: 64, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !624, file: !451, line: 364, baseType: !515, size: 64, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !624, file: !451, line: 365, baseType: !515, size: 64, offset: 160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !624, file: !451, line: 366, baseType: !631, size: 64, offset: 224)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 64, elements: !181)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !624, file: !451, line: 367, baseType: !13, size: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !624, file: !451, line: 368, baseType: !515, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !624, file: !451, line: 369, baseType: !515, size: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !624, file: !451, line: 370, baseType: !515, size: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !624, file: !451, line: 371, baseType: !515, size: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !624, file: !451, line: 372, baseType: !515, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !450, file: !451, line: 423, baseType: !448, size: 32, offset: 1888)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !524, line: 46, baseType: !7)
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !642, globals: !643, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!642 = !{!448, !446}
!643 = !{!440}
!644 = !{!645, !646, !647, !648}
!645 = !DILocalVariable(name: "r", arg: 1, scope: !442, file: !443, line: 63, type: !449)
!646 = !DILocalVariable(name: "nbytes", arg: 2, scope: !442, file: !443, line: 63, type: !639)
!647 = !DILocalVariable(name: "prev_heap_end", scope: !442, file: !443, line: 67, type: !448)
!648 = !DILocalVariable(name: "stack", scope: !442, file: !443, line: 68, type: !448)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !651, file: !656, line: 4, type: !662, isLocal: false, isDefinition: true)
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !653, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!653 = !{!649, !654, !660}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !651, file: !656, line: 5, type: !657, isLocal: false, isDefinition: true)
!656 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 88, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 11)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !651, file: !656, line: 6, type: !657, isLocal: false, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 248, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 31)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !667, retainedTypes: !673, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!667 = !{!668}
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !669, line: 1209, baseType: !7, size: 32, elements: !670)
!669 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!670 = !{!671, !672}
!671 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!672 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!673 = !{!58, !60}
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !676, retainedTypes: !754, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!676 = !{!677}
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !678, line: 150, baseType: !7, size: 32, elements: !679)
!678 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!680 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!681 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!682 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!683 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!684 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!685 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!686 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!687 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!688 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!689 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!690 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!691 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!692 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!693 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!694 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!695 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!696 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!697 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!698 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!699 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!700 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!701 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!702 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!703 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!704 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!705 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!706 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!707 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!708 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!709 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!710 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!711 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!712 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!713 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!714 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!715 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!716 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!717 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!718 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!719 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!720 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!721 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!722 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!723 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!724 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!725 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!726 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!727 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!728 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!729 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!730 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!731 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!732 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!733 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!734 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!735 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!736 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!737 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!738 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!739 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!740 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!741 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!742 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!743 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!744 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!745 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!746 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!747 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!748 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!749 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!750 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!751 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!752 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!753 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!754 = !{!58, !80}
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !757, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!757 = !{!758, !783}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !176, line: 418, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 395, size: 1120, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !760, file: !176, line: 397, baseType: !213, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !760, file: !176, line: 398, baseType: !91, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !760, file: !176, line: 399, baseType: !91, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !760, file: !176, line: 400, baseType: !91, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !760, file: !176, line: 401, baseType: !91, size: 32, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !760, file: !176, line: 402, baseType: !91, size: 32, offset: 160)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !760, file: !176, line: 403, baseType: !220, size: 96, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !760, file: !176, line: 404, baseType: !91, size: 32, offset: 288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !760, file: !176, line: 405, baseType: !91, size: 32, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !760, file: !176, line: 406, baseType: !91, size: 32, offset: 352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !760, file: !176, line: 407, baseType: !91, size: 32, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !760, file: !176, line: 408, baseType: !91, size: 32, offset: 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !760, file: !176, line: 409, baseType: !91, size: 32, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !760, file: !176, line: 410, baseType: !91, size: 32, offset: 480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !760, file: !176, line: 411, baseType: !231, size: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !760, file: !176, line: 412, baseType: !213, size: 32, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !760, file: !176, line: 413, baseType: !213, size: 32, offset: 608)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !760, file: !176, line: 414, baseType: !237, size: 128, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !760, file: !176, line: 415, baseType: !241, size: 160, offset: 768)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !760, file: !176, line: 416, baseType: !245, size: 160, offset: 928)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !760, file: !176, line: 417, baseType: !91, size: 32, offset: 1088)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !176, line: 378, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 363, size: 28704, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !785, file: !176, line: 365, baseType: !180, size: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !785, file: !176, line: 366, baseType: !184, size: 768, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !785, file: !176, line: 367, baseType: !180, size: 256, offset: 1024)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !785, file: !176, line: 368, baseType: !184, size: 768, offset: 1280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !785, file: !176, line: 369, baseType: !180, size: 256, offset: 2048)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !785, file: !176, line: 370, baseType: !184, size: 768, offset: 2304)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !785, file: !176, line: 371, baseType: !180, size: 256, offset: 3072)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !785, file: !176, line: 372, baseType: !184, size: 768, offset: 3328)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !785, file: !176, line: 373, baseType: !180, size: 256, offset: 4096)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !785, file: !176, line: 374, baseType: !195, size: 1792, offset: 4352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !785, file: !176, line: 375, baseType: !199, size: 1920, offset: 6144)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !785, file: !176, line: 376, baseType: !204, size: 20608, offset: 8064)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !785, file: !176, line: 377, baseType: !91, size: 32, offset: 28672)
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !802, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!802 = !{!803, !677}
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !804, line: 55, baseType: !7, size: 32, elements: !805)
!804 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!806 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!807 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!808 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!809 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!810 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!811 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!812 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!813 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!814 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!815 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!816 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!817 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!818 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!819 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!820 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!821 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!822 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!823 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!824 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!825 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!826 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!827 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!828 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!829 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!830 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!831 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!832 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!833 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !836, splitDebugInlining: false, nameTableKind: None)
!835 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/timer.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!836 = !{!490, !58}
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!838 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !841, retainedTypes: !905, splitDebugInlining: false, nameTableKind: None)
!840 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!841 = !{!842, !849, !803, !880, !886, !890, !894, !900}
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !843, line: 233, baseType: !13, size: 32, elements: !844)
!843 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!844 = !{!845, !846, !847, !848}
!845 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!846 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!847 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!848 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!849 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !273, line: 249, baseType: !7, size: 32, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!851 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!852 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!853 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!854 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!855 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!856 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!857 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!858 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!859 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!860 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!861 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!862 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!863 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!864 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!865 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!866 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!867 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!868 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!869 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!870 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!871 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!872 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!873 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!874 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!875 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!876 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!877 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!878 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!879 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !843, line: 224, baseType: !13, size: 32, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!883 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!884 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!885 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !843, line: 217, baseType: !7, size: 32, elements: !887)
!887 = !{!888, !889}
!888 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!889 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!890 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !843, line: 210, baseType: !7, size: 32, elements: !891)
!891 = !{!892, !893}
!892 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!893 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !843, line: 242, baseType: !7, size: 32, elements: !895)
!895 = !{!896, !897, !898, !899}
!896 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!897 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!898 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!899 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !901, line: 57, baseType: !7, size: 32, elements: !902)
!901 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!902 = !{!903, !904}
!903 = !DIEnumerator(name: "eDirection_IN", value: 0)
!904 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!905 = !{!906, !149, !907, !150, !908, !909}
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !804, line: 87, baseType: !803)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !843, line: 220, baseType: !886)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !843, line: 247, baseType: !894)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !901, line: 60, baseType: !900)
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !912, retainedTypes: !918, splitDebugInlining: false, nameTableKind: None)
!911 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_md5.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!912 = !{!913}
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !914, line: 139, baseType: !13, size: 32, elements: !915)
!914 = !DIFile(filename: "../../../../../driver/chip/inc/hal_md5.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!915 = !{!916, !917}
!916 = !DIEnumerator(name: "HAL_MD5_STATUS_ERROR", value: -1)
!917 = !DIEnumerator(name: "HAL_MD5_STATUS_OK", value: 0)
!918 = !{!149, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "MD5_CTX_STRUC", file: !921, line: 64, baseType: !922)
!921 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/crypt_md5.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !921, line: 58, size: 768, elements: !923)
!923 = !{!924, !926, !929, !930, !934}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "HashValue", scope: !922, file: !921, line: 59, baseType: !925, size: 128)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 128, elements: !238)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "MessageLen", scope: !922, file: !921, line: 60, baseType: !927, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !93, line: 60, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !95, line: 105, baseType: !574)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !922, file: !921, line: 61, baseType: !363, size: 32, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Buff", scope: !922, file: !921, line: 62, baseType: !931, size: 512, offset: 224)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "BlockLen", scope: !922, file: !921, line: 63, baseType: !92, size: 32, offset: 736)
!935 = distinct !DICompileUnit(language: DW_LANG_C99, file: !936, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !937, retainedTypes: !938, splitDebugInlining: false, nameTableKind: None)
!936 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/md5_get_hash/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/md5_get_hash/GCC")
!937 = !{!272, !278, !294, !300, !304, !849}
!938 = !{!363, !92, !448}
!939 = !{!"Ubuntu clang version 14.0.6"}
!940 = !{i32 7, !"Dwarf Version", i32 2}
!941 = !{i32 2, !"Debug Info Version", i32 3}
!942 = !{i32 1, !"wchar_size", i32 4}
!943 = !{i32 1, !"min_enum_size", i32 4}
!944 = !{i32 1, !"branch-target-enforcement", i32 0}
!945 = !{i32 1, !"sign-return-address", i32 0}
!946 = !{i32 1, !"sign-return-address-all", i32 0}
!947 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!948 = !{i32 7, !"frame-pointer", i32 2}
!949 = distinct !DISubprogram(name: "GPT_ResetTimer", scope: !3, file: !3, line: 73, type: !950, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !952)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !60, !60, !156}
!952 = !{!953, !954, !955}
!953 = !DILocalVariable(name: "timerNum", arg: 1, scope: !949, file: !3, line: 73, type: !60)
!954 = !DILocalVariable(name: "countValue", arg: 2, scope: !949, file: !3, line: 73, type: !60)
!955 = !DILocalVariable(name: "autoRepeat", arg: 3, scope: !949, file: !3, line: 73, type: !156)
!956 = !DILocation(line: 0, scope: !949)
!957 = !DILocation(line: 75, column: 5, scope: !958)
!958 = distinct !DILexicalBlock(scope: !949, file: !3, line: 75, column: 5)
!959 = !DILocation(line: 75, column: 5, scope: !949)
!960 = !DILocation(line: 75, column: 5, scope: !961)
!961 = distinct !DILexicalBlock(scope: !958, file: !3, line: 75, column: 5)
!962 = distinct !{!962, !960, !960}
!963 = !DILocation(line: 77, column: 9, scope: !949)
!964 = !DILocation(line: 78, column: 30, scope: !965)
!965 = distinct !DILexicalBlock(scope: !966, file: !3, line: 77, column: 24)
!966 = distinct !DILexicalBlock(scope: !949, file: !3, line: 77, column: 9)
!967 = !DILocation(line: 0, scope: !968)
!968 = distinct !DILexicalBlock(scope: !965, file: !3, line: 79, column: 13)
!969 = !DILocation(line: 79, column: 13, scope: !965)
!970 = !DILocation(line: 80, column: 34, scope: !971)
!971 = distinct !DILexicalBlock(scope: !968, file: !3, line: 79, column: 37)
!972 = !DILocation(line: 81, column: 9, scope: !971)
!973 = !DILocation(line: 82, column: 34, scope: !974)
!974 = distinct !DILexicalBlock(scope: !968, file: !3, line: 81, column: 16)
!975 = !DILocation(line: 85, column: 30, scope: !976)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 84, column: 31)
!977 = distinct !DILexicalBlock(scope: !966, file: !3, line: 84, column: 16)
!978 = !DILocation(line: 0, scope: !979)
!979 = distinct !DILexicalBlock(scope: !976, file: !3, line: 86, column: 13)
!980 = !DILocation(line: 86, column: 13, scope: !976)
!981 = !DILocation(line: 87, column: 34, scope: !982)
!982 = distinct !DILexicalBlock(scope: !979, file: !3, line: 86, column: 37)
!983 = !DILocation(line: 88, column: 9, scope: !982)
!984 = !DILocation(line: 89, column: 34, scope: !985)
!985 = distinct !DILexicalBlock(scope: !979, file: !3, line: 88, column: 16)
!986 = !DILocation(line: 92, column: 1, scope: !949)
!987 = distinct !DISubprogram(name: "GPT_Start", scope: !3, file: !3, line: 94, type: !988, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !990)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !60}
!990 = !{!991}
!991 = !DILocalVariable(name: "timerNum", arg: 1, scope: !987, file: !3, line: 94, type: !60)
!992 = !DILocation(line: 0, scope: !987)
!993 = !DILocation(line: 96, column: 5, scope: !987)
!994 = !DILocation(line: 96, column: 5, scope: !995)
!995 = distinct !DILexicalBlock(scope: !996, file: !3, line: 96, column: 5)
!996 = distinct !DILexicalBlock(scope: !987, file: !3, line: 96, column: 5)
!997 = distinct !{!997, !994, !994}
!998 = !DILocation(line: 99, column: 30, scope: !999)
!999 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 98, column: 24)
!1000 = distinct !DILexicalBlock(scope: !987, file: !3, line: 98, column: 9)
!1001 = !DILocation(line: 100, column: 9, scope: !999)
!1002 = !DILocation(line: 101, column: 5, scope: !999)
!1003 = !DILocation(line: 102, column: 30, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 101, column: 31)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 101, column: 16)
!1006 = !DILocation(line: 103, column: 9, scope: !1004)
!1007 = !DILocation(line: 104, column: 5, scope: !1004)
!1008 = !DILocation(line: 105, column: 30, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 104, column: 31)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 104, column: 16)
!1011 = !DILocation(line: 106, column: 5, scope: !1009)
!1012 = !DILocation(line: 108, column: 1, scope: !987)
!1013 = distinct !DISubprogram(name: "GPT_Stop", scope: !3, file: !3, line: 110, type: !988, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1014)
!1014 = !{!1015}
!1015 = !DILocalVariable(name: "timerNum", arg: 1, scope: !1013, file: !3, line: 110, type: !60)
!1016 = !DILocation(line: 0, scope: !1013)
!1017 = !DILocation(line: 112, column: 9, scope: !1013)
!1018 = !DILocation(line: 113, column: 30, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 112, column: 24)
!1020 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 112, column: 9)
!1021 = !DILocation(line: 114, column: 30, scope: !1019)
!1022 = !DILocation(line: 115, column: 31, scope: !1019)
!1023 = !DILocation(line: 117, column: 5, scope: !1019)
!1024 = !DILocation(line: 118, column: 30, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 117, column: 31)
!1026 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 117, column: 16)
!1027 = !DILocation(line: 119, column: 30, scope: !1025)
!1028 = !DILocation(line: 120, column: 31, scope: !1025)
!1029 = !DILocation(line: 121, column: 5, scope: !1025)
!1030 = !DILocation(line: 122, column: 30, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 121, column: 31)
!1032 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 121, column: 16)
!1033 = !DILocation(line: 123, column: 5, scope: !1031)
!1034 = !DILocation(line: 124, column: 30, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 123, column: 31)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 123, column: 16)
!1037 = !DILocation(line: 125, column: 5, scope: !1035)
!1038 = !DILocation(line: 128, column: 1, scope: !1013)
!1039 = distinct !DISubprogram(name: "GPT_INT_Handler", scope: !3, file: !3, line: 130, type: !254, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1040)
!1040 = !{!1041, !1042}
!1041 = !DILocalVariable(name: "irq_number", arg: 1, scope: !1039, file: !3, line: 130, type: !171)
!1042 = !DILocalVariable(name: "GPT_Status", scope: !1039, file: !3, line: 132, type: !131)
!1043 = !DILocation(line: 0, scope: !1039)
!1044 = !DILocation(line: 135, column: 18, scope: !1039)
!1045 = !DILocation(line: 136, column: 26, scope: !1039)
!1046 = !DILocation(line: 136, column: 24, scope: !1039)
!1047 = !DILocation(line: 138, column: 20, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 138, column: 9)
!1049 = !DILocation(line: 138, column: 9, scope: !1039)
!1050 = !DILocation(line: 141, column: 27, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 141, column: 16)
!1052 = !DILocation(line: 141, column: 16, scope: !1048)
!1053 = !DILocation(line: 0, scope: !1048)
!1054 = !DILocation(line: 145, column: 1, scope: !1039)
!1055 = distinct !DISubprogram(name: "GPT_init", scope: !3, file: !3, line: 147, type: !1056, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1058)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{null, !60, !60, !74}
!1058 = !{!1059, !1060, !1061}
!1059 = !DILocalVariable(name: "timerNum", arg: 1, scope: !1055, file: !3, line: 147, type: !60)
!1060 = !DILocalVariable(name: "speed_32us", arg: 2, scope: !1055, file: !3, line: 147, type: !60)
!1061 = !DILocalVariable(name: "GPT_Callback", arg: 3, scope: !1055, file: !3, line: 147, type: !74)
!1062 = !DILocation(line: 0, scope: !1055)
!1063 = !DILocation(line: 149, column: 5, scope: !1055)
!1064 = !DILocation(line: 149, column: 5, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 149, column: 5)
!1066 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 149, column: 5)
!1067 = distinct !{!1067, !1064, !1064}
!1068 = !DILocation(line: 149, column: 5, scope: !1066)
!1069 = !DILocation(line: 151, column: 23, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 151, column: 9)
!1071 = !DILocation(line: 152, column: 9, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 151, column: 41)
!1073 = !DILocation(line: 153, column: 9, scope: !1072)
!1074 = !DILocation(line: 154, column: 9, scope: !1072)
!1075 = !DILocation(line: 155, column: 5, scope: !1072)
!1076 = !DILocation(line: 157, column: 9, scope: !1055)
!1077 = !DILocation(line: 158, column: 37, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 157, column: 24)
!1079 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 157, column: 9)
!1080 = !DILocation(line: 159, column: 30, scope: !1078)
!1081 = !DILocation(line: 160, column: 45, scope: !1078)
!1082 = !DILocation(line: 160, column: 30, scope: !1078)
!1083 = !DILocation(line: 161, column: 5, scope: !1078)
!1084 = !DILocation(line: 162, column: 37, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 161, column: 31)
!1086 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 161, column: 16)
!1087 = !DILocation(line: 163, column: 30, scope: !1085)
!1088 = !DILocation(line: 164, column: 45, scope: !1085)
!1089 = !DILocation(line: 164, column: 30, scope: !1085)
!1090 = !DILocation(line: 165, column: 5, scope: !1085)
!1091 = !DILocation(line: 166, column: 59, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 165, column: 31)
!1093 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 165, column: 16)
!1094 = !DILocation(line: 166, column: 45, scope: !1092)
!1095 = !DILocation(line: 166, column: 30, scope: !1092)
!1096 = !DILocation(line: 167, column: 5, scope: !1092)
