; ModuleID = 'build/arduino_nano_33_ble/drivers/ipm/ipm_mcux/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "gcounter", scope: !27, file: !170, line: 12, type: !103, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !169, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !{!110, !143, !154, !159, !164}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 99, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!103, !115, !103, !142, !13, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !124, !125, !126, !135, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 380, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 386, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !128, file: !118, line: 359, baseType: !131, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !128, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !117, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !118, line: 43, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !141)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !107, file: !108, line: 100, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !115, !148, !104}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !115, !104, !142, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !107, file: !108, line: 101, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!103, !115}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !107, file: !108, line: 102, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!142, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !107, file: !108, line: 103, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !115, !103}
!169 = !{!25}
!170 = !DIFile(filename: "zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "_char_out", scope: !173, file: !177, line: 54, type: !178, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!175 = !{!104, !103}
!176 = !{!171}
!177 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!103, !103}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !183, file: !224, line: 27, type: !251, isLocal: true, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !197, globals: !221, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!185 = !{!186, !30}
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !187, line: 27, baseType: !32, size: 32, elements: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196}
!189 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!190 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!191 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!192 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!193 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!194 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!195 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!196 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!197 = !{!104, !198, !103, !24, !202, !218, !142, !219}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !199, line: 46, baseType: !200)
!199 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !201)
!201 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !204, line: 54, size: 96, elements: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !{!206, !213, !217}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !203, file: !204, line: 55, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !208, line: 33, baseType: !209)
!208 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !208, line: 29, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !208, line: 30, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !203, file: !204, line: 60, baseType: !214, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !186}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !203, file: !204, line: 65, baseType: !214, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !220)
!220 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!221 = !{!181, !222, !228, !230, !241, !243}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !183, file: !224, line: 44, type: !225, isLocal: true, isDefinition: true)
!224 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !226, line: 43, elements: !227)
!226 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !{}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !183, file: !224, line: 49, type: !225, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !183, file: !224, line: 36, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 128, elements: !239)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !187, line: 114, size: 128, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !233, file: !187, line: 115, baseType: !186, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !233, file: !187, line: 141, baseType: !131, size: 8, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !233, file: !187, line: 149, baseType: !142, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !233, file: !187, line: 156, baseType: !142, size: 32, offset: 96)
!239 = !{!240}
!240 = !DISubrange(count: 1)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !183, file: !224, line: 40, type: !232, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !183, file: !224, line: 28, type: !245, isLocal: true, isDefinition: true)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !208, line: 40, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !208, line: 35, size: 64, elements: !247)
!247 = !{!248, !250}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !246, file: !208, line: 36, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !246, file: !208, line: 37, baseType: !249, size: 32, offset: 32)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 32, elements: !239)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !253, line: 22, baseType: !254)
!253 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!255 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!256 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !259, file: !288, line: 50, type: !275, isLocal: true, isDefinition: true)
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !261, globals: !285, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!261 = !{!140, !198, !262, !103, !104, !142, !219, !264, !218, !275, !276}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !263, line: 214, baseType: !32)
!263 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !266, line: 45, size: 64, elements: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = !{!268, !274}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !265, file: !266, line: 46, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !208, line: 33, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !208, line: 29, size: 32, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !208, line: 30, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !265, file: !266, line: 48, baseType: !142, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !266, line: 38, size: 64, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !277, file: !266, line: 39, baseType: !269, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !277, file: !266, line: 41, baseType: !281, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !266, line: 35, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !275}
!285 = !{!286, !290, !298, !257, !300, !310}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "latency_lock", scope: !259, file: !288, line: 44, type: !289, isLocal: true, isDefinition: true)
!288 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !226, line: 43, elements: !227)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !259, file: !288, line: 46, type: !292, isLocal: true, isDefinition: true)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !208, line: 40, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !208, line: 35, size: 64, elements: !294)
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !293, file: !208, line: 36, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !293, file: !208, line: 37, baseType: !296, size: 32, offset: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "latency_subs", scope: !259, file: !288, line: 52, type: !292, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !259, file: !288, line: 39, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, elements: !308)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !288, line: 35, size: 96, elements: !304)
!304 = !{!305, !306, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !303, file: !288, line: 36, baseType: !186, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !303, file: !288, line: 37, baseType: !131, size: 8, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !303, file: !288, line: 38, baseType: !252, size: 32, offset: 64)
!308 = !{!309}
!309 = !DISubrange(count: 0)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !259, file: !288, line: 48, type: !275, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !314, file: !321, line: 47, type: !335, isLocal: true, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !316, retainedTypes: !317, globals: !318, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!316 = !{!186}
!317 = !{!262, !103}
!318 = !{!319, !312, !331}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "cpus_states", scope: !314, file: !321, line: 50, type: !322, isLocal: true, isDefinition: true)
!321 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 32, elements: !239)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !187, line: 114, size: 128, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !325, file: !187, line: 115, baseType: !186, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !325, file: !187, line: 141, baseType: !131, size: 8, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !325, file: !187, line: 149, baseType: !142, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !325, file: !187, line: 156, baseType: !142, size: 32, offset: 96)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !314, file: !321, line: 55, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 8, elements: !239)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, elements: !308)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "static_regions", scope: !338, file: !345, line: 62, type: !480, isLocal: true, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !340, globals: !341, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!340 = !{!262, !103, !142, !104}
!341 = !{!342, !336}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !344, file: !345, line: 198, type: !468, isLocal: true, isDefinition: true)
!344 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !345, file: !345, line: 175, type: !346, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !338, retainedNodes: !463)
!345 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !350, line: 245, size: 1024, elements: !351)
!350 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!351 = !{!352, !419, !432, !433, !434, !435, !441, !458}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !349, file: !350, line: 247, baseType: !353, size: 384)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !350, line: 57, size: 384, elements: !354)
!354 = !{!355, !383, !391, !392, !393, !406, !407, !408}
!355 = !DIDerivedType(tag: DW_TAG_member, scope: !353, file: !350, line: 60, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !353, file: !350, line: 60, size: 64, elements: !357)
!357 = !{!358, !374}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !356, file: !350, line: 61, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !360, line: 49, baseType: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !360, line: 37, size: 64, elements: !362)
!362 = !{!363, !369}
!363 = !DIDerivedType(tag: DW_TAG_member, scope: !361, file: !360, line: 38, baseType: !364, size: 32)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !361, file: !360, line: 38, size: 32, elements: !365)
!365 = !{!366, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !364, file: !360, line: 39, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !360, line: 40, baseType: !367, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, scope: !361, file: !360, line: 42, baseType: !370, size: 32, offset: 32)
!370 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !361, file: !360, line: 42, size: 32, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !370, file: !360, line: 43, baseType: !367, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !370, file: !360, line: 44, baseType: !367, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !356, file: !350, line: 62, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !376, line: 49, size: 64, elements: !377)
!376 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !375, file: !376, line: 50, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 64, elements: !381)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!381 = !{!382}
!382 = !DISubrange(count: 2)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !353, file: !350, line: 68, baseType: !384, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !386, line: 233, baseType: !387)
!386 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 231, size: 64, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !387, file: !386, line: 232, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !360, line: 48, baseType: !361)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !353, file: !350, line: 71, baseType: !131, size: 8, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !353, file: !350, line: 74, baseType: !131, size: 8, offset: 104)
!393 = !DIDerivedType(tag: DW_TAG_member, scope: !353, file: !350, line: 90, baseType: !394, size: 16, offset: 112)
!394 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !353, file: !350, line: 90, size: 16, elements: !395)
!395 = !{!396, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, scope: !394, file: !350, line: 91, baseType: !397, size: 16)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !350, line: 91, size: 16, elements: !398)
!398 = !{!399, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !397, file: !350, line: 96, baseType: !400, size: 8)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !401)
!401 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !397, file: !350, line: 97, baseType: !131, size: 8, offset: 8)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !394, file: !350, line: 100, baseType: !404, size: 16)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !405)
!405 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !353, file: !350, line: 107, baseType: !142, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !353, file: !350, line: 127, baseType: !104, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !353, file: !350, line: 131, baseType: !409, size: 192, offset: 192)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !386, line: 244, size: 192, elements: !410)
!410 = !{!411, !412, !418}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !409, file: !386, line: 245, baseType: !359, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !409, file: !386, line: 246, baseType: !413, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !386, line: 242, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !409, file: !386, line: 249, baseType: !200, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !349, file: !350, line: 250, baseType: !420, size: 288, offset: 384)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !421, line: 25, size: 288, elements: !422)
!421 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !420, file: !421, line: 26, baseType: !142, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !420, file: !421, line: 27, baseType: !142, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !420, file: !421, line: 28, baseType: !142, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !420, file: !421, line: 29, baseType: !142, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !420, file: !421, line: 30, baseType: !142, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !420, file: !421, line: 31, baseType: !142, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !420, file: !421, line: 32, baseType: !142, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !420, file: !421, line: 33, baseType: !142, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !420, file: !421, line: 34, baseType: !142, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !349, file: !350, line: 253, baseType: !104, size: 32, offset: 672)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !349, file: !350, line: 256, baseType: !385, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !349, file: !350, line: 294, baseType: !103, size: 32, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !349, file: !350, line: 300, baseType: !436, size: 96, offset: 800)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !350, line: 149, size: 96, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !436, file: !350, line: 153, baseType: !22, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !436, file: !350, line: 162, baseType: !262, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !436, file: !350, line: 168, baseType: !262, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !349, file: !350, line: 325, baseType: !442, size: 32, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !444, line: 5073, size: 160, elements: !445)
!444 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!445 = !{!446, !455, !456}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !443, file: !444, line: 5074, baseType: !447, size: 96)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !448, line: 56, size: 96, elements: !449)
!448 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !{!450, !453, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !447, file: !448, line: 57, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !448, line: 57, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !447, file: !448, line: 58, baseType: !104, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !447, file: !448, line: 59, baseType: !262, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !443, file: !444, line: 5075, baseType: !385, size: 64, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !443, file: !444, line: 5076, baseType: !457, offset: 160)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !226, line: 43, elements: !227)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !349, file: !350, line: 343, baseType: !459, size: 64, offset: 928)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !421, line: 60, size: 64, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !459, file: !421, line: 63, baseType: !142, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !459, file: !421, line: 66, baseType: !142, size: 32, offset: 32)
!463 = !{!464, !465, !466, !467}
!464 = !DILocalVariable(name: "thread", arg: 1, scope: !344, file: !345, line: 175, type: !348)
!465 = !DILocalVariable(name: "region_num", scope: !344, file: !345, line: 200, type: !131)
!466 = !DILocalVariable(name: "guard_start", scope: !344, file: !345, line: 265, type: !22)
!467 = !DILocalVariable(name: "guard_size", scope: !344, file: !345, line: 266, type: !262)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 96, elements: !239)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !470, line: 52, size: 96, elements: !471)
!470 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !469, file: !470, line: 53, baseType: !22, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !469, file: !470, line: 54, baseType: !262, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !469, file: !470, line: 55, baseType: !475, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !476, line: 151, baseType: !477)
!476 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 149, size: 32, elements: !478)
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !477, file: !476, line: 150, baseType: !142, size: 32)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 96, elements: !239)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !484, file: !518, line: 39, type: !131, isLocal: true, isDefinition: true)
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !486, globals: !517, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!486 = !{!487, !104, !103, !505, !131}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !489, line: 1226, baseType: !490)
!489 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 1213, size: 352, elements: !491)
!491 = !{!492, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !490, file: !489, line: 1215, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !490, file: !489, line: 1216, baseType: !494, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !490, file: !489, line: 1217, baseType: !494, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !490, file: !489, line: 1218, baseType: !494, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !490, file: !489, line: 1219, baseType: !494, size: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !490, file: !489, line: 1220, baseType: !494, size: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !490, file: !489, line: 1221, baseType: !494, size: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !490, file: !489, line: 1222, baseType: !494, size: 32, offset: 224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !490, file: !489, line: 1223, baseType: !494, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !490, file: !489, line: 1224, baseType: !494, size: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !490, file: !489, line: 1225, baseType: !494, size: 32, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !508, line: 27, size: 96, elements: !509)
!508 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !507, file: !508, line: 29, baseType: !142, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !507, file: !508, line: 31, baseType: !121, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !507, file: !508, line: 37, baseType: !513, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !476, line: 146, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !476, line: 141, size: 32, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !514, file: !476, line: 143, baseType: !142, size: 32)
!517 = !{!482}
!518 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !521, file: !528, line: 21, type: !178, isLocal: true, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !523, globals: !527, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!523 = !{!524, !103, !104}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !526, line: 22, baseType: !103)
!526 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !{!519}
!528 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !531, file: !536, line: 13, type: !553, isLocal: true, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !533, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!533 = !{!534, !529}
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "mpu_config", scope: !531, file: !536, line: 37, type: !537, isLocal: false, isDefinition: true)
!536 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !508, line: 41, size: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !538, file: !508, line: 43, baseType: !142, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !538, file: !508, line: 45, baseType: !542, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !508, line: 27, size: 96, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !544, file: !508, line: 29, baseType: !142, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !544, file: !508, line: 31, baseType: !121, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !544, file: !508, line: 37, baseType: !549, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !476, line: 146, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !476, line: 141, size: 32, elements: !551)
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !550, file: !476, line: 143, baseType: !142, size: 32)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 192, elements: !381)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !556, file: !726, line: 93, type: !727, isLocal: true, isDefinition: true, align: 32)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !558, globals: !721, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!558 = !{!559, !131, !104, !103, !639, !142, !640, !676, !687}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !561, line: 1071, baseType: !562)
!561 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 1035, size: 19584, elements: !563)
!563 = !{!564, !568, !569, !570, !574, !575, !577, !578, !579, !580, !581, !582, !586, !587, !588, !592, !593, !597, !598, !602, !603, !607, !608, !609, !610, !611, !612, !613, !617, !618, !619, !620, !624, !625, !629}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !562, file: !561, line: 1036, baseType: !565, size: 960)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 960, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 30)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !562, file: !561, line: 1037, baseType: !494, size: 32, offset: 960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !562, file: !561, line: 1038, baseType: !494, size: 32, offset: 992)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !562, file: !561, line: 1039, baseType: !571, size: 1088, offset: 1024)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 1088, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 34)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !562, file: !561, line: 1040, baseType: !494, size: 32, offset: 2112)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !562, file: !561, line: 1041, baseType: !576, size: 64, offset: 2144)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 64, elements: !381)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !562, file: !561, line: 1042, baseType: !494, size: 32, offset: 2208)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !562, file: !561, line: 1043, baseType: !494, size: 32, offset: 2240)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !562, file: !561, line: 1044, baseType: !494, size: 32, offset: 2272)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !562, file: !561, line: 1045, baseType: !494, size: 32, offset: 2304)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !562, file: !561, line: 1046, baseType: !494, size: 32, offset: 2336)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !562, file: !561, line: 1047, baseType: !583, size: 3808, offset: 2368)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 3808, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 119)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !562, file: !561, line: 1048, baseType: !494, size: 32, offset: 6176)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !562, file: !561, line: 1049, baseType: !494, size: 32, offset: 6208)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !562, file: !561, line: 1050, baseType: !589, size: 1952, offset: 6240)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 1952, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 61)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !562, file: !561, line: 1051, baseType: !494, size: 32, offset: 8192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !562, file: !561, line: 1052, baseType: !594, size: 288, offset: 8224)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 288, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 9)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !562, file: !561, line: 1053, baseType: !493, size: 32, offset: 8512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !562, file: !561, line: 1054, baseType: !599, size: 96, offset: 8544)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 96, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 3)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !562, file: !561, line: 1055, baseType: !493, size: 32, offset: 8640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !562, file: !561, line: 1056, baseType: !604, size: 1568, offset: 8672)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 1568, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 49)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !562, file: !561, line: 1057, baseType: !494, size: 32, offset: 10240)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !562, file: !561, line: 1058, baseType: !599, size: 96, offset: 10272)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !562, file: !561, line: 1059, baseType: !494, size: 32, offset: 10368)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !562, file: !561, line: 1060, baseType: !576, size: 64, offset: 10400)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !562, file: !561, line: 1061, baseType: !494, size: 32, offset: 10464)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !562, file: !561, line: 1062, baseType: !494, size: 32, offset: 10496)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !562, file: !561, line: 1063, baseType: !614, size: 672, offset: 10528)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 672, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 21)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !562, file: !561, line: 1064, baseType: !494, size: 32, offset: 11200)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !562, file: !561, line: 1065, baseType: !493, size: 32, offset: 11232)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !562, file: !561, line: 1066, baseType: !494, size: 32, offset: 11264)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !562, file: !561, line: 1067, baseType: !621, size: 1504, offset: 11296)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 1504, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 47)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !562, file: !561, line: 1068, baseType: !493, size: 32, offset: 12800)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !562, file: !561, line: 1069, baseType: !626, size: 5600, offset: 12832)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 5600, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 175)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !562, file: !561, line: 1070, baseType: !630, size: 1152, offset: 18432)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 1152, elements: !595)
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !561, line: 278, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 272, size: 128, elements: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !633, file: !561, line: 273, baseType: !494, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !633, file: !561, line: 274, baseType: !494, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !633, file: !561, line: 275, baseType: !494, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !633, file: !561, line: 277, baseType: !493, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !489, line: 468, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 445, size: 1120, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !669, !673, !675}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !642, file: !489, line: 447, baseType: !493, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !642, file: !489, line: 448, baseType: !494, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !642, file: !489, line: 449, baseType: !494, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !642, file: !489, line: 450, baseType: !494, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !642, file: !489, line: 451, baseType: !494, size: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !642, file: !489, line: 452, baseType: !494, size: 32, offset: 160)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !642, file: !489, line: 453, baseType: !651, size: 96, offset: 192)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 96, elements: !653)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!653 = !{!654}
!654 = !DISubrange(count: 12)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !642, file: !489, line: 454, baseType: !494, size: 32, offset: 288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !642, file: !489, line: 455, baseType: !494, size: 32, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !642, file: !489, line: 456, baseType: !494, size: 32, offset: 352)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !642, file: !489, line: 457, baseType: !494, size: 32, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !642, file: !489, line: 458, baseType: !494, size: 32, offset: 416)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !642, file: !489, line: 459, baseType: !494, size: 32, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !642, file: !489, line: 460, baseType: !494, size: 32, offset: 480)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !642, file: !489, line: 461, baseType: !576, size: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !642, file: !489, line: 462, baseType: !493, size: 32, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !642, file: !489, line: 463, baseType: !493, size: 32, offset: 608)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !642, file: !489, line: 464, baseType: !666, size: 128, offset: 640)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 128, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 4)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !642, file: !489, line: 465, baseType: !670, size: 160, offset: 768)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 160, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 5)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !642, file: !489, line: 466, baseType: !674, size: 160, offset: 928)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 160, elements: !671)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !642, file: !489, line: 467, baseType: !494, size: 32, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !678, file: !677, line: 167, baseType: !686)
!677 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!678 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !677, file: !677, line: 134, type: !679, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !556, retainedNodes: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !142}
!681 = !{!682, !683, !685}
!682 = !DILocalVariable(name: "time_us", arg: 1, scope: !678, file: !677, line: 134, type: !142)
!683 = !DILocalVariable(name: "delay_cycles", scope: !678, file: !677, line: 168, type: !684)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!685 = !DILocalVariable(name: "cycles", scope: !678, file: !677, line: 171, type: !142)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !561, line: 2399, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 2373, size: 10880, elements: !690)
!690 = !{!691, !695, !696, !697, !698, !702, !703, !708, !709, !710, !711, !712, !713, !717, !718, !719, !720}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !689, file: !561, line: 2374, baseType: !692, size: 8192)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 8192, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !689, file: !561, line: 2375, baseType: !493, size: 32, offset: 8192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !689, file: !561, line: 2376, baseType: !493, size: 32, offset: 8224)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !689, file: !561, line: 2377, baseType: !493, size: 32, offset: 8256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !689, file: !561, line: 2378, baseType: !699, size: 1984, offset: 8288)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 1984, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 62)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !689, file: !561, line: 2379, baseType: !494, size: 32, offset: 10272)
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !689, file: !561, line: 2381, baseType: !704, size: 32, offset: 10304)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !689, file: !561, line: 2381, size: 32, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !704, file: !561, line: 2382, baseType: !494, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !704, file: !561, line: 2383, baseType: !494, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !689, file: !561, line: 2386, baseType: !494, size: 32, offset: 10336)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !689, file: !561, line: 2387, baseType: !494, size: 32, offset: 10368)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !689, file: !561, line: 2389, baseType: !494, size: 32, offset: 10400)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !689, file: !561, line: 2391, baseType: !494, size: 32, offset: 10432)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !689, file: !561, line: 2393, baseType: !494, size: 32, offset: 10464)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !689, file: !561, line: 2394, baseType: !714, size: 256, offset: 10496)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 256, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 8)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !689, file: !561, line: 2395, baseType: !494, size: 32, offset: 10752)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !689, file: !561, line: 2396, baseType: !493, size: 32, offset: 10784)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !689, file: !561, line: 2397, baseType: !494, size: 32, offset: 10816)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !689, file: !561, line: 2398, baseType: !494, size: 32, offset: 10848)
!721 = !{!554, !722}
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !678, file: !677, line: 161, type: !724, isLocal: true, isDefinition: true, align: 128)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 48, elements: !600)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!726 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !729, line: 51, size: 64, elements: !730)
!729 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!730 = !{!731, !738}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !728, file: !729, line: 60, baseType: !732, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DISubroutineType(types: !734)
!734 = !{!103, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !729, line: 48, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !728, file: !729, line: 65, baseType: !735, size: 32, offset: 32)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !741, file: !840, line: 36, type: !855, isLocal: true, isDefinition: true, align: 32)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !743, retainedTypes: !755, globals: !836, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!743 = !{!744, !750}
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !745, line: 506, baseType: !32, size: 32, elements: !746)
!745 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!746 = !{!747, !748, !749}
!747 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!748 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!749 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !745, line: 512, baseType: !32, size: 32, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!753 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!754 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!755 = !{!756, !825, !830, !791, !750, !744, !835, !104}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !745, line: 523, size: 288, elements: !759)
!759 = !{!760, !781, !787, !792, !796, !797, !798, !802, !821}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !758, file: !745, line: 524, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!103, !764, !779, !780}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !767)
!767 = !{!768, !769, !770, !771, !777, !778}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !766, file: !118, line: 380, baseType: !121, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !766, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !766, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !766, file: !118, line: 386, baseType: !772, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !773, file: !118, line: 359, baseType: !131, size: 8)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !773, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !766, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !766, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !745, line: 237, baseType: !131)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !745, line: 257, baseType: !142)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !758, file: !745, line: 530, baseType: !782, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{!103, !764, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !745, line: 229, baseType: !142)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !758, file: !745, line: 532, baseType: !788, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DISubroutineType(types: !790)
!790 = !{!103, !764, !791, !786}
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !745, line: 216, baseType: !142)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !758, file: !745, line: 535, baseType: !793, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DISubroutineType(types: !795)
!795 = !{!103, !764, !791}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !758, file: !745, line: 537, baseType: !793, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !758, file: !745, line: 539, baseType: !793, size: 32, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !758, file: !745, line: 541, baseType: !799, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{!103, !764, !779, !744, !750}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !758, file: !745, line: 544, baseType: !803, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{!103, !764, !806, !134}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !745, line: 478, size: 96, elements: !808)
!808 = !{!809, !815, !820}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !807, file: !745, line: 482, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !208, line: 33, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !208, line: 29, size: 32, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !811, file: !208, line: 30, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !807, file: !745, line: 485, baseType: !816, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !745, line: 464, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !764, !806, !791}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !807, file: !745, line: 493, baseType: !791, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !758, file: !745, line: 547, baseType: !822, size: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = !DISubroutineType(types: !824)
!824 = !{!142, !764}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !745, line: 428, size: 32, elements: !828)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !827, file: !745, line: 434, baseType: !791, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !745, line: 441, size: 32, elements: !833)
!833 = !{!834}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !832, file: !745, line: 447, baseType: !791, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!836 = !{!739, !837, !853}
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "pull_up", scope: !839, file: !840, line: 15, type: !846, isLocal: true, isDefinition: true)
!839 = distinct !DISubprogram(name: "board_init", scope: !840, file: !840, line: 10, type: !841, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !741, retainedNodes: !843)
!840 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !DISubroutineType(types: !842)
!842 = !{!103, !764}
!843 = !{!844, !845}
!844 = !DILocalVariable(name: "dev", arg: 1, scope: !839, file: !840, line: 10, type: !764)
!845 = !DILocalVariable(name: "res", scope: !839, file: !840, line: 14, type: !103)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !745, line: 271, size: 64, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !847, file: !745, line: 273, baseType: !764, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !847, file: !745, line: 275, baseType: !779, size: 8, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !847, file: !745, line: 277, baseType: !852, size: 16, offset: 48)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !745, line: 249, baseType: !404)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "user_led", scope: !839, file: !840, line: 17, type: !846, isLocal: true, isDefinition: true)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !729, line: 51, size: 64, elements: !857)
!857 = !{!858, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !856, file: !729, line: 60, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !856, file: !729, line: 65, baseType: !764, size: 32, offset: 32)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !863, file: !1098, line: 733, type: !1199, isLocal: false, isDefinition: true, align: 32)
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !865, retainedTypes: !1008, globals: !1094, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/ipm/ipm_mcux")
!865 = !{!866, !872, !30, !877, !882, !889, !897, !905, !914, !918, !973, !980, !999}
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !867, line: 23, baseType: !32, size: 32, elements: !868)
!867 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!868 = !{!869, !870, !871}
!869 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!870 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!871 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !867, line: 48, baseType: !32, size: 32, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!875 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!876 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 167, baseType: !32, size: 32, elements: !879)
!878 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!879 = !{!880, !881}
!880 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!881 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 107, baseType: !32, size: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888}
!884 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!885 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!886 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!887 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!888 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 208, baseType: !32, size: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!892 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!893 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!894 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!895 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!896 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 261, baseType: !32, size: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!900 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!901 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!902 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!903 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!904 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 237, baseType: !32, size: 32, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913}
!907 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!908 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!909 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!910 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!911 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!912 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!913 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 152, baseType: !32, size: 32, elements: !915)
!915 = !{!916, !917}
!916 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!917 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !561, line: 71, baseType: !103, size: 32, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972}
!920 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!921 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!922 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!923 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!924 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!925 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!926 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!927 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!928 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!929 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!930 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!931 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!932 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!933 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!934 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!935 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!936 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!937 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!938 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!939 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!940 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!941 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!942 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!943 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!944 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!945 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!946 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!947 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!948 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!949 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!950 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!951 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!952 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!953 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!954 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!955 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!956 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!957 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!958 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!959 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!960 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!961 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!962 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!963 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!964 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!965 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!966 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!967 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!968 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!969 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!970 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!971 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!972 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !974, line: 44, baseType: !32, size: 32, elements: !975)
!974 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!975 = !{!976, !977, !978, !979}
!976 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!977 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!978 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!979 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !981, line: 54, baseType: !32, size: 32, elements: !982)
!981 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!983 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!984 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!985 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!986 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!987 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!988 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!989 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!990 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!991 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!992 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!993 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!994 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!995 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!996 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!997 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!998 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!999 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1000, line: 53, baseType: !32, size: 32, elements: !1001)
!1000 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007}
!1002 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!1003 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!1004 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!1005 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!1006 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!1007 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!1008 = !{!866, !104, !103, !1009, !1058, !1059, !1060, !1061, !198, !142, !219, !134, !639, !1062, !275, !1063, !1093, !262}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !561, line: 1022, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 979, size: 11712, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1036, !1037, !1038, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !1011, file: !561, line: 980, baseType: !494, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !1011, file: !561, line: 981, baseType: !494, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !1011, file: !561, line: 982, baseType: !494, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !1011, file: !561, line: 983, baseType: !494, size: 32, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !1011, file: !561, line: 984, baseType: !494, size: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !1011, file: !561, line: 985, baseType: !494, size: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !1011, file: !561, line: 986, baseType: !494, size: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1011, file: !561, line: 987, baseType: !1021, size: 1824, offset: 224)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 1824, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 57)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !1011, file: !561, line: 988, baseType: !494, size: 32, offset: 2048)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !1011, file: !561, line: 989, baseType: !494, size: 32, offset: 2080)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1011, file: !561, line: 990, baseType: !493, size: 32, offset: 2112)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !1011, file: !561, line: 991, baseType: !494, size: 32, offset: 2144)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !1011, file: !561, line: 992, baseType: !494, size: 32, offset: 2176)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1011, file: !561, line: 993, baseType: !670, size: 160, offset: 2208)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !1011, file: !561, line: 994, baseType: !494, size: 32, offset: 2368)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !1011, file: !561, line: 996, baseType: !494, size: 32, offset: 2400)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1011, file: !561, line: 998, baseType: !1033, size: 3744, offset: 2432)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 3744, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 117)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !1011, file: !561, line: 999, baseType: !494, size: 32, offset: 6176)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !1011, file: !561, line: 1000, baseType: !494, size: 32, offset: 6208)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1011, file: !561, line: 1001, baseType: !1039, size: 2016, offset: 6240)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 2016, elements: !1040)
!1040 = !{!1041}
!1041 = !DISubrange(count: 63)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !1011, file: !561, line: 1002, baseType: !493, size: 32, offset: 8256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !1011, file: !561, line: 1004, baseType: !493, size: 32, offset: 8288)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1011, file: !561, line: 1005, baseType: !493, size: 32, offset: 8320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !1011, file: !561, line: 1006, baseType: !493, size: 32, offset: 8352)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !1011, file: !561, line: 1008, baseType: !493, size: 32, offset: 8384)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !1011, file: !561, line: 1009, baseType: !493, size: 32, offset: 8416)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1011, file: !561, line: 1011, baseType: !699, size: 1984, offset: 8448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !1011, file: !561, line: 1012, baseType: !494, size: 32, offset: 10432)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !1011, file: !561, line: 1013, baseType: !599, size: 96, offset: 10464)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !1011, file: !561, line: 1014, baseType: !494, size: 32, offset: 10560)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !1011, file: !561, line: 1016, baseType: !599, size: 96, offset: 10592)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !1011, file: !561, line: 1017, baseType: !494, size: 32, offset: 10688)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !1011, file: !561, line: 1018, baseType: !714, size: 256, offset: 10720)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !1011, file: !561, line: 1019, baseType: !494, size: 32, offset: 10976)
