; ModuleID = './build/pwm_generate_waveform.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.IOT_PWM_TypeDef = type { i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !2, file: !3, line: 71, type: !79, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !62, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 121, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!10 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !12, line: 47, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!15 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!16 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!17 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!18 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!19 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!20 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!21 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!22 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!23 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!24 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!25 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!26 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!27 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!28 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!29 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!30 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!31 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!32 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!33 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!34 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!35 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!36 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!37 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!38 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!39 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!40 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!41 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!42 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!43 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!44 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!45 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!46 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!47 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!48 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!49 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!50 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!51 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!52 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!53 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!54 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!55 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!56 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!57 = !{!58, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !6, line: 116, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !12, line: 95, baseType: !11)
!62 = !{!0, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !2, file: !3, line: 67, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !66, line: 111, baseType: !67)
!66 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 109, size: 96, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !67, file: !66, line: 110, baseType: !70, size: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !66, line: 106, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 102, size: 96, elements: !72)
!72 = !{!73, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !71, file: !66, line: 103, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !71, file: !66, line: 104, baseType: !74, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !71, file: !66, line: 105, baseType: !74, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !6, line: 62, baseType: !7)
!81 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!82 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !85, file: !86, line: 43, type: !92, isLocal: true, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !87, globals: !97, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!87 = !{!88, !80, !90, !96}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 48, baseType: !94)
!93 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !95, line: 79, baseType: !7)
!95 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!97 = !{!83, !98}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !85, file: !86, line: 44, type: !92, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !102, file: !103, line: 54, type: !92, isLocal: false, isDefinition: true)
!102 = distinct !DICompileUnit(language: DW_LANG_C99, file: !103, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !128, globals: !137, splitDebugInlining: false, nameTableKind: None)
!103 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!104 = !{!105, !111}
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 71, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!107 = !{!108, !109, !110}
!108 = !DIEnumerator(name: "UART_PORT0", value: 0)
!109 = !DIEnumerator(name: "UART_PORT1", value: 1)
!110 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 129, baseType: !7, size: 32, elements: !113)
!112 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!114 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!115 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!116 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!117 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!118 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!119 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!120 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!121 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!122 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!123 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!124 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!125 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!126 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!127 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!128 = !{!88, !92, !129, !131, !133, !135, !80}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !6, line: 113, baseType: !132)
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !6, line: 59, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!137 = !{!100}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !140, file: !141, line: 51, type: !221, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !189, globals: !220, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!142 = !{!143, !154, !173, !180}
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 163, baseType: !13, size: 32, elements: !145)
!144 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153}
!146 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!147 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!148 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!149 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!150 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!151 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!152 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!153 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 186, baseType: !7, size: 32, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!156 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!157 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!158 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!159 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!160 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!161 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!162 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!163 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!164 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!165 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!166 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!167 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!168 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!169 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!170 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!171 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!172 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!173 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 176, baseType: !7, size: 32, elements: !174)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!176 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!177 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!178 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!179 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 99, baseType: !7, size: 32, elements: !182)
!181 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!182 = !{!183, !184, !185, !186, !187, !188}
!183 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!184 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!185 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!186 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!187 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!188 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!189 = !{!190, !219}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !192, line: 72, baseType: !193)
!192 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 56, size: 525312, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !209, !210, !214, !218}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !193, file: !192, line: 57, baseType: !91, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !193, file: !192, line: 58, baseType: !91, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !193, file: !192, line: 59, baseType: !91, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !193, file: !192, line: 60, baseType: !91, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !193, file: !192, line: 61, baseType: !91, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !193, file: !192, line: 62, baseType: !91, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !193, file: !192, line: 63, baseType: !91, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !193, file: !192, line: 64, baseType: !91, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !193, file: !192, line: 65, baseType: !91, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !193, file: !192, line: 66, baseType: !91, size: 32, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !193, file: !192, line: 67, baseType: !206, size: 32, offset: 320)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !193, file: !192, line: 68, baseType: !91, size: 32, offset: 352)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !193, file: !192, line: 69, baseType: !211, size: 523904, offset: 384)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 523904, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 16372)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !193, file: !192, line: 70, baseType: !215, size: 512, offset: 524288)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 512, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !193, file: !192, line: 71, baseType: !215, size: 512, offset: 524800)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!220 = !{!138}
!221 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !222)
!222 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !225, file: !226, line: 53, type: !316, isLocal: false, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !227, retainedTypes: !236, globals: !315, splitDebugInlining: false, nameTableKind: None)
!226 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!227 = !{!228, !11}
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !229, line: 152, baseType: !13, size: 32, elements: !230)
!229 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!230 = !{!231, !232, !233, !234, !235}
!231 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!232 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!233 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!234 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!235 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!236 = !{!237, !219, !92, !238, !240, !276}
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !12, line: 97, baseType: !61)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !93, line: 44, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !95, line: 77, baseType: !13)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !242, line: 378, baseType: !243)
!242 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 363, size: 28704, elements: !244)
!244 = !{!245, !249, !253, !254, !255, !256, !257, !258, !259, !260, !264, !271, !275}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !243, file: !242, line: 365, baseType: !246, size: 256)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 8)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !243, file: !242, line: 366, baseType: !250, size: 768, offset: 256)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 768, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 24)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !243, file: !242, line: 367, baseType: !246, size: 256, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !243, file: !242, line: 368, baseType: !250, size: 768, offset: 1280)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !243, file: !242, line: 369, baseType: !246, size: 256, offset: 2048)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !243, file: !242, line: 370, baseType: !250, size: 768, offset: 2304)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !243, file: !242, line: 371, baseType: !246, size: 256, offset: 3072)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !243, file: !242, line: 372, baseType: !250, size: 768, offset: 3328)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !243, file: !242, line: 373, baseType: !246, size: 256, offset: 4096)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !243, file: !242, line: 374, baseType: !261, size: 1792, offset: 4352)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1792, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 56)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !243, file: !242, line: 375, baseType: !265, size: 1920, offset: 6144)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 1920, elements: !269)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !93, line: 24, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !95, line: 43, baseType: !134)
!269 = !{!270}
!270 = !DISubrange(count: 240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !243, file: !242, line: 376, baseType: !272, size: 20608, offset: 8064)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 20608, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 644)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !243, file: !242, line: 377, baseType: !91, size: 32, offset: 28672)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !242, line: 418, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 395, size: 1120, elements: !279)
!279 = !{!280, !282, !283, !284, !285, !286, !287, !291, !292, !293, !294, !295, !296, !297, !298, !302, !303, !304, !308, !312, !314}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !278, file: !242, line: 397, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !278, file: !242, line: 398, baseType: !91, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !278, file: !242, line: 399, baseType: !91, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !278, file: !242, line: 400, baseType: !91, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !278, file: !242, line: 401, baseType: !91, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !278, file: !242, line: 402, baseType: !91, size: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !278, file: !242, line: 403, baseType: !288, size: 96, offset: 192)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 96, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 12)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !278, file: !242, line: 404, baseType: !91, size: 32, offset: 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !278, file: !242, line: 405, baseType: !91, size: 32, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !278, file: !242, line: 406, baseType: !91, size: 32, offset: 352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !278, file: !242, line: 407, baseType: !91, size: 32, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !278, file: !242, line: 408, baseType: !91, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !278, file: !242, line: 409, baseType: !91, size: 32, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !278, file: !242, line: 410, baseType: !91, size: 32, offset: 480)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !278, file: !242, line: 411, baseType: !299, size: 64, offset: 512)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 64, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 2)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !278, file: !242, line: 412, baseType: !281, size: 32, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !278, file: !242, line: 413, baseType: !281, size: 32, offset: 608)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !278, file: !242, line: 414, baseType: !305, size: 128, offset: 640)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 128, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 4)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !278, file: !242, line: 415, baseType: !309, size: 160, offset: 768)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 160, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 5)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !278, file: !242, line: 416, baseType: !313, size: 160, offset: 928)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 160, elements: !310)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !278, file: !242, line: 417, baseType: !91, size: 32, offset: 1088)
!315 = !{!223}
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 6144, elements: !325)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !226, line: 50, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 47, size: 64, elements: !319)
!319 = !{!320, !324}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !318, file: !226, line: 48, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !237}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !318, file: !226, line: 49, baseType: !92, size: 32, offset: 32)
!325 = !{!326}
!326 = !DISubrange(count: 96)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !329, file: !330, line: 61, type: !363, isLocal: true, isDefinition: true)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !331, retainedTypes: !361, globals: !362, splitDebugInlining: false, nameTableKind: None)
!330 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!331 = !{!332, !340, !348, !352, !357}
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 387, baseType: !13, size: 32, elements: !334)
!333 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!334 = !{!335, !336, !337, !338, !339}
!335 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!336 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!337 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!338 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!339 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 657, baseType: !7, size: 32, elements: !342)
!341 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!342 = !{!343, !344, !345, !346, !347}
!343 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!344 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!345 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!346 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!347 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 397, baseType: !7, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!351 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!352 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 666, baseType: !7, size: 32, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!355 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!356 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 380, baseType: !7, size: 32, elements: !358)
!358 = !{!359, !360}
!359 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!360 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!361 = !{!219, !92}
!362 = !{!327}
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 640, elements: !310)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !330, line: 55, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 51, size: 128, elements: !366)
!366 = !{!367, !369, !379}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !365, file: !330, line: 52, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !333, line: 400, baseType: !348)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !365, file: !330, line: 53, baseType: !370, size: 64, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !330, line: 49, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 46, size: 64, elements: !372)
!372 = !{!373, !378}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !371, file: !330, line: 47, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !333, line: 371, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !219}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !371, file: !330, line: 48, baseType: !219, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !365, file: !330, line: 54, baseType: !222, size: 8, offset: 96)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!381 = distinct !DIGlobalVariable(name: "init_time", scope: !382, file: !383, line: 46, type: !238, isLocal: true, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !384, retainedTypes: !437, globals: !440, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_pwm.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!384 = !{!385, !393, !402, !433}
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !386, line: 226, baseType: !13, size: 32, elements: !387)
!386 = !DIFile(filename: "../../../../../driver/chip/inc/hal_pwm.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!387 = !{!388, !389, !390, !391, !392}
!388 = !DIEnumerator(name: "HAL_PWM_STATUS_ERROR", value: -4)
!389 = !DIEnumerator(name: "HAL_PWM_STATUS_ERROR_CHANNEL", value: -3)
!390 = !DIEnumerator(name: "HAL_PWM_STATUS_INVALID_PARAMETER", value: -2)
!391 = !DIEnumerator(name: "HAL_PWM_STATUS_INVALID_FREQUENCY", value: -1)
!392 = !DIEnumerator(name: "HAL_PWM_STATUS_OK", value: 0)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 814, baseType: !7, size: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401}
!395 = !DIEnumerator(name: "HAL_PWM_CLOCK_32KHZ", value: 0)
!396 = !DIEnumerator(name: "HAL_PWM_CLOCK_2MHZ", value: 1)
!397 = !DIEnumerator(name: "HAL_PWM_CLOCK_20MHZ", value: 2)
!398 = !DIEnumerator(name: "HAL_PWM_CLOCK_26MHZ", value: 3)
!399 = !DIEnumerator(name: "HAL_PWM_CLOCK_40MHZ", value: 4)
!400 = !DIEnumerator(name: "HAL_PWM_CLOCK_52MHZ", value: 5)
!401 = !DIEnumerator(name: "HAL_PWM_CLOCK_MAX", value: 6)
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 781, baseType: !7, size: 32, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!404 = !DIEnumerator(name: "HAL_PWM_0", value: 0)
!405 = !DIEnumerator(name: "HAL_PWM_1", value: 1)
!406 = !DIEnumerator(name: "HAL_PWM_2", value: 2)
!407 = !DIEnumerator(name: "HAL_PWM_3", value: 3)
!408 = !DIEnumerator(name: "HAL_PWM_4", value: 4)
!409 = !DIEnumerator(name: "HAL_PWM_5", value: 5)
!410 = !DIEnumerator(name: "HAL_PWM_18", value: 18)
!411 = !DIEnumerator(name: "HAL_PWM_19", value: 19)
!412 = !DIEnumerator(name: "HAL_PWM_20", value: 20)
!413 = !DIEnumerator(name: "HAL_PWM_21", value: 21)
!414 = !DIEnumerator(name: "HAL_PWM_22", value: 22)
!415 = !DIEnumerator(name: "HAL_PWM_23", value: 23)
!416 = !DIEnumerator(name: "HAL_PWM_24", value: 24)
!417 = !DIEnumerator(name: "HAL_PWM_25", value: 25)
!418 = !DIEnumerator(name: "HAL_PWM_26", value: 26)
!419 = !DIEnumerator(name: "HAL_PWM_27", value: 27)
!420 = !DIEnumerator(name: "HAL_PWM_28", value: 28)
!421 = !DIEnumerator(name: "HAL_PWM_29", value: 29)
!422 = !DIEnumerator(name: "HAL_PWM_30", value: 30)
!423 = !DIEnumerator(name: "HAL_PWM_31", value: 31)
!424 = !DIEnumerator(name: "HAL_PWM_32", value: 32)
!425 = !DIEnumerator(name: "HAL_PWM_33", value: 33)
!426 = !DIEnumerator(name: "HAL_PWM_34", value: 34)
!427 = !DIEnumerator(name: "HAL_PWM_35", value: 35)
!428 = !DIEnumerator(name: "HAL_PWM_36", value: 36)
!429 = !DIEnumerator(name: "HAL_PWM_37", value: 37)
!430 = !DIEnumerator(name: "HAL_PWM_38", value: 38)
!431 = !DIEnumerator(name: "HAL_PWM_39", value: 39)
!432 = !DIEnumerator(name: "HAL_PWM_MAX_CHANNEL", value: 40)
!433 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !386, line: 237, baseType: !7, size: 32, elements: !434)
!434 = !{!435, !436}
!435 = !DIEnumerator(name: "HAL_PWM_IDLE", value: 0)
!436 = !DIEnumerator(name: "HAL_PWM_BUSY", value: 1)
!437 = !{!267, !438, !219}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !93, line: 36, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !95, line: 57, baseType: !132)
!440 = !{!441, !444, !445}
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "g_source_clock", scope: !382, file: !383, line: 45, type: !443, isLocal: true, isDefinition: true)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_pwm_source_clock_t", file: !341, line: 822, baseType: !393)
!444 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "source_clock_table", scope: !447, file: !383, line: 69, type: !457, isLocal: true, isDefinition: true)
!447 = distinct !DISubprogram(name: "hal_pwm_calc_total_count", scope: !383, file: !383, line: 65, type: !448, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !382, retainedNodes: !452)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !443, !92, !451}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_pwm_status_t", file: !386, line: 232, baseType: !385)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!452 = !{!453, !454, !455, !456}
!453 = !DILocalVariable(name: "source_clock", arg: 1, scope: !447, file: !383, line: 65, type: !443)
!454 = !DILocalVariable(name: "frequency", arg: 2, scope: !447, file: !383, line: 66, type: !92)
!455 = !DILocalVariable(name: "total_count", arg: 3, scope: !447, file: !383, line: 67, type: !451)
!456 = !DILocalVariable(name: "source_clock_rate", scope: !447, file: !383, line: 72, type: !92)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 192, elements: !459)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!459 = !{!460}
!460 = !DISubrange(count: 6)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !463, file: !464, line: 77, type: !529, isLocal: true, isDefinition: true)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !465, retainedTypes: !515, globals: !517, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!465 = !{!466, !474, !479, !495, !501, !505, !105, !111, !510}
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 345, baseType: !13, size: 32, elements: !468)
!467 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!468 = !{!469, !470, !471, !472, !473}
!469 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!470 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!471 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!472 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!473 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 109, baseType: !7, size: 32, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!477 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!478 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 302, baseType: !7, size: 32, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!481 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!482 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!483 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!484 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!485 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!486 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!487 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!488 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!489 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!490 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!491 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!492 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!493 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!494 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!495 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 321, baseType: !7, size: 32, elements: !496)
!496 = !{!497, !498, !499, !500}
!497 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!498 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!499 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!500 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!501 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 330, baseType: !7, size: 32, elements: !502)
!502 = !{!503, !504}
!503 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!504 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 337, baseType: !7, size: 32, elements: !506)
!506 = !{!507, !508, !509}
!507 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!508 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!509 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 355, baseType: !13, size: 32, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!513 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!514 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!515 = !{!7, !219, !134, !516, !267}
!516 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!517 = !{!461, !518}
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "func_tbl", scope: !520, file: !464, line: 536, type: !527, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !464, file: !464, line: 534, type: !521, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !463, retainedNodes: !525)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !112, line: 197, baseType: !74)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !341, line: 113, baseType: !474)
!525 = !{!526}
!526 = !DILocalVariable(name: "uart_port", arg: 1, scope: !520, file: !464, line: 534, type: !524)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 64, elements: !300)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 1024, elements: !300)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !464, line: 75, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 68, size: 512, elements: !532)
!532 = !{!533, !534, !546, !547, !558, !559}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !531, file: !464, line: 69, baseType: !222, size: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !531, file: !464, line: 70, baseType: !535, size: 128, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !467, line: 378, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 373, size: 128, elements: !537)
!537 = !{!538, !540, !542, !544}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !536, file: !467, line: 374, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !467, line: 317, baseType: !479)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !536, file: !467, line: 375, baseType: !541, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !467, line: 326, baseType: !495)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !536, file: !467, line: 376, baseType: !543, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !467, line: 333, baseType: !501)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !536, file: !467, line: 377, baseType: !545, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !467, line: 341, baseType: !505)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !531, file: !464, line: 71, baseType: !222, size: 8, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !531, file: !464, line: 72, baseType: !548, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !464, line: 66, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 63, size: 64, elements: !550)
!550 = !{!551, !557}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !549, file: !464, line: 64, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !467, line: 410, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !556, !219}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !467, line: 359, baseType: !510)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !549, file: !464, line: 65, baseType: !219, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !531, file: !464, line: 73, baseType: !222, size: 8, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !531, file: !464, line: 74, baseType: !560, size: 224, offset: 288)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !467, line: 390, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 382, size: 224, elements: !562)
!562 = !{!563, !565, !566, !567, !568, !569, !570}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !561, file: !467, line: 383, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !561, file: !467, line: 384, baseType: !92, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !561, file: !467, line: 385, baseType: !92, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !561, file: !467, line: 386, baseType: !564, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !561, file: !467, line: 387, baseType: !92, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !561, file: !467, line: 388, baseType: !92, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !561, file: !467, line: 389, baseType: !92, size: 32, offset: 192)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !573, file: !574, line: 59, type: !92, isLocal: false, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !575, globals: !628, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "../../../../../project/linkit7697_hdk/hal_examples/pwm_generate_waveform/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!575 = !{!576, !584, !609}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !242, line: 656, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 650, size: 128, elements: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !578, file: !242, line: 652, baseType: !91, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !578, file: !242, line: 653, baseType: !91, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !578, file: !242, line: 654, baseType: !91, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !578, file: !242, line: 655, baseType: !281, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !242, line: 418, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 395, size: 1120, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !586, file: !242, line: 397, baseType: !281, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !586, file: !242, line: 398, baseType: !91, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !586, file: !242, line: 399, baseType: !91, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !586, file: !242, line: 400, baseType: !91, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !586, file: !242, line: 401, baseType: !91, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !586, file: !242, line: 402, baseType: !91, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !586, file: !242, line: 403, baseType: !288, size: 96, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !586, file: !242, line: 404, baseType: !91, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !586, file: !242, line: 405, baseType: !91, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !586, file: !242, line: 406, baseType: !91, size: 32, offset: 352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !586, file: !242, line: 407, baseType: !91, size: 32, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !586, file: !242, line: 408, baseType: !91, size: 32, offset: 416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !586, file: !242, line: 409, baseType: !91, size: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !586, file: !242, line: 410, baseType: !91, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !586, file: !242, line: 411, baseType: !299, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !586, file: !242, line: 412, baseType: !281, size: 32, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !586, file: !242, line: 413, baseType: !281, size: 32, offset: 608)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !586, file: !242, line: 414, baseType: !305, size: 128, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !586, file: !242, line: 415, baseType: !309, size: 160, offset: 768)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !586, file: !242, line: 416, baseType: !313, size: 160, offset: 928)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !586, file: !242, line: 417, baseType: !91, size: 32, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !192, line: 72, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 56, size: 525312, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !611, file: !192, line: 57, baseType: !91, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !611, file: !192, line: 58, baseType: !91, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !611, file: !192, line: 59, baseType: !91, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !611, file: !192, line: 60, baseType: !91, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !611, file: !192, line: 61, baseType: !91, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !611, file: !192, line: 62, baseType: !91, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !611, file: !192, line: 63, baseType: !91, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !611, file: !192, line: 64, baseType: !91, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !611, file: !192, line: 65, baseType: !91, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !611, file: !192, line: 66, baseType: !91, size: 32, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !611, file: !192, line: 67, baseType: !206, size: 32, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !611, file: !192, line: 68, baseType: !91, size: 32, offset: 352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !611, file: !192, line: 69, baseType: !211, size: 523904, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !611, file: !192, line: 70, baseType: !215, size: 512, offset: 524288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !611, file: !192, line: 71, baseType: !215, size: 512, offset: 524800)
!628 = !{!571, !629}
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !573, file: !574, line: 61, type: !91, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "heap_end", scope: !633, file: !634, line: 66, type: !639, isLocal: true, isDefinition: true)
!633 = distinct !DISubprogram(name: "_sbrk_r", scope: !634, file: !634, line: 63, type: !635, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !831, retainedNodes: !835)
!634 = !DIFile(filename: "../../../../../project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!635 = !DISubroutineType(types: !636)
!636 = !{!637, !640, !830}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !638, line: 123, baseType: !639)
!638 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !642, line: 377, size: 1920, elements: !643)
!642 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!643 = !{!644, !645, !719, !720, !721, !722, !723, !724, !725, !728, !749, !753, !754, !755, !756, !766, !779, !780, !785, !804, !805, !812, !813, !829}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !641, file: !642, line: 381, baseType: !13, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !641, file: !642, line: 386, baseType: !646, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !642, line: 292, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !642, line: 186, size: 832, elements: !649)
!649 = !{!650, !652, !653, !654, !656, !657, !662, !663, !664, !665, !669, !675, !682, !686, !687, !688, !689, !693, !695, !696, !697, !699, !705, !718}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !648, file: !642, line: 187, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !648, file: !642, line: 188, baseType: !13, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !648, file: !642, line: 189, baseType: !13, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !648, file: !642, line: 190, baseType: !655, size: 16, offset: 96)
!655 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !648, file: !642, line: 191, baseType: !655, size: 16, offset: 112)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !648, file: !642, line: 192, baseType: !658, size: 64, offset: 128)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !642, line: 122, size: 64, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !658, file: !642, line: 123, baseType: !651, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !658, file: !642, line: 124, baseType: !13, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !648, file: !642, line: 193, baseType: !13, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !648, file: !642, line: 196, baseType: !640, size: 32, offset: 224)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !648, file: !642, line: 200, baseType: !219, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !648, file: !642, line: 202, baseType: !666, size: 32, offset: 288)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DISubroutineType(types: !668)
!668 = !{!13, !640, !219, !639, !13}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !648, file: !642, line: 204, baseType: !670, size: 32, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{!13, !640, !219, !673, !13}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !648, file: !642, line: 207, baseType: !676, size: 32, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DISubroutineType(types: !678)
!678 = !{!679, !640, !219, !679, !13}
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !680, line: 116, baseType: !681)
!680 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!681 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !648, file: !642, line: 208, baseType: !683, size: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DISubroutineType(types: !685)
!685 = !{!13, !640, !219}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !648, file: !642, line: 211, baseType: !658, size: 64, offset: 416)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !648, file: !642, line: 212, baseType: !651, size: 32, offset: 480)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !648, file: !642, line: 213, baseType: !13, size: 32, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !648, file: !642, line: 216, baseType: !690, size: 24, offset: 544)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 24, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 3)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !648, file: !642, line: 217, baseType: !694, size: 8, offset: 568)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8, elements: !207)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !648, file: !642, line: 220, baseType: !658, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !648, file: !642, line: 223, baseType: !13, size: 32, offset: 640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !648, file: !642, line: 224, baseType: !698, size: 32, offset: 672)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !680, line: 46, baseType: !681)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !648, file: !642, line: 231, baseType: !700, size: 32, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !642, line: 35, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !702, line: 34, baseType: !703)
!702 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !702, line: 33, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !648, file: !642, line: 233, baseType: !706, size: 64, offset: 736)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !680, line: 170, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !680, line: 162, size: 64, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !707, file: !680, line: 164, baseType: !13, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !707, file: !680, line: 169, baseType: !711, size: 32, offset: 32)
!711 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !707, file: !680, line: 165, size: 32, elements: !712)
!712 = !{!713, !716}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !711, file: !680, line: 167, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !715, line: 116, baseType: !13)
!715 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !711, file: !680, line: 168, baseType: !717, size: 32)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !306)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !648, file: !642, line: 234, baseType: !13, size: 32, offset: 800)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !641, file: !642, line: 386, baseType: !646, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !641, file: !642, line: 386, baseType: !646, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !641, file: !642, line: 388, baseType: !13, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !641, file: !642, line: 390, baseType: !639, size: 32, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !641, file: !642, line: 392, baseType: !13, size: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !641, file: !642, line: 394, baseType: !13, size: 32, offset: 224)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !641, file: !642, line: 395, baseType: !726, size: 32, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !642, line: 45, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !641, file: !642, line: 397, baseType: !729, size: 32, offset: 288)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !642, line: 349, size: 128, elements: !731)
!731 = !{!732, !745, !746, !747}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !730, file: !642, line: 352, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !642, line: 52, size: 192, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !734, file: !642, line: 54, baseType: !733, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !734, file: !642, line: 55, baseType: !13, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !734, file: !642, line: 55, baseType: !13, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !734, file: !642, line: 55, baseType: !13, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !734, file: !642, line: 55, baseType: !13, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !734, file: !642, line: 56, baseType: !742, size: 32, offset: 160)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 32, elements: !207)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !642, line: 22, baseType: !744)
!744 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !730, file: !642, line: 353, baseType: !13, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !730, file: !642, line: 354, baseType: !733, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !730, file: !642, line: 355, baseType: !748, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !641, file: !642, line: 399, baseType: !750, size: 32, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !640}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !641, file: !642, line: 401, baseType: !13, size: 32, offset: 352)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !641, file: !642, line: 404, baseType: !13, size: 32, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !641, file: !642, line: 405, baseType: !639, size: 32, offset: 416)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !641, file: !642, line: 407, baseType: !757, size: 32, offset: 448)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !642, line: 324, size: 192, elements: !759)
!759 = !{!760, !762, !763, !764}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !758, file: !642, line: 325, baseType: !761, size: 48)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 48, elements: !691)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !758, file: !642, line: 326, baseType: !761, size: 48, offset: 48)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !758, file: !642, line: 327, baseType: !132, size: 16, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !758, file: !642, line: 330, baseType: !765, size: 64, offset: 128)
!765 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !641, file: !642, line: 408, baseType: !767, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !642, line: 60, size: 288, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !768, file: !642, line: 62, baseType: !13, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !768, file: !642, line: 63, baseType: !13, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !768, file: !642, line: 64, baseType: !13, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !768, file: !642, line: 65, baseType: !13, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !768, file: !642, line: 66, baseType: !13, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !768, file: !642, line: 67, baseType: !13, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !768, file: !642, line: 68, baseType: !13, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !768, file: !642, line: 69, baseType: !13, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !768, file: !642, line: 70, baseType: !13, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !641, file: !642, line: 409, baseType: !639, size: 32, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !641, file: !642, line: 412, baseType: !781, size: 32, offset: 544)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !13}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !641, file: !642, line: 416, baseType: !786, size: 32, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !642, line: 90, size: 1120, elements: !788)
!788 = !{!789, !790, !791, !795}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !787, file: !642, line: 91, baseType: !786, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !787, file: !642, line: 92, baseType: !13, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !787, file: !642, line: 93, baseType: !792, size: 1024, offset: 64)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1024, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !787, file: !642, line: 94, baseType: !796, size: 32, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !642, line: 79, size: 2112, elements: !798)
!798 = !{!799, !801, !802, !803}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !797, file: !642, line: 80, baseType: !800, size: 1024)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 1024, elements: !793)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !797, file: !642, line: 81, baseType: !800, size: 1024, offset: 1024)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !797, file: !642, line: 83, baseType: !743, size: 32, offset: 2048)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !797, file: !642, line: 86, baseType: !743, size: 32, offset: 2080)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !641, file: !642, line: 417, baseType: !787, size: 1120, offset: 608)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !641, file: !642, line: 420, baseType: !806, size: 96, offset: 1728)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !642, line: 296, size: 96, elements: !807)
!807 = !{!808, !810, !811}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !806, file: !642, line: 298, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !806, file: !642, line: 299, baseType: !13, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !806, file: !642, line: 300, baseType: !646, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !641, file: !642, line: 421, baseType: !646, size: 32, offset: 1824)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !641, file: !642, line: 422, baseType: !814, size: 32, offset: 1856)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !642, line: 359, size: 640, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !823, !824, !825, !826, !827, !828}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !815, file: !642, line: 362, baseType: !639, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !815, file: !642, line: 363, baseType: !706, size: 64, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !815, file: !642, line: 364, baseType: !706, size: 64, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !815, file: !642, line: 365, baseType: !706, size: 64, offset: 160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !815, file: !642, line: 366, baseType: !822, size: 64, offset: 224)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 64, elements: !247)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !815, file: !642, line: 367, baseType: !13, size: 32, offset: 288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !815, file: !642, line: 368, baseType: !706, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !815, file: !642, line: 369, baseType: !706, size: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !815, file: !642, line: 370, baseType: !706, size: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !815, file: !642, line: 371, baseType: !706, size: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !815, file: !642, line: 372, baseType: !706, size: 64, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !641, file: !642, line: 423, baseType: !639, size: 32, offset: 1888)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !715, line: 46, baseType: !7)
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !833, globals: !834, splitDebugInlining: false, nameTableKind: None)
!832 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!833 = !{!639, !637}
!834 = !{!631}
!835 = !{!836, !837, !838, !839}
!836 = !DILocalVariable(name: "r", arg: 1, scope: !633, file: !634, line: 63, type: !640)
!837 = !DILocalVariable(name: "nbytes", arg: 2, scope: !633, file: !634, line: 63, type: !830)
!838 = !DILocalVariable(name: "prev_heap_end", scope: !633, file: !634, line: 67, type: !639)
!839 = !DILocalVariable(name: "stack", scope: !633, file: !634, line: 68, type: !639)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !842, file: !847, line: 4, type: !856, isLocal: false, isDefinition: true)
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !844, splitDebugInlining: false, nameTableKind: None)
!843 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!844 = !{!840, !845, !851}
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !842, file: !847, line: 5, type: !848, isLocal: false, isDefinition: true)
!847 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 88, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 11)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !842, file: !847, line: 6, type: !853, isLocal: false, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 120, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 15)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 248, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 31)
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !861, retainedTypes: !884, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_pwm.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!861 = !{!862, !867, !873, !878}
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_HAL_RET_T", file: !863, line: 365, baseType: !134, size: 8, elements: !864)
!863 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687_cm4_hw_memmap.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!864 = !{!865, !866}
!865 = !DIEnumerator(name: "HAL_RET_SUCCESS", value: 0)
!866 = !DIEnumerator(name: "HAL_RET_FAIL", value: 1)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_PWM_CLK_T", file: !863, line: 371, baseType: !134, size: 8, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIEnumerator(name: "PWM_CLK_32K", value: 0)
!870 = !DIEnumerator(name: "PWM_CLK_2M", value: 1)
!871 = !DIEnumerator(name: "PWM_CLK_XTAL", value: 2)
!872 = !DIEnumerator(name: "PWM_CLK_NUM", value: 3)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_PWM_STATE_T", file: !863, line: 378, baseType: !134, size: 8, elements: !874)
!874 = !{!875, !876, !877}
!875 = !DIEnumerator(name: "PWM_S0", value: 0)
!876 = !DIEnumerator(name: "PWM_S1", value: 1)
!877 = !DIEnumerator(name: "PWM_STATE_NUM", value: 2)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_XTAL_FREQ_T", file: !863, line: 166, baseType: !7, size: 32, elements: !879)
!879 = !{!880, !881, !882, !883}
!880 = !DIEnumerator(name: "XTAL_FREQ_20M", value: 0)
!881 = !DIEnumerator(name: "XTAL_FREQ_40M", value: 1)
!882 = !DIEnumerator(name: "XTAL_FREQ_26M", value: 2)
!883 = !DIEnumerator(name: "XTAL_FREQ_52M", value: 3)
!884 = !{!80, !88, !885, !886, !893, !895}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "PUINT8", file: !6, line: 84, baseType: !651)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "P_IOT_PWM_TypeDef", file: !863, line: 188, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !863, line: 184, size: 96, elements: !889)
!889 = !{!890, !891, !892}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CTRL", scope: !888, file: !863, line: 185, baseType: !79, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_PARAM_S0", scope: !888, file: !863, line: 186, baseType: !79, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_PARAM_S1", scope: !888, file: !863, line: 187, baseType: !79, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOT_PWM_TypeDef", file: !863, line: 188, baseType: !888)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_PWM_CLK_T", file: !863, line: 376, baseType: !867)
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !898, retainedTypes: !904, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!898 = !{!899}
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !900, line: 1209, baseType: !7, size: 32, elements: !901)
!900 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!901 = !{!902, !903}
!902 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!903 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!904 = !{!58, !60}
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !907, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!906 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!907 = !{!908}
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !909, line: 150, baseType: !7, size: 32, elements: !910)
!909 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984}
!911 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!912 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!913 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!914 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!915 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!916 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!917 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!918 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!919 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!920 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!921 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!922 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!923 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!924 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!925 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!926 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!927 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!928 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!929 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!930 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!931 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!932 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!933 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!934 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!935 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!936 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!937 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!938 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!939 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!940 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!941 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!942 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!943 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!944 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!945 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!946 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!947 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!948 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!949 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!950 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!951 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!952 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!953 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!954 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!955 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!956 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!957 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!958 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!959 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!960 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!961 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!962 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!963 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!964 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!965 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!966 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!967 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!968 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!969 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!970 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!971 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!972 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!973 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!974 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!975 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!976 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!977 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!978 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!979 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!980 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!981 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!982 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!983 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!984 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!985 = !{!58, !80}
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !988, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!988 = !{!989, !1014}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !242, line: 418, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 395, size: 1120, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !991, file: !242, line: 397, baseType: !281, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !991, file: !242, line: 398, baseType: !91, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !991, file: !242, line: 399, baseType: !91, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !991, file: !242, line: 400, baseType: !91, size: 32, offset: 96)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !991, file: !242, line: 401, baseType: !91, size: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !991, file: !242, line: 402, baseType: !91, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !991, file: !242, line: 403, baseType: !288, size: 96, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !991, file: !242, line: 404, baseType: !91, size: 32, offset: 288)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !991, file: !242, line: 405, baseType: !91, size: 32, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !991, file: !242, line: 406, baseType: !91, size: 32, offset: 352)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !991, file: !242, line: 407, baseType: !91, size: 32, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !991, file: !242, line: 408, baseType: !91, size: 32, offset: 416)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !991, file: !242, line: 409, baseType: !91, size: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !991, file: !242, line: 410, baseType: !91, size: 32, offset: 480)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !991, file: !242, line: 411, baseType: !299, size: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !991, file: !242, line: 412, baseType: !281, size: 32, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !991, file: !242, line: 413, baseType: !281, size: 32, offset: 608)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !991, file: !242, line: 414, baseType: !305, size: 128, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !991, file: !242, line: 415, baseType: !309, size: 160, offset: 768)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !991, file: !242, line: 416, baseType: !313, size: 160, offset: 928)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !991, file: !242, line: 417, baseType: !91, size: 32, offset: 1088)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !242, line: 378, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 363, size: 28704, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1016, file: !242, line: 365, baseType: !246, size: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1016, file: !242, line: 366, baseType: !250, size: 768, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1016, file: !242, line: 367, baseType: !246, size: 256, offset: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1016, file: !242, line: 368, baseType: !250, size: 768, offset: 1280)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1016, file: !242, line: 369, baseType: !246, size: 256, offset: 2048)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1016, file: !242, line: 370, baseType: !250, size: 768, offset: 2304)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1016, file: !242, line: 371, baseType: !246, size: 256, offset: 3072)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1016, file: !242, line: 372, baseType: !250, size: 768, offset: 3328)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1016, file: !242, line: 373, baseType: !246, size: 256, offset: 4096)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1016, file: !242, line: 374, baseType: !261, size: 1792, offset: 4352)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !1016, file: !242, line: 375, baseType: !265, size: 1920, offset: 6144)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1016, file: !242, line: 376, baseType: !272, size: 20608, offset: 8064)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1016, file: !242, line: 377, baseType: !91, size: 32, offset: 28672)
!1031 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1032, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1033, splitDebugInlining: false, nameTableKind: None)
!1032 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!1033 = !{!1034, !908}
!1034 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1035, line: 55, baseType: !7, size: 32, elements: !1036)
!1035 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/pwm_generate_waveform/GCC")
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064}
!1037 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!1038 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!1039 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!1040 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!1041 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!1042 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!1043 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!1044 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!1045 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!1046 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!1047 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!1048 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!1049 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!1050 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!1051 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!1052 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!1053 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!1054 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!1055 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!1056 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!1057 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!1058 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!1059 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!1060 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!1061 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!1062 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!1063 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!1064 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
