; ModuleID = 'build/actinius_icarus_som/drivers/counter/alarm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.counter_alarm_cfg = type { void (%struct.device*, i8, i32, i8*)*, i32, i8*, i32 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "alarm_cfg", scope: !27, file: !228, line: 16, type: !176, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !227, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/counter/alarm/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !120, !167}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_config_info", file: !112, line: 169, size: 96, elements: !113)
!112 = !DIFile(filename: "zephyr/include/zephyr/drivers/counter.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !{!114, !115, !116, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "max_top_value", scope: !111, file: !112, line: 170, baseType: !102, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !111, file: !112, line: 171, baseType: !102, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !111, file: !112, line: 172, baseType: !117, size: 8, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !111, file: !112, line: 173, baseType: !117, size: 8, offset: 72)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_driver_api", file: !112, line: 198, size: 384, elements: !122)
!122 = !{!123, !153, !155, !161, !169, !186, !191, !208, !213, !215, !220, !225}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !121, file: !112, line: 199, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_start", file: !112, line: 176, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DISubroutineType(types: !127)
!127 = !{!108, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !131, line: 378, size: 192, elements: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = !{!133, !137, !138, !139, !146, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !131, line: 380, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !130, file: !131, line: 382, baseType: !13, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !130, file: !131, line: 384, baseType: !13, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !130, file: !131, line: 386, baseType: !140, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !131, line: 351, size: 16, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !141, file: !131, line: 359, baseType: !117, size: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !141, file: !131, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !130, file: !131, line: 388, baseType: !107, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !130, file: !131, line: 396, baseType: !148, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !131, line: 43, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !121, file: !112, line: 200, baseType: !154, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_stop", file: !112, line: 177, baseType: !125)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "get_value", scope: !121, file: !112, line: 201, baseType: !156, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_value", file: !112, line: 178, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DISubroutineType(types: !159)
!159 = !{!108, !128, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "get_value_64", scope: !121, file: !112, line: 202, baseType: !162, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_value_64", file: !112, line: 180, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{!108, !128, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !168)
!168 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "set_alarm", scope: !121, file: !112, line: 203, baseType: !170, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_alarm", file: !112, line: 182, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DISubroutineType(types: !173)
!173 = !{!108, !128, !117, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_alarm_cfg", file: !112, line: 129, size: 128, elements: !177)
!177 = !{!178, !183, !184, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !176, file: !112, line: 130, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_alarm_callback_t", file: !112, line: 111, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !128, !117, !102, !107}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !176, file: !112, line: 131, baseType: !102, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !176, file: !112, line: 132, baseType: !107, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !112, line: 133, baseType: !102, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_alarm", scope: !121, file: !112, line: 204, baseType: !187, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_cancel_alarm", file: !112, line: 185, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!108, !128, !117}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "set_top_value", scope: !121, file: !112, line: 205, baseType: !192, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_top_value", file: !112, line: 187, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!108, !128, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_top_cfg", file: !112, line: 152, size: 128, elements: !199)
!199 = !{!200, !201, !206, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !198, file: !112, line: 153, baseType: !102, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !198, file: !112, line: 154, baseType: !202, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_top_callback_t", file: !112, line: 141, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !128, !107}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !198, file: !112, line: 155, baseType: !107, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !198, file: !112, line: 156, baseType: !102, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !121, file: !112, line: 206, baseType: !209, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_pending_int", file: !112, line: 189, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!102, !128}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "get_top_value", scope: !121, file: !112, line: 207, baseType: !214, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_top_value", file: !112, line: 190, baseType: !210)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "get_guard_period", scope: !121, file: !112, line: 208, baseType: !216, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_guard_period", file: !112, line: 191, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{!102, !128, !102}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "set_guard_period", scope: !121, file: !112, line: 209, baseType: !221, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_guard_period", file: !112, line: 193, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{!108, !128, !102, !102}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "get_freq", scope: !121, file: !112, line: 210, baseType: !226, size: 32, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_freq", file: !112, line: 196, baseType: !210)
!227 = !{!25}
!228 = !DIFile(filename: "zephyr/samples/drivers/counter/alarm/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "_char_out", scope: !231, file: !235, line: 54, type: !236, isLocal: false, isDefinition: true)
!231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !232, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !233, globals: !234, splitDebugInlining: false, nameTableKind: None)
!232 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!233 = !{!107, !108}
!234 = !{!229}
!235 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DISubroutineType(types: !238)
!238 = !{!108, !108}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !241, file: !302, line: 65, type: !303, isLocal: true, isDefinition: true, align: 32)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !243, globals: !295, splitDebugInlining: false, nameTableKind: None)
!242 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!243 = !{!107, !108, !244, !102, !255}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !246, file: !245, line: 167, baseType: !254)
!245 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !245, file: !245, line: 134, type: !247, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !241, retainedNodes: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !102}
!249 = !{!250, !251, !253}
!250 = !DILocalVariable(name: "time_us", arg: 1, scope: !246, file: !245, line: 134, type: !102)
!251 = !DILocalVariable(name: "delay_cycles", scope: !246, file: !245, line: 168, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!253 = !DILocalVariable(name: "cycles", scope: !246, file: !245, line: 171, type: !102)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !257, line: 1928, baseType: !258)
!257 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 1909, size: 11360, elements: !259)
!259 = !{!260, !266, !267, !268, !269, !273, !274, !275, !276, !280, !281, !285, !286, !287, !288, !289, !293, !294}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !258, file: !257, line: 1910, baseType: !261, size: 8192)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 8192, elements: !264)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!264 = !{!265}
!265 = !DISubrange(count: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !258, file: !257, line: 1911, baseType: !262, size: 32, offset: 8192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !258, file: !257, line: 1912, baseType: !262, size: 32, offset: 8224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !258, file: !257, line: 1913, baseType: !262, size: 32, offset: 8256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !258, file: !257, line: 1914, baseType: !270, size: 1984, offset: 8288)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 1984, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 62)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !258, file: !257, line: 1915, baseType: !263, size: 32, offset: 10272)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !258, file: !257, line: 1916, baseType: !262, size: 32, offset: 10304)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !258, file: !257, line: 1917, baseType: !263, size: 32, offset: 10336)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !258, file: !257, line: 1918, baseType: !277, size: 96, offset: 10368)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 96, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 3)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !258, file: !257, line: 1919, baseType: !263, size: 32, offset: 10464)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !258, file: !257, line: 1920, baseType: !282, size: 256, offset: 10496)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 256, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !258, file: !257, line: 1921, baseType: !263, size: 32, offset: 10752)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !258, file: !257, line: 1922, baseType: !262, size: 32, offset: 10784)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !258, file: !257, line: 1923, baseType: !263, size: 32, offset: 10816)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !258, file: !257, line: 1924, baseType: !263, size: 32, offset: 10848)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !258, file: !257, line: 1925, baseType: !290, size: 416, offset: 10880)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 416, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 13)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !258, file: !257, line: 1926, baseType: !263, size: 32, offset: 11296)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !258, file: !257, line: 1927, baseType: !263, size: 32, offset: 11328)
!295 = !{!239, !296}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !246, file: !245, line: 161, type: !298, isLocal: true, isDefinition: true, align: 128)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 48, elements: !278)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !301)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !305, line: 51, size: 64, elements: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !{!307, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !304, file: !305, line: 60, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{!108, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !305, line: 48, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !304, file: !305, line: 65, baseType: !311, size: 32, offset: 32)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !317, file: !352, line: 27, type: !379, isLocal: true, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, retainedTypes: !331, globals: !349, splitDebugInlining: false, nameTableKind: None)
!318 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!319 = !{!320, !30}
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !321, line: 27, baseType: !32, size: 32, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330}
!323 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!324 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!325 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!326 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!327 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!328 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!329 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!330 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!331 = !{!107, !103, !108, !24, !332, !348, !102, !167}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !334, line: 54, size: 96, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336, !343, !347}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !333, file: !334, line: 55, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !338, line: 33, baseType: !339)
!338 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !338, line: 29, size: 32, elements: !340)
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !338, line: 30, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !333, file: !334, line: 60, baseType: !344, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !320}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !333, file: !334, line: 65, baseType: !344, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!349 = !{!315, !350, !356, !358, !369, !371}
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !317, file: !352, line: 44, type: !353, isLocal: true, isDefinition: true)
!352 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !354, line: 43, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{}
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !317, file: !352, line: 49, type: !353, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !317, file: !352, line: 36, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 128, elements: !367)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !321, line: 114, size: 128, elements: !362)
!362 = !{!363, !364, !365, !366}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !361, file: !321, line: 115, baseType: !320, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !361, file: !321, line: 141, baseType: !117, size: 8, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !361, file: !321, line: 149, baseType: !102, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !361, file: !321, line: 156, baseType: !102, size: 32, offset: 96)
!367 = !{!368}
!368 = !DISubrange(count: 1)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !317, file: !352, line: 40, type: !360, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !317, file: !352, line: 28, type: !373, isLocal: true, isDefinition: true)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !338, line: 40, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !338, line: 35, size: 64, elements: !375)
!375 = !{!376, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !374, file: !338, line: 36, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !374, file: !338, line: 37, baseType: !377, size: 32, offset: 32)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 32, elements: !367)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !381, line: 22, baseType: !382)
!381 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!383 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!384 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !387, file: !416, line: 50, type: !403, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, retainedTypes: !389, globals: !413, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!389 = !{!151, !103, !390, !108, !107, !102, !167, !392, !348, !403, !404}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !391, line: 214, baseType: !32)
!391 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !394, line: 45, size: 64, elements: !395)
!394 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !{!396, !402}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !393, file: !394, line: 46, baseType: !397, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !338, line: 33, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !338, line: 29, size: 32, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !338, line: 30, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !393, file: !394, line: 48, baseType: !102, size: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !394, line: 38, size: 64, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !405, file: !394, line: 39, baseType: !397, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !405, file: !394, line: 41, baseType: !409, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !394, line: 35, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !403}
!413 = !{!414, !418, !426, !385, !428, !438}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "latency_lock", scope: !387, file: !416, line: 44, type: !417, isLocal: true, isDefinition: true)
!416 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !354, line: 43, elements: !355)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !387, file: !416, line: 46, type: !420, isLocal: true, isDefinition: true)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !338, line: 40, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !338, line: 35, size: 64, elements: !422)
!422 = !{!423, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !421, file: !338, line: 36, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !421, file: !338, line: 37, baseType: !424, size: 32, offset: 32)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "latency_subs", scope: !387, file: !416, line: 52, type: !420, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !387, file: !416, line: 39, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, elements: !436)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 35, size: 96, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !431, file: !416, line: 36, baseType: !320, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !431, file: !416, line: 37, baseType: !117, size: 8, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !431, file: !416, line: 38, baseType: !380, size: 32, offset: 64)
!436 = !{!437}
!437 = !DISubrange(count: 0)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !387, file: !416, line: 48, type: !403, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !442, file: !449, line: 47, type: !463, isLocal: true, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !444, retainedTypes: !445, globals: !446, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!444 = !{!320}
!445 = !{!390, !108}
!446 = !{!447, !440, !459}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "cpus_states", scope: !442, file: !449, line: 50, type: !450, isLocal: true, isDefinition: true)
!449 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 32, elements: !367)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !321, line: 114, size: 128, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !453, file: !321, line: 115, baseType: !320, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !453, file: !321, line: 141, baseType: !117, size: 8, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !453, file: !321, line: 149, baseType: !102, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !453, file: !321, line: 156, baseType: !102, size: 32, offset: 96)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !442, file: !449, line: 55, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 8, elements: !367)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, elements: !436)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "static_regions", scope: !466, file: !473, line: 62, type: !605, isLocal: true, isDefinition: true)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !468, globals: !469, splitDebugInlining: false, nameTableKind: None)
!467 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!468 = !{!390, !108, !102, !107}
!469 = !{!470, !464}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !472, file: !473, line: 198, type: !592, isLocal: true, isDefinition: true)
!472 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !473, file: !473, line: 175, type: !474, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !466, retainedNodes: !589)
!473 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!474 = !DISubroutineType(types: !475)
!475 = !{null, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !478, line: 245, size: 1024, elements: !479)
!478 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!479 = !{!480, !545, !558, !559, !560, !561, !567, !584}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !477, file: !478, line: 247, baseType: !481, size: 384)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !478, line: 57, size: 384, elements: !482)
!482 = !{!483, !511, !519, !520, !521, !532, !533, !534}
!483 = !DIDerivedType(tag: DW_TAG_member, scope: !481, file: !478, line: 60, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !481, file: !478, line: 60, size: 64, elements: !485)
!485 = !{!486, !502}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !484, file: !478, line: 61, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !488, line: 49, baseType: !489)
!488 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !488, line: 37, size: 64, elements: !490)
!490 = !{!491, !497}
!491 = !DIDerivedType(tag: DW_TAG_member, scope: !489, file: !488, line: 38, baseType: !492, size: 32)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !489, file: !488, line: 38, size: 32, elements: !493)
!493 = !{!494, !496}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !492, file: !488, line: 39, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !488, line: 40, baseType: !495, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, scope: !489, file: !488, line: 42, baseType: !498, size: 32, offset: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !489, file: !488, line: 42, size: 32, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !498, file: !488, line: 43, baseType: !495, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !498, file: !488, line: 44, baseType: !495, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !484, file: !478, line: 62, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !504, line: 49, size: 64, elements: !505)
!504 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !503, file: !504, line: 50, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 64, elements: !509)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!509 = !{!510}
!510 = !DISubrange(count: 2)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !481, file: !478, line: 68, baseType: !512, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !514, line: 233, baseType: !515)
!514 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 231, size: 64, elements: !516)
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !515, file: !514, line: 232, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !488, line: 48, baseType: !489)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !481, file: !478, line: 71, baseType: !117, size: 8, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !481, file: !478, line: 74, baseType: !117, size: 8, offset: 104)
!521 = !DIDerivedType(tag: DW_TAG_member, scope: !481, file: !478, line: 90, baseType: !522, size: 16, offset: 112)
!522 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !481, file: !478, line: 90, size: 16, elements: !523)
!523 = !{!524, !531}
!524 = !DIDerivedType(tag: DW_TAG_member, scope: !522, file: !478, line: 91, baseType: !525, size: 16)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !522, file: !478, line: 91, size: 16, elements: !526)
!526 = !{!527, !530}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !525, file: !478, line: 96, baseType: !528, size: 8)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !529)
!529 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !525, file: !478, line: 97, baseType: !117, size: 8, offset: 8)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !522, file: !478, line: 100, baseType: !300, size: 16)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !481, file: !478, line: 107, baseType: !102, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !481, file: !478, line: 127, baseType: !107, size: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !481, file: !478, line: 131, baseType: !535, size: 192, offset: 192)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !514, line: 244, size: 192, elements: !536)
!536 = !{!537, !538, !544}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !535, file: !514, line: 245, baseType: !487, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !535, file: !514, line: 246, baseType: !539, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !514, line: 242, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !535, file: !514, line: 249, baseType: !105, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !477, file: !478, line: 250, baseType: !546, size: 288, offset: 384)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !547, line: 25, size: 288, elements: !548)
!547 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !546, file: !547, line: 26, baseType: !102, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !546, file: !547, line: 27, baseType: !102, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !546, file: !547, line: 28, baseType: !102, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !546, file: !547, line: 29, baseType: !102, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !546, file: !547, line: 30, baseType: !102, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !546, file: !547, line: 31, baseType: !102, size: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !546, file: !547, line: 32, baseType: !102, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !546, file: !547, line: 33, baseType: !102, size: 32, offset: 224)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !546, file: !547, line: 34, baseType: !102, size: 32, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !477, file: !478, line: 253, baseType: !107, size: 32, offset: 672)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !477, file: !478, line: 256, baseType: !513, size: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !477, file: !478, line: 294, baseType: !108, size: 32, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !477, file: !478, line: 300, baseType: !562, size: 96, offset: 800)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !478, line: 149, size: 96, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !562, file: !478, line: 153, baseType: !22, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !562, file: !478, line: 162, baseType: !390, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !562, file: !478, line: 168, baseType: !390, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !477, file: !478, line: 325, baseType: !568, size: 32, offset: 896)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !570, line: 5073, size: 160, elements: !571)
!570 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !{!572, !581, !582}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !569, file: !570, line: 5074, baseType: !573, size: 96)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !574, line: 56, size: 96, elements: !575)
!574 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = !{!576, !579, !580}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !573, file: !574, line: 57, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !574, line: 57, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !573, file: !574, line: 58, baseType: !107, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !573, file: !574, line: 59, baseType: !390, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !569, file: !570, line: 5075, baseType: !513, size: 64, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !569, file: !570, line: 5076, baseType: !583, offset: 160)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !354, line: 43, elements: !355)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !477, file: !478, line: 343, baseType: !585, size: 64, offset: 928)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !547, line: 60, size: 64, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !585, file: !547, line: 63, baseType: !102, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !585, file: !547, line: 66, baseType: !102, size: 32, offset: 32)
!589 = !{!590, !591}
!590 = !DILocalVariable(name: "thread", arg: 1, scope: !472, file: !473, line: 175, type: !476)
!591 = !DILocalVariable(name: "region_num", scope: !472, file: !473, line: 200, type: !117)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, elements: !436)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !594, line: 52, size: 96, elements: !595)
!594 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !593, file: !594, line: 53, baseType: !22, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !593, file: !594, line: 54, baseType: !390, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !593, file: !594, line: 55, baseType: !599, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !600, line: 304, baseType: !601)
!600 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 301, size: 32, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !601, file: !600, line: 302, baseType: !300, size: 16)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !601, file: !600, line: 303, baseType: !300, size: 16, offset: 16)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 96, elements: !367)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !609, file: !663, line: 39, type: !117, isLocal: true, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !611, globals: !654, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!611 = !{!612, !107, !108, !640}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !614, line: 1495, baseType: !615)
!614 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 1474, size: 448, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !630}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !615, file: !614, line: 1476, baseType: !262, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !615, file: !614, line: 1477, baseType: !263, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !615, file: !614, line: 1478, baseType: !263, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !615, file: !614, line: 1479, baseType: !263, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !615, file: !614, line: 1480, baseType: !263, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !615, file: !614, line: 1481, baseType: !263, size: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !615, file: !614, line: 1482, baseType: !263, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !615, file: !614, line: 1483, baseType: !263, size: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !615, file: !614, line: 1484, baseType: !263, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !615, file: !614, line: 1485, baseType: !263, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !615, file: !614, line: 1486, baseType: !263, size: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !615, file: !614, line: 1487, baseType: !629, size: 32, offset: 352)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 32, elements: !367)
!630 = !DIDerivedType(tag: DW_TAG_member, scope: !615, file: !614, line: 1488, baseType: !631, size: 64, offset: 384)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !615, file: !614, line: 1488, size: 64, elements: !632)
!632 = !{!633, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !631, file: !614, line: 1489, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !509)
!635 = !DIDerivedType(tag: DW_TAG_member, scope: !631, file: !614, line: 1490, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !631, file: !614, line: 1490, size: 64, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !636, file: !614, line: 1491, baseType: !263, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !636, file: !614, line: 1492, baseType: !263, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !643, line: 27, size: 128, elements: !644)
!643 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!644 = !{!645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !642, file: !643, line: 29, baseType: !102, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !642, file: !643, line: 31, baseType: !134, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !642, file: !643, line: 37, baseType: !648, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !600, line: 298, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !600, line: 289, size: 64, elements: !650)
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !649, file: !600, line: 291, baseType: !117, size: 5, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !649, file: !600, line: 293, baseType: !117, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !649, file: !600, line: 295, baseType: !102, size: 32, offset: 32)
!654 = !{!607, !655}
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !609, file: !657, line: 31, type: !658, isLocal: true, isDefinition: true)
!657 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 160, elements: !367)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !657, line: 21, size: 160, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !659, file: !657, line: 22, baseType: !108, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !659, file: !657, line: 23, baseType: !642, size: 128, offset: 32)
!663 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !666, file: !673, line: 21, type: !236, isLocal: true, isDefinition: true)
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !668, globals: !672, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!668 = !{!669, !108, !107}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !671, line: 22, baseType: !108)
!671 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = !{!664}
!673 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !676, file: !681, line: 13, type: !700, isLocal: true, isDefinition: true)
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !678, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!678 = !{!679, !674}
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "mpu_config", scope: !676, file: !681, line: 37, type: !682, isLocal: false, isDefinition: true)
!681 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !643, line: 41, size: 64, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !683, file: !643, line: 43, baseType: !102, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !683, file: !643, line: 45, baseType: !687, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !643, line: 27, size: 128, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !689, file: !643, line: 29, baseType: !102, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !689, file: !643, line: 31, baseType: !134, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !689, file: !643, line: 37, baseType: !694, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !600, line: 298, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !600, line: 289, size: 64, elements: !696)
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !695, file: !600, line: 291, baseType: !117, size: 5, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !695, file: !600, line: 293, baseType: !117, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !695, file: !600, line: 295, baseType: !102, size: 32, offset: 32)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 256, elements: !509)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "__device_dts_ord_35", scope: !703, file: !907, line: 733, type: !1010, isLocal: false, isDefinition: true, align: 32)
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !705, retainedTypes: !823, globals: !903, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/drivers/counter/alarm")
!705 = !{!706, !712, !30, !717, !722, !726, !730, !734, !740, !744, !788, !795, !814}
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !707, line: 23, baseType: !32, size: 32, elements: !708)
!707 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = !{!709, !710, !711}
!709 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!710 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!711 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !707, line: 48, baseType: !32, size: 32, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!715 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!716 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !718, line: 167, baseType: !32, size: 32, elements: !719)
!718 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = !{!720, !721}
!720 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!721 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !718, line: 107, baseType: !32, size: 32, elements: !723)
!723 = !{!724, !725}
!724 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!725 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !718, line: 208, baseType: !32, size: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!729 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !718, line: 261, baseType: !32, size: 32, elements: !731)
!731 = !{!732, !733}
!732 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!733 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !718, line: 237, baseType: !32, size: 32, elements: !735)
!735 = !{!736, !737, !738, !739}
!736 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!737 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!738 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!739 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!740 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !718, line: 152, baseType: !32, size: 32, elements: !741)
!741 = !{!742, !743}
!742 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!743 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 71, baseType: !108, size: 32, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787}
!746 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!747 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!748 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!749 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!750 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!751 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!752 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!753 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!754 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!755 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!756 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!757 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!758 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!759 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!760 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!761 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!762 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!763 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!764 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!765 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!766 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!767 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!768 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!769 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!770 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!771 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!772 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!773 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!774 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!775 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!776 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!777 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!778 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!779 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!780 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!781 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!782 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!783 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!784 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!785 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!786 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!787 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !789, line: 44, baseType: !32, size: 32, elements: !790)
!789 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = !{!791, !792, !793, !794}
!791 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!792 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!793 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!794 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !796, line: 54, baseType: !32, size: 32, elements: !797)
!796 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!798 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!799 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!800 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!801 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!802 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!803 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!804 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!805 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!806 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!807 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!808 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!809 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!810 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!811 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!812 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!813 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !815, line: 53, baseType: !32, size: 32, elements: !816)
!815 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !{!817, !818, !819, !820, !821, !822}
!817 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!818 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!819 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!820 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!821 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!822 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!823 = !{!706, !107, !108, !824, !866, !867, !868, !869, !103, !102, !167, !145, !870, !871, !403, !872, !902, !390}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !257, line: 923, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 883, size: 10464, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !836, !837, !838, !839, !840, !841, !842, !843, !847, !848, !849, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !826, file: !257, line: 884, baseType: !263, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !826, file: !257, line: 885, baseType: !263, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !826, file: !257, line: 886, baseType: !263, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !826, file: !257, line: 887, baseType: !263, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !826, file: !257, line: 888, baseType: !833, size: 896, offset: 128)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 896, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 28)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !826, file: !257, line: 889, baseType: !263, size: 32, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !826, file: !257, line: 890, baseType: !263, size: 32, offset: 1056)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !826, file: !257, line: 891, baseType: !263, size: 32, offset: 1088)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !826, file: !257, line: 892, baseType: !263, size: 32, offset: 1120)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !826, file: !257, line: 893, baseType: !833, size: 896, offset: 1152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !826, file: !257, line: 894, baseType: !263, size: 32, offset: 2048)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !826, file: !257, line: 895, baseType: !263, size: 32, offset: 2080)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !826, file: !257, line: 896, baseType: !844, size: 960, offset: 2112)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 960, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 30)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !826, file: !257, line: 897, baseType: !263, size: 32, offset: 3072)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !826, file: !257, line: 898, baseType: !263, size: 32, offset: 3104)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !826, file: !257, line: 899, baseType: !850, size: 3008, offset: 3136)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 3008, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 94)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !826, file: !257, line: 900, baseType: !263, size: 32, offset: 6144)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !826, file: !257, line: 901, baseType: !263, size: 32, offset: 6176)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !826, file: !257, line: 902, baseType: !263, size: 32, offset: 6208)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !826, file: !257, line: 903, baseType: !262, size: 32, offset: 6240)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !826, file: !257, line: 904, baseType: !270, size: 1984, offset: 6272)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !826, file: !257, line: 905, baseType: !262, size: 32, offset: 8256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !826, file: !257, line: 907, baseType: !262, size: 32, offset: 8288)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !826, file: !257, line: 910, baseType: !262, size: 32, offset: 8320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !826, file: !257, line: 911, baseType: !262, size: 32, offset: 8352)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !826, file: !257, line: 913, baseType: !262, size: 32, offset: 8384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !826, file: !257, line: 917, baseType: !262, size: 32, offset: 8416)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !826, file: !257, line: 919, baseType: !270, size: 1984, offset: 8448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !826, file: !257, line: 920, baseType: !263, size: 32, offset: 10432)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !718, line: 146, baseType: !722)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !718, line: 164, baseType: !740)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !614, line: 485, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 468, size: 28704, elements: !875)
!875 = !{!876, !880, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !897, !901}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !874, file: !614, line: 470, baseType: !877, size: 512)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 512, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 16)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !874, file: !614, line: 471, baseType: !881, size: 512, offset: 512)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, elements: !878)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !874, file: !614, line: 472, baseType: !877, size: 512, offset: 1024)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !874, file: !614, line: 473, baseType: !881, size: 512, offset: 1536)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !874, file: !614, line: 474, baseType: !877, size: 512, offset: 2048)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !874, file: !614, line: 475, baseType: !881, size: 512, offset: 2560)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !874, file: !614, line: 476, baseType: !877, size: 512, offset: 3072)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !874, file: !614, line: 477, baseType: !881, size: 512, offset: 3584)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !874, file: !614, line: 478, baseType: !877, size: 512, offset: 4096)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !874, file: !614, line: 479, baseType: !881, size: 512, offset: 4608)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !874, file: !614, line: 480, baseType: !877, size: 512, offset: 5120)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !874, file: !614, line: 481, baseType: !881, size: 512, offset: 5632)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !874, file: !614, line: 482, baseType: !893, size: 3968, offset: 6144)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 3968, elements: !895)
!894 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!895 = !{!896}
!896 = !DISubrange(count: 496)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !874, file: !614, line: 483, baseType: !898, size: 18560, offset: 10112)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 18560, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 580)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !874, file: !614, line: 484, baseType: !263, size: 32, offset: 28672)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !789, line: 56, baseType: !107)
!903 = !{!904, !954, !995, !701, !1000, !1025, !1027, !1044, !1046, !1056, !1059, !1074, !1111, !1125}
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "on", scope: !906, file: !907, line: 549, type: !380, isLocal: true, isDefinition: true)
!906 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !907, file: !907, line: 547, type: !908, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !703, retainedNodes: !910)
!907 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!908 = !DISubroutineType(types: !909)
!909 = !{null, !712}
!910 = !{!911, !912, !915}
!911 = !DILocalVariable(name: "start_mode", arg: 1, scope: !906, file: !907, line: 547, type: !712)
!912 = !DILocalVariable(name: "err", scope: !913, file: !907, line: 553, type: !108)
!913 = distinct !DILexicalBlock(scope: !914, file: !907, line: 552, column: 31)
!914 = distinct !DILexicalBlock(scope: !906, file: !907, line: 552, column: 6)
!915 = !DILocalVariable(name: "mgr", scope: !913, file: !907, line: 554, type: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !918, line: 154, size: 224, elements: !919)
!918 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!919 = !{!920, !932, !933, !949, !951, !952, !953}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !917, file: !918, line: 158, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !338, line: 40, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !338, line: 35, size: 64, elements: !923)
!923 = !{!924, !931}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !922, file: !338, line: 36, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !338, line: 33, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !338, line: 29, size: 32, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !927, file: !338, line: 30, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !922, file: !338, line: 37, baseType: !925, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !917, file: !918, line: 163, baseType: !921, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !917, file: !918, line: 166, baseType: !934, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !918, line: 133, size: 96, elements: !937)
!937 = !{!938, !947, !948}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !936, file: !918, line: 135, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !918, line: 129, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !916, !943}
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !918, line: 101, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !916, !108}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !936, file: !918, line: 138, baseType: !939, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !936, file: !918, line: 143, baseType: !939, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !917, file: !918, line: 169, baseType: !950, offset: 160)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !354, line: 43, elements: !355)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !917, file: !918, line: 172, baseType: !108, size: 32, offset: 160)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !917, file: !918, line: 175, baseType: !300, size: 16, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !917, file: !918, line: 178, baseType: !300, size: 16, offset: 208)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "cli", scope: !906, file: !907, line: 550, type: !956, isLocal: true, isDefinition: true)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !918, line: 273, size: 128, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !956, file: !918, line: 280, baseType: !926, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !956, file: !918, line: 283, baseType: !960, size: 96, offset: 32)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !961, line: 138, size: 96, elements: !962)
!961 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!962 = !{!963, !992, !993}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !960, file: !961, line: 149, baseType: !964, size: 32)
!964 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !961, line: 139, size: 32, elements: !965)
!965 = !{!966, !987}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !964, file: !961, line: 145, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !570, line: 5397, size: 128, elements: !969)
!969 = !{!970, !985, !986}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !968, file: !570, line: 5399, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !488, line: 48, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !488, line: 37, size: 64, elements: !973)
!973 = !{!974, !980}
!974 = !DIDerivedType(tag: DW_TAG_member, scope: !972, file: !488, line: 38, baseType: !975, size: 32)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !972, file: !488, line: 38, size: 32, elements: !976)
!976 = !{!977, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !975, file: !488, line: 39, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !975, file: !488, line: 40, baseType: !978, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, scope: !972, file: !488, line: 42, baseType: !981, size: 32, offset: 32)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !972, file: !488, line: 42, size: 32, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !981, file: !488, line: 43, baseType: !978, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !981, file: !488, line: 44, baseType: !978, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !968, file: !570, line: 5405, baseType: !32, size: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !968, file: !570, line: 5408, baseType: !108, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !964, file: !961, line: 148, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !961, line: 98, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DISubroutineType(types: !991)
!991 = !{null, null}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !960, file: !961, line: 165, baseType: !263, size: 32, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !960, file: !961, line: 174, baseType: !994, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !703, file: !907, line: 733, type: !997, isLocal: false, isDefinition: true, align: 16)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 80, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 5)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_35", scope: !703, file: !907, line: 733, type: !1002, isLocal: true, isDefinition: true, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !305, line: 51, size: 64, elements: !1004)
!1004 = !{!1005, !1024}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1003, file: !305, line: 60, baseType: !1006, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!108, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !131, line: 378, size: 192, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1022, !1023}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1011, file: !131, line: 380, baseType: !134, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1011, file: !131, line: 382, baseType: !13, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1011, file: !131, line: 384, baseType: !13, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1011, file: !131, line: 386, baseType: !1017, size: 32, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !131, line: 351, size: 16, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1018, file: !131, line: 359, baseType: !117, size: 8)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1018, file: !131, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1011, file: !131, line: 388, baseType: !107, size: 32, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1011, file: !131, line: 396, baseType: !148, size: 32, offset: 160)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1003, file: !305, line: 65, baseType: !1009, size: 32, offset: 32)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !703, file: !907, line: 79, type: !380, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "data", scope: !703, file: !907, line: 702, type: !1029, isLocal: true, isDefinition: true)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !907, line: 69, size: 640, elements: !1030)
!1030 = !{!1031, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1029, file: !907, line: 70, baseType: !1032, size: 448)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 448, elements: !509)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1029, file: !907, line: 71, baseType: !1034, size: 192, offset: 448)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 192, elements: !509)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !907, line: 52, size: 96, elements: !1036)
!1036 = !{!1037, !1042, !1043}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1035, file: !907, line: 53, baseType: !1038, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !789, line: 72, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !1009, !902, !107}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1035, file: !907, line: 54, baseType: !107, size: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1035, file: !907, line: 55, baseType: !102, size: 32, offset: 64)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_35", scope: !703, file: !907, line: 733, type: !1018, isLocal: true, isDefinition: true, align: 8)
