; ModuleID = 'build/actinius_icarus_bee/tmp112/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !111, file: !173, line: 65, type: !174, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !166, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!113 = !{!102, !103, !114, !119, !126}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !116, file: !115, line: 167, baseType: !125)
!115 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !115, file: !115, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!120 = !{!121, !122, !124}
!121 = !DILocalVariable(name: "time_us", arg: 1, scope: !116, file: !115, line: 134, type: !119)
!122 = !DILocalVariable(name: "delay_cycles", scope: !116, file: !115, line: 168, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!124 = !DILocalVariable(name: "cycles", scope: !116, file: !115, line: 171, type: !119)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !128, line: 1928, baseType: !129)
!128 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 1909, size: 11360, elements: !130)
!130 = !{!131, !137, !138, !139, !140, !144, !145, !146, !147, !151, !152, !156, !157, !158, !159, !160, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !129, file: !128, line: 1910, baseType: !132, size: 8192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !119)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !129, file: !128, line: 1911, baseType: !133, size: 32, offset: 8192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !129, file: !128, line: 1912, baseType: !133, size: 32, offset: 8224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !129, file: !128, line: 1913, baseType: !133, size: 32, offset: 8256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !129, file: !128, line: 1914, baseType: !141, size: 1984, offset: 8288)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1984, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 62)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !129, file: !128, line: 1915, baseType: !134, size: 32, offset: 10272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !129, file: !128, line: 1916, baseType: !133, size: 32, offset: 10304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !129, file: !128, line: 1917, baseType: !134, size: 32, offset: 10336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !129, file: !128, line: 1918, baseType: !148, size: 96, offset: 10368)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !129, file: !128, line: 1919, baseType: !134, size: 32, offset: 10464)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !129, file: !128, line: 1920, baseType: !153, size: 256, offset: 10496)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !129, file: !128, line: 1921, baseType: !134, size: 32, offset: 10752)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !129, file: !128, line: 1922, baseType: !133, size: 32, offset: 10784)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !129, file: !128, line: 1923, baseType: !134, size: 32, offset: 10816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !129, file: !128, line: 1924, baseType: !134, size: 32, offset: 10848)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !129, file: !128, line: 1925, baseType: !161, size: 416, offset: 10880)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !129, file: !128, line: 1926, baseType: !134, size: 32, offset: 11296)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !129, file: !128, line: 1927, baseType: !134, size: 32, offset: 11328)
!166 = !{!109, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !116, file: !115, line: 161, type: !169, isLocal: true, isDefinition: true, align: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !149)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !177)
!176 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !{!178, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !176, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !175, file: !176, line: 65, baseType: !182, size: 32, offset: 32)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !188, file: !230, line: 27, type: !260, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !202, globals: !227, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!190 = !{!191, !30}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !192, line: 27, baseType: !32, size: 32, elements: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!195 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!196 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!197 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!198 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!199 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!200 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!201 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!202 = !{!102, !203, !103, !24, !207, !223, !119, !225}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !204, line: 46, baseType: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !206)
!206 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !209, line: 54, size: 96, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !218, !222}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !208, file: !209, line: 55, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !214)
!213 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !213, line: 30, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !208, file: !209, line: 60, baseType: !219, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !191}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !208, file: !209, line: 65, baseType: !219, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !226)
!226 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!227 = !{!186, !228, !235, !237, !250, !252}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !188, file: !230, line: 44, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, size: 32, elements: !233)
!232 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !231, file: !232, line: 52, baseType: !22, size: 32)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !188, file: !230, line: 49, type: !231, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !188, file: !230, line: 36, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 128, elements: !248)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !241)
!241 = !{!242, !243, !246, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !240, file: !192, line: 115, baseType: !191, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !240, file: !192, line: 141, baseType: !244, size: 8, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !245)
!245 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !240, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !240, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!248 = !{!249}
!249 = !DISubrange(count: 1)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !188, file: !230, line: 40, type: !239, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !188, file: !230, line: 28, type: !254, isLocal: true, isDefinition: true)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !256)
!256 = !{!257, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !255, file: !213, line: 36, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !255, file: !213, line: 37, baseType: !258, size: 32, offset: 32)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 32, elements: !248)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !262, line: 22, baseType: !263)
!262 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!263 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!264 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!265 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !268, file: !299, line: 50, type: !286, isLocal: true, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !270, globals: !296, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!270 = !{!271, !203, !273, !103, !102, !119, !225, !275, !223, !286, !287}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !272)
!272 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !274, line: 214, baseType: !32)
!274 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !277, line: 45, size: 64, elements: !278)
!277 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !{!279, !285}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !276, file: !277, line: 46, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !213, line: 30, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !276, file: !277, line: 48, baseType: !119, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !277, line: 38, size: 64, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !288, file: !277, line: 39, baseType: !280, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !288, file: !277, line: 41, baseType: !292, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !277, line: 35, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !286}
!296 = !{!297, !303, !311, !266, !313, !323}
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "latency_lock", scope: !268, file: !299, line: 44, type: !300, isLocal: true, isDefinition: true)
!299 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, size: 32, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !300, file: !232, line: 52, baseType: !22, size: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !268, file: !299, line: 46, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !307)
!307 = !{!308, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !306, file: !213, line: 36, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !306, file: !213, line: 37, baseType: !309, size: 32, offset: 32)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "latency_subs", scope: !268, file: !299, line: 52, type: !305, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !268, file: !299, line: 39, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, elements: !321)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 35, size: 96, elements: !317)
!317 = !{!318, !319, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !316, file: !299, line: 36, baseType: !191, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !316, file: !299, line: 37, baseType: !244, size: 8, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !316, file: !299, line: 38, baseType: !261, size: 32, offset: 64)
!321 = !{!322}
!322 = !DISubrange(count: 0)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !268, file: !299, line: 48, type: !286, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !327, file: !334, line: 47, type: !348, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !330, globals: !331, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!329 = !{!191}
!330 = !{!273, !103}
!331 = !{!332, !325, !344}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "cpus_states", scope: !327, file: !334, line: 50, type: !335, isLocal: true, isDefinition: true)
!334 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 32, elements: !248)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !339)
!339 = !{!340, !341, !342, !343}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !338, file: !192, line: 115, baseType: !191, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !338, file: !192, line: 141, baseType: !244, size: 8, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !338, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !338, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !327, file: !334, line: 55, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 8, elements: !248)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, elements: !321)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions", scope: !351, file: !358, line: 62, type: !492, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !354, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!353 = !{!273, !103, !119, !102}
!354 = !{!355, !349}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !357, file: !358, line: 198, type: !479, isLocal: true, isDefinition: true)
!357 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !358, file: !358, line: 175, type: !359, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !351, retainedNodes: !476)
!358 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !363, line: 245, size: 1024, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !430, !443, !444, !445, !446, !452, !471}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !362, file: !363, line: 247, baseType: !366, size: 384)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !363, line: 57, size: 384, elements: !367)
!367 = !{!368, !396, !404, !405, !406, !417, !418, !419}
!368 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !363, line: 60, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !363, line: 60, size: 64, elements: !370)
!370 = !{!371, !387}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !369, file: !363, line: 61, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !373, line: 49, baseType: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !373, line: 37, size: 64, elements: !375)
!375 = !{!376, !382}
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !373, line: 38, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !373, line: 38, size: 32, elements: !378)
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !377, file: !373, line: 39, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !373, line: 40, baseType: !380, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !373, line: 42, baseType: !383, size: 32, offset: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !373, line: 42, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !383, file: !373, line: 43, baseType: !380, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !373, line: 44, baseType: !380, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !369, file: !363, line: 62, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !389, line: 49, size: 64, elements: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !388, file: !389, line: 50, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 64, elements: !394)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!394 = !{!395}
!395 = !DISubrange(count: 2)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !366, file: !363, line: 68, baseType: !397, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !399, line: 233, baseType: !400)
!399 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 231, size: 64, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !400, file: !399, line: 232, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !373, line: 48, baseType: !374)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !366, file: !363, line: 71, baseType: !244, size: 8, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !366, file: !363, line: 74, baseType: !244, size: 8, offset: 104)
!406 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !363, line: 90, baseType: !407, size: 16, offset: 112)
!407 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !363, line: 90, size: 16, elements: !408)
!408 = !{!409, !416}
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !407, file: !363, line: 91, baseType: !410, size: 16)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !363, line: 91, size: 16, elements: !411)
!411 = !{!412, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !410, file: !363, line: 96, baseType: !413, size: 8)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !414)
!414 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !410, file: !363, line: 97, baseType: !244, size: 8, offset: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !407, file: !363, line: 100, baseType: !171, size: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !366, file: !363, line: 107, baseType: !119, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !366, file: !363, line: 127, baseType: !102, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !366, file: !363, line: 131, baseType: !420, size: 192, offset: 192)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !399, line: 244, size: 192, elements: !421)
!421 = !{!422, !423, !429}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !420, file: !399, line: 245, baseType: !372, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !420, file: !399, line: 246, baseType: !424, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !399, line: 242, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !420, file: !399, line: 249, baseType: !205, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !362, file: !363, line: 250, baseType: !431, size: 288, offset: 384)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !432, line: 25, size: 288, elements: !433)
!432 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !431, file: !432, line: 26, baseType: !119, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !431, file: !432, line: 27, baseType: !119, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !431, file: !432, line: 28, baseType: !119, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !431, file: !432, line: 29, baseType: !119, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !431, file: !432, line: 30, baseType: !119, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !431, file: !432, line: 31, baseType: !119, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !431, file: !432, line: 32, baseType: !119, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !431, file: !432, line: 33, baseType: !119, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !431, file: !432, line: 34, baseType: !119, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !362, file: !363, line: 253, baseType: !102, size: 32, offset: 672)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !362, file: !363, line: 256, baseType: !398, size: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !362, file: !363, line: 294, baseType: !103, size: 32, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !362, file: !363, line: 300, baseType: !447, size: 96, offset: 800)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !363, line: 149, size: 96, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !447, file: !363, line: 153, baseType: !22, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !363, line: 162, baseType: !273, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !447, file: !363, line: 168, baseType: !273, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !362, file: !363, line: 325, baseType: !453, size: 32, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !455, line: 5073, size: 192, elements: !456)
!455 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!456 = !{!457, !466, !467}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !454, file: !455, line: 5074, baseType: !458, size: 96)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !459, line: 56, size: 96, elements: !460)
!459 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !{!461, !464, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !458, file: !459, line: 57, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !459, line: 57, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !458, file: !459, line: 58, baseType: !102, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !458, file: !459, line: 59, baseType: !273, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !454, file: !455, line: 5075, baseType: !398, size: 64, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !454, file: !455, line: 5076, baseType: !468, size: 32, offset: 160)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, size: 32, elements: !469)
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !468, file: !232, line: 52, baseType: !22, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !362, file: !363, line: 343, baseType: !472, size: 64, offset: 928)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !432, line: 60, size: 64, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !472, file: !432, line: 63, baseType: !119, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !472, file: !432, line: 66, baseType: !119, size: 32, offset: 32)
!476 = !{!477, !478}
!477 = !DILocalVariable(name: "thread", arg: 1, scope: !357, file: !358, line: 175, type: !361)
!478 = !DILocalVariable(name: "region_num", scope: !357, file: !358, line: 200, type: !244)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, elements: !321)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !481, line: 52, size: 96, elements: !482)
!481 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !480, file: !481, line: 53, baseType: !22, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !480, file: !481, line: 54, baseType: !273, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !480, file: !481, line: 55, baseType: !486, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !487, line: 304, baseType: !488)
!487 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !487, line: 301, size: 32, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !488, file: !487, line: 302, baseType: !171, size: 16)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !488, file: !487, line: 303, baseType: !171, size: 16, offset: 16)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 96, elements: !248)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !496, file: !552, line: 39, type: !244, isLocal: true, isDefinition: true)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !498, globals: !543, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!498 = !{!499, !102, !103, !527}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !501, line: 1495, baseType: !502)
!501 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 1474, size: 448, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !517}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !502, file: !501, line: 1476, baseType: !133, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !502, file: !501, line: 1477, baseType: !134, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !502, file: !501, line: 1478, baseType: !134, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !502, file: !501, line: 1479, baseType: !134, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !502, file: !501, line: 1480, baseType: !134, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !502, file: !501, line: 1481, baseType: !134, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !502, file: !501, line: 1482, baseType: !134, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !502, file: !501, line: 1483, baseType: !134, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !502, file: !501, line: 1484, baseType: !134, size: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !502, file: !501, line: 1485, baseType: !134, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !502, file: !501, line: 1486, baseType: !134, size: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !502, file: !501, line: 1487, baseType: !516, size: 32, offset: 352)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !248)
!517 = !DIDerivedType(tag: DW_TAG_member, scope: !502, file: !501, line: 1488, baseType: !518, size: 64, offset: 384)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !502, file: !501, line: 1488, size: 64, elements: !519)
!519 = !{!520, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !518, file: !501, line: 1489, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !394)
!522 = !DIDerivedType(tag: DW_TAG_member, scope: !518, file: !501, line: 1490, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !501, line: 1490, size: 64, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !523, file: !501, line: 1491, baseType: !134, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !523, file: !501, line: 1492, baseType: !134, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !530, line: 27, size: 128, elements: !531)
!530 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !{!532, !533, !536}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !529, file: !530, line: 29, baseType: !119, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !529, file: !530, line: 31, baseType: !534, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !529, file: !530, line: 37, baseType: !537, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !487, line: 298, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !487, line: 289, size: 64, elements: !539)
!539 = !{!540, !541, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !538, file: !487, line: 291, baseType: !244, size: 5, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !538, file: !487, line: 293, baseType: !244, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !538, file: !487, line: 295, baseType: !119, size: 32, offset: 32)
!543 = !{!494, !544}
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !496, file: !546, line: 31, type: !547, isLocal: true, isDefinition: true)
!546 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 160, elements: !248)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !546, line: 21, size: 160, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !548, file: !546, line: 22, baseType: !103, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !548, file: !546, line: 23, baseType: !529, size: 128, offset: 32)
!552 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !555, file: !562, line: 21, type: !106, isLocal: true, isDefinition: true)
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !557, globals: !561, splitDebugInlining: false, nameTableKind: None)
!556 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!557 = !{!558, !103, !102}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !560, line: 22, baseType: !103)
!560 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!561 = !{!553}
!562 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !565, file: !570, line: 13, type: !589, isLocal: true, isDefinition: true)
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !567, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!567 = !{!568, !563}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "mpu_config", scope: !565, file: !570, line: 37, type: !571, isLocal: false, isDefinition: true)
!570 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !530, line: 41, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !572, file: !530, line: 43, baseType: !119, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !572, file: !530, line: 45, baseType: !576, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !530, line: 27, size: 128, elements: !579)
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !578, file: !530, line: 29, baseType: !119, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !578, file: !530, line: 31, baseType: !534, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !578, file: !530, line: 37, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !487, line: 298, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !487, line: 289, size: 64, elements: !585)
!585 = !{!586, !587, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !584, file: !487, line: 291, baseType: !244, size: 5, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !584, file: !487, line: 293, baseType: !244, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !584, file: !487, line: 295, baseType: !119, size: 32, offset: 32)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 256, elements: !394)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "__device_dts_ord_54", scope: !592, file: !797, line: 733, type: !905, isLocal: false, isDefinition: true, align: 32)
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !594, retainedTypes: !712, globals: !793, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!594 = !{!595, !601, !30, !606, !611, !615, !619, !623, !629, !633, !677, !684, !703}
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !596, line: 23, baseType: !32, size: 32, elements: !597)
!596 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!597 = !{!598, !599, !600}
!598 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!599 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!600 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!601 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !596, line: 48, baseType: !32, size: 32, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!604 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!605 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 167, baseType: !32, size: 32, elements: !608)
!607 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!608 = !{!609, !610}
!609 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!610 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 107, baseType: !32, size: 32, elements: !612)
!612 = !{!613, !614}
!613 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!614 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 208, baseType: !32, size: 32, elements: !616)
!616 = !{!617, !618}
!617 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!618 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 261, baseType: !32, size: 32, elements: !620)
!620 = !{!621, !622}
!621 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!622 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 237, baseType: !32, size: 32, elements: !624)
!624 = !{!625, !626, !627, !628}
!625 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!626 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!627 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!628 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 152, baseType: !32, size: 32, elements: !630)
!630 = !{!631, !632}
!631 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!632 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 71, baseType: !103, size: 32, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!635 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!636 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!637 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!638 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!639 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!640 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!641 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!642 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!643 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!644 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!645 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!646 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!647 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!648 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!649 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!650 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!651 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!652 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!653 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!654 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!655 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!656 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!657 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!658 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!659 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!660 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!661 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!662 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!663 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!664 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!665 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!666 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!667 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!668 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!669 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!670 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!671 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!672 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!673 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!674 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!675 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!676 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !678, line: 44, baseType: !32, size: 32, elements: !679)
!678 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!679 = !{!680, !681, !682, !683}
!680 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!681 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!682 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!683 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 54, baseType: !32, size: 32, elements: !686)
!685 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!687 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!688 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!689 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!690 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!691 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!692 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!693 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!694 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!695 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!696 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!697 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!698 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!699 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!700 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!701 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!702 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !704, line: 53, baseType: !32, size: 32, elements: !705)
!704 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = !{!706, !707, !708, !709, !710, !711}
!706 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!707 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!708 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!709 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!710 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!711 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!712 = !{!595, !102, !103, !713, !755, !756, !757, !758, !203, !119, !225, !759, !760, !761, !286, !762, !792, !273}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !128, line: 923, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 883, size: 10464, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !725, !726, !727, !728, !729, !730, !731, !732, !736, !737, !738, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !715, file: !128, line: 884, baseType: !134, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !715, file: !128, line: 885, baseType: !134, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !715, file: !128, line: 886, baseType: !134, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !715, file: !128, line: 887, baseType: !134, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !715, file: !128, line: 888, baseType: !722, size: 896, offset: 128)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 28)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !715, file: !128, line: 889, baseType: !134, size: 32, offset: 1024)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !715, file: !128, line: 890, baseType: !134, size: 32, offset: 1056)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !715, file: !128, line: 891, baseType: !134, size: 32, offset: 1088)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !715, file: !128, line: 892, baseType: !134, size: 32, offset: 1120)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !715, file: !128, line: 893, baseType: !722, size: 896, offset: 1152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !715, file: !128, line: 894, baseType: !134, size: 32, offset: 2048)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !715, file: !128, line: 895, baseType: !134, size: 32, offset: 2080)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !715, file: !128, line: 896, baseType: !733, size: 960, offset: 2112)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 960, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 30)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !715, file: !128, line: 897, baseType: !134, size: 32, offset: 3072)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !715, file: !128, line: 898, baseType: !134, size: 32, offset: 3104)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !715, file: !128, line: 899, baseType: !739, size: 3008, offset: 3136)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3008, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 94)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !715, file: !128, line: 900, baseType: !134, size: 32, offset: 6144)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !715, file: !128, line: 901, baseType: !134, size: 32, offset: 6176)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !715, file: !128, line: 902, baseType: !134, size: 32, offset: 6208)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !715, file: !128, line: 903, baseType: !133, size: 32, offset: 6240)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !715, file: !128, line: 904, baseType: !141, size: 1984, offset: 6272)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !715, file: !128, line: 905, baseType: !133, size: 32, offset: 8256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !715, file: !128, line: 907, baseType: !133, size: 32, offset: 8288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !715, file: !128, line: 910, baseType: !133, size: 32, offset: 8320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !715, file: !128, line: 911, baseType: !133, size: 32, offset: 8352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !715, file: !128, line: 913, baseType: !133, size: 32, offset: 8384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !715, file: !128, line: 917, baseType: !133, size: 32, offset: 8416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !715, file: !128, line: 919, baseType: !141, size: 1984, offset: 8448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !715, file: !128, line: 920, baseType: !134, size: 32, offset: 10432)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !607, line: 146, baseType: !611)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !607, line: 164, baseType: !629)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!759 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !501, line: 485, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 468, size: 28704, elements: !765)
!765 = !{!766, !770, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !787, !791}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !764, file: !501, line: 470, baseType: !767, size: 512)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 16)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !764, file: !501, line: 471, baseType: !771, size: 512, offset: 512)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !764, file: !501, line: 472, baseType: !767, size: 512, offset: 1024)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !764, file: !501, line: 473, baseType: !771, size: 512, offset: 1536)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !764, file: !501, line: 474, baseType: !767, size: 512, offset: 2048)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !764, file: !501, line: 475, baseType: !771, size: 512, offset: 2560)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !764, file: !501, line: 476, baseType: !767, size: 512, offset: 3072)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !764, file: !501, line: 477, baseType: !771, size: 512, offset: 3584)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !764, file: !501, line: 478, baseType: !767, size: 512, offset: 4096)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !764, file: !501, line: 479, baseType: !771, size: 512, offset: 4608)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !764, file: !501, line: 480, baseType: !767, size: 512, offset: 5120)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !764, file: !501, line: 481, baseType: !771, size: 512, offset: 5632)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !764, file: !501, line: 482, baseType: !783, size: 3968, offset: 6144)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 3968, elements: !785)
!784 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !244)
!785 = !{!786}
!786 = !DISubrange(count: 496)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !764, file: !501, line: 483, baseType: !788, size: 18560, offset: 10112)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 18560, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 580)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !764, file: !501, line: 484, baseType: !134, size: 32, offset: 28672)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !678, line: 56, baseType: !102)
!793 = !{!794, !846, !887, !590, !895, !921, !923, !940, !942, !952, !955, !970, !1008, !1022}
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "on", scope: !796, file: !797, line: 549, type: !261, isLocal: true, isDefinition: true)
!796 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !797, file: !797, line: 547, type: !798, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !592, retainedNodes: !800)
!797 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !DISubroutineType(types: !799)
!799 = !{null, !601}
!800 = !{!801, !802, !805}
!801 = !DILocalVariable(name: "start_mode", arg: 1, scope: !796, file: !797, line: 547, type: !601)
!802 = !DILocalVariable(name: "err", scope: !803, file: !797, line: 553, type: !103)
!803 = distinct !DILexicalBlock(scope: !804, file: !797, line: 552, column: 31)
!804 = distinct !DILexicalBlock(scope: !796, file: !797, line: 552, column: 6)
!805 = !DILocalVariable(name: "mgr", scope: !803, file: !797, line: 554, type: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !808, line: 154, size: 256, elements: !809)
!808 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !{!810, !822, !823, !839, !843, !844, !845}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !807, file: !808, line: 158, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !813)
!813 = !{!814, !821}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !812, file: !213, line: 36, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !817, file: !213, line: 30, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !812, file: !213, line: 37, baseType: !815, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !807, file: !808, line: 163, baseType: !811, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !807, file: !808, line: 166, baseType: !824, size: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !808, line: 133, size: 96, elements: !827)
!827 = !{!828, !837, !838}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !826, file: !808, line: 135, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !808, line: 129, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !806, !833}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !808, line: 101, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !806, !103}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !826, file: !808, line: 138, baseType: !829, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !826, file: !808, line: 143, baseType: !829, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !807, file: !808, line: 169, baseType: !840, size: 32, offset: 160)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, size: 32, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !840, file: !232, line: 52, baseType: !22, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !807, file: !808, line: 172, baseType: !103, size: 32, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !807, file: !808, line: 175, baseType: !171, size: 16, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !807, file: !808, line: 178, baseType: !171, size: 16, offset: 240)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "cli", scope: !796, file: !797, line: 550, type: !848, isLocal: true, isDefinition: true)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !808, line: 273, size: 128, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !848, file: !808, line: 280, baseType: !816, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !848, file: !808, line: 283, baseType: !852, size: 96, offset: 32)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !853, line: 138, size: 96, elements: !854)
!853 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !{!855, !884, !885}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !852, file: !853, line: 149, baseType: !856, size: 32)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !853, line: 139, size: 32, elements: !857)
!857 = !{!858, !879}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !856, file: !853, line: 145, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !455, line: 5397, size: 128, elements: !861)
!861 = !{!862, !877, !878}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !860, file: !455, line: 5399, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !373, line: 48, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !373, line: 37, size: 64, elements: !865)
!865 = !{!866, !872}
!866 = !DIDerivedType(tag: DW_TAG_member, scope: !864, file: !373, line: 38, baseType: !867, size: 32)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !864, file: !373, line: 38, size: 32, elements: !868)
!868 = !{!869, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !867, file: !373, line: 39, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !373, line: 40, baseType: !870, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, scope: !864, file: !373, line: 42, baseType: !873, size: 32, offset: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !864, file: !373, line: 42, size: 32, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !873, file: !373, line: 43, baseType: !870, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !873, file: !373, line: 44, baseType: !870, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !860, file: !455, line: 5405, baseType: !32, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !860, file: !455, line: 5408, baseType: !103, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !856, file: !853, line: 148, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !853, line: 98, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DISubroutineType(types: !883)
!883 = !{null, null}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !852, file: !853, line: 165, baseType: !134, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !852, file: !853, line: 174, baseType: !886, size: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !592, file: !797, line: 733, type: !889, isLocal: false, isDefinition: true, align: 16)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 80, elements: !893)
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !892, line: 43, baseType: !271)
!892 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!893 = !{!894}
!894 = !DISubrange(count: 5)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_54", scope: !592, file: !797, line: 733, type: !897, isLocal: true, isDefinition: true, align: 32)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !899)
!899 = !{!900, !920}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !898, file: !176, line: 60, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!103, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !892, line: 378, size: 192, elements: !907)
!907 = !{!908, !909, !910, !911, !917, !918}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !892, line: 380, baseType: !534, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !906, file: !892, line: 382, baseType: !13, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !906, file: !892, line: 384, baseType: !13, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !906, file: !892, line: 386, baseType: !912, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !892, line: 351, size: 16, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !913, file: !892, line: 359, baseType: !244, size: 8)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !913, file: !892, line: 364, baseType: !759, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !906, file: !892, line: 388, baseType: !102, size: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !906, file: !892, line: 396, baseType: !919, size: 32, offset: 160)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !898, file: !176, line: 65, baseType: !904, size: 32, offset: 32)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !592, file: !797, line: 79, type: !261, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "data", scope: !592, file: !797, line: 702, type: !925, isLocal: true, isDefinition: true)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !797, line: 69, size: 704, elements: !926)
!926 = !{!927, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !925, file: !797, line: 70, baseType: !928, size: 512)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 512, elements: !394)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !925, file: !797, line: 71, baseType: !930, size: 192, offset: 512)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 192, elements: !394)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !797, line: 52, size: 96, elements: !932)
!932 = !{!933, !938, !939}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !931, file: !797, line: 53, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !678, line: 72, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !904, !792, !102}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !931, file: !797, line: 54, baseType: !102, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !931, file: !797, line: 55, baseType: !119, size: 32, offset: 64)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_54", scope: !592, file: !797, line: 733, type: !913, isLocal: true, isDefinition: true, align: 8)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "d", scope: !944, file: !797, line: 476, type: !950, isLocal: true, isDefinition: true)
!944 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !797, file: !797, line: 474, type: !798, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !592, retainedNodes: !945)
!945 = !{!946, !947, !948, !949}
!946 = !DILocalVariable(name: "mode", arg: 1, scope: !944, file: !797, line: 474, type: !601)
!947 = !DILocalVariable(name: "type", scope: !944, file: !797, line: 486, type: !755)
!948 = !DILocalVariable(name: "isr_mode", scope: !944, file: !797, line: 500, type: !759)
!949 = !DILocalVariable(name: "key", scope: !944, file: !797, line: 501, type: !103)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !607, line: 177, baseType: !606)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "target_type", scope: !944, file: !797, line: 477, type: !954, isLocal: true, isDefinition: true)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "config", scope: !592, file: !797, line: 704, type: !957, isLocal: true, isDefinition: true)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !797, line: 74, size: 128, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !958, file: !797, line: 76, baseType: !961, size: 128)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 128, elements: !394)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !797, line: 61, size: 64, elements: !963)
!963 = !{!964, !969}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !962, file: !797, line: 62, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !797, line: 58, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DISubroutineType(types: !968)
!968 = !{null}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !962, file: !797, line: 63, baseType: !965, size: 32, offset: 32)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !592, file: !797, line: 695, type: !972, isLocal: true, isDefinition: true)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !678, line: 100, size: 224, elements: !974)
!974 = !{!975, !980, !981, !986, !992, !997, !1003}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !973, file: !678, line: 101, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !678, line: 76, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{!103, !904, !792}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !973, file: !678, line: 102, baseType: !976, size: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !973, file: !678, line: 103, baseType: !982, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !678, line: 83, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DISubroutineType(types: !985)
!985 = !{!103, !904, !792, !934, !102}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !973, file: !678, line: 104, baseType: !987, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !678, line: 79, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DISubroutineType(types: !990)
!990 = !{!103, !904, !792, !991}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !973, file: !678, line: 105, baseType: !993, size: 32, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !678, line: 88, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DISubroutineType(types: !996)
!996 = !{!677, !904, !792}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !973, file: !678, line: 106, baseType: !998, size: 32, offset: 160)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !678, line: 92, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!103, !904, !792, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !678, line: 64, baseType: !102)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !973, file: !678, line: 107, baseType: !1004, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !678, line: 96, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!103, !904, !792, !102}
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "transitions", scope: !1010, file: !797, line: 655, type: !825, isLocal: true, isDefinition: true)
!1010 = distinct !DISubprogram(name: "clk_init", scope: !797, file: !797, line: 651, type: !902, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !592, retainedNodes: !1011)
!1011 = !{!1012, !1013, !1015, !1016, !1018}
!1012 = !DILocalVariable(name: "dev", arg: 1, scope: !1010, file: !797, line: 651, type: !904)
!1013 = !DILocalVariable(name: "nrfx_err", scope: !1010, file: !797, line: 653, type: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !685, line: 72, baseType: !684)
!1015 = !DILocalVariable(name: "err", scope: !1010, file: !797, line: 654, type: !103)
!1016 = !DILocalVariable(name: "i", scope: !1017, file: !797, line: 678, type: !595)
!1017 = distinct !DILexicalBlock(scope: !1010, file: !797, line: 678, column: 2)
!1018 = !DILocalVariable(name: "subdata", scope: !1019, file: !797, line: 680, type: !1021)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !797, line: 679, column: 42)
!1020 = distinct !DILexicalBlock(scope: !1017, file: !797, line: 678, column: 2)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !1010, file: !797, line: 660, type: !1024, isLocal: true, isDefinition: true, align: 32)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1024, file: !10, line: 55, baseType: !286, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1024, file: !10, line: 57, baseType: !286, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1024, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1024, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !1032, file: !1037, line: 7, type: !1043, isLocal: false, isDefinition: true, align: 16)
!1032 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1033, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1034, splitDebugInlining: false, nameTableKind: None)
!1033 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!1034 = !{!1030, !1035, !1041, !1044, !1046}
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_6", scope: !1032, file: !1037, line: 14, type: !1038, isLocal: false, isDefinition: true, align: 16)
!1037 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/tmp112")
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 64, elements: !1039)
!1039 = !{!1040}
!1040 = !DISubrange(count: 4)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_82", scope: !1032, file: !1037, line: 19, type: !1043, isLocal: false, isDefinition: true, align: 16)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 48, elements: !149)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_98", scope: !1032, file: !1037, line: 26, type: !1038, isLocal: false, isDefinition: true, align: 16)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_99", scope: !1032, file: !1037, line: 34, type: !889, isLocal: false, isDefinition: true, align: 16)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
