; ModuleID = 'build/96b_neonkey/ipm_mcux/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 98, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5504, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 86)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2752, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "gcounter", scope: !27, file: !170, line: 12, type: !103, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !169, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !{!110, !143, !154, !159, !164}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 99, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!103, !115, !103, !142, !13, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !124, !125, !126, !135, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 380, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 386, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !128, file: !118, line: 359, baseType: !131, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !128, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !117, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !118, line: 43, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !141)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !107, file: !108, line: 100, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !115, !148, !104}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !115, !104, !142, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !107, file: !108, line: 101, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!103, !115}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !107, file: !108, line: 102, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!142, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !107, file: !108, line: 103, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !115, !103}
!169 = !{!25}
!170 = !DIFile(filename: "zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "_char_out", scope: !173, file: !177, line: 54, type: !178, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!175 = !{!104, !103}
!176 = !{!171}
!177 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!103, !103}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !183, file: !200, line: 56, type: !201, isLocal: true, isDefinition: true, align: 32)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !185, globals: !199, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !188, line: 259, baseType: !189)
!188 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f411xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 250, size: 224, elements: !190)
!190 = !{!191, !193, !194, !195, !196, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !189, file: !188, line: 252, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !189, file: !188, line: 253, baseType: !192, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !189, file: !188, line: 254, baseType: !192, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !189, file: !188, line: 255, baseType: !192, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !189, file: !188, line: 256, baseType: !192, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !189, file: !188, line: 257, baseType: !192, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !189, file: !188, line: 258, baseType: !192, size: 32, offset: 192)
!199 = !{!181}
!200 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !224}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !202, file: !203, line: 60, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DISubroutineType(types: !208)
!208 = !{!103, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !212)
!212 = !{!213, !214, !215, !216, !222, !223}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !118, line: 380, baseType: !121, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !211, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !211, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !211, file: !118, line: 386, baseType: !217, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !218, file: !118, line: 359, baseType: !131, size: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !218, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !211, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !202, file: !203, line: 65, baseType: !209, size: 32, offset: 32)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !227, file: !230, line: 71, type: !231, isLocal: true, isDefinition: true, align: 32)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !229, splitDebugInlining: false, nameTableKind: None)
!228 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!229 = !{!225}
!230 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !233)
!233 = !{!234, !253}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !232, file: !203, line: 60, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DISubroutineType(types: !237)
!237 = !{!103, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !241)
!241 = !{!242, !243, !244, !245, !251, !252}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !118, line: 380, baseType: !121, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !240, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !240, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !240, file: !118, line: 386, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !247, file: !118, line: 359, baseType: !131, size: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !247, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !240, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !232, file: !203, line: 65, baseType: !238, size: 32, offset: 32)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "static_regions", scope: !256, file: !265, line: 62, type: !406, isLocal: true, isDefinition: true)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !258, globals: !261, splitDebugInlining: false, nameTableKind: None)
!257 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!258 = !{!259, !103, !142, !104}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !260, line: 214, baseType: !32)
!260 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !{!262, !254}
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !264, file: !265, line: 198, type: !392, isLocal: true, isDefinition: true)
!264 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !265, file: !265, line: 175, type: !266, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !256, retainedNodes: !387)
!265 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !DISubroutineType(types: !267)
!267 = !{null, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !270, line: 245, size: 1024, elements: !271)
!270 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!271 = !{!272, !341, !354, !355, !356, !357, !363, !382}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !269, file: !270, line: 247, baseType: !273, size: 384)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !270, line: 57, size: 384, elements: !274)
!274 = !{!275, !303, !311, !312, !313, !326, !327, !328}
!275 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !270, line: 60, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !270, line: 60, size: 64, elements: !277)
!277 = !{!278, !294}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !276, file: !270, line: 61, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !280, line: 49, baseType: !281)
!280 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !280, line: 37, size: 64, elements: !282)
!282 = !{!283, !289}
!283 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !280, line: 38, baseType: !284, size: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !280, line: 38, size: 32, elements: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !284, file: !280, line: 39, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !280, line: 40, baseType: !287, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !280, line: 42, baseType: !290, size: 32, offset: 32)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !280, line: 42, size: 32, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !290, file: !280, line: 43, baseType: !287, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !280, line: 44, baseType: !287, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !276, file: !270, line: 62, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !296, line: 49, size: 64, elements: !297)
!296 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !295, file: !296, line: 50, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 64, elements: !301)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !273, file: !270, line: 68, baseType: !304, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !306, line: 233, baseType: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 231, size: 64, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !307, file: !306, line: 232, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !280, line: 48, baseType: !281)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !273, file: !270, line: 71, baseType: !131, size: 8, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !273, file: !270, line: 74, baseType: !131, size: 8, offset: 104)
!313 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !270, line: 90, baseType: !314, size: 16, offset: 112)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !270, line: 90, size: 16, elements: !315)
!315 = !{!316, !323}
!316 = !DIDerivedType(tag: DW_TAG_member, scope: !314, file: !270, line: 91, baseType: !317, size: 16)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !270, line: 91, size: 16, elements: !318)
!318 = !{!319, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !317, file: !270, line: 96, baseType: !320, size: 8)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !321)
!321 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !317, file: !270, line: 97, baseType: !131, size: 8, offset: 8)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !314, file: !270, line: 100, baseType: !324, size: 16)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !325)
!325 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !273, file: !270, line: 107, baseType: !142, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !273, file: !270, line: 127, baseType: !104, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !273, file: !270, line: 131, baseType: !329, size: 192, offset: 192)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !306, line: 244, size: 192, elements: !330)
!330 = !{!331, !332, !338}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !329, file: !306, line: 245, baseType: !279, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !329, file: !306, line: 246, baseType: !333, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !306, line: 242, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !329, file: !306, line: 249, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !340)
!340 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !269, file: !270, line: 250, baseType: !342, size: 288, offset: 384)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !343, line: 25, size: 288, elements: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !342, file: !343, line: 26, baseType: !142, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !342, file: !343, line: 27, baseType: !142, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !342, file: !343, line: 28, baseType: !142, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !342, file: !343, line: 29, baseType: !142, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !342, file: !343, line: 30, baseType: !142, size: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !342, file: !343, line: 31, baseType: !142, size: 32, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !342, file: !343, line: 32, baseType: !142, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !342, file: !343, line: 33, baseType: !142, size: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !342, file: !343, line: 34, baseType: !142, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !269, file: !270, line: 253, baseType: !104, size: 32, offset: 672)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !269, file: !270, line: 256, baseType: !305, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !269, file: !270, line: 294, baseType: !103, size: 32, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !269, file: !270, line: 300, baseType: !358, size: 96, offset: 800)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !270, line: 149, size: 96, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !358, file: !270, line: 153, baseType: !22, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !358, file: !270, line: 162, baseType: !259, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !358, file: !270, line: 168, baseType: !259, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !269, file: !270, line: 325, baseType: !364, size: 32, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !366, line: 5073, size: 160, elements: !367)
!366 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!367 = !{!368, !377, !378}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !365, file: !366, line: 5074, baseType: !369, size: 96)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !370, line: 56, size: 96, elements: !371)
!370 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = !{!372, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !369, file: !370, line: 57, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !370, line: 57, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !369, file: !370, line: 58, baseType: !104, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !369, file: !370, line: 59, baseType: !259, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !365, file: !366, line: 5075, baseType: !305, size: 64, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !365, file: !366, line: 5076, baseType: !379, offset: 160)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !380, line: 43, elements: !381)
!380 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!381 = !{}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !269, file: !270, line: 343, baseType: !383, size: 64, offset: 928)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !343, line: 60, size: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !383, file: !343, line: 63, baseType: !142, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !383, file: !343, line: 66, baseType: !142, size: 32, offset: 32)
!387 = !{!388, !389, !390, !391}
!388 = !DILocalVariable(name: "thread", arg: 1, scope: !264, file: !265, line: 175, type: !268)
!389 = !DILocalVariable(name: "region_num", scope: !264, file: !265, line: 200, type: !131)
!390 = !DILocalVariable(name: "guard_start", scope: !264, file: !265, line: 265, type: !22)
!391 = !DILocalVariable(name: "guard_size", scope: !264, file: !265, line: 266, type: !259)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 96, elements: !404)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !394, line: 52, size: 96, elements: !395)
!394 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !{!396, !397, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !393, file: !394, line: 53, baseType: !22, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !393, file: !394, line: 54, baseType: !259, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !393, file: !394, line: 55, baseType: !399, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !400, line: 151, baseType: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 149, size: 32, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !401, file: !400, line: 150, baseType: !142, size: 32)
!404 = !{!405}
!405 = !DISubrange(count: 1)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 96, elements: !404)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !410, file: !443, line: 39, type: !131, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !412, globals: !442, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!412 = !{!413, !104, !103, !430, !131}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !415, line: 1226, baseType: !416)
!415 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 1213, size: 352, elements: !417)
!417 = !{!418, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !416, file: !415, line: 1215, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !416, file: !415, line: 1216, baseType: !192, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !416, file: !415, line: 1217, baseType: !192, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !416, file: !415, line: 1218, baseType: !192, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !416, file: !415, line: 1219, baseType: !192, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !416, file: !415, line: 1220, baseType: !192, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !416, file: !415, line: 1221, baseType: !192, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !416, file: !415, line: 1222, baseType: !192, size: 32, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !416, file: !415, line: 1223, baseType: !192, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !416, file: !415, line: 1224, baseType: !192, size: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !416, file: !415, line: 1225, baseType: !192, size: 32, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !433, line: 27, size: 96, elements: !434)
!433 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !432, file: !433, line: 29, baseType: !142, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !433, line: 31, baseType: !121, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !432, file: !433, line: 37, baseType: !438, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !400, line: 146, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !400, line: 141, size: 32, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !439, file: !400, line: 143, baseType: !142, size: 32)
!442 = !{!408}
!443 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !446, file: !453, line: 21, type: !178, isLocal: true, isDefinition: true)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !448, globals: !452, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!448 = !{!449, !103, !104}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !451, line: 22, baseType: !103)
!451 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!452 = !{!444}
!453 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !456, file: !461, line: 13, type: !478, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!458 = !{!459, !454}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "mpu_config", scope: !456, file: !461, line: 37, type: !462, isLocal: false, isDefinition: true)
!461 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !433, line: 41, size: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !463, file: !433, line: 43, baseType: !142, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !463, file: !433, line: 45, baseType: !467, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !433, line: 27, size: 96, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !469, file: !433, line: 29, baseType: !142, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !433, line: 31, baseType: !121, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !469, file: !433, line: 37, baseType: !474, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !400, line: 146, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !400, line: 141, size: 32, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !475, file: !400, line: 143, baseType: !142, size: 32)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 192, elements: !301)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !481, file: !565, line: 72, type: !649, isLocal: true, isDefinition: true)
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !483, retainedTypes: !551, globals: !562, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!483 = !{!30, !484}
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !188, line: 65, baseType: !103, size: 32, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!486 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!487 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!488 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!489 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!490 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!491 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!492 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!493 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!494 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!495 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!496 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!497 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!498 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!499 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!500 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!501 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!502 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!503 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!504 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!505 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!506 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!507 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!508 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!509 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!510 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!511 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!512 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!513 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!514 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!515 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!516 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!517 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!518 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!519 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!520 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!521 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!522 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!523 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!524 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!525 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!526 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!527 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!528 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!529 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!530 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!531 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!532 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!533 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!534 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!535 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!536 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!537 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!538 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!539 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!540 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!541 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!542 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!543 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!544 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!545 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!546 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!547 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!548 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!549 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!550 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!551 = !{!259, !103, !104, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !188, line: 244, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 236, size: 192, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !554, file: !188, line: 238, baseType: !192, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !554, file: !188, line: 239, baseType: !192, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !554, file: !188, line: 240, baseType: !192, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !554, file: !188, line: 241, baseType: !192, size: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !554, file: !188, line: 242, baseType: !192, size: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !554, file: !188, line: 243, baseType: !192, size: 32, offset: 160)
!562 = !{!563, !569, !585, !596, !613, !479, !615, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !481, file: !565, line: 424, type: !566, isLocal: false, isDefinition: true, align: 16)
!565 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 4)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !481, file: !565, line: 424, type: !571, isLocal: false, isDefinition: true, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !573)
!573 = !{!574, !575, !576, !577, !583, !584}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !572, file: !118, line: 380, baseType: !121, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !572, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !572, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !572, file: !118, line: 386, baseType: !578, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !579, file: !118, line: 359, baseType: !131, size: 8)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !579, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !572, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !572, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !481, file: !565, line: 424, type: !587, isLocal: true, isDefinition: true, align: 32)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !589)
!589 = !{!590, !595}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !588, file: !203, line: 60, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DISubroutineType(types: !593)
!593 = !{!103, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !588, file: !203, line: 65, baseType: !594, size: 32, offset: 32)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "exti_data", scope: !481, file: !565, line: 423, type: !598, isLocal: true, isDefinition: true)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !565, line: 107, size: 1472, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !598, file: !565, line: 109, baseType: !601, size: 1472)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 1472, elements: !611)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !565, line: 101, size: 64, elements: !603)
!603 = !{!604, !610}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !602, file: !565, line: 102, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !606, line: 63, baseType: !607)
!606 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !103, !104}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !602, file: !565, line: 103, baseType: !104, size: 32, offset: 32)
!611 = !{!612}
!612 = !DISubrange(count: 23)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !481, file: !565, line: 424, type: !579, isLocal: true, isDefinition: true, align: 8)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !617, file: !565, line: 493, type: !622, isLocal: true, isDefinition: true, align: 32)
!617 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !565, file: !565, line: 460, type: !618, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !481, retainedNodes: !620)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !594}
!620 = !{!621}
!621 = !DILocalVariable(name: "dev", arg: 1, scope: !617, file: !565, line: 460, type: !594)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !623)
!623 = !{!624, !626, !627, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !622, file: !10, line: 55, baseType: !625, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !622, file: !10, line: 57, baseType: !625, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !622, file: !10, line: 59, baseType: !104, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !622, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !617, file: !565, line: 497, type: !622, isLocal: true, isDefinition: true, align: 32)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !617, file: !565, line: 507, type: !622, isLocal: true, isDefinition: true, align: 32)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !617, file: !565, line: 512, type: !622, isLocal: true, isDefinition: true, align: 32)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !617, file: !565, line: 516, type: !622, isLocal: true, isDefinition: true, align: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !617, file: !565, line: 523, type: !622, isLocal: true, isDefinition: true, align: 32)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !617, file: !565, line: 527, type: !622, isLocal: true, isDefinition: true, align: 32)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !617, file: !565, line: 581, type: !622, isLocal: true, isDefinition: true, align: 32)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !617, file: !565, line: 586, type: !622, isLocal: true, isDefinition: true, align: 32)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !617, file: !565, line: 591, type: !622, isLocal: true, isDefinition: true, align: 32)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !617, file: !565, line: 595, type: !622, isLocal: true, isDefinition: true, align: 32)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 736, elements: !611)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !188, line: 134, baseType: !484)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !654, file: !659, line: 22, type: !681, isLocal: false, isDefinition: true, align: 16)
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !656, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!656 = !{!657, !652, !663, !665, !667, !669, !671, !673, !675, !677, !679}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !654, file: !659, line: 17, type: !660, isLocal: false, isDefinition: true, align: 16)
!659 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 192, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 12)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !654, file: !659, line: 29, type: !566, isLocal: false, isDefinition: true, align: 16)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !654, file: !659, line: 36, type: !566, isLocal: false, isDefinition: true, align: 16)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !654, file: !659, line: 43, type: !566, isLocal: false, isDefinition: true, align: 16)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !654, file: !659, line: 50, type: !566, isLocal: false, isDefinition: true, align: 16)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !654, file: !659, line: 57, type: !566, isLocal: false, isDefinition: true, align: 16)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !654, file: !659, line: 64, type: !566, isLocal: false, isDefinition: true, align: 16)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !654, file: !659, line: 71, type: !566, isLocal: false, isDefinition: true, align: 16)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !654, file: !659, line: 78, type: !566, isLocal: false, isDefinition: true, align: 16)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !654, file: !659, line: 85, type: !566, isLocal: false, isDefinition: true, align: 16)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 48, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 3)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !686, file: !750, line: 398, type: !783, isLocal: true, isDefinition: true)
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !688, retainedTypes: !701, globals: !747, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!688 = !{!689, !30, !694}
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !690, line: 197, baseType: !32, size: 32, elements: !691)
!690 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!691 = !{!692, !693}
!692 = !DIEnumerator(name: "SUCCESS", value: 0)
!693 = !DIEnumerator(name: "ERROR", value: 1)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !695, line: 44, baseType: !32, size: 32, elements: !696)
!695 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!696 = !{!697, !698, !699, !700}
!697 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!698 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!699 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!700 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!701 = !{!104, !103, !142, !702, !740, !746}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !188, line: 370, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 336, size: 1152, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !739}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !704, file: !188, line: 338, baseType: !192, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !704, file: !188, line: 339, baseType: !192, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !704, file: !188, line: 340, baseType: !192, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !704, file: !188, line: 341, baseType: !192, size: 32, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !704, file: !188, line: 342, baseType: !192, size: 32, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !704, file: !188, line: 343, baseType: !192, size: 32, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !704, file: !188, line: 344, baseType: !192, size: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !704, file: !188, line: 345, baseType: !142, size: 32, offset: 224)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !704, file: !188, line: 346, baseType: !192, size: 32, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !704, file: !188, line: 347, baseType: !192, size: 32, offset: 288)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !704, file: !188, line: 348, baseType: !717, size: 64, offset: 320)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 64, elements: !301)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !704, file: !188, line: 349, baseType: !192, size: 32, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !704, file: !188, line: 350, baseType: !192, size: 32, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !704, file: !188, line: 351, baseType: !192, size: 32, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !704, file: !188, line: 352, baseType: !142, size: 32, offset: 480)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !704, file: !188, line: 353, baseType: !192, size: 32, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !704, file: !188, line: 354, baseType: !192, size: 32, offset: 544)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !704, file: !188, line: 355, baseType: !717, size: 64, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !704, file: !188, line: 356, baseType: !192, size: 32, offset: 640)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !704, file: !188, line: 357, baseType: !192, size: 32, offset: 672)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !704, file: !188, line: 358, baseType: !192, size: 32, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !704, file: !188, line: 359, baseType: !142, size: 32, offset: 736)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !704, file: !188, line: 360, baseType: !192, size: 32, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !704, file: !188, line: 361, baseType: !192, size: 32, offset: 800)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !704, file: !188, line: 362, baseType: !717, size: 64, offset: 832)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !704, file: !188, line: 363, baseType: !192, size: 32, offset: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !704, file: !188, line: 364, baseType: !192, size: 32, offset: 928)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !704, file: !188, line: 365, baseType: !717, size: 64, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !704, file: !188, line: 366, baseType: !192, size: 32, offset: 1024)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !704, file: !188, line: 367, baseType: !192, size: 32, offset: 1056)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !704, file: !188, line: 368, baseType: !738, size: 32, offset: 1088)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, elements: !404)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !704, file: !188, line: 369, baseType: !192, size: 32, offset: 1120)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !742, line: 343, size: 64, elements: !743)
!742 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !741, file: !742, line: 344, baseType: !142, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !741, file: !742, line: 345, baseType: !142, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!747 = !{!748, !754, !770, !781, !684}
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !686, file: !750, line: 752, type: !751, isLocal: false, isDefinition: true, align: 16)
!750 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 704, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 44)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !686, file: !750, line: 752, type: !756, isLocal: false, isDefinition: true, align: 32)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !758)
!758 = !{!759, !760, !761, !762, !768, !769}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !118, line: 380, baseType: !121, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !757, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !757, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !757, file: !118, line: 386, baseType: !763, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !764, file: !118, line: 359, baseType: !131, size: 8)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !764, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !757, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !757, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !686, file: !750, line: 752, type: !772, isLocal: true, isDefinition: true, align: 32)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !774)
!774 = !{!775, !780}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !773, file: !203, line: 60, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{!103, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !773, file: !203, line: 65, baseType: !779, size: 32, offset: 32)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !686, file: !750, line: 752, type: !764, isLocal: true, isDefinition: true, align: 8)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !695, line: 100, size: 224, elements: !784)
!784 = !{!785, !791, !792, !801, !806, !811, !817}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !783, file: !695, line: 101, baseType: !786, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !695, line: 76, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{!103, !779, !790}
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !695, line: 56, baseType: !104)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !783, file: !695, line: 102, baseType: !786, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !783, file: !695, line: 103, baseType: !793, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !695, line: 83, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DISubroutineType(types: !796)
!796 = !{!103, !779, !790, !797, !104}
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !695, line: 72, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !779, !790, !104}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !783, file: !695, line: 104, baseType: !802, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !695, line: 79, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{!103, !779, !790, !746}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !783, file: !695, line: 105, baseType: !807, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !695, line: 88, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!694, !779, !790}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !783, file: !695, line: 106, baseType: !812, size: 32, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !695, line: 92, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DISubroutineType(types: !815)
!815 = !{!103, !779, !790, !816}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !695, line: 64, baseType: !104)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !783, file: !695, line: 107, baseType: !818, size: 32, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !695, line: 96, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{!103, !779, !790, !104}
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !824, file: !881, line: 603, type: !883, isLocal: true, isDefinition: true, align: 32)
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !826, globals: !878, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!826 = !{!104, !103, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !830, line: 336, size: 160, elements: !831)
!830 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !{!832, !852, !856, !860, !873}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !829, file: !830, line: 365, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DISubroutineType(types: !835)
!835 = !{!103, !836, !851}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !839)
!839 = !{!840, !841, !842, !843, !849, !850}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !838, file: !118, line: 380, baseType: !121, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !838, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !838, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !838, file: !118, line: 386, baseType: !844, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !845, file: !118, line: 359, baseType: !131, size: 8)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !845, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !838, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !838, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !829, file: !830, line: 366, baseType: !853, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !836, !132}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !829, file: !830, line: 374, baseType: !857, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{!103, !836}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !829, file: !830, line: 377, baseType: !861, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{!103, !836, !864}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !830, line: 122, size: 64, elements: !867)
!867 = !{!868, !869, !870, !871, !872}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !866, file: !830, line: 123, baseType: !142, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !866, file: !830, line: 124, baseType: !131, size: 8, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !866, file: !830, line: 125, baseType: !131, size: 8, offset: 40)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !866, file: !830, line: 126, baseType: !131, size: 8, offset: 48)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !866, file: !830, line: 127, baseType: !131, size: 8, offset: 56)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !829, file: !830, line: 379, baseType: !874, size: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DISubroutineType(types: !876)
!876 = !{!103, !836, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!878 = !{!822, !879}
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !824, file: !881, line: 38, type: !882, isLocal: true, isDefinition: true)
!881 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !884, file: !203, line: 60, baseType: !857, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !884, file: !203, line: 65, baseType: !836, size: 32, offset: 32)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !890, file: !1060, line: 762, type: !1169, isLocal: true, isDefinition: true)
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !892, retainedTypes: !910, globals: !1057, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/ipm_mcux")
!892 = !{!30, !893, !899, !904, !694}
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !894, line: 506, baseType: !32, size: 32, elements: !895)
!894 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!895 = !{!896, !897, !898}
!896 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!897 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!898 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !894, line: 512, baseType: !32, size: 32, elements: !900)
!900 = !{!901, !902, !903}
!901 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!902 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!903 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !606, line: 43, baseType: !32, size: 32, elements: !905)
!905 = !{!906, !907, !908, !909}
!906 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!907 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!908 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!909 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!910 = !{!104, !103, !911, !981, !986, !946, !899, !893, !991, !992, !142, !1006, !961, !1016, !1017, !1018}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !894, line: 523, size: 288, elements: !914)
!914 = !{!915, !936, !942, !947, !951, !952, !953, !957, !977}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !913, file: !894, line: 524, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DISubroutineType(types: !918)
!918 = !{!103, !919, !934, !935}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !922)
!922 = !{!923, !924, !925, !926, !932, !933}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !921, file: !118, line: 380, baseType: !121, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !921, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !921, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !921, file: !118, line: 386, baseType: !927, size: 32, offset: 96)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !928, file: !118, line: 359, baseType: !131, size: 8)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !928, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !921, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !921, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !894, line: 237, baseType: !131)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !894, line: 257, baseType: !142)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !913, file: !894, line: 530, baseType: !937, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{!103, !919, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !894, line: 229, baseType: !142)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !913, file: !894, line: 532, baseType: !943, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DISubroutineType(types: !945)
!945 = !{!103, !919, !946, !941}
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !894, line: 216, baseType: !142)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !913, file: !894, line: 535, baseType: !948, size: 32, offset: 96)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{!103, !919, !946}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !913, file: !894, line: 537, baseType: !948, size: 32, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !913, file: !894, line: 539, baseType: !948, size: 32, offset: 160)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !913, file: !894, line: 541, baseType: !954, size: 32, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DISubroutineType(types: !956)
!956 = !{!103, !919, !934, !893, !899}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !913, file: !894, line: 544, baseType: !958, size: 32, offset: 224)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DISubroutineType(types: !960)
!960 = !{!103, !919, !961, !134}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !894, line: 478, size: 96, elements: !963)
!963 = !{!964, !971, !976}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !962, file: !894, line: 482, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !966, line: 33, baseType: !967)
!966 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !966, line: 29, size: 32, elements: !968)
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !966, line: 30, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !962, file: !894, line: 485, baseType: !972, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !894, line: 464, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !919, !961, !946}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !962, file: !894, line: 493, baseType: !946, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !913, file: !894, line: 547, baseType: !978, size: 32, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{!142, !919}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !894, line: 428, size: 32, elements: !984)
!984 = !{!985}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !983, file: !894, line: 434, baseType: !946, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !894, line: 441, size: 32, elements: !989)
!989 = !{!990}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !988, file: !894, line: 447, baseType: !946, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !188, line: 276, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 265, size: 320, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !994, file: !188, line: 267, baseType: !192, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !994, file: !188, line: 268, baseType: !192, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !994, file: !188, line: 269, baseType: !192, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !994, file: !188, line: 270, baseType: !192, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !994, file: !188, line: 271, baseType: !192, size: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !994, file: !188, line: 272, baseType: !192, size: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !994, file: !188, line: 273, baseType: !192, size: 32, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !994, file: !188, line: 274, baseType: !192, size: 32, offset: 224)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !994, file: !188, line: 275, baseType: !1005, size: 64, offset: 256)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 64, elements: !301)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !188, line: 289, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 282, size: 288, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1014, !1015}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !1008, file: !188, line: 284, baseType: !192, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !1008, file: !188, line: 285, baseType: !192, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !1008, file: !188, line: 286, baseType: !1013, size: 128, offset: 64)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !567)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1008, file: !188, line: 287, baseType: !717, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !1008, file: !188, line: 288, baseType: !192, size: 32, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !695, line: 100, size: 224, elements: !1021)
!1021 = !{!1022, !1027, !1028, !1037, !1042, !1047, !1052}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1020, file: !695, line: 101, baseType: !1023, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !695, line: 76, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!103, !919, !790}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1020, file: !695, line: 102, baseType: !1023, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1020, file: !695, line: 103, baseType: !1029, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !695, line: 83, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!103, !919, !790, !1033, !104}
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !695, line: 72, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !919, !790, !104}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1020, file: !695, line: 104, baseType: !1038, size: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !695, line: 79, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!103, !919, !790, !746}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1020, file: !695, line: 105, baseType: !1043, size: 32, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !695, line: 88, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 32)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!694, !919, !790}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1020, file: !695, line: 106, baseType: !1048, size: 32, offset: 160)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !695, line: 92, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 32)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!103, !919, !790, !816}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1020, file: !695, line: 107, baseType: !1053, size: 32, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !695, line: 96, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 32)
