; ModuleID = 'build/adafruit_itsybitsy_m4_express/drivers/crypto/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.mode_test = type { i8*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.ctr_params }
%struct.ctr_params = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.ctr_params }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.11] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.11 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.crypto_driver_api = type { i32 (%struct.device*)*, i32 (%struct.device*, %struct.cipher_ctx*, i32, i32, i32)*, i32 (%struct.device*, %struct.cipher_ctx*)*, i32 (%struct.device*, void (%struct.cipher_pkt*, i32)*)*, i32 (%struct.device*, %struct.hash_ctx*, i32)*, i32 (%struct.device*, %struct.hash_ctx*)*, i32 (%struct.device*, void (%struct.hash_pkt*, i32)*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/crypto/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/crypto")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/crypto")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !294, line: 18, type: !371, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !290, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/crypto")
!29 = !{!30, !39, !42, !46, !116}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_mode", file: !31, line: 44, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/crypto/cipher.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_ECB", value: 1)
!35 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CBC", value: 2)
!36 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CTR", value: 3)
!37 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CCM", value: 4)
!38 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_GCM", value: 5)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_algo", file: !31, line: 29, baseType: !32, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "CRYPTO_CIPHER_ALGO_AES", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_op", file: !31, line: 34, baseType: !32, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_DECRYPT", value: 0)
!45 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_ENCRYPT", value: 1)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !47, line: 27, baseType: !32, size: 32, elements: !48)
!47 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!49 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!50 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!51 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!52 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!53 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!54 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!55 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!56 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!57 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!58 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!59 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!60 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!61 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!62 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!63 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!64 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!65 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!115 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_algo", file: !117, line: 26, baseType: !32, size: 32, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/crypto/hash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA224", value: 1)
!120 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA256", value: 2)
!121 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA384", value: 3)
!122 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA512", value: 4)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/crypto/crypto.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !161, !241, !245, !253, !278, !282}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !127, file: !128, line: 66, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!125, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !143, !144, !145, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 380, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !136, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !136, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !136, file: !137, line: 386, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !147, file: !137, line: 359, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !147, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !136, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !137, line: 43, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !127, file: !128, line: 69, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !134, !165, !39, !30, !42}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !167)
!167 = !{!168, !212, !217, !218, !219, !220, !239, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !31, line: 116, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !169, file: !31, line: 76, baseType: !30, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !31, line: 78, baseType: !173, size: 32, offset: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !31, line: 78, size: 32, elements: !174)
!174 = !{!175, !190, !195, !197, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !173, file: !31, line: 79, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!125, !165, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !182)
!182 = !{!183, !185, !186, !187, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !181, file: !31, line: 183, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !181, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !181, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !181, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !181, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !31, line: 208, baseType: !165, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !173, file: !31, line: 80, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!125, !165, !180, !184}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !173, file: !31, line: 81, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !173, file: !31, line: 82, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!125, !165, !202, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !204)
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !203, file: !31, line: 219, baseType: !180, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !203, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !203, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !173, file: !31, line: 83, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !31, line: 126, baseType: !213, size: 32, offset: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 119, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !213, file: !31, line: 121, baseType: !184, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !213, file: !31, line: 125, baseType: !124, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !166, file: !31, line: 131, baseType: !134, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !166, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !166, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !166, file: !31, line: 156, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 152, size: 32, elements: !222)
!222 = !{!223, !230, !234}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !221, file: !31, line: 153, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !224, file: !31, line: 88, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !224, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !221, file: !31, line: 154, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !231, file: !31, line: 96, baseType: !208, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !221, file: !31, line: 155, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !235, file: !31, line: 100, baseType: !227, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !235, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !166, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !127, file: !128, line: 74, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !134, !165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !127, file: !128, line: 77, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !134, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !180, !125}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !127, file: !128, line: 81, baseType: !254, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!125, !134, !257, !116}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !259)
!259 = !{!260, !261, !262, !276, !277}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !258, file: !117, line: 51, baseType: !134, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !258, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !258, file: !117, line: 65, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!125, !257, !267, !153}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !269)
!269 = !{!270, !271, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !268, file: !117, line: 91, baseType: !184, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !268, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !268, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !268, file: !117, line: 107, baseType: !257, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !258, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !127, file: !128, line: 84, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!125, !134, !257}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !127, file: !128, line: 86, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!125, !134, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !267, !125}
!290 = !{!25, !291, !314, !316, !318, !320, !324, !327, !329, !334, !339, !344, !349, !351, !356, !361, !366}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "iv", scope: !293, file: !294, line: 227, type: !311, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "cbc_mode", scope: !294, file: !294, line: 205, type: !295, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !297)
!294 = !DIFile(filename: "zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !134}
!297 = !{!298, !299, !303, !307, !308, !309, !310}
!298 = !DILocalVariable(name: "dev", arg: 1, scope: !293, file: !294, line: 205, type: !134)
!299 = !DILocalVariable(name: "encrypted", scope: !293, file: !294, line: 207, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 640, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 80)
!303 = !DILocalVariable(name: "decrypted", scope: !293, file: !294, line: 208, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DILocalVariable(name: "ini", scope: !293, file: !294, line: 209, type: !166)
!308 = !DILocalVariable(name: "encrypt", scope: !293, file: !294, line: 214, type: !181)
!309 = !DILocalVariable(name: "decrypt", scope: !293, file: !294, line: 220, type: !181)
!310 = !DILabel(scope: !293, name: "out", file: !294, line: 279)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "cap_flags", scope: !27, file: !294, line: 48, type: !208, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "key", scope: !27, file: !294, line: 34, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plaintext", scope: !27, file: !294, line: 39, type: !304, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "cbc_ciphertext", scope: !27, file: !294, line: 195, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 640, elements: !301)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ctr_ciphertext", scope: !27, file: !294, line: 283, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !305)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ccm_key", scope: !27, file: !294, line: 373, type: !311, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ccm_data", scope: !27, file: !294, line: 384, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 184, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 23)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "ccm_hdr", scope: !27, file: !294, line: 381, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "ccm_nonce", scope: !27, file: !294, line: 377, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "ccm_expected", scope: !27, file: !294, line: 388, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 248, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 31)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "gcm_key", scope: !27, file: !294, line: 485, type: !311, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gcm_data", scope: !27, file: !294, line: 496, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 336, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 42)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "gcm_hdr", scope: !27, file: !294, line: 492, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gcm_nonce", scope: !27, file: !294, line: 489, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "gcm_expected", scope: !27, file: !294, line: 502, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 464, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 58)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 17, baseType: !140, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !379, file: !395, line: 18, type: !396, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, globals: !394, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/crypto")
!381 = !{!22, !124, !24, !382, !384, !386, !272, !125, !387, !388, !390, !392, !393, !184, !227, !140}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!394 = !{!377}
!395 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !373, line: 17, baseType: !140, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_char_out", scope: !403, file: !408, line: 54, type: !409, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/crypto")
!405 = !{!46}
!406 = !{!124, !125}
!407 = !{!401}
!408 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!125, !125}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !414, file: !949, line: 149, type: !950, isLocal: true, isDefinition: true, align: 32)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !416, globals: !948, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/crypto")
!416 = !{!124, !125, !417, !549, !634}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !419, line: 352, baseType: !420)
!419 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 339, size: 448, elements: !421)
!421 = !{!422, !438, !450, !460, !471, !481, !487, !497, !508, !518, !528, !538}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !420, file: !419, line: 340, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !419, line: 57, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 44, size: 32, elements: !427)
!427 = !{!428, !437}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !426, file: !419, line: 55, baseType: !429, size: 32)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !426, file: !419, line: 45, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !429, file: !419, line: 47, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !429, file: !419, line: 49, baseType: !208, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !429, file: !419, line: 50, baseType: !208, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !429, file: !419, line: 51, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !429, file: !419, line: 52, baseType: !208, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !429, file: !419, line: 53, baseType: !208, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !426, file: !419, line: 56, baseType: !208, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !420, file: !419, line: 341, baseType: !439, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !419, line: 124, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 114, size: 32, elements: !442)
!442 = !{!443, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !441, file: !419, line: 122, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !419, line: 115, size: 32, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !444, file: !419, line: 117, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !444, file: !419, line: 118, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !444, file: !419, line: 120, baseType: !208, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !441, file: !419, line: 123, baseType: !208, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !420, file: !419, line: 342, baseType: !451, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !419, line: 161, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 155, size: 32, elements: !454)
!454 = !{!455, !459}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !453, file: !419, line: 159, baseType: !456, size: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !419, line: 156, size: 32, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !456, file: !419, line: 157, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !453, file: !419, line: 160, baseType: !208, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !420, file: !419, line: 343, baseType: !461, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !419, line: 179, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 173, size: 32, elements: !465)
!465 = !{!466, !470}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !464, file: !419, line: 177, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !464, file: !419, line: 174, size: 32, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !467, file: !419, line: 175, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !464, file: !419, line: 178, baseType: !208, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !420, file: !419, line: 344, baseType: !472, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !419, line: 197, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 191, size: 32, elements: !475)
!475 = !{!476, !480}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !474, file: !419, line: 195, baseType: !477, size: 32)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !419, line: 192, size: 32, elements: !478)
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !477, file: !419, line: 193, baseType: !208, size: 4, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !474, file: !419, line: 196, baseType: !208, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !420, file: !419, line: 345, baseType: !482, size: 96, offset: 160)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 96, elements: !364)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !484, line: 53, baseType: !485)
!484 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !420, file: !419, line: 346, baseType: !488, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !419, line: 216, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 210, size: 32, elements: !491)
!491 = !{!492, !496}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !490, file: !419, line: 214, baseType: !493, size: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !490, file: !419, line: 211, size: 32, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !493, file: !419, line: 212, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !490, file: !419, line: 215, baseType: !208, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !420, file: !419, line: 347, baseType: !498, size: 32, offset: 288)
!498 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !419, line: 236, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 228, size: 32, elements: !501)
!501 = !{!502, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !500, file: !419, line: 234, baseType: !503, size: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !500, file: !419, line: 229, size: 32, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !503, file: !419, line: 231, baseType: !208, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !503, file: !419, line: 233, baseType: !208, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !500, file: !419, line: 235, baseType: !208, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !420, file: !419, line: 348, baseType: !509, size: 32, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !419, line: 266, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 260, size: 32, elements: !512)
!512 = !{!513, !517}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !511, file: !419, line: 264, baseType: !514, size: 32)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !511, file: !419, line: 261, size: 32, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !514, file: !419, line: 262, baseType: !208, size: 2, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !511, file: !419, line: 265, baseType: !208, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !420, file: !419, line: 349, baseType: !519, size: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !419, line: 291, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 285, size: 32, elements: !522)
!522 = !{!523, !527}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !521, file: !419, line: 289, baseType: !524, size: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !521, file: !419, line: 286, size: 32, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !524, file: !419, line: 287, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !521, file: !419, line: 290, baseType: !208, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !420, file: !419, line: 350, baseType: !529, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !419, line: 309, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 303, size: 32, elements: !532)
!532 = !{!533, !537}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !531, file: !419, line: 307, baseType: !534, size: 32)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !531, file: !419, line: 304, size: 32, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !534, file: !419, line: 305, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !531, file: !419, line: 308, baseType: !208, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !420, file: !419, line: 351, baseType: !539, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !419, line: 326, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 321, size: 32, elements: !543)
!543 = !{!544, !548}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !542, file: !419, line: 324, baseType: !545, size: 32)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !542, file: !419, line: 322, size: 32, elements: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !545, file: !419, line: 323, baseType: !208, size: 32, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !542, file: !419, line: 325, baseType: !208, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !551, line: 267, baseType: !552)
!551 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !551, line: 259, size: 2560, elements: !553)
!553 = !{!554, !564, !568, !595, !599, !617, !621}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !552, file: !551, line: 260, baseType: !555, size: 8)
!555 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !551, line: 50, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !551, line: 44, size: 8, elements: !558)
!558 = !{!559, !563}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !557, file: !551, line: 48, baseType: !560, size: 8)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !557, file: !551, line: 45, size: 8, elements: !561)
!561 = !{!562}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !560, file: !551, line: 46, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !557, file: !551, line: 49, baseType: !150, size: 8)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !552, file: !551, line: 261, baseType: !565, size: 24, offset: 8)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 24, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 3)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !552, file: !551, line: 262, baseType: !569, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !551, line: 86, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !551, line: 62, size: 32, elements: !573)
!573 = !{!574, !590, !594}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !572, file: !551, line: 79, baseType: !575, size: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !572, file: !551, line: 63, size: 32, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !575, file: !551, line: 64, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !575, file: !551, line: 66, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !575, file: !551, line: 67, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !575, file: !551, line: 68, baseType: !208, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !575, file: !551, line: 69, baseType: !208, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !575, file: !551, line: 70, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !575, file: !551, line: 71, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !575, file: !551, line: 72, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !575, file: !551, line: 73, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !575, file: !551, line: 74, baseType: !208, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !575, file: !551, line: 75, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !575, file: !551, line: 76, baseType: !208, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !575, file: !551, line: 77, baseType: !208, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !572, file: !551, line: 84, baseType: !591, size: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !572, file: !551, line: 80, size: 32, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !591, file: !551, line: 82, baseType: !208, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !572, file: !551, line: 85, baseType: !208, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !552, file: !551, line: 263, baseType: !596, size: 192, offset: 64)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 192, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 24)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !552, file: !551, line: 264, baseType: !600, size: 384, offset: 256)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 384, elements: !364)
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !551, line: 163, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !551, line: 149, size: 32, elements: !604)
!604 = !{!605, !616}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !603, file: !551, line: 161, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !551, line: 150, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !606, file: !551, line: 151, baseType: !208, size: 4, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !606, file: !551, line: 153, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !606, file: !551, line: 154, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !606, file: !551, line: 155, baseType: !208, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !606, file: !551, line: 156, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !606, file: !551, line: 157, baseType: !208, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !606, file: !551, line: 158, baseType: !208, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !606, file: !551, line: 160, baseType: !208, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !603, file: !551, line: 162, baseType: !208, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !552, file: !551, line: 265, baseType: !618, size: 384, offset: 640)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 384, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 48)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !552, file: !551, line: 266, baseType: !622, size: 1536, offset: 1024)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 1536, elements: !619)
!623 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !551, line: 218, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !551, line: 209, size: 32, elements: !626)
!626 = !{!627, !633}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !625, file: !551, line: 216, baseType: !628, size: 32)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !551, line: 210, size: 32, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !628, file: !551, line: 211, baseType: !208, size: 4, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !628, file: !551, line: 213, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !628, file: !551, line: 214, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !625, file: !551, line: 217, baseType: !208, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !636, line: 788, baseType: !637)
!636 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !636, line: 771, size: 704, elements: !638)
!638 = !{!639, !654, !655, !686, !717, !750, !785, !809, !821, !822, !839, !840, !852, !864, !877, !878}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !637, file: !636, line: 772, baseType: !640, size: 8)
!640 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !636, line: 55, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 44, size: 8, elements: !643)
!643 = !{!644, !649, !653}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !642, file: !636, line: 49, baseType: !645, size: 8)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !636, line: 45, size: 8, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !645, file: !636, line: 46, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !645, file: !636, line: 47, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !642, file: !636, line: 53, baseType: !650, size: 8)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !636, line: 50, size: 8, elements: !651)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !650, file: !636, line: 51, baseType: !150, size: 2, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !642, file: !636, line: 54, baseType: !150, size: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !637, file: !636, line: 773, baseType: !565, size: 24, offset: 8)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !637, file: !636, line: 774, baseType: !656, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !636, line: 102, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 72, size: 32, elements: !659)
!659 = !{!660, !680, !685}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !658, file: !636, line: 95, baseType: !661, size: 32)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !636, line: 73, size: 32, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !661, file: !636, line: 74, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !661, file: !636, line: 75, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !661, file: !636, line: 76, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !661, file: !636, line: 77, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !661, file: !636, line: 79, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !661, file: !636, line: 80, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !661, file: !636, line: 81, baseType: !208, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !661, file: !636, line: 82, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !661, file: !636, line: 83, baseType: !208, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !661, file: !636, line: 85, baseType: !208, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !661, file: !636, line: 86, baseType: !208, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !661, file: !636, line: 87, baseType: !208, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !661, file: !636, line: 88, baseType: !208, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !661, file: !636, line: 90, baseType: !208, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !661, file: !636, line: 91, baseType: !208, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !661, file: !636, line: 92, baseType: !208, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !661, file: !636, line: 93, baseType: !208, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !658, file: !636, line: 100, baseType: !681, size: 32)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !636, line: 96, size: 32, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !681, file: !636, line: 97, baseType: !208, size: 2, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !681, file: !636, line: 98, baseType: !208, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !658, file: !636, line: 101, baseType: !208, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !637, file: !636, line: 775, baseType: !687, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !636, line: 182, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 152, size: 32, elements: !690)
!690 = !{!691, !711, !716}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !689, file: !636, line: 175, baseType: !692, size: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !636, line: 153, size: 32, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !692, file: !636, line: 154, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !692, file: !636, line: 155, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !692, file: !636, line: 156, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !692, file: !636, line: 157, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !692, file: !636, line: 159, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !692, file: !636, line: 160, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !692, file: !636, line: 161, baseType: !208, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !692, file: !636, line: 162, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !692, file: !636, line: 163, baseType: !208, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !692, file: !636, line: 165, baseType: !208, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !692, file: !636, line: 166, baseType: !208, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !692, file: !636, line: 167, baseType: !208, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !692, file: !636, line: 168, baseType: !208, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !692, file: !636, line: 170, baseType: !208, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !692, file: !636, line: 171, baseType: !208, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !692, file: !636, line: 172, baseType: !208, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !692, file: !636, line: 173, baseType: !208, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !689, file: !636, line: 180, baseType: !712, size: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !636, line: 176, size: 32, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !712, file: !636, line: 177, baseType: !208, size: 2, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !712, file: !636, line: 178, baseType: !208, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !689, file: !636, line: 181, baseType: !208, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !637, file: !636, line: 776, baseType: !718, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !636, line: 262, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 232, size: 32, elements: !721)
!721 = !{!722, !744, !749}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !720, file: !636, line: 255, baseType: !723, size: 32)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !720, file: !636, line: 233, size: 32, elements: !724)
!724 = !{!725, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !723, file: !636, line: 234, baseType: !726, size: 1, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !723, file: !636, line: 235, baseType: !726, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !723, file: !636, line: 236, baseType: !726, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !723, file: !636, line: 237, baseType: !726, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !723, file: !636, line: 239, baseType: !726, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !723, file: !636, line: 240, baseType: !726, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !723, file: !636, line: 241, baseType: !726, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !723, file: !636, line: 242, baseType: !726, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !723, file: !636, line: 243, baseType: !726, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !723, file: !636, line: 245, baseType: !726, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !723, file: !636, line: 246, baseType: !726, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !723, file: !636, line: 247, baseType: !726, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !723, file: !636, line: 248, baseType: !726, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !723, file: !636, line: 250, baseType: !726, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !723, file: !636, line: 251, baseType: !726, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !723, file: !636, line: 252, baseType: !726, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !723, file: !636, line: 253, baseType: !726, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !720, file: !636, line: 260, baseType: !745, size: 32)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !720, file: !636, line: 256, size: 32, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !745, file: !636, line: 257, baseType: !726, size: 2, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !745, file: !636, line: 258, baseType: !726, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !720, file: !636, line: 261, baseType: !208, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !637, file: !636, line: 777, baseType: !751, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !636, line: 345, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 312, size: 32, elements: !755)
!755 = !{!756, !778, !784}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !754, file: !636, line: 337, baseType: !757, size: 32)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !636, line: 313, size: 32, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !757, file: !636, line: 314, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !757, file: !636, line: 315, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !757, file: !636, line: 316, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !757, file: !636, line: 317, baseType: !208, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !757, file: !636, line: 318, baseType: !208, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !757, file: !636, line: 319, baseType: !208, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !757, file: !636, line: 321, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !757, file: !636, line: 322, baseType: !208, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !757, file: !636, line: 323, baseType: !208, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !757, file: !636, line: 324, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !757, file: !636, line: 325, baseType: !208, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !757, file: !636, line: 327, baseType: !208, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !757, file: !636, line: 328, baseType: !208, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !757, file: !636, line: 329, baseType: !208, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !757, file: !636, line: 330, baseType: !208, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !757, file: !636, line: 332, baseType: !208, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !757, file: !636, line: 333, baseType: !208, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !757, file: !636, line: 334, baseType: !208, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !757, file: !636, line: 335, baseType: !208, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !754, file: !636, line: 343, baseType: !779, size: 32)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !636, line: 338, size: 32, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !779, file: !636, line: 339, baseType: !208, size: 2, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !779, file: !636, line: 340, baseType: !208, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !779, file: !636, line: 341, baseType: !208, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !754, file: !636, line: 344, baseType: !208, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !637, file: !636, line: 778, baseType: !786, size: 64, offset: 160)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 64, elements: !807)
!787 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !636, line: 422, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 402, size: 32, elements: !790)
!790 = !{!791, !806}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !789, file: !636, line: 420, baseType: !792, size: 32)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !789, file: !636, line: 403, size: 32, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !792, file: !636, line: 405, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !792, file: !636, line: 406, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !792, file: !636, line: 408, baseType: !208, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !792, file: !636, line: 409, baseType: !208, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !792, file: !636, line: 410, baseType: !208, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !792, file: !636, line: 411, baseType: !208, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !792, file: !636, line: 412, baseType: !208, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !792, file: !636, line: 413, baseType: !208, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !792, file: !636, line: 414, baseType: !208, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !792, file: !636, line: 415, baseType: !208, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !792, file: !636, line: 417, baseType: !208, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !792, file: !636, line: 418, baseType: !208, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !789, file: !636, line: 421, baseType: !208, size: 32)
!807 = !{!808}
!808 = !DISubrange(count: 2)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !637, file: !636, line: 779, baseType: !810, size: 8, offset: 224)
!810 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !636, line: 469, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 460, size: 8, elements: !813)
!813 = !{!814, !820}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !812, file: !636, line: 467, baseType: !815, size: 8)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !812, file: !636, line: 461, size: 8, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !815, file: !636, line: 463, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !815, file: !636, line: 465, baseType: !150, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !815, file: !636, line: 466, baseType: !150, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !812, file: !636, line: 468, baseType: !150, size: 8)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !637, file: !636, line: 780, baseType: !565, size: 24, offset: 232)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !637, file: !636, line: 781, baseType: !823, size: 8, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !636, line: 497, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 485, size: 8, elements: !826)
!826 = !{!827, !838}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !825, file: !636, line: 495, baseType: !828, size: 8)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !825, file: !636, line: 486, size: 8, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !828, file: !636, line: 487, baseType: !150, size: 1, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !828, file: !636, line: 488, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !828, file: !636, line: 489, baseType: !150, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !828, file: !636, line: 490, baseType: !150, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !828, file: !636, line: 491, baseType: !150, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !828, file: !636, line: 492, baseType: !150, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !828, file: !636, line: 493, baseType: !150, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !828, file: !636, line: 494, baseType: !150, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !825, file: !636, line: 496, baseType: !150, size: 8)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !637, file: !636, line: 782, baseType: !565, size: 24, offset: 264)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !637, file: !636, line: 783, baseType: !841, size: 32, offset: 288)
!841 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !636, line: 531, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 523, size: 32, elements: !844)
!844 = !{!845, !851}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !843, file: !636, line: 529, baseType: !846, size: 32)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !843, file: !636, line: 524, size: 32, elements: !847)
!847 = !{!848, !849, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !846, file: !636, line: 525, baseType: !208, size: 8, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !846, file: !636, line: 527, baseType: !208, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !846, file: !636, line: 528, baseType: !208, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !843, file: !636, line: 530, baseType: !208, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !637, file: !636, line: 784, baseType: !853, size: 32, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !636, line: 558, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 550, size: 32, elements: !856)
!856 = !{!857, !863}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !855, file: !636, line: 556, baseType: !858, size: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !855, file: !636, line: 551, size: 32, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !858, file: !636, line: 552, baseType: !208, size: 16, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !858, file: !636, line: 553, baseType: !208, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !858, file: !636, line: 555, baseType: !208, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !855, file: !636, line: 557, baseType: !208, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !637, file: !636, line: 785, baseType: !865, size: 8, offset: 352)
!865 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !636, line: 587, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 577, size: 8, elements: !868)
!868 = !{!869, !876}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !867, file: !636, line: 585, baseType: !870, size: 8)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !636, line: 578, size: 8, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !870, file: !636, line: 580, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !870, file: !636, line: 581, baseType: !150, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !870, file: !636, line: 582, baseType: !150, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !870, file: !636, line: 583, baseType: !150, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !867, file: !636, line: 586, baseType: !150, size: 8)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !637, file: !636, line: 786, baseType: !565, size: 24, offset: 360)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !637, file: !636, line: 787, baseType: !879, size: 320, offset: 384)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 320, elements: !807)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !636, line: 766, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !636, line: 759, size: 160, elements: !882)
!882 = !{!883, !895, !896, !907, !924, !936}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !881, file: !636, line: 760, baseType: !884, size: 8)
!884 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !636, line: 614, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 605, size: 8, elements: !887)
!887 = !{!888, !894}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !886, file: !636, line: 612, baseType: !889, size: 8)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !886, file: !636, line: 606, size: 8, elements: !890)
!890 = !{!891, !892, !893}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !889, file: !636, line: 608, baseType: !150, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !889, file: !636, line: 610, baseType: !150, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !889, file: !636, line: 611, baseType: !150, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !886, file: !636, line: 613, baseType: !150, size: 8)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !881, file: !636, line: 761, baseType: !565, size: 24, offset: 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !881, file: !636, line: 762, baseType: !897, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !636, line: 638, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 630, size: 32, elements: !900)
!900 = !{!901, !906}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !899, file: !636, line: 636, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !899, file: !636, line: 631, size: 32, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !902, file: !636, line: 632, baseType: !208, size: 13, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !902, file: !636, line: 634, baseType: !208, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !899, file: !636, line: 637, baseType: !208, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !881, file: !636, line: 763, baseType: !908, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !636, line: 667, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 654, size: 32, elements: !911)
!911 = !{!912, !923}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !910, file: !636, line: 665, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !910, file: !636, line: 655, size: 32, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !913, file: !636, line: 656, baseType: !208, size: 4, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !913, file: !636, line: 657, baseType: !208, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !913, file: !636, line: 658, baseType: !208, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !913, file: !636, line: 659, baseType: !208, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !913, file: !636, line: 660, baseType: !208, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !913, file: !636, line: 661, baseType: !208, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !913, file: !636, line: 662, baseType: !208, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !913, file: !636, line: 663, baseType: !208, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !910, file: !636, line: 666, baseType: !208, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !881, file: !636, line: 764, baseType: !925, size: 32, offset: 96)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !636, line: 724, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 716, size: 32, elements: !929)
!929 = !{!930, !935}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !928, file: !636, line: 722, baseType: !931, size: 32)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !928, file: !636, line: 717, size: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !931, file: !636, line: 719, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !931, file: !636, line: 720, baseType: !208, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !928, file: !636, line: 723, baseType: !208, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !881, file: !636, line: 765, baseType: !937, size: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !636, line: 745, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !636, line: 738, size: 32, elements: !941)
!941 = !{!942, !947}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !940, file: !636, line: 743, baseType: !943, size: 32)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !940, file: !636, line: 739, size: 32, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !943, file: !636, line: 740, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !943, file: !636, line: 741, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !940, file: !636, line: 744, baseType: !208, size: 32)
!948 = !{!412}
!949 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !952, line: 51, size: 64, elements: !953)
!952 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!953 = !{!954, !973}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !951, file: !952, line: 60, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
