; ModuleID = 'build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "i2c", scope: !27, file: !232, line: 17, type: !240, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !228, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/lcd_cyclonev_socdk/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !108, !112, !113, !114, !115, !218, !150, !226}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !105)
!105 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !111)
!111 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!114 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_driver_api", file: !118, line: 234, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/drivers/i2c.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !151, !157, !170, !211, !213}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !117, file: !118, line: 235, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_configure_t", file: !118, line: 212, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!123 = !DISubroutineType(types: !124)
!124 = !{!114, !125, !150}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !128, line: 378, size: 192, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !134, !135, !136, !143, !144}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !128, line: 380, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !127, file: !128, line: 382, baseType: !13, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !127, file: !128, line: 384, baseType: !13, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !128, line: 386, baseType: !137, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !128, line: 351, size: 16, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !138, file: !128, line: 359, baseType: !104, size: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !138, file: !128, line: 364, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!142 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !128, line: 388, baseType: !113, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !127, file: !128, line: 396, baseType: !145, size: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !128, line: 43, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !149)
!149 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "get_config", scope: !117, file: !118, line: 236, baseType: !152, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_get_config_t", file: !118, line: 214, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{!114, !125, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !117, file: !118, line: 237, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_full_io_t", file: !118, line: 216, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{!114, !125, !162, !104, !168}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_msg", file: !118, line: 184, size: 96, elements: !164)
!164 = !{!165, !166, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !163, file: !118, line: 186, baseType: !112, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !163, file: !118, line: 189, baseType: !150, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !163, file: !118, line: 192, baseType: !104, size: 8, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "target_register", scope: !117, file: !118, line: 238, baseType: !171, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_target_register_t", file: !118, line: 220, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DISubroutineType(types: !174)
!174 = !{!114, !125, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_config", file: !118, line: 385, size: 96, elements: !177)
!177 = !{!178, !185, !186, !187}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !176, file: !118, line: 387, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !180, line: 33, baseType: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !180, line: 29, size: 32, elements: !182)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !180, line: 30, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !118, line: 390, baseType: !104, size: 8, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !176, file: !118, line: 393, baseType: !168, size: 16, offset: 48)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !176, file: !118, line: 396, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_callbacks", file: !118, line: 366, size: 160, elements: !191)
!191 = !{!192, !197, !202, !207, !209}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "write_requested", scope: !190, file: !118, line: 367, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_write_requested_cb_t", file: !118, line: 276, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{!114, !175}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "read_requested", scope: !190, file: !118, line: 368, baseType: !198, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_read_requested_cb_t", file: !118, line: 319, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!114, !175, !112}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "write_received", scope: !190, file: !118, line: 369, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_write_received_cb_t", file: !118, line: 297, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{!114, !175, !104}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "read_processed", scope: !190, file: !118, line: 370, baseType: !208, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_read_processed_cb_t", file: !118, line: 341, baseType: !199)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !190, file: !118, line: 371, baseType: !210, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_stop_cb_t", file: !118, line: 358, baseType: !194)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "target_unregister", scope: !117, file: !118, line: 239, baseType: !212, size: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_target_unregister_t", file: !118, line: 222, baseType: !172)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "recover_bus", scope: !117, file: !118, line: 243, baseType: !214, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_recover_bus_t", file: !118, line: 232, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{!114, !125}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_driver_api", file: !118, line: 249, size: 64, elements: !221)
!221 = !{!222, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "driver_register", scope: !220, file: !118, line: 250, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_api_register_t", file: !118, line: 246, baseType: !215)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "driver_unregister", scope: !220, file: !118, line: 251, baseType: !225, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_api_unregister_t", file: !118, line: 247, baseType: !215)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !227)
!227 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!228 = !{!25, !229}
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "string", scope: !231, file: !232, line: 90, type: !237, isLocal: true, isDefinition: true)
!231 = distinct !DISubprogram(name: "main", scope: !232, file: !232, line: 87, type: !233, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !235)
!232 = !DIFile(filename: "zephyr/samples/drivers/lcd_cyclonev_socdk/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !DISubroutineType(types: !234)
!234 = !{null}
!235 = !{!236}
!236 = !DILocalVariable(name: "len", scope: !231, file: !232, line: 91, type: !114)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 104, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 13)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "_char_out", scope: !243, file: !247, line: 54, type: !248, isLocal: false, isDefinition: true)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !245, globals: !246, splitDebugInlining: false, nameTableKind: None)
!244 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!245 = !{!113, !114}
!246 = !{!241}
!247 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{!114, !114}
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !253, file: !287, line: 27, type: !314, isLocal: true, isDefinition: true)
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !267, globals: !284, splitDebugInlining: false, nameTableKind: None)
!254 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!255 = !{!256, !30}
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !257, line: 27, baseType: !32, size: 32, elements: !258)
!257 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266}
!259 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!260 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!261 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!262 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!263 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!264 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!265 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!266 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!267 = !{!113, !108, !114, !24, !268, !283, !150, !226}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !270, line: 54, size: 96, elements: !271)
!270 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!271 = !{!272, !278, !282}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !269, file: !270, line: 55, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !180, line: 33, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !180, line: 29, size: 32, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !180, line: 30, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !269, file: !270, line: 60, baseType: !279, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !256}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !269, file: !270, line: 65, baseType: !279, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!284 = !{!251, !285, !291, !293, !304, !306}
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !253, file: !287, line: 44, type: !288, isLocal: true, isDefinition: true)
!287 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !289, line: 43, elements: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !{}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !253, file: !287, line: 49, type: !288, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !253, file: !287, line: 36, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 128, elements: !302)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !257, line: 114, size: 128, elements: !297)
!297 = !{!298, !299, !300, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !296, file: !257, line: 115, baseType: !256, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !296, file: !257, line: 141, baseType: !104, size: 8, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !296, file: !257, line: 149, baseType: !150, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !296, file: !257, line: 156, baseType: !150, size: 32, offset: 96)
!302 = !{!303}
!303 = !DISubrange(count: 1)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !253, file: !287, line: 40, type: !295, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !253, file: !287, line: 28, type: !308, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !180, line: 40, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !180, line: 35, size: 64, elements: !310)
!310 = !{!311, !313}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !309, file: !180, line: 36, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !309, file: !180, line: 37, baseType: !312, size: 32, offset: 32)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 32, elements: !302)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !316, line: 22, baseType: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!318 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!319 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !322, file: !351, line: 50, type: !338, isLocal: true, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !255, retainedTypes: !324, globals: !348, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!324 = !{!148, !108, !325, !114, !113, !150, !226, !327, !283, !338, !339}
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !326, line: 214, baseType: !32)
!326 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !329, line: 45, size: 64, elements: !330)
!329 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!330 = !{!331, !337}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !328, file: !329, line: 46, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !180, line: 33, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !180, line: 29, size: 32, elements: !334)
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !180, line: 30, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !328, file: !329, line: 48, baseType: !150, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !114)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !329, line: 38, size: 64, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !340, file: !329, line: 39, baseType: !332, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !340, file: !329, line: 41, baseType: !344, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !329, line: 35, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !338}
!348 = !{!349, !353, !361, !320, !363, !373}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "latency_lock", scope: !322, file: !351, line: 44, type: !352, isLocal: true, isDefinition: true)
!351 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !289, line: 43, elements: !290)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !322, file: !351, line: 46, type: !355, isLocal: true, isDefinition: true)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !180, line: 40, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !180, line: 35, size: 64, elements: !357)
!357 = !{!358, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !356, file: !180, line: 36, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !356, file: !180, line: 37, baseType: !359, size: 32, offset: 32)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "latency_subs", scope: !322, file: !351, line: 52, type: !355, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !322, file: !351, line: 39, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, elements: !371)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 35, size: 96, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !351, line: 36, baseType: !256, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !366, file: !351, line: 37, baseType: !104, size: 8, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !366, file: !351, line: 38, baseType: !315, size: 32, offset: 64)
!371 = !{!372}
!372 = !DISubrange(count: 0)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !322, file: !351, line: 48, type: !338, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !377, file: !384, line: 47, type: !397, isLocal: true, isDefinition: true)
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !379, retainedTypes: !380, globals: !381, splitDebugInlining: false, nameTableKind: None)
!378 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!379 = !{!256}
!380 = !{!325, !114}
!381 = !{!382, !375, !394}
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "cpus_states", scope: !377, file: !384, line: 50, type: !385, isLocal: true, isDefinition: true)
!384 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 32, elements: !302)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !257, line: 114, size: 128, elements: !389)
!389 = !{!390, !391, !392, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !388, file: !257, line: 115, baseType: !256, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !388, file: !257, line: 141, baseType: !104, size: 8, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !388, file: !257, line: 149, baseType: !150, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !388, file: !257, line: 156, baseType: !150, size: 32, offset: 96)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !377, file: !384, line: 55, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8, elements: !302)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, elements: !371)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "static_regions", scope: !400, file: !407, line: 62, type: !540, isLocal: true, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !402, globals: !403, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!402 = !{!325, !114, !150, !113}
!403 = !{!404, !398}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !406, file: !407, line: 198, type: !528, isLocal: true, isDefinition: true)
!406 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !407, file: !407, line: 175, type: !408, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !400, retainedNodes: !523)
!407 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !DISubroutineType(types: !409)
!409 = !{null, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !412, line: 245, size: 1024, elements: !413)
!412 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!413 = !{!414, !479, !492, !493, !494, !495, !501, !518}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !411, file: !412, line: 247, baseType: !415, size: 384)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !412, line: 57, size: 384, elements: !416)
!416 = !{!417, !445, !453, !454, !455, !466, !467, !468}
!417 = !DIDerivedType(tag: DW_TAG_member, scope: !415, file: !412, line: 60, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !415, file: !412, line: 60, size: 64, elements: !419)
!419 = !{!420, !436}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !418, file: !412, line: 61, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !422, line: 49, baseType: !423)
!422 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !422, line: 37, size: 64, elements: !424)
!424 = !{!425, !431}
!425 = !DIDerivedType(tag: DW_TAG_member, scope: !423, file: !422, line: 38, baseType: !426, size: 32)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !423, file: !422, line: 38, size: 32, elements: !427)
!427 = !{!428, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !426, file: !422, line: 39, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !422, line: 40, baseType: !429, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, scope: !423, file: !422, line: 42, baseType: !432, size: 32, offset: 32)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !423, file: !422, line: 42, size: 32, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !432, file: !422, line: 43, baseType: !429, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !432, file: !422, line: 44, baseType: !429, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !418, file: !412, line: 62, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !438, line: 49, size: 64, elements: !439)
!438 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !437, file: !438, line: 50, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 64, elements: !443)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!443 = !{!444}
!444 = !DISubrange(count: 2)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !415, file: !412, line: 68, baseType: !446, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !448, line: 233, baseType: !449)
!448 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 231, size: 64, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !449, file: !448, line: 232, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !422, line: 48, baseType: !423)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !415, file: !412, line: 71, baseType: !104, size: 8, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !415, file: !412, line: 74, baseType: !104, size: 8, offset: 104)
!455 = !DIDerivedType(tag: DW_TAG_member, scope: !415, file: !412, line: 90, baseType: !456, size: 16, offset: 112)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !415, file: !412, line: 90, size: 16, elements: !457)
!457 = !{!458, !465}
!458 = !DIDerivedType(tag: DW_TAG_member, scope: !456, file: !412, line: 91, baseType: !459, size: 16)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !412, line: 91, size: 16, elements: !460)
!460 = !{!461, !464}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !459, file: !412, line: 96, baseType: !462, size: 8)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !463)
!463 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !459, file: !412, line: 97, baseType: !104, size: 8, offset: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !456, file: !412, line: 100, baseType: !168, size: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !415, file: !412, line: 107, baseType: !150, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !415, file: !412, line: 127, baseType: !113, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !415, file: !412, line: 131, baseType: !469, size: 192, offset: 192)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !448, line: 244, size: 192, elements: !470)
!470 = !{!471, !472, !478}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !469, file: !448, line: 245, baseType: !421, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !469, file: !448, line: 246, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !448, line: 242, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !469, file: !448, line: 249, baseType: !110, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !411, file: !412, line: 250, baseType: !480, size: 288, offset: 384)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !481, line: 25, size: 288, elements: !482)
!481 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !480, file: !481, line: 26, baseType: !150, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !480, file: !481, line: 27, baseType: !150, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !480, file: !481, line: 28, baseType: !150, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !480, file: !481, line: 29, baseType: !150, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !480, file: !481, line: 30, baseType: !150, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !480, file: !481, line: 31, baseType: !150, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !480, file: !481, line: 32, baseType: !150, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !480, file: !481, line: 33, baseType: !150, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !480, file: !481, line: 34, baseType: !150, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !411, file: !412, line: 253, baseType: !113, size: 32, offset: 672)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !411, file: !412, line: 256, baseType: !447, size: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !411, file: !412, line: 294, baseType: !114, size: 32, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !411, file: !412, line: 300, baseType: !496, size: 96, offset: 800)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !412, line: 149, size: 96, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !496, file: !412, line: 153, baseType: !22, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !496, file: !412, line: 162, baseType: !325, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !496, file: !412, line: 168, baseType: !325, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !411, file: !412, line: 325, baseType: !502, size: 32, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !504, line: 5073, size: 160, elements: !505)
!504 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !{!506, !515, !516}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !503, file: !504, line: 5074, baseType: !507, size: 96)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !508, line: 56, size: 96, elements: !509)
!508 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!509 = !{!510, !513, !514}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !507, file: !508, line: 57, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !508, line: 57, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !507, file: !508, line: 58, baseType: !113, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !507, file: !508, line: 59, baseType: !325, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !503, file: !504, line: 5075, baseType: !447, size: 64, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !503, file: !504, line: 5076, baseType: !517, offset: 160)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !289, line: 43, elements: !290)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !411, file: !412, line: 343, baseType: !519, size: 64, offset: 928)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !481, line: 60, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !519, file: !481, line: 63, baseType: !150, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !519, file: !481, line: 66, baseType: !150, size: 32, offset: 32)
!523 = !{!524, !525, !526, !527}
!524 = !DILocalVariable(name: "thread", arg: 1, scope: !406, file: !407, line: 175, type: !410)
!525 = !DILocalVariable(name: "region_num", scope: !406, file: !407, line: 200, type: !104)
!526 = !DILocalVariable(name: "guard_start", scope: !406, file: !407, line: 265, type: !22)
!527 = !DILocalVariable(name: "guard_size", scope: !406, file: !407, line: 266, type: !325)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 96, elements: !302)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !530, line: 52, size: 96, elements: !531)
!530 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !529, file: !530, line: 53, baseType: !22, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !529, file: !530, line: 54, baseType: !325, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !529, file: !530, line: 55, baseType: !535, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !536, line: 151, baseType: !537)
!536 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 149, size: 32, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !537, file: !536, line: 150, baseType: !150, size: 32)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 96, elements: !302)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !544, file: !578, line: 39, type: !104, isLocal: true, isDefinition: true)
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !546, globals: !577, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!546 = !{!547, !113, !114, !565, !104}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !549, line: 1226, baseType: !550)
!549 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 1213, size: 352, elements: !551)
!551 = !{!552, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !550, file: !549, line: 1215, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !550, file: !549, line: 1216, baseType: !554, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !550, file: !549, line: 1217, baseType: !554, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !550, file: !549, line: 1218, baseType: !554, size: 32, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !550, file: !549, line: 1219, baseType: !554, size: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !550, file: !549, line: 1220, baseType: !554, size: 32, offset: 160)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !550, file: !549, line: 1221, baseType: !554, size: 32, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !550, file: !549, line: 1222, baseType: !554, size: 32, offset: 224)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !550, file: !549, line: 1223, baseType: !554, size: 32, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !550, file: !549, line: 1224, baseType: !554, size: 32, offset: 288)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !550, file: !549, line: 1225, baseType: !554, size: 32, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !568, line: 27, size: 96, elements: !569)
!568 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !567, file: !568, line: 29, baseType: !150, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !568, line: 31, baseType: !131, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !567, file: !568, line: 37, baseType: !573, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !536, line: 146, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !536, line: 141, size: 32, elements: !575)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !574, file: !536, line: 143, baseType: !150, size: 32)
!577 = !{!542}
!578 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !581, file: !588, line: 21, type: !248, isLocal: true, isDefinition: true)
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !583, globals: !587, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!583 = !{!584, !114, !113}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !586, line: 22, baseType: !114)
!586 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!587 = !{!579}
!588 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !591, file: !596, line: 13, type: !613, isLocal: true, isDefinition: true)
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !593, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!593 = !{!594, !589}
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "mpu_config", scope: !591, file: !596, line: 37, type: !597, isLocal: false, isDefinition: true)
!596 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !568, line: 41, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !598, file: !568, line: 43, baseType: !150, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !598, file: !568, line: 45, baseType: !602, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !568, line: 27, size: 96, elements: !605)
!605 = !{!606, !607, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !604, file: !568, line: 29, baseType: !150, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !604, file: !568, line: 31, baseType: !131, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !604, file: !568, line: 37, baseType: !609, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !536, line: 146, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !536, line: 141, size: 32, elements: !611)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !610, file: !536, line: 143, baseType: !150, size: 32)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 192, elements: !443)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !616, file: !786, line: 93, type: !787, isLocal: true, isDefinition: true, align: 32)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !618, globals: !781, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!618 = !{!619, !104, !113, !114, !699, !150, !700, !736, !747}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !621, line: 1071, baseType: !622)
!621 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !621, line: 1035, size: 19584, elements: !623)
!623 = !{!624, !628, !629, !630, !634, !635, !637, !638, !639, !640, !641, !642, !646, !647, !648, !652, !653, !657, !658, !662, !663, !667, !668, !669, !670, !671, !672, !673, !677, !678, !679, !680, !684, !685, !689}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !622, file: !621, line: 1036, baseType: !625, size: 960)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 960, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 30)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !622, file: !621, line: 1037, baseType: !554, size: 32, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !622, file: !621, line: 1038, baseType: !554, size: 32, offset: 992)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !622, file: !621, line: 1039, baseType: !631, size: 1088, offset: 1024)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1088, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 34)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !622, file: !621, line: 1040, baseType: !554, size: 32, offset: 2112)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !622, file: !621, line: 1041, baseType: !636, size: 64, offset: 2144)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 64, elements: !443)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !622, file: !621, line: 1042, baseType: !554, size: 32, offset: 2208)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !622, file: !621, line: 1043, baseType: !554, size: 32, offset: 2240)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !622, file: !621, line: 1044, baseType: !554, size: 32, offset: 2272)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !622, file: !621, line: 1045, baseType: !554, size: 32, offset: 2304)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !622, file: !621, line: 1046, baseType: !554, size: 32, offset: 2336)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !622, file: !621, line: 1047, baseType: !643, size: 3808, offset: 2368)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 3808, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 119)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !622, file: !621, line: 1048, baseType: !554, size: 32, offset: 6176)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !622, file: !621, line: 1049, baseType: !554, size: 32, offset: 6208)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !622, file: !621, line: 1050, baseType: !649, size: 1952, offset: 6240)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1952, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 61)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !622, file: !621, line: 1051, baseType: !554, size: 32, offset: 8192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !622, file: !621, line: 1052, baseType: !654, size: 288, offset: 8224)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 288, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 9)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !622, file: !621, line: 1053, baseType: !553, size: 32, offset: 8512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !622, file: !621, line: 1054, baseType: !659, size: 96, offset: 8544)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 96, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 3)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !622, file: !621, line: 1055, baseType: !553, size: 32, offset: 8640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !622, file: !621, line: 1056, baseType: !664, size: 1568, offset: 8672)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1568, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 49)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !622, file: !621, line: 1057, baseType: !554, size: 32, offset: 10240)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !622, file: !621, line: 1058, baseType: !659, size: 96, offset: 10272)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !622, file: !621, line: 1059, baseType: !554, size: 32, offset: 10368)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !622, file: !621, line: 1060, baseType: !636, size: 64, offset: 10400)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !622, file: !621, line: 1061, baseType: !554, size: 32, offset: 10464)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !622, file: !621, line: 1062, baseType: !554, size: 32, offset: 10496)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !622, file: !621, line: 1063, baseType: !674, size: 672, offset: 10528)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 672, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 21)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !622, file: !621, line: 1064, baseType: !554, size: 32, offset: 11200)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !622, file: !621, line: 1065, baseType: !553, size: 32, offset: 11232)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !622, file: !621, line: 1066, baseType: !554, size: 32, offset: 11264)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !622, file: !621, line: 1067, baseType: !681, size: 1504, offset: 11296)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1504, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 47)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !622, file: !621, line: 1068, baseType: !553, size: 32, offset: 12800)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !622, file: !621, line: 1069, baseType: !686, size: 5600, offset: 12832)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 5600, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 175)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !622, file: !621, line: 1070, baseType: !690, size: 1152, offset: 18432)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 1152, elements: !655)
!691 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !621, line: 278, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !621, line: 272, size: 128, elements: !694)
!694 = !{!695, !696, !697, !698}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !693, file: !621, line: 273, baseType: !554, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !693, file: !621, line: 274, baseType: !554, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !693, file: !621, line: 275, baseType: !554, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !693, file: !621, line: 277, baseType: !553, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !549, line: 468, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 445, size: 1120, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !729, !733, !735}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !702, file: !549, line: 447, baseType: !553, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !702, file: !549, line: 448, baseType: !554, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !702, file: !549, line: 449, baseType: !554, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !702, file: !549, line: 450, baseType: !554, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !702, file: !549, line: 451, baseType: !554, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !702, file: !549, line: 452, baseType: !554, size: 32, offset: 160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !702, file: !549, line: 453, baseType: !711, size: 96, offset: 192)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 96, elements: !713)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!713 = !{!714}
!714 = !DISubrange(count: 12)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !702, file: !549, line: 454, baseType: !554, size: 32, offset: 288)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !702, file: !549, line: 455, baseType: !554, size: 32, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !702, file: !549, line: 456, baseType: !554, size: 32, offset: 352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !702, file: !549, line: 457, baseType: !554, size: 32, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !702, file: !549, line: 458, baseType: !554, size: 32, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !702, file: !549, line: 459, baseType: !554, size: 32, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !702, file: !549, line: 460, baseType: !554, size: 32, offset: 480)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !702, file: !549, line: 461, baseType: !636, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !702, file: !549, line: 462, baseType: !553, size: 32, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !702, file: !549, line: 463, baseType: !553, size: 32, offset: 608)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !702, file: !549, line: 464, baseType: !726, size: 128, offset: 640)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 128, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 4)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !702, file: !549, line: 465, baseType: !730, size: 160, offset: 768)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 160, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 5)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !702, file: !549, line: 466, baseType: !734, size: 160, offset: 928)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !731)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !702, file: !549, line: 467, baseType: !554, size: 32, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !738, file: !737, line: 167, baseType: !746)
!737 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !737, file: !737, line: 134, type: !739, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !616, retainedNodes: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !150}
!741 = !{!742, !743, !745}
!742 = !DILocalVariable(name: "time_us", arg: 1, scope: !738, file: !737, line: 134, type: !150)
!743 = !DILocalVariable(name: "delay_cycles", scope: !738, file: !737, line: 168, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!745 = !DILocalVariable(name: "cycles", scope: !738, file: !737, line: 171, type: !150)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !621, line: 2399, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !621, line: 2373, size: 10880, elements: !750)
!750 = !{!751, !755, !756, !757, !758, !762, !763, !768, !769, !770, !771, !772, !773, !777, !778, !779, !780}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !749, file: !621, line: 2374, baseType: !752, size: 8192)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 8192, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !749, file: !621, line: 2375, baseType: !553, size: 32, offset: 8192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !749, file: !621, line: 2376, baseType: !553, size: 32, offset: 8224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !749, file: !621, line: 2377, baseType: !553, size: 32, offset: 8256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !749, file: !621, line: 2378, baseType: !759, size: 1984, offset: 8288)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1984, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 62)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !749, file: !621, line: 2379, baseType: !554, size: 32, offset: 10272)
!763 = !DIDerivedType(tag: DW_TAG_member, scope: !749, file: !621, line: 2381, baseType: !764, size: 32, offset: 10304)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !749, file: !621, line: 2381, size: 32, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !764, file: !621, line: 2382, baseType: !554, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !764, file: !621, line: 2383, baseType: !554, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !749, file: !621, line: 2386, baseType: !554, size: 32, offset: 10336)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !749, file: !621, line: 2387, baseType: !554, size: 32, offset: 10368)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !749, file: !621, line: 2389, baseType: !554, size: 32, offset: 10400)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !749, file: !621, line: 2391, baseType: !554, size: 32, offset: 10432)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !749, file: !621, line: 2393, baseType: !554, size: 32, offset: 10464)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !749, file: !621, line: 2394, baseType: !774, size: 256, offset: 10496)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 256, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 8)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !749, file: !621, line: 2395, baseType: !554, size: 32, offset: 10752)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !749, file: !621, line: 2396, baseType: !553, size: 32, offset: 10784)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !749, file: !621, line: 2397, baseType: !554, size: 32, offset: 10816)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !749, file: !621, line: 2398, baseType: !554, size: 32, offset: 10848)
!781 = !{!614, !782}
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !738, file: !737, line: 161, type: !784, isLocal: true, isDefinition: true, align: 128)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 48, elements: !660)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!786 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !789, line: 51, size: 64, elements: !790)
!789 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = !{!791, !798}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !788, file: !789, line: 60, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DISubroutineType(types: !794)
!794 = !{!114, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !789, line: 48, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !788, file: !789, line: 65, baseType: !795, size: 32, offset: 32)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !801, file: !900, line: 36, type: !915, isLocal: true, isDefinition: true, align: 32)
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !803, retainedTypes: !815, globals: !896, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!803 = !{!804, !810}
!804 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !805, line: 506, baseType: !32, size: 32, elements: !806)
!805 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!806 = !{!807, !808, !809}
!807 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!808 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!809 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!810 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !805, line: 512, baseType: !32, size: 32, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!813 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!814 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!815 = !{!816, !885, !890, !851, !810, !804, !895, !113}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !805, line: 523, size: 288, elements: !819)
!819 = !{!820, !841, !847, !852, !856, !857, !858, !862, !881}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !818, file: !805, line: 524, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{!114, !824, !839, !840}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !128, line: 378, size: 192, elements: !827)
!827 = !{!828, !829, !830, !831, !837, !838}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !128, line: 380, baseType: !131, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !826, file: !128, line: 382, baseType: !13, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !826, file: !128, line: 384, baseType: !13, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !826, file: !128, line: 386, baseType: !832, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !128, line: 351, size: 16, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !833, file: !128, line: 359, baseType: !104, size: 8)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !833, file: !128, line: 364, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !826, file: !128, line: 388, baseType: !113, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !826, file: !128, line: 396, baseType: !145, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !805, line: 237, baseType: !104)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !805, line: 257, baseType: !150)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !818, file: !805, line: 530, baseType: !842, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DISubroutineType(types: !844)
!844 = !{!114, !824, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !805, line: 229, baseType: !150)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !818, file: !805, line: 532, baseType: !848, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DISubroutineType(types: !850)
!850 = !{!114, !824, !851, !846}
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !805, line: 216, baseType: !150)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !818, file: !805, line: 535, baseType: !853, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DISubroutineType(types: !855)
!855 = !{!114, !824, !851}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !818, file: !805, line: 537, baseType: !853, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !818, file: !805, line: 539, baseType: !853, size: 32, offset: 160)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !818, file: !805, line: 541, baseType: !859, size: 32, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DISubroutineType(types: !861)
!861 = !{!114, !824, !839, !804, !810}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !818, file: !805, line: 544, baseType: !863, size: 32, offset: 224)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DISubroutineType(types: !865)
!865 = !{!114, !824, !866, !142}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !805, line: 478, size: 96, elements: !868)
!868 = !{!869, !875, !880}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !867, file: !805, line: 482, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !180, line: 33, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !180, line: 29, size: 32, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !871, file: !180, line: 30, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !867, file: !805, line: 485, baseType: !876, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !805, line: 464, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !824, !866, !851}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !867, file: !805, line: 493, baseType: !851, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !818, file: !805, line: 547, baseType: !882, size: 32, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DISubroutineType(types: !884)
!884 = !{!150, !824}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !805, line: 428, size: 32, elements: !888)
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !887, file: !805, line: 434, baseType: !851, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !805, line: 441, size: 32, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !892, file: !805, line: 447, baseType: !851, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!896 = !{!799, !897, !913}
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "pull_up", scope: !899, file: !900, line: 15, type: !906, isLocal: true, isDefinition: true)
!899 = distinct !DISubprogram(name: "board_init", scope: !900, file: !900, line: 10, type: !901, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !801, retainedNodes: !903)
!900 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!901 = !DISubroutineType(types: !902)
!902 = !{!114, !824}
!903 = !{!904, !905}
!904 = !DILocalVariable(name: "dev", arg: 1, scope: !899, file: !900, line: 10, type: !824)
!905 = !DILocalVariable(name: "res", scope: !899, file: !900, line: 14, type: !114)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !805, line: 271, size: 64, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !907, file: !805, line: 273, baseType: !824, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !907, file: !805, line: 275, baseType: !839, size: 8, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !907, file: !805, line: 277, baseType: !912, size: 16, offset: 48)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !805, line: 249, baseType: !168)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "user_led", scope: !899, file: !900, line: 17, type: !906, isLocal: true, isDefinition: true)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !789, line: 51, size: 64, elements: !917)
!917 = !{!918, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !916, file: !789, line: 60, baseType: !919, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !916, file: !789, line: 65, baseType: !824, size: 32, offset: 32)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !923, file: !1157, line: 733, type: !1258, isLocal: false, isDefinition: true, align: 32)
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !925, retainedTypes: !1068, globals: !1153, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/lcd_cyclonev_socdk")
!925 = !{!926, !932, !30, !937, !942, !949, !957, !965, !974, !978, !1033, !1040, !1059}
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !927, line: 23, baseType: !32, size: 32, elements: !928)
!927 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!928 = !{!929, !930, !931}
!929 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!930 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!931 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !927, line: 48, baseType: !32, size: 32, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!935 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!936 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 167, baseType: !32, size: 32, elements: !939)
!938 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!939 = !{!940, !941}
!940 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!941 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!942 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 107, baseType: !32, size: 32, elements: !943)
!943 = !{!944, !945, !946, !947, !948}
!944 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!945 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!946 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!947 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!948 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 208, baseType: !32, size: 32, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956}
!951 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!952 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!953 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!954 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!955 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!956 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 261, baseType: !32, size: 32, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964}
!959 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!960 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!961 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!962 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!963 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!964 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!965 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 237, baseType: !32, size: 32, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !973}
!967 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!968 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!969 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!970 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!971 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!972 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!973 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!974 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 152, baseType: !32, size: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!977 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!978 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !621, line: 71, baseType: !114, size: 32, elements: !979)
!979 = !{!980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!980 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!981 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!982 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!983 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!984 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!985 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!986 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!987 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!988 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!989 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!990 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!991 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!992 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!993 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!994 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!995 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!996 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!997 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!998 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!999 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!1000 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!1001 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!1002 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!1003 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!1004 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!1005 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!1006 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!1007 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!1008 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!1009 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!1010 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!1011 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!1012 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!1013 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!1014 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!1015 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!1016 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!1017 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!1018 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!1019 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!1020 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!1021 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!1022 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!1023 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!1024 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!1025 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!1026 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!1027 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!1028 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!1029 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!1030 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!1031 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!1032 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!1033 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !1034, line: 44, baseType: !32, size: 32, elements: !1035)
!1034 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1035 = !{!1036, !1037, !1038, !1039}
!1036 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!1037 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!1038 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!1039 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!1040 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1041, line: 54, baseType: !32, size: 32, elements: !1042)
!1041 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1043 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!1044 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!1045 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!1046 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!1047 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!1048 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!1049 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!1050 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!1051 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!1052 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!1053 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!1054 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!1055 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!1056 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!1057 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!1058 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!1059 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1060, line: 53, baseType: !32, size: 32, elements: !1061)
!1060 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1061 = !{!1062, !1063, !1064, !1065, !1066, !1067}
!1062 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!1063 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!1064 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!1065 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!1066 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!1067 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!1068 = !{!926, !113, !114, !1069, !1118, !1119, !1120, !1121, !108, !150, !226, !142, !699, !112, !338, !1122, !1152, !325}
