; ModuleID = 'build/arduino_due/subsys/console/getline/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %union.anon }
%struct._sflist = type { %struct.z_heap_bucket*, %struct.z_heap_bucket* }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.console_input = type { i32, i8, [128 x i8] }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.wdt_sam_dev_cfg = type { %struct._thread_stack_info* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.wdt_driver_api = type { i32 (%struct.device*, i8)*, i32 (%struct.device*)*, i32 (%struct.device*, %struct.wdt_timeout_cfg*)*, i32 (%struct.device*, i32)* }
%struct.wdt_timeout_cfg = type { %struct._thread_arch, void (%struct.device*, i32)*, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !111, file: !177, line: 235, type: !178, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !176, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!113 = !{!102, !103, !114, !126}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 41, size: 128, elements: !118)
!118 = !{!119, !122, !123, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !117, file: !116, line: 42, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !117, file: !116, line: 43, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !117, file: !116, line: 44, baseType: !124, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !117, file: !116, line: 45, baseType: !124, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !128, line: 75, baseType: !129)
!128 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 41, size: 2176, elements: !130)
!130 = !{!131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !160, !161, !162, !163, !164, !165, !169, !170, !171, !172, !173, !174, !175}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !129, file: !128, line: 42, baseType: !120, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !129, file: !128, line: 43, baseType: !120, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !129, file: !128, line: 44, baseType: !124, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !129, file: !128, line: 45, baseType: !135, size: 32, offset: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !129, file: !128, line: 46, baseType: !120, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !129, file: !128, line: 47, baseType: !120, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !129, file: !128, line: 48, baseType: !124, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !129, file: !128, line: 49, baseType: !120, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !129, file: !128, line: 50, baseType: !120, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !129, file: !128, line: 51, baseType: !124, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !129, file: !128, line: 52, baseType: !120, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !129, file: !128, line: 53, baseType: !135, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !129, file: !128, line: 54, baseType: !120, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !129, file: !128, line: 55, baseType: !135, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !129, file: !128, line: 56, baseType: !120, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !129, file: !128, line: 57, baseType: !135, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !129, file: !128, line: 58, baseType: !151, size: 96, offset: 512)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !129, file: !128, line: 59, baseType: !155, size: 160, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !129, file: !128, line: 60, baseType: !120, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !129, file: !128, line: 61, baseType: !120, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !129, file: !128, line: 62, baseType: !124, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !129, file: !128, line: 63, baseType: !124, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !129, file: !128, line: 64, baseType: !120, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !129, file: !128, line: 65, baseType: !120, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !129, file: !128, line: 66, baseType: !120, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !129, file: !128, line: 67, baseType: !166, size: 832, offset: 992)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 832, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !129, file: !128, line: 68, baseType: !120, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !129, file: !128, line: 69, baseType: !124, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !129, file: !128, line: 70, baseType: !155, size: 160, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !129, file: !128, line: 71, baseType: !120, size: 32, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !129, file: !128, line: 72, baseType: !120, size: 32, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !129, file: !128, line: 73, baseType: !124, size: 32, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !129, file: !128, line: 74, baseType: !120, size: 32, offset: 2144)
!176 = !{!109}
!177 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!103, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{!191, !195, !196, !197, !206, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 380, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !188, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !189, line: 386, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !200)
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !199, file: !189, line: 359, baseType: !202, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !199, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !188, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !189, line: 43, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !212)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !179, file: !180, line: 65, baseType: !186, size: 32, offset: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "free_queue", scope: !216, file: !313, line: 17, type: !314, isLocal: true, isDefinition: true, align: 32)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !218, globals: !310, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!218 = !{!102, !219, !223, !103, !225}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !220, line: 46, baseType: !221)
!220 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !222)
!222 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !224, line: 214, baseType: !32)
!224 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !228, line: 336, size: 608, elements: !229)
!228 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !{!230, !250, !254, !258, !271, !276, !282, !288, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !227, file: !228, line: 365, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{!103, !234, !249}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !237)
!237 = !{!238, !239, !240, !241, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !189, line: 380, baseType: !192, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !236, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !236, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !236, file: !189, line: 386, baseType: !242, size: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !243, file: !189, line: 359, baseType: !202, size: 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !243, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !236, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !227, file: !228, line: 366, baseType: !251, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !234, !203}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !227, file: !228, line: 374, baseType: !255, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{!103, !234}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !227, file: !228, line: 377, baseType: !259, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!103, !234, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !228, line: 122, size: 64, elements: !265)
!265 = !{!266, !267, !268, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !264, file: !228, line: 123, baseType: !121, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !264, file: !228, line: 124, baseType: !202, size: 8, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !264, file: !228, line: 125, baseType: !202, size: 8, offset: 40)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !264, file: !228, line: 126, baseType: !202, size: 8, offset: 48)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !264, file: !228, line: 127, baseType: !202, size: 8, offset: 56)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !227, file: !228, line: 379, baseType: !272, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DISubroutineType(types: !274)
!274 = !{!103, !234, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !227, file: !228, line: 384, baseType: !277, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DISubroutineType(types: !279)
!279 = !{!103, !234, !280, !103}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !227, file: !228, line: 393, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!103, !234, !286, !287}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !227, file: !228, line: 402, baseType: !289, size: 32, offset: 224)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !234}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !227, file: !228, line: 405, baseType: !289, size: 32, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !227, file: !228, line: 408, baseType: !255, size: 32, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !227, file: !228, line: 411, baseType: !289, size: 32, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !227, file: !228, line: 414, baseType: !289, size: 32, offset: 352)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !227, file: !228, line: 417, baseType: !255, size: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !227, file: !228, line: 420, baseType: !255, size: 32, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !227, file: !228, line: 423, baseType: !289, size: 32, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !227, file: !228, line: 426, baseType: !289, size: 32, offset: 480)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !227, file: !228, line: 429, baseType: !255, size: 32, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !227, file: !228, line: 432, baseType: !255, size: 32, offset: 544)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !227, file: !228, line: 435, baseType: !303, size: 32, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !234, !306, !102}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !228, line: 142, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !234, !102}
!310 = !{!214, !311, !358, !379}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "used_queue", scope: !216, file: !313, line: 18, type: !314, isLocal: true, isDefinition: true, align: 32)
!313 = !DIFile(filename: "zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !315, line: 2208, size: 128, elements: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !314, file: !315, line: 2209, baseType: !318, size: 128)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !315, line: 1709, size: 128, elements: !319)
!319 = !{!320, !333, !337}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !318, file: !315, line: 1710, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !322, line: 46, baseType: !323)
!322 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !322, line: 41, size: 64, elements: !324)
!324 = !{!325, !332}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !323, file: !322, line: 42, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !322, line: 39, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !322, line: 35, size: 32, elements: !329)
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !328, file: !322, line: 36, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !322, line: 32, baseType: !121)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !323, file: !322, line: 43, baseType: !326, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !318, file: !315, line: 1711, baseType: !334, offset: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !335, line: 43, elements: !336)
!335 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !318, file: !315, line: 1712, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !339, line: 233, baseType: !340)
!339 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 231, size: 64, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !340, file: !339, line: 232, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !344, line: 48, baseType: !345)
!344 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !344, line: 37, size: 64, elements: !346)
!346 = !{!347, !353}
!347 = !DIDerivedType(tag: DW_TAG_member, scope: !345, file: !344, line: 38, baseType: !348, size: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !344, line: 38, size: 32, elements: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !348, file: !344, line: 39, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !344, line: 40, baseType: !351, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, scope: !345, file: !344, line: 42, baseType: !354, size: 32, offset: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !344, line: 42, size: 32, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !354, file: !344, line: 43, baseType: !351, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !344, line: 44, baseType: !351, size: 32)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "cmd", scope: !360, file: !313, line: 22, type: !367, isLocal: true, isDefinition: true)
!360 = distinct !DISubprogram(name: "console_getline", scope: !313, file: !313, line: 20, type: !361, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !364)
!361 = !DISubroutineType(types: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!364 = !{!365}
!365 = !DILocalVariable(name: "ret", scope: !366, file: !313, line: 29, type: !102)
!366 = distinct !DILexicalBlock(scope: !360, file: !313, line: 29, column: 8)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "console_input", file: !369, line: 21, size: 1088, elements: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !{!371, !374, !375}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !368, file: !369, line: 23, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !373)
!373 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_mcumgr", scope: !368, file: !369, line: 25, baseType: !202, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !368, file: !369, line: 27, baseType: !376, size: 1024, offset: 40)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1024, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 128)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "line_bufs", scope: !216, file: !313, line: 15, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 2176, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 2)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "static_regions", scope: !386, file: !393, line: 62, type: !523, isLocal: true, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !388, globals: !389, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!388 = !{!223, !103, !121, !102}
!389 = !{!390, !384}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !392, file: !393, line: 198, type: !511, isLocal: true, isDefinition: true)
!392 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !393, file: !393, line: 175, type: !394, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !386, retainedNodes: !506)
!393 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !DISubroutineType(types: !395)
!395 = !{null, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !398, line: 245, size: 1024, elements: !399)
!398 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!399 = !{!400, !463, !476, !477, !478, !479, !485, !501}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !397, file: !398, line: 247, baseType: !401, size: 384)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !398, line: 57, size: 384, elements: !402)
!402 = !{!403, !428, !435, !436, !437, !450, !451, !452}
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !398, line: 60, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !398, line: 60, size: 64, elements: !405)
!405 = !{!406, !421}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !404, file: !398, line: 61, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !344, line: 49, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !344, line: 37, size: 64, elements: !409)
!409 = !{!410, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !344, line: 38, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !344, line: 38, size: 32, elements: !412)
!412 = !{!413, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !411, file: !344, line: 39, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !344, line: 40, baseType: !414, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !344, line: 42, baseType: !417, size: 32, offset: 32)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !344, line: 42, size: 32, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !417, file: !344, line: 43, baseType: !414, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !344, line: 44, baseType: !414, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !404, file: !398, line: 62, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !423, line: 49, size: 64, elements: !424)
!423 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !422, file: !423, line: 50, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 64, elements: !382)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !401, file: !398, line: 68, baseType: !429, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !339, line: 233, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 231, size: 64, elements: !432)
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !431, file: !339, line: 232, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !344, line: 48, baseType: !408)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !401, file: !398, line: 71, baseType: !202, size: 8, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !401, file: !398, line: 74, baseType: !202, size: 8, offset: 104)
!437 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !398, line: 90, baseType: !438, size: 16, offset: 112)
!438 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !398, line: 90, size: 16, elements: !439)
!439 = !{!440, !447}
!440 = !DIDerivedType(tag: DW_TAG_member, scope: !438, file: !398, line: 91, baseType: !441, size: 16)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !438, file: !398, line: 91, size: 16, elements: !442)
!442 = !{!443, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !441, file: !398, line: 96, baseType: !444, size: 8)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !445)
!445 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !441, file: !398, line: 97, baseType: !202, size: 8, offset: 8)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !438, file: !398, line: 100, baseType: !448, size: 16)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !449)
!449 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !401, file: !398, line: 107, baseType: !121, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !401, file: !398, line: 127, baseType: !102, size: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !401, file: !398, line: 131, baseType: !453, size: 192, offset: 192)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !339, line: 244, size: 192, elements: !454)
!454 = !{!455, !456, !462}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !453, file: !339, line: 245, baseType: !407, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !453, file: !339, line: 246, baseType: !457, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !339, line: 242, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !453, file: !339, line: 249, baseType: !221, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !397, file: !398, line: 250, baseType: !464, size: 288, offset: 384)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !465, line: 25, size: 288, elements: !466)
!465 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !464, file: !465, line: 26, baseType: !121, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !464, file: !465, line: 27, baseType: !121, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !464, file: !465, line: 28, baseType: !121, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !464, file: !465, line: 29, baseType: !121, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !464, file: !465, line: 30, baseType: !121, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !464, file: !465, line: 31, baseType: !121, size: 32, offset: 160)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !464, file: !465, line: 32, baseType: !121, size: 32, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !464, file: !465, line: 33, baseType: !121, size: 32, offset: 224)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !464, file: !465, line: 34, baseType: !121, size: 32, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !397, file: !398, line: 253, baseType: !102, size: 32, offset: 672)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !397, file: !398, line: 256, baseType: !430, size: 64, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !397, file: !398, line: 294, baseType: !103, size: 32, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !397, file: !398, line: 300, baseType: !480, size: 96, offset: 800)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !398, line: 149, size: 96, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !480, file: !398, line: 153, baseType: !22, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !480, file: !398, line: 162, baseType: !223, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !480, file: !398, line: 168, baseType: !223, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !397, file: !398, line: 325, baseType: !486, size: 32, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !315, line: 5073, size: 160, elements: !488)
!488 = !{!489, !498, !499}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !487, file: !315, line: 5074, baseType: !490, size: 96)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !491, line: 56, size: 96, elements: !492)
!491 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!492 = !{!493, !496, !497}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !490, file: !491, line: 57, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !491, line: 57, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !490, file: !491, line: 58, baseType: !102, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !490, file: !491, line: 59, baseType: !223, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !487, file: !315, line: 5075, baseType: !430, size: 64, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !487, file: !315, line: 5076, baseType: !500, offset: 160)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !335, line: 43, elements: !336)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !397, file: !398, line: 343, baseType: !502, size: 64, offset: 928)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !465, line: 60, size: 64, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !502, file: !465, line: 63, baseType: !121, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !502, file: !465, line: 66, baseType: !121, size: 32, offset: 32)
!506 = !{!507, !508, !509, !510}
!507 = !DILocalVariable(name: "thread", arg: 1, scope: !392, file: !393, line: 175, type: !396)
!508 = !DILocalVariable(name: "region_num", scope: !392, file: !393, line: 200, type: !202)
!509 = !DILocalVariable(name: "guard_start", scope: !392, file: !393, line: 265, type: !22)
!510 = !DILocalVariable(name: "guard_size", scope: !392, file: !393, line: 266, type: !223)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 96, elements: !136)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !513, line: 52, size: 96, elements: !514)
!513 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !512, file: !513, line: 53, baseType: !22, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !512, file: !513, line: 54, baseType: !223, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !512, file: !513, line: 55, baseType: !518, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !519, line: 151, baseType: !520)
!519 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 149, size: 32, elements: !521)
!521 = !{!522}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !520, file: !519, line: 150, baseType: !121, size: 32)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 96, elements: !136)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !527, file: !559, line: 39, type: !202, isLocal: true, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !529, globals: !558, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!529 = !{!530, !102, !103, !546, !202}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !532, line: 1168, baseType: !533)
!532 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 1155, size: 352, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !533, file: !532, line: 1157, baseType: !124, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !533, file: !532, line: 1158, baseType: !120, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !533, file: !532, line: 1159, baseType: !120, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !533, file: !532, line: 1160, baseType: !120, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !533, file: !532, line: 1161, baseType: !120, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !533, file: !532, line: 1162, baseType: !120, size: 32, offset: 160)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !533, file: !532, line: 1163, baseType: !120, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !533, file: !532, line: 1164, baseType: !120, size: 32, offset: 224)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !533, file: !532, line: 1165, baseType: !120, size: 32, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !533, file: !532, line: 1166, baseType: !120, size: 32, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !533, file: !532, line: 1167, baseType: !120, size: 32, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !549, line: 27, size: 96, elements: !550)
!549 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !548, file: !549, line: 29, baseType: !121, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !548, file: !549, line: 31, baseType: !192, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !548, file: !549, line: 37, baseType: !554, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !519, line: 146, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !519, line: 141, size: 32, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !555, file: !519, line: 143, baseType: !121, size: 32)
!558 = !{!525}
!559 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !562, file: !569, line: 21, type: !106, isLocal: true, isDefinition: true)
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !564, globals: !568, splitDebugInlining: false, nameTableKind: None)
!563 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!564 = !{!565, !103, !102}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !567, line: 22, baseType: !103)
!567 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!568 = !{!560}
!569 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !572, file: !577, line: 13, type: !594, isLocal: true, isDefinition: true)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !574, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!574 = !{!575, !570}
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "mpu_config", scope: !572, file: !577, line: 37, type: !578, isLocal: false, isDefinition: true)
!577 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !549, line: 41, size: 64, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !579, file: !549, line: 43, baseType: !121, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !579, file: !549, line: 45, baseType: !583, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !549, line: 27, size: 96, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !585, file: !549, line: 29, baseType: !121, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !585, file: !549, line: 31, baseType: !192, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !585, file: !549, line: 37, baseType: !590, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !519, line: 146, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !519, line: 141, size: 32, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !591, file: !519, line: 143, baseType: !121, size: 32)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 192, elements: !382)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "avail_queue", scope: !597, file: !601, line: 108, type: !698, isLocal: true, isDefinition: true)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !599, retainedTypes: !608, globals: !688, splitDebugInlining: false, nameTableKind: None)
!598 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!599 = !{!30, !600}
!600 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !601, line: 214, baseType: !32, size: 32, elements: !602)
!601 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!602 = !{!603, !604, !605, !606, !607}
!603 = !DIEnumerator(name: "ESC_ESC", value: 0)
!604 = !DIEnumerator(name: "ESC_ANSI", value: 1)
!605 = !DIEnumerator(name: "ESC_ANSI_FIRST", value: 2)
!606 = !DIEnumerator(name: "ESC_ANSI_VAL", value: 3)
!607 = !DIEnumerator(name: "ESC_ANSI_VAL_2", value: 4)
!608 = !{!102, !103, !609, !32, !24}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !228, line: 336, size: 608, elements: !612)
!612 = !{!613, !632, !636, !640, !653, !658, !662, !666, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !611, file: !228, line: 365, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DISubroutineType(types: !616)
!616 = !{!103, !617, !249}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !620)
!620 = !{!621, !622, !623, !624, !630, !631}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !619, file: !189, line: 380, baseType: !192, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !619, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !619, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !619, file: !189, line: 386, baseType: !625, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !626, file: !189, line: 359, baseType: !202, size: 8)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !626, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !619, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !619, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !611, file: !228, line: 366, baseType: !633, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !617, !203}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !611, file: !228, line: 374, baseType: !637, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DISubroutineType(types: !639)
!639 = !{!103, !617}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !611, file: !228, line: 377, baseType: !641, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DISubroutineType(types: !643)
!643 = !{!103, !617, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !228, line: 122, size: 64, elements: !647)
!647 = !{!648, !649, !650, !651, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !646, file: !228, line: 123, baseType: !121, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !646, file: !228, line: 124, baseType: !202, size: 8, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !646, file: !228, line: 125, baseType: !202, size: 8, offset: 40)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !646, file: !228, line: 126, baseType: !202, size: 8, offset: 48)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !646, file: !228, line: 127, baseType: !202, size: 8, offset: 56)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !611, file: !228, line: 379, baseType: !654, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DISubroutineType(types: !656)
!656 = !{!103, !617, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !611, file: !228, line: 384, baseType: !659, size: 32, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DISubroutineType(types: !661)
!661 = !{!103, !617, !280, !103}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !611, file: !228, line: 393, baseType: !663, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DISubroutineType(types: !665)
!665 = !{!103, !617, !286, !287}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !611, file: !228, line: 402, baseType: !667, size: 32, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !617}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !611, file: !228, line: 405, baseType: !667, size: 32, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !611, file: !228, line: 408, baseType: !637, size: 32, offset: 288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !611, file: !228, line: 411, baseType: !667, size: 32, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !611, file: !228, line: 414, baseType: !667, size: 32, offset: 352)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !611, file: !228, line: 417, baseType: !637, size: 32, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !611, file: !228, line: 420, baseType: !637, size: 32, offset: 416)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !611, file: !228, line: 423, baseType: !667, size: 32, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !611, file: !228, line: 426, baseType: !667, size: 32, offset: 480)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !611, file: !228, line: 429, baseType: !637, size: 32, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !611, file: !228, line: 432, baseType: !637, size: 32, offset: 544)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !611, file: !228, line: 435, baseType: !681, size: 32, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !617, !684, !102}
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !228, line: 142, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !617, !102}
!688 = !{!689, !595, !696, !736, !741, !744, !763, !767, !769, !771, !773}
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !597, file: !601, line: 603, type: !691, isLocal: true, isDefinition: true, align: 32)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !692, file: !180, line: 60, baseType: !637, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !692, file: !180, line: 65, baseType: !617, size: 32, offset: 32)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "lines_queue", scope: !597, file: !601, line: 109, type: !698, isLocal: true, isDefinition: true)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !315, line: 2208, size: 128, elements: !700)
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !699, file: !315, line: 2209, baseType: !702, size: 128)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !315, line: 1709, size: 128, elements: !703)
!703 = !{!704, !715, !717}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !702, file: !315, line: 1710, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !322, line: 46, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !322, line: 41, size: 64, elements: !707)
!707 = !{!708, !714}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !706, file: !322, line: 42, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !322, line: 39, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !322, line: 35, size: 32, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !711, file: !322, line: 36, baseType: !331, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !706, file: !322, line: 43, baseType: !709, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !702, file: !315, line: 1711, baseType: !716, offset: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !335, line: 43, elements: !336)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !702, file: !315, line: 1712, baseType: !718, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !339, line: 233, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 231, size: 64, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !719, file: !339, line: 232, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !344, line: 48, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !344, line: 37, size: 64, elements: !724)
!724 = !{!725, !731}
!725 = !DIDerivedType(tag: DW_TAG_member, scope: !723, file: !344, line: 38, baseType: !726, size: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !723, file: !344, line: 38, size: 32, elements: !727)
!727 = !{!728, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !726, file: !344, line: 39, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !344, line: 40, baseType: !729, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, scope: !723, file: !344, line: 42, baseType: !732, size: 32, offset: 32)
!732 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !723, file: !344, line: 42, size: 32, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !732, file: !344, line: 43, baseType: !729, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !732, file: !344, line: 44, baseType: !729, size: 32)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "completion_cb", scope: !597, file: !601, line: 110, type: !738, isLocal: true, isDefinition: true)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DISubroutineType(types: !740)
!740 = !{!202, !363, !202}
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !597, file: !601, line: 38, type: !743, isLocal: true, isDefinition: true)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "cmd", scope: !746, file: !601, line: 435, type: !757, isLocal: true, isDefinition: true)
!746 = distinct !DISubprogram(name: "uart_console_isr", scope: !601, file: !601, line: 428, type: !686, scopeLine: 429, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !597, retainedNodes: !747)
!747 = !{!748, !749, !750, !752, !753}
!748 = !DILocalVariable(name: "unused", arg: 1, scope: !746, file: !601, line: 428, type: !617)
!749 = !DILocalVariable(name: "user_data", arg: 2, scope: !746, file: !601, line: 428, type: !102)
!750 = !DILocalVariable(name: "byte", scope: !751, file: !601, line: 436, type: !202)
!751 = distinct !DILexicalBlock(scope: !746, file: !601, line: 434, column: 48)
!752 = !DILocalVariable(name: "rx", scope: !751, file: !601, line: 437, type: !103)
!753 = !DILocalVariable(name: "ret", scope: !754, file: !601, line: 461, type: !102)
!754 = distinct !DILexicalBlock(scope: !755, file: !601, line: 461, column: 10)
!755 = distinct !DILexicalBlock(scope: !756, file: !601, line: 460, column: 13)
!756 = distinct !DILexicalBlock(scope: !751, file: !601, line: 460, column: 7)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "console_input", file: !369, line: 21, size: 1088, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !758, file: !369, line: 23, baseType: !372, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "is_mcumgr", scope: !758, file: !369, line: 25, baseType: !202, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !758, file: !369, line: 27, baseType: !376, size: 1024, offset: 40)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "esc_state", scope: !597, file: !601, line: 228, type: !765, isLocal: true, isDefinition: true)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !766, line: 22, baseType: !373)
!766 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "ansi_val", scope: !597, file: !601, line: 229, type: !32, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "ansi_val_2", scope: !597, file: !601, line: 229, type: !32, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "cur", scope: !597, file: !601, line: 230, type: !202, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "end", scope: !597, file: !601, line: 230, type: !202, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !777, file: !782, line: 7, type: !783, isLocal: false, isDefinition: true, align: 16)
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !779, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!779 = !{!775, !780}
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !777, file: !782, line: 12, type: !783, isLocal: false, isDefinition: true, align: 16)
!782 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 48, elements: !152)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !786, file: !847, line: 234, type: !882, isLocal: true, isDefinition: true)
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !788, globals: !844, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!788 = !{!789, !121}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !792, line: 134, size: 128, elements: !793)
!792 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!793 = !{!794, !814, !819, !839}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !791, file: !792, line: 135, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !792, line: 113, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DISubroutineType(types: !798)
!798 = !{!103, !799, !202}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !802)
!802 = !{!803, !804, !805, !806, !812, !813}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !189, line: 380, baseType: !192, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !801, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !801, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !801, file: !189, line: 386, baseType: !807, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !808, file: !189, line: 359, baseType: !202, size: 8)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !808, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !801, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !791, file: !792, line: 136, baseType: !815, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !792, line: 119, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{!103, !799}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !791, file: !792, line: 137, baseType: !820, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !792, line: 125, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{!103, !799, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !792, line: 88, size: 128, elements: !827)
!827 = !{!828, !833, !838}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !826, file: !792, line: 90, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !792, line: 72, size: 64, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !829, file: !792, line: 74, baseType: !121, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !829, file: !792, line: 76, baseType: !121, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !826, file: !792, line: 92, baseType: !834, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !792, line: 85, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !799, !103}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !826, file: !792, line: 104, baseType: !202, size: 8, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !791, file: !792, line: 138, baseType: !840, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !792, line: 132, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DISubroutineType(types: !843)
!843 = !{!103, !799, !103}
!844 = !{!845, !849, !851, !858, !784, !860, !862, !870}
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !786, file: !847, line: 256, type: !848, isLocal: false, isDefinition: true, align: 16)
!847 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 80, elements: !156)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !786, file: !847, line: 256, type: !800, isLocal: false, isDefinition: true, align: 32)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !786, file: !847, line: 256, type: !853, isLocal: true, isDefinition: true, align: 32)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !854, file: !180, line: 60, baseType: !816, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !854, file: !180, line: 65, baseType: !799, size: 32, offset: 32)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !786, file: !847, line: 256, type: !808, isLocal: true, isDefinition: true, align: 8)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !786, file: !847, line: 227, type: !790, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !786, file: !847, line: 45, type: !864, isLocal: true, isDefinition: true)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !847, line: 38, size: 96, elements: !865)
!865 = !{!866, !867, !868, !869}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !864, file: !847, line: 39, baseType: !834, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !864, file: !847, line: 40, baseType: !121, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !864, file: !847, line: 41, baseType: !205, size: 8, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !864, file: !847, line: 42, baseType: !205, size: 8, offset: 72)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !872, file: !847, line: 240, type: !875, isLocal: true, isDefinition: true, align: 32)
!872 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !847, file: !847, line: 238, type: !873, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !786, retainedNodes: !336)
!873 = !DISubroutineType(types: !874)
!874 = !{null}
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !876)
!876 = !{!877, !879, !880, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !875, file: !10, line: 55, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !875, file: !10, line: 57, baseType: !878, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !875, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !875, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !847, line: 34, size: 32, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !883, file: !847, line: 35, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !888, line: 45, baseType: !889)
!888 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 41, size: 96, elements: !890)
!890 = !{!891, !892, !893}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !889, file: !888, line: 42, baseType: !120, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !889, file: !888, line: 43, baseType: !120, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !889, file: !888, line: 44, baseType: !124, size: 32, offset: 64)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !896, file: !1014, line: 494, type: !1074, isLocal: true, isDefinition: true)
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !898, retainedTypes: !931, globals: !1011, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getline")
!898 = !{!899, !906, !912, !919, !924}
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !228, line: 47, baseType: !32, size: 32, elements: !900)
!900 = !{!901, !902, !903, !904, !905}
!901 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!902 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!903 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!904 = !DIEnumerator(name: "UART_BREAK", value: 8)
!905 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !228, line: 84, baseType: !32, size: 32, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!909 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!910 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!911 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !228, line: 92, baseType: !32, size: 32, elements: !913)
!913 = !{!914, !915, !916, !917, !918}
!914 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!915 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!916 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!917 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!918 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !228, line: 107, baseType: !32, size: 32, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!922 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!923 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !228, line: 75, baseType: !32, size: 32, elements: !925)
!925 = !{!926, !927, !928, !929, !930}
!926 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!927 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!928 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!929 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!930 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!931 = !{!932, !102, !203, !121}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !228, line: 336, size: 608, elements: !935)
!935 = !{!936, !955, !959, !963, !976, !981, !985, !989, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !934, file: !228, line: 365, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{!103, !940, !249}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !943)
!943 = !{!944, !945, !946, !947, !953, !954}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !189, line: 380, baseType: !192, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !942, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !942, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !942, file: !189, line: 386, baseType: !948, size: 32, offset: 96)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !949, file: !189, line: 359, baseType: !202, size: 8)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !949, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !942, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !942, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !934, file: !228, line: 366, baseType: !956, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !940, !203}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !934, file: !228, line: 374, baseType: !960, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{!103, !940}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !934, file: !228, line: 377, baseType: !964, size: 32, offset: 96)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{!103, !940, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !228, line: 122, size: 64, elements: !970)
!970 = !{!971, !972, !973, !974, !975}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !969, file: !228, line: 123, baseType: !121, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !969, file: !228, line: 124, baseType: !202, size: 8, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !969, file: !228, line: 125, baseType: !202, size: 8, offset: 40)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !969, file: !228, line: 126, baseType: !202, size: 8, offset: 48)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !969, file: !228, line: 127, baseType: !202, size: 8, offset: 56)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !934, file: !228, line: 379, baseType: !977, size: 32, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{!103, !940, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !934, file: !228, line: 384, baseType: !982, size: 32, offset: 160)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{!103, !940, !280, !103}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !934, file: !228, line: 393, baseType: !986, size: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{!103, !940, !286, !287}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !934, file: !228, line: 402, baseType: !990, size: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !940}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !934, file: !228, line: 405, baseType: !990, size: 32, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !934, file: !228, line: 408, baseType: !960, size: 32, offset: 288)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !934, file: !228, line: 411, baseType: !990, size: 32, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !934, file: !228, line: 414, baseType: !990, size: 32, offset: 352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !934, file: !228, line: 417, baseType: !960, size: 32, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !934, file: !228, line: 420, baseType: !960, size: 32, offset: 416)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !934, file: !228, line: 423, baseType: !990, size: 32, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !934, file: !228, line: 426, baseType: !990, size: 32, offset: 480)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !934, file: !228, line: 429, baseType: !960, size: 32, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !934, file: !228, line: 432, baseType: !960, size: 32, offset: 544)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !934, file: !228, line: 435, baseType: !1004, size: 32, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !940, !1007, !102}
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !228, line: 142, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !940, !102}
!1011 = !{!1012, !1018, !1020, !1027, !1029, !1031, !894, !1038, !1057, !1060, !1063}
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !896, file: !1014, line: 494, type: !1015, isLocal: false, isDefinition: true, align: 16)
!1014 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 6)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !896, file: !1014, line: 494, type: !941, isLocal: false, isDefinition: true, align: 32)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !896, file: !1014, line: 494, type: !1022, isLocal: true, isDefinition: true, align: 32)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1023, file: !180, line: 60, baseType: !960, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1023, file: !180, line: 65, baseType: !940, size: 32, offset: 32)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !896, file: !1014, line: 494, type: !949, isLocal: true, isDefinition: true, align: 8)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !896, file: !1014, line: 419, type: !933, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !896, file: !1014, line: 494, type: !1033, isLocal: true, isDefinition: true)
