; ModuleID = 'build/96b_wistrio/benchmark/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_bm_channel", scope: !27, file: !114, line: 16, type: !136, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !290, !292, !294, !296, !298, !300, !302, !304, !306, !339, !343, !348, !350, !357, !362}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "bm_channel", scope: !27, file: !114, line: 16, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 192, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !123, !125, !126, !134, !259}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !120, size: 16)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !124, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !13, !132}
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 214, baseType: !32)
!133 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !137, line: 2720, size: 160, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !160, !257, !258}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !136, file: !137, line: 2722, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !142, file: !141, line: 232, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !148)
!148 = !{!149, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 38, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 38, size: 32, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !150, file: !146, line: 39, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !146, line: 40, baseType: !153, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 42, baseType: !156, size: 32, offset: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 42, size: 32, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !156, file: !146, line: 43, baseType: !153, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !146, line: 44, baseType: !153, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !136, file: !137, line: 2724, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = !{!165, !212, !225, !226, !227, !228, !234, !252}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !162, file: !163, line: 247, baseType: !166, size: 384)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !167)
!167 = !{!168, !182, !184, !187, !188, !199, !200, !201}
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 60, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 60, size: 64, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !169, file: !163, line: 61, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !147)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !169, file: !163, line: 62, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !176)
!175 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !174, file: !175, line: 50, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!180 = !{!181}
!181 = !DISubrange(count: 2)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !166, file: !163, line: 68, baseType: !183, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !166, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !186)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !166, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 90, baseType: !189, size: 16, offset: 112)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 90, size: 16, elements: !190)
!190 = !{!191, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !163, line: 91, baseType: !192, size: 16)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !163, line: 91, size: 16, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !192, file: !163, line: 96, baseType: !195, size: 8)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !196)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !192, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !189, file: !163, line: 100, baseType: !121, size: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !166, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !166, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !166, file: !163, line: 131, baseType: !202, size: 192, offset: 192)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !203)
!203 = !{!204, !205, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !141, line: 245, baseType: !172, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !202, file: !141, line: 246, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !202, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !162, file: !163, line: 250, baseType: !213, size: 288, offset: 384)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !213, file: !214, line: 26, baseType: !108, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !213, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !213, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !213, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !213, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !213, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !213, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !213, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !213, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !162, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !162, file: !163, line: 256, baseType: !140, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !162, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !162, file: !163, line: 300, baseType: !229, size: 96, offset: 800)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !163, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !162, file: !163, line: 325, baseType: !235, size: 32, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !137, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !137, line: 5075, baseType: !140, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !137, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !162, file: !163, line: 343, baseType: !253, size: 64, offset: 928)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !214, line: 63, baseType: !108, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !136, file: !137, line: 2727, baseType: !108, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !136, file: !137, line: 2730, baseType: !103, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !260, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 96, elements: !265)
!265 = !{!266, !267, !284}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !264, file: !117, line: 91, baseType: !131, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !264, file: !117, line: 93, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !137, line: 4204, size: 320, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !279, !280, !281, !282, !283}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !137, line: 4206, baseType: !140, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !137, line: 4208, baseType: !249, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !270, file: !137, line: 4210, baseType: !132, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !270, file: !137, line: 4212, baseType: !108, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !270, file: !137, line: 4214, baseType: !277, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !270, file: !137, line: 4216, baseType: !277, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !270, file: !137, line: 4218, baseType: !277, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !270, file: !137, line: 4220, baseType: !277, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !270, file: !137, line: 4222, baseType: !108, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !137, line: 4227, baseType: !185, size: 8, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !264, file: !117, line: 96, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "s1", scope: !27, file: !114, line: 126, type: !264, isLocal: false, isDefinition: true, align: 32)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "s2", scope: !27, file: !114, line: 129, type: !264, isLocal: false, isDefinition: true, align: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s3", scope: !27, file: !114, line: 131, type: !264, isLocal: false, isDefinition: true, align: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "s4", scope: !27, file: !114, line: 132, type: !264, isLocal: false, isDefinition: true, align: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "s5", scope: !27, file: !114, line: 134, type: !264, isLocal: false, isDefinition: true, align: 32)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "s6", scope: !27, file: !114, line: 135, type: !264, isLocal: false, isDefinition: true, align: 32)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "s7", scope: !27, file: !114, line: 136, type: !264, isLocal: false, isDefinition: true, align: 32)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "s8", scope: !27, file: !114, line: 137, type: !264, isLocal: false, isDefinition: true, align: 32)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !27, file: !114, line: 216, type: !308, isLocal: false, isDefinition: true, align: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !137, line: 620, size: 384, elements: !309)
!309 = !{!310, !311, !319, !320, !325, !326, !327, !328, !329, !330, !332, !336}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !308, file: !137, line: 621, baseType: !161, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !308, file: !137, line: 622, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !314, line: 44, baseType: !315)
!314 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !316, line: 47, size: 8, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !316, line: 48, baseType: !278, size: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !308, file: !137, line: 623, baseType: !32, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !308, file: !137, line: 624, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !314, line: 46, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !102, !102, !102}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !308, file: !137, line: 625, baseType: !102, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !308, file: !137, line: 626, baseType: !102, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !308, file: !137, line: 627, baseType: !102, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !308, file: !137, line: 628, baseType: !103, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !308, file: !137, line: 629, baseType: !108, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !308, file: !137, line: 630, baseType: !331, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !308, file: !137, line: 631, baseType: !333, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !308, file: !137, line: 632, baseType: !337, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !27, file: !114, line: 216, type: !341, isLocal: false, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !163, line: 347, baseType: !161)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !27, file: !114, line: 216, type: !345, isLocal: false, isDefinition: true, align: 512)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 8704, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1088)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !27, file: !114, line: 216, type: !162, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "_zbus_message_bm_channel", scope: !27, file: !114, line: 16, type: !352, isLocal: true, isDefinition: true)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !353, line: 10, size: 64, elements: !354)
!353 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !352, file: !353, line: 11, baseType: !102, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !353, line: 12, baseType: !132, size: 32, offset: 32)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "_zbus_observers_bm_channel", scope: !27, file: !114, line: 16, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 288, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 9)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 44, type: !109, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !366, file: !381, line: 18, type: !382, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !368, globals: !380, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!368 = !{!22, !102, !24, !369, !371, !373, !132, !103, !374, !375, !377, !378, !277, !379, !121, !337}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!380 = !{!364}
!381 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !384, line: 17, baseType: !337, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !383, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "_char_out", scope: !390, file: !394, line: 54, type: !395, isLocal: false, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!392 = !{!102, !103}
!393 = !{!388}
!394 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!103, !103}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !400, file: !430, line: 60, type: !431, isLocal: true, isDefinition: true, align: 32)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !402, globals: !429, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!402 = !{!403, !423}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !405, line: 386, baseType: !406)
!405 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 370, size: 448, elements: !407)
!407 = !{!408, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !406, file: !405, line: 372, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !406, file: !405, line: 373, baseType: !409, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !406, file: !405, line: 374, baseType: !409, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !406, file: !405, line: 375, baseType: !409, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !406, file: !405, line: 376, baseType: !409, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !406, file: !405, line: 377, baseType: !409, size: 32, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !406, file: !405, line: 378, baseType: !409, size: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !406, file: !405, line: 379, baseType: !409, size: 32, offset: 224)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !406, file: !405, line: 380, baseType: !409, size: 32, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !406, file: !405, line: 381, baseType: !409, size: 32, offset: 288)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !406, file: !405, line: 382, baseType: !409, size: 32, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !406, file: !405, line: 383, baseType: !409, size: 32, offset: 352)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !406, file: !405, line: 384, baseType: !409, size: 32, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !406, file: !405, line: 385, baseType: !409, size: 32, offset: 416)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !405, line: 364, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 360, size: 64, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !425, file: !405, line: 362, baseType: !409, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !425, file: !405, line: 363, baseType: !409, size: 32, offset: 32)
!429 = !{!398}
!430 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !433, line: 51, size: 64, elements: !434)
!433 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !{!435, !460}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !432, file: !433, line: 60, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DISubroutineType(types: !438)
!438 = !{!103, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !442, line: 378, size: 192, elements: !443)
!442 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!443 = !{!444, !445, !446, !447, !453, !454}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !442, line: 380, baseType: !337, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !441, file: !442, line: 382, baseType: !13, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !441, file: !442, line: 384, baseType: !13, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !441, file: !442, line: 386, baseType: !448, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !442, line: 351, size: 16, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !449, file: !442, line: 359, baseType: !185, size: 8)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !449, file: !442, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !442, line: 388, baseType: !102, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !441, file: !442, line: 396, baseType: !455, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !442, line: 43, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !459)
!459 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !432, file: !433, line: 65, baseType: !439, size: 32, offset: 32)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !463, file: !466, line: 71, type: !467, isLocal: true, isDefinition: true, align: 32)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !465, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!465 = !{!461}
!466 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !433, line: 51, size: 64, elements: !469)
!469 = !{!470, !489}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !468, file: !433, line: 60, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!103, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !442, line: 378, size: 192, elements: !477)
!477 = !{!478, !479, !480, !481, !487, !488}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !442, line: 380, baseType: !337, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !476, file: !442, line: 382, baseType: !13, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !476, file: !442, line: 384, baseType: !13, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !476, file: !442, line: 386, baseType: !482, size: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !442, line: 351, size: 16, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !483, file: !442, line: 359, baseType: !185, size: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !483, file: !442, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !476, file: !442, line: 388, baseType: !102, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !476, file: !442, line: 396, baseType: !455, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !468, file: !433, line: 65, baseType: !474, size: 32, offset: 32)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !492, file: !499, line: 17, type: !625, isLocal: false, isDefinition: true)
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !494, globals: !495, splitDebugInlining: false, nameTableKind: None)
!493 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!494 = !{!132, !103, !108, !102}
!495 = !{!490, !496, !621}
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !498, file: !499, line: 198, type: !607, isLocal: true, isDefinition: true)
!498 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !499, file: !499, line: 175, type: !500, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !492, retainedNodes: !602)
!499 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !DISubroutineType(types: !501)
!501 = !{null, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !504)
!504 = !{!505, !563, !575, !576, !577, !578, !584, !597}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !503, file: !163, line: 247, baseType: !506, size: 384)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !507)
!507 = !{!508, !532, !539, !540, !541, !550, !551, !552}
!508 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !163, line: 60, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !506, file: !163, line: 60, size: 64, elements: !510)
!510 = !{!511, !526}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !509, file: !163, line: 61, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !514)
!514 = !{!515, !521}
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !513, file: !146, line: 38, baseType: !516, size: 32)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !513, file: !146, line: 38, size: 32, elements: !517)
!517 = !{!518, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !516, file: !146, line: 39, baseType: !519, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !146, line: 40, baseType: !519, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, scope: !513, file: !146, line: 42, baseType: !522, size: 32, offset: 32)
!522 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !513, file: !146, line: 42, size: 32, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !522, file: !146, line: 43, baseType: !519, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !522, file: !146, line: 44, baseType: !519, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !509, file: !163, line: 62, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !527, file: !175, line: 50, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 64, elements: !180)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !506, file: !163, line: 68, baseType: !533, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !535, file: !141, line: 232, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !513)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !506, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !506, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!541 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !163, line: 90, baseType: !542, size: 16, offset: 112)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !506, file: !163, line: 90, size: 16, elements: !543)
!543 = !{!544, !549}
!544 = !DIDerivedType(tag: DW_TAG_member, scope: !542, file: !163, line: 91, baseType: !545, size: 16)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !542, file: !163, line: 91, size: 16, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !545, file: !163, line: 96, baseType: !195, size: 8)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !545, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !542, file: !163, line: 100, baseType: !121, size: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !506, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !506, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !506, file: !163, line: 131, baseType: !553, size: 192, offset: 192)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !554)
!554 = !{!555, !556, !562}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !553, file: !141, line: 245, baseType: !512, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !553, file: !141, line: 246, baseType: !557, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !553, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !503, file: !163, line: 250, baseType: !564, size: 288, offset: 384)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !564, file: !214, line: 26, baseType: !108, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !564, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !564, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !564, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !564, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !564, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !564, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !564, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !564, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !503, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !503, file: !163, line: 256, baseType: !534, size: 64, offset: 704)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !503, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !503, file: !163, line: 300, baseType: !579, size: 96, offset: 800)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !580)
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !579, file: !163, line: 153, baseType: !22, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !579, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !503, file: !163, line: 325, baseType: !585, size: 32, offset: 896)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !587)
!587 = !{!588, !594, !595}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !586, file: !137, line: 5074, baseType: !589, size: 96)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !589, file: !240, line: 57, baseType: !243, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !589, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !589, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !586, file: !137, line: 5075, baseType: !534, size: 64, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !586, file: !137, line: 5076, baseType: !596, offset: 160)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !503, file: !163, line: 343, baseType: !598, size: 64, offset: 928)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !598, file: !214, line: 63, baseType: !108, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !598, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!602 = !{!603, !604, !605, !606}
!603 = !DILocalVariable(name: "thread", arg: 1, scope: !498, file: !499, line: 175, type: !502)
!604 = !DILocalVariable(name: "region_num", scope: !498, file: !499, line: 200, type: !185)
!605 = !DILocalVariable(name: "guard_start", scope: !498, file: !499, line: 265, type: !22)
!606 = !DILocalVariable(name: "guard_size", scope: !498, file: !499, line: 266, type: !132)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 96, elements: !619)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !609, line: 52, size: 96, elements: !610)
!609 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!610 = !{!611, !612, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !608, file: !609, line: 53, baseType: !22, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !608, file: !609, line: 54, baseType: !132, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !608, file: !609, line: 55, baseType: !614, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !615, line: 151, baseType: !616)
!615 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 149, size: 32, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !616, file: !615, line: 150, baseType: !108, size: 32)
!619 = !{!620}
!620 = !DISubrange(count: 1)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "static_regions", scope: !492, file: !499, line: 62, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 96, elements: !619)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !626, file: !384, line: 17, baseType: !337, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !626, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !632, file: !665, line: 39, type: !185, isLocal: true, isDefinition: true)
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !634, globals: !664, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!634 = !{!635, !102, !103, !652, !185}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !637, line: 1168, baseType: !638)
!637 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !637, line: 1155, size: 352, elements: !639)
!639 = !{!640, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !638, file: !637, line: 1157, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !638, file: !637, line: 1158, baseType: !409, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !638, file: !637, line: 1159, baseType: !409, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !638, file: !637, line: 1160, baseType: !409, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !638, file: !637, line: 1161, baseType: !409, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !638, file: !637, line: 1162, baseType: !409, size: 32, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !638, file: !637, line: 1163, baseType: !409, size: 32, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !638, file: !637, line: 1164, baseType: !409, size: 32, offset: 224)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !638, file: !637, line: 1165, baseType: !409, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !638, file: !637, line: 1166, baseType: !409, size: 32, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !638, file: !637, line: 1167, baseType: !409, size: 32, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !655, line: 27, size: 96, elements: !656)
!655 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !654, file: !655, line: 29, baseType: !108, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !654, file: !655, line: 31, baseType: !337, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !654, file: !655, line: 37, baseType: !660, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !615, line: 146, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !615, line: 141, size: 32, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !661, file: !615, line: 143, baseType: !108, size: 32)
!664 = !{!630}
!665 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !668, file: !675, line: 21, type: !395, isLocal: true, isDefinition: true)
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !670, globals: !674, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!670 = !{!671, !103, !102}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !673, line: 22, baseType: !103)
!673 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!674 = !{!666}
!675 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !678, file: !683, line: 13, type: !700, isLocal: true, isDefinition: true)
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !680, splitDebugInlining: false, nameTableKind: None)
!679 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!680 = !{!681, !676}
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "mpu_config", scope: !678, file: !683, line: 37, type: !684, isLocal: false, isDefinition: true)
!683 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !655, line: 41, size: 64, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !685, file: !655, line: 43, baseType: !108, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !685, file: !655, line: 45, baseType: !689, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !655, line: 27, size: 96, elements: !692)
!692 = !{!693, !694, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !691, file: !655, line: 29, baseType: !108, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !691, file: !655, line: 31, baseType: !337, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !691, file: !655, line: 37, baseType: !696, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !615, line: 146, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !615, line: 141, size: 32, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !697, file: !615, line: 143, baseType: !108, size: 32)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 192, elements: !180)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !703, file: !800, line: 36, type: !801, isLocal: true, isDefinition: true, align: 32)
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !705, retainedTypes: !717, globals: !799, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!705 = !{!706, !712}
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !707, line: 506, baseType: !32, size: 32, elements: !708)
!707 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = !{!709, !710, !711}
!709 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!710 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!711 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !707, line: 512, baseType: !32, size: 32, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!715 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!716 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!717 = !{!718, !788, !793, !753, !712, !706, !798, !102}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !707, line: 523, size: 288, elements: !721)
!721 = !{!722, !743, !749, !754, !758, !759, !760, !764, !784}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !720, file: !707, line: 524, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DISubroutineType(types: !725)
!725 = !{!103, !726, !741, !742}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !442, line: 378, size: 192, elements: !729)
!729 = !{!730, !731, !732, !733, !739, !740}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !728, file: !442, line: 380, baseType: !337, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !728, file: !442, line: 382, baseType: !13, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !728, file: !442, line: 384, baseType: !13, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !728, file: !442, line: 386, baseType: !734, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !442, line: 351, size: 16, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !735, file: !442, line: 359, baseType: !185, size: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !735, file: !442, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !728, file: !442, line: 388, baseType: !102, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !728, file: !442, line: 396, baseType: !455, size: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !707, line: 237, baseType: !185)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !707, line: 257, baseType: !108)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !720, file: !707, line: 530, baseType: !744, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{!103, !726, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !707, line: 229, baseType: !108)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !720, file: !707, line: 532, baseType: !750, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DISubroutineType(types: !752)
!752 = !{!103, !726, !753, !748}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !707, line: 216, baseType: !108)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !720, file: !707, line: 535, baseType: !755, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{!103, !726, !753}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !720, file: !707, line: 537, baseType: !755, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !720, file: !707, line: 539, baseType: !755, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !720, file: !707, line: 541, baseType: !761, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!103, !726, !741, !706, !712}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !720, file: !707, line: 544, baseType: !765, size: 32, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DISubroutineType(types: !767)
!767 = !{!103, !726, !768, !131}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !707, line: 478, size: 96, elements: !770)
!770 = !{!771, !778, !783}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !769, file: !707, line: 482, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !773, line: 33, baseType: !774)
!773 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !773, line: 29, size: 32, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !774, file: !773, line: 30, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !769, file: !707, line: 485, baseType: !779, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !707, line: 464, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !726, !768, !753}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !769, file: !707, line: 493, baseType: !753, size: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !720, file: !707, line: 547, baseType: !785, size: 32, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DISubroutineType(types: !787)
!787 = !{!108, !726}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !707, line: 428, size: 32, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !790, file: !707, line: 434, baseType: !753, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !707, line: 441, size: 32, elements: !796)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !795, file: !707, line: 447, baseType: !753, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!799 = !{!701}
!800 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !433, line: 51, size: 64, elements: !803)
!803 = !{!804, !808}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !802, file: !433, line: 60, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!103, !726}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !802, file: !433, line: 65, baseType: !726, size: 32, offset: 32)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !811, file: !815, line: 10, type: !816, isLocal: false, isDefinition: true)
!811 = distinct !DICompileUnit(language: DW_LANG_C99, file: !812, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !813, globals: !814, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!813 = !{!104, !102, !103}
!814 = !{!809}
!815 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !384, line: 17, baseType: !337, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !817, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !823, file: !895, line: 48, type: !970, isLocal: true, isDefinition: true)
!823 = distinct !DICompileUnit(language: DW_LANG_C99, file: !824, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !825, retainedTypes: !881, globals: !892, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!825 = !{!30, !826}
!826 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !405, line: 69, baseType: !103, size: 32, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!828 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!829 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!830 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!831 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!832 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!833 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!834 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!835 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!836 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!837 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!838 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!839 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!840 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!841 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!842 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!843 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!844 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!845 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!846 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!847 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!848 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!849 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!850 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!851 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!852 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!853 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!854 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!855 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!856 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!857 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!858 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!859 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!860 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!861 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!862 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!863 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!864 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!865 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!866 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!867 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!868 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!869 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!870 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!871 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!872 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!873 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!874 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!875 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!876 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!877 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!878 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!879 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!880 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!881 = !{!132, !103, !102, !882}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !405, line: 270, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 262, size: 192, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !884, file: !405, line: 264, baseType: !409, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !884, file: !405, line: 265, baseType: !409, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !884, file: !405, line: 266, baseType: !409, size: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !884, file: !405, line: 267, baseType: !409, size: 32, offset: 96)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !884, file: !405, line: 268, baseType: !409, size: 32, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !884, file: !405, line: 269, baseType: !409, size: 32, offset: 160)
!892 = !{!893, !899, !915, !926, !943, !821, !945, !958, !960, !962, !964, !966, !968}
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !823, file: !895, line: 424, type: !896, isLocal: false, isDefinition: true, align: 16)
!895 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 64, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 4)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !823, file: !895, line: 424, type: !901, isLocal: false, isDefinition: true, align: 32)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !442, line: 378, size: 192, elements: !903)
!903 = !{!904, !905, !906, !907, !913, !914}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !902, file: !442, line: 380, baseType: !337, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !902, file: !442, line: 382, baseType: !13, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !902, file: !442, line: 384, baseType: !13, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !902, file: !442, line: 386, baseType: !908, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !442, line: 351, size: 16, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !909, file: !442, line: 359, baseType: !185, size: 8)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !909, file: !442, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !902, file: !442, line: 388, baseType: !102, size: 32, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !902, file: !442, line: 396, baseType: !455, size: 32, offset: 160)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !823, file: !895, line: 424, type: !917, isLocal: true, isDefinition: true, align: 32)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !433, line: 51, size: 64, elements: !919)
!919 = !{!920, !925}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !918, file: !433, line: 60, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DISubroutineType(types: !923)
!923 = !{!103, !924}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !918, file: !433, line: 65, baseType: !924, size: 32, offset: 32)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "exti_data", scope: !823, file: !895, line: 423, type: !928, isLocal: true, isDefinition: true)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !895, line: 107, size: 1024, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !928, file: !895, line: 109, baseType: !931, size: 1024)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 1024, elements: !941)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !895, line: 101, size: 64, elements: !933)
!933 = !{!934, !940}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !932, file: !895, line: 102, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !936, line: 63, baseType: !937)
!936 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !103, !102}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !932, file: !895, line: 103, baseType: !102, size: 32, offset: 32)
!941 = !{!942}
!942 = !DISubrange(count: 16)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !823, file: !895, line: 424, type: !909, isLocal: true, isDefinition: true, align: 8)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !947, file: !895, line: 493, type: !952, isLocal: true, isDefinition: true, align: 32)
!947 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !895, file: !895, line: 460, type: !948, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !823, retainedNodes: !950)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !924}
!950 = !{!951}
!951 = !DILocalVariable(name: "dev", arg: 1, scope: !947, file: !895, line: 460, type: !924)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !952, file: !10, line: 55, baseType: !331, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !952, file: !10, line: 57, baseType: !331, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !952, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !952, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !947, file: !895, line: 497, type: !952, isLocal: true, isDefinition: true, align: 32)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !947, file: !895, line: 507, type: !952, isLocal: true, isDefinition: true, align: 32)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !947, file: !895, line: 512, type: !952, isLocal: true, isDefinition: true, align: 32)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !947, file: !895, line: 516, type: !952, isLocal: true, isDefinition: true, align: 32)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !947, file: !895, line: 523, type: !952, isLocal: true, isDefinition: true, align: 32)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !947, file: !895, line: 527, type: !952, isLocal: true, isDefinition: true, align: 32)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 512, elements: !941)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !405, line: 127, baseType: !826)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !975, file: !980, line: 21, type: !1000, isLocal: false, isDefinition: true, align: 16)
!975 = distinct !DICompileUnit(language: DW_LANG_C99, file: !976, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !977, splitDebugInlining: false, nameTableKind: None)
!976 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!977 = !{!978, !973, !984, !986, !988, !990, !992, !994, !996, !998}
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !975, file: !980, line: 16, type: !981, isLocal: false, isDefinition: true, align: 16)
!980 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 176, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 11)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !975, file: !980, line: 28, type: !896, isLocal: false, isDefinition: true, align: 16)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !975, file: !980, line: 35, type: !896, isLocal: false, isDefinition: true, align: 16)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !975, file: !980, line: 42, type: !896, isLocal: false, isDefinition: true, align: 16)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !975, file: !980, line: 49, type: !896, isLocal: false, isDefinition: true, align: 16)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !975, file: !980, line: 56, type: !896, isLocal: false, isDefinition: true, align: 16)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !975, file: !980, line: 63, type: !896, isLocal: false, isDefinition: true, align: 16)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !975, file: !980, line: 70, type: !896, isLocal: false, isDefinition: true, align: 16)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !975, file: !980, line: 77, type: !896, isLocal: false, isDefinition: true, align: 16)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 48, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 3)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !1005, file: !1049, line: 398, type: !1082, isLocal: true, isDefinition: true)
!1005 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1006, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1007, retainedTypes: !1020, globals: !1046, splitDebugInlining: false, nameTableKind: None)
!1006 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/benchmark")
!1007 = !{!1008, !30, !1013}
!1008 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1009, line: 190, baseType: !32, size: 32, elements: !1010)
!1009 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1010 = !{!1011, !1012}
!1011 = !DIEnumerator(name: "SUCCESS", value: 0)
!1012 = !DIEnumerator(name: "ERROR", value: 1)
!1013 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !1014, line: 44, baseType: !32, size: 32, elements: !1015)
!1014 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!1017 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!1018 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!1019 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!1020 = !{!102, !103, !108, !1021, !1039, !1045}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !405, line: 386, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 370, size: 448, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !1023, file: !405, line: 372, baseType: !409, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !1023, file: !405, line: 373, baseType: !409, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !1023, file: !405, line: 374, baseType: !409, size: 32, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !1023, file: !405, line: 375, baseType: !409, size: 32, offset: 96)
