; ModuleID = 'build/arduino_due/sensor/bmi270/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.i2c_sam_twi_dev_cfg = type { %struct.Twi*, void ()*, i32, %struct.pinctrl_dev_config*, i8, i8 }
%struct.Twi = type { i32, i32, i32, i32, i32, [3 x i32], i32, i32, i32, i32, i32, i32, [50 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.pinctrl_dev_config = type { %struct.pinctrl_state*, i8 }
%struct.pinctrl_state = type { i32*, i8, i8 }
%struct.i2c_driver_api = type { i32 (%struct.device*, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, %struct.i2c_msg*, i8, i16)*, i32 (%struct.device*, %struct.i2c_target_config*)*, i32 (%struct.device*, %struct.i2c_target_config*)*, i32 (%struct.device*)* }
%struct.i2c_msg = type { i8*, i32, i8 }
%struct.i2c_target_config = type { %struct._snode, i8, i16, %struct.i2c_target_callbacks* }
%struct._snode = type { %struct._snode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !111, file: !177, line: 235, type: !178, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !176, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!113 = !{!102, !103, !114, !126}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 41, size: 128, elements: !118)
!118 = !{!119, !122, !123, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !117, file: !116, line: 42, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !117, file: !116, line: 43, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !117, file: !116, line: 44, baseType: !124, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !117, file: !116, line: 45, baseType: !124, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !128, line: 75, baseType: !129)
!128 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 41, size: 2176, elements: !130)
!130 = !{!131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !160, !161, !162, !163, !164, !165, !169, !170, !171, !172, !173, !174, !175}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !129, file: !128, line: 42, baseType: !120, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !129, file: !128, line: 43, baseType: !120, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !129, file: !128, line: 44, baseType: !124, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !129, file: !128, line: 45, baseType: !135, size: 32, offset: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !129, file: !128, line: 46, baseType: !120, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !129, file: !128, line: 47, baseType: !120, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !129, file: !128, line: 48, baseType: !124, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !129, file: !128, line: 49, baseType: !120, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !129, file: !128, line: 50, baseType: !120, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !129, file: !128, line: 51, baseType: !124, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !129, file: !128, line: 52, baseType: !120, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !129, file: !128, line: 53, baseType: !135, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !129, file: !128, line: 54, baseType: !120, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !129, file: !128, line: 55, baseType: !135, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !129, file: !128, line: 56, baseType: !120, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !129, file: !128, line: 57, baseType: !135, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !129, file: !128, line: 58, baseType: !151, size: 96, offset: 512)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !129, file: !128, line: 59, baseType: !155, size: 160, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !129, file: !128, line: 60, baseType: !120, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !129, file: !128, line: 61, baseType: !120, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !129, file: !128, line: 62, baseType: !124, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !129, file: !128, line: 63, baseType: !124, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !129, file: !128, line: 64, baseType: !120, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !129, file: !128, line: 65, baseType: !120, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !129, file: !128, line: 66, baseType: !120, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !129, file: !128, line: 67, baseType: !166, size: 832, offset: 992)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 832, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !129, file: !128, line: 68, baseType: !120, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !129, file: !128, line: 69, baseType: !124, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !129, file: !128, line: 70, baseType: !155, size: 160, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !129, file: !128, line: 71, baseType: !120, size: 32, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !129, file: !128, line: 72, baseType: !120, size: 32, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !129, file: !128, line: 73, baseType: !124, size: 32, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !129, file: !128, line: 74, baseType: !120, size: 32, offset: 2144)
!176 = !{!109}
!177 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!103, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{!191, !195, !196, !197, !206, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 380, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !188, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !189, line: 386, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !200)
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !199, file: !189, line: 359, baseType: !202, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !199, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !188, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !189, line: 43, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !212)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !179, file: !180, line: 65, baseType: !186, size: 32, offset: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "static_regions", scope: !216, file: !225, line: 62, type: !364, isLocal: true, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !218, globals: !221, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!218 = !{!219, !103, !121, !102}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 214, baseType: !32)
!220 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !214}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !224, file: !225, line: 198, type: !352, isLocal: true, isDefinition: true)
!224 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !225, file: !225, line: 175, type: !226, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !347)
!225 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !230, line: 245, size: 1024, elements: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232, !301, !314, !315, !316, !317, !323, !342}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !229, file: !230, line: 247, baseType: !233, size: 384)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !230, line: 57, size: 384, elements: !234)
!234 = !{!235, !263, !271, !272, !273, !286, !287, !288}
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 60, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 60, size: 64, elements: !237)
!237 = !{!238, !254}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !236, file: !230, line: 61, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !240, line: 49, baseType: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !240, line: 37, size: 64, elements: !242)
!242 = !{!243, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 38, baseType: !244, size: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 38, size: 32, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !244, file: !240, line: 39, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !240, line: 40, baseType: !247, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 42, baseType: !250, size: 32, offset: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 42, size: 32, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !250, file: !240, line: 43, baseType: !247, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !250, file: !240, line: 44, baseType: !247, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !236, file: !230, line: 62, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !256, line: 49, size: 64, elements: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !255, file: !256, line: 50, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 64, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !233, file: !230, line: 68, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !266, line: 233, baseType: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 231, size: 64, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !267, file: !266, line: 232, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !240, line: 48, baseType: !241)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !233, file: !230, line: 71, baseType: !202, size: 8, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !233, file: !230, line: 74, baseType: !202, size: 8, offset: 104)
!273 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 90, baseType: !274, size: 16, offset: 112)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 90, size: 16, elements: !275)
!275 = !{!276, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !230, line: 91, baseType: !277, size: 16)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !230, line: 91, size: 16, elements: !278)
!278 = !{!279, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !277, file: !230, line: 96, baseType: !280, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !281)
!281 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !277, file: !230, line: 97, baseType: !202, size: 8, offset: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !274, file: !230, line: 100, baseType: !284, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !285)
!285 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !233, file: !230, line: 107, baseType: !121, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !233, file: !230, line: 127, baseType: !102, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !233, file: !230, line: 131, baseType: !289, size: 192, offset: 192)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !266, line: 244, size: 192, elements: !290)
!290 = !{!291, !292, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !289, file: !266, line: 245, baseType: !239, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !289, file: !266, line: 246, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !266, line: 242, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !289, file: !266, line: 249, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !300)
!300 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !229, file: !230, line: 250, baseType: !302, size: 288, offset: 384)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !303, line: 25, size: 288, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !302, file: !303, line: 26, baseType: !121, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !302, file: !303, line: 27, baseType: !121, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !302, file: !303, line: 28, baseType: !121, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !302, file: !303, line: 29, baseType: !121, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !302, file: !303, line: 30, baseType: !121, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !302, file: !303, line: 31, baseType: !121, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !302, file: !303, line: 32, baseType: !121, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !302, file: !303, line: 33, baseType: !121, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !302, file: !303, line: 34, baseType: !121, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !229, file: !230, line: 253, baseType: !102, size: 32, offset: 672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !229, file: !230, line: 256, baseType: !265, size: 64, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !229, file: !230, line: 294, baseType: !103, size: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !229, file: !230, line: 300, baseType: !318, size: 96, offset: 800)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !230, line: 149, size: 96, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !318, file: !230, line: 153, baseType: !22, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !230, line: 162, baseType: !219, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !318, file: !230, line: 168, baseType: !219, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !229, file: !230, line: 325, baseType: !324, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !326, line: 5073, size: 160, elements: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !{!328, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !325, file: !326, line: 5074, baseType: !329, size: 96)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !330, line: 56, size: 96, elements: !331)
!330 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = !{!332, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !329, file: !330, line: 57, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !330, line: 57, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !329, file: !330, line: 58, baseType: !102, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !329, file: !330, line: 59, baseType: !219, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !325, file: !326, line: 5075, baseType: !265, size: 64, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !325, file: !326, line: 5076, baseType: !339, offset: 160)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !340, line: 43, elements: !341)
!340 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = !{}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !229, file: !230, line: 343, baseType: !343, size: 64, offset: 928)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !303, line: 60, size: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !343, file: !303, line: 63, baseType: !121, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !343, file: !303, line: 66, baseType: !121, size: 32, offset: 32)
!347 = !{!348, !349, !350, !351}
!348 = !DILocalVariable(name: "thread", arg: 1, scope: !224, file: !225, line: 175, type: !228)
!349 = !DILocalVariable(name: "region_num", scope: !224, file: !225, line: 200, type: !202)
!350 = !DILocalVariable(name: "guard_start", scope: !224, file: !225, line: 265, type: !22)
!351 = !DILocalVariable(name: "guard_size", scope: !224, file: !225, line: 266, type: !219)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 96, elements: !136)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !354, line: 52, size: 96, elements: !355)
!354 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !353, file: !354, line: 53, baseType: !22, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !353, file: !354, line: 54, baseType: !219, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !353, file: !354, line: 55, baseType: !359, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !360, line: 151, baseType: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 149, size: 32, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !361, file: !360, line: 150, baseType: !121, size: 32)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 96, elements: !136)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !368, file: !400, line: 39, type: !202, isLocal: true, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !370, globals: !399, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!370 = !{!371, !102, !103, !387, !202}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !373, line: 1168, baseType: !374)
!373 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 1155, size: 352, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !374, file: !373, line: 1157, baseType: !124, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !374, file: !373, line: 1158, baseType: !120, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !374, file: !373, line: 1159, baseType: !120, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !374, file: !373, line: 1160, baseType: !120, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !374, file: !373, line: 1161, baseType: !120, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !374, file: !373, line: 1162, baseType: !120, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !374, file: !373, line: 1163, baseType: !120, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !374, file: !373, line: 1164, baseType: !120, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !374, file: !373, line: 1165, baseType: !120, size: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !374, file: !373, line: 1166, baseType: !120, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !374, file: !373, line: 1167, baseType: !120, size: 32, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !390, line: 27, size: 96, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !389, file: !390, line: 29, baseType: !121, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !390, line: 31, baseType: !192, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !389, file: !390, line: 37, baseType: !395, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !360, line: 146, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !360, line: 141, size: 32, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !396, file: !360, line: 143, baseType: !121, size: 32)
!399 = !{!366}
!400 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !403, file: !410, line: 21, type: !106, isLocal: true, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !405, globals: !409, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!405 = !{!406, !103, !102}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !408, line: 22, baseType: !103)
!408 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !{!401}
!410 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !413, file: !418, line: 13, type: !435, isLocal: true, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !415, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!415 = !{!416, !411}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "mpu_config", scope: !413, file: !418, line: 37, type: !419, isLocal: false, isDefinition: true)
!418 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !390, line: 41, size: 64, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !420, file: !390, line: 43, baseType: !121, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !420, file: !390, line: 45, baseType: !424, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !390, line: 27, size: 96, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !426, file: !390, line: 29, baseType: !121, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !426, file: !390, line: 31, baseType: !192, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !426, file: !390, line: 37, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !360, line: 146, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !360, line: 141, size: 32, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !432, file: !360, line: 143, baseType: !121, size: 32)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 192, elements: !261)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !438, file: !495, line: 603, type: !497, isLocal: true, isDefinition: true, align: 32)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !440, globals: !492, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!440 = !{!102, !103, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !444, line: 336, size: 160, elements: !445)
!444 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!445 = !{!446, !466, !470, !474, !487}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !443, file: !444, line: 365, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DISubroutineType(types: !449)
!449 = !{!103, !450, !465}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !453)
!453 = !{!454, !455, !456, !457, !463, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !189, line: 380, baseType: !192, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !452, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !452, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !452, file: !189, line: 386, baseType: !458, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !459, file: !189, line: 359, baseType: !202, size: 8)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !459, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !452, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !443, file: !444, line: 366, baseType: !467, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !450, !203}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !443, file: !444, line: 374, baseType: !471, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!103, !450}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !443, file: !444, line: 377, baseType: !475, size: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DISubroutineType(types: !477)
!477 = !{!103, !450, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !444, line: 122, size: 64, elements: !481)
!481 = !{!482, !483, !484, !485, !486}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !480, file: !444, line: 123, baseType: !121, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !480, file: !444, line: 124, baseType: !202, size: 8, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !480, file: !444, line: 125, baseType: !202, size: 8, offset: 40)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !480, file: !444, line: 126, baseType: !202, size: 8, offset: 48)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !480, file: !444, line: 127, baseType: !202, size: 8, offset: 56)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !443, file: !444, line: 379, baseType: !488, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DISubroutineType(types: !490)
!490 = !{!103, !450, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!492 = !{!436, !493}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !438, file: !495, line: 38, type: !496, isLocal: true, isDefinition: true)
!495 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !498, file: !180, line: 60, baseType: !471, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !498, file: !180, line: 65, baseType: !450, size: 32, offset: 32)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_12", scope: !504, file: !509, line: 24, type: !510, isLocal: false, isDefinition: true, align: 16)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!506 = !{!507, !511, !513, !502, !518}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !504, file: !509, line: 7, type: !510, isLocal: false, isDefinition: true, align: 16)
!509 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 48, elements: !152)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !504, file: !509, line: 12, type: !510, isLocal: false, isDefinition: true, align: 16)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_28", scope: !504, file: !509, line: 19, type: !515, isLocal: false, isDefinition: true, align: 16)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 64, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 4)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_29", scope: !504, file: !509, line: 31, type: !515, isLocal: false, isDefinition: true, align: 16)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "i2c0_sam_config", scope: !522, file: !629, line: 381, type: !735, isLocal: true, isDefinition: true)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !524, globals: !626, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/i2c/i2c_sam_twi.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!524 = !{!102, !103, !525, !616, !624}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_driver_api", file: !528, line: 234, size: 192, elements: !529)
!528 = !DIFile(filename: "zephyr/include/zephyr/drivers/i2c.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = !{!530, !550, !556, !568, !609, !611}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !527, file: !528, line: 235, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_configure_t", file: !528, line: 212, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DISubroutineType(types: !534)
!534 = !{!103, !535, !121}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !538)
!538 = !{!539, !540, !541, !542, !548, !549}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !537, file: !189, line: 380, baseType: !192, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !537, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !537, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !537, file: !189, line: 386, baseType: !543, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !544, file: !189, line: 359, baseType: !202, size: 8)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !544, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !537, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !537, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "get_config", scope: !527, file: !528, line: 236, baseType: !551, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_get_config_t", file: !528, line: 214, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DISubroutineType(types: !554)
!554 = !{!103, !535, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !527, file: !528, line: 237, baseType: !557, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_full_io_t", file: !528, line: 216, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DISubroutineType(types: !560)
!560 = !{!103, !535, !561, !202, !284}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_msg", file: !528, line: 184, size: 96, elements: !563)
!563 = !{!564, !566, !567}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !562, file: !528, line: 186, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !562, file: !528, line: 189, baseType: !121, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !562, file: !528, line: 192, baseType: !202, size: 8, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "target_register", scope: !527, file: !528, line: 238, baseType: !569, size: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_target_register_t", file: !528, line: 220, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DISubroutineType(types: !572)
!572 = !{!103, !535, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_config", file: !528, line: 385, size: 96, elements: !575)
!575 = !{!576, !583, !584, !585}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !574, file: !528, line: 387, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !578, line: 33, baseType: !579)
!578 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !578, line: 29, size: 32, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !579, file: !578, line: 30, baseType: !582, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !574, file: !528, line: 390, baseType: !202, size: 8, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !574, file: !528, line: 393, baseType: !284, size: 16, offset: 48)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !574, file: !528, line: 396, baseType: !586, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_callbacks", file: !528, line: 366, size: 160, elements: !589)
!589 = !{!590, !595, !600, !605, !607}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "write_requested", scope: !588, file: !528, line: 367, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_write_requested_cb_t", file: !528, line: 276, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DISubroutineType(types: !594)
!594 = !{!103, !573}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "read_requested", scope: !588, file: !528, line: 368, baseType: !596, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_read_requested_cb_t", file: !528, line: 319, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!103, !573, !565}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "write_received", scope: !588, file: !528, line: 369, baseType: !601, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_write_received_cb_t", file: !528, line: 297, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{!103, !573, !202}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "read_processed", scope: !588, file: !528, line: 370, baseType: !606, size: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_read_processed_cb_t", file: !528, line: 341, baseType: !597)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !588, file: !528, line: 371, baseType: !608, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_stop_cb_t", file: !528, line: 358, baseType: !592)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "target_unregister", scope: !527, file: !528, line: 239, baseType: !610, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_target_unregister_t", file: !528, line: 222, baseType: !570)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "recover_bus", scope: !527, file: !528, line: 243, baseType: !612, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_recover_bus_t", file: !528, line: 232, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DISubroutineType(types: !615)
!615 = !{!103, !535}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_driver_api", file: !528, line: 249, size: 64, elements: !619)
!619 = !{!620, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "driver_register", scope: !618, file: !528, line: 250, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_api_register_t", file: !528, line: 246, baseType: !613)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "driver_unregister", scope: !618, file: !528, line: 251, baseType: !623, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_api_unregister_t", file: !528, line: 247, baseType: !613)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !625, line: 46, baseType: !299)
!625 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!626 = !{!627, !633, !635, !642, !647, !649, !651, !688, !690, !692, !520, !694, !706, !725, !728, !731, !733, !778, !781, !783, !785}
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_12", scope: !522, file: !629, line: 381, type: !630, isLocal: false, isDefinition: true, align: 16)
!629 = !DIFile(filename: "zephyr/drivers/i2c/i2c_sam_twi.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 6)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "__device_dts_ord_12", scope: !522, file: !629, line: 381, type: !536, isLocal: false, isDefinition: true, align: 32)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_12", scope: !522, file: !629, line: 381, type: !637, isLocal: true, isDefinition: true, align: 32)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !638, file: !180, line: 60, baseType: !613, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !638, file: !180, line: 65, baseType: !535, size: 32, offset: 32)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_28", scope: !522, file: !629, line: 381, type: !644, isLocal: false, isDefinition: true, align: 16)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 112, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 7)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "__device_dts_ord_28", scope: !522, file: !629, line: 381, type: !536, isLocal: false, isDefinition: true, align: 32)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_28", scope: !522, file: !629, line: 381, type: !637, isLocal: true, isDefinition: true, align: 32)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "i2c0_sam_data", scope: !522, file: !629, line: 381, type: !653, isLocal: true, isDefinition: true)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_sam_twi_dev_data", file: !629, line: 65, size: 416, elements: !654)
!654 = !{!655, !679, !680}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !653, file: !629, line: 66, baseType: !656, size: 128)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !326, line: 2909, size: 128, elements: !657)
!657 = !{!658, !677, !678}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !656, file: !326, line: 2910, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !266, line: 233, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 231, size: 64, elements: !661)
!661 = !{!662}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !660, file: !266, line: 232, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !240, line: 48, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !240, line: 37, size: 64, elements: !665)
!665 = !{!666, !672}
!666 = !DIDerivedType(tag: DW_TAG_member, scope: !664, file: !240, line: 38, baseType: !667, size: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !664, file: !240, line: 38, size: 32, elements: !668)
!668 = !{!669, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !667, file: !240, line: 39, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !240, line: 40, baseType: !670, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, scope: !664, file: !240, line: 42, baseType: !673, size: 32, offset: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !664, file: !240, line: 42, size: 32, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !673, file: !240, line: 43, baseType: !670, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !673, file: !240, line: 44, baseType: !670, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !656, file: !326, line: 2911, baseType: !32, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !656, file: !326, line: 2912, baseType: !32, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !653, file: !629, line: 67, baseType: !656, size: 128, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !653, file: !629, line: 68, baseType: !681, size: 160, offset: 256)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "twi_msg", file: !629, line: 51, size: 160, elements: !682)
!682 = !{!683, !684, !685, !686, !687}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !681, file: !629, line: 53, baseType: !565, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !681, file: !629, line: 55, baseType: !121, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !681, file: !629, line: 57, baseType: !121, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "twi_sr", scope: !681, file: !629, line: 59, baseType: !121, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !681, file: !629, line: 61, baseType: !202, size: 8, offset: 128)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_12", scope: !522, file: !629, line: 381, type: !544, isLocal: true, isDefinition: true, align: 8)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "i2c1_sam_data", scope: !522, file: !629, line: 381, type: !653, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_28", scope: !522, file: !629, line: 381, type: !544, isLocal: true, isDefinition: true, align: 8)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "__isr_i2c_sam_twi_isr_irq_0", scope: !696, file: !629, line: 381, type: !699, isLocal: true, isDefinition: true, align: 32)
!696 = distinct !DISubprogram(name: "i2c0_sam_irq_config", scope: !629, file: !629, line: 381, type: !697, scopeLine: 381, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !522, retainedNodes: !341)
!697 = !DISubroutineType(types: !698)
!698 = !{null}
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !700)
!700 = !{!701, !703, !704, !705}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !699, file: !10, line: 55, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !699, file: !10, line: 57, baseType: !702, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !699, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !699, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_12", scope: !522, file: !629, line: 381, type: !708, isLocal: true, isDefinition: true)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !710, line: 60, size: 64, elements: !711)
!710 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !{!712, !724}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !709, file: !710, line: 69, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !710, line: 50, size: 64, elements: !716)
!716 = !{!717, !722, !723}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !715, file: !710, line: 52, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !721, line: 32, baseType: !121)
!721 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !715, file: !710, line: 54, baseType: !202, size: 8, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !715, file: !710, line: 56, baseType: !202, size: 8, offset: 40)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !709, file: !710, line: 71, baseType: !202, size: 8, offset: 32)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_12", scope: !522, file: !629, line: 381, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 64, elements: !136)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_12", scope: !522, file: !629, line: 381, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 64, elements: !261)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "i2c_sam_twi_driver_api", scope: !522, file: !629, line: 350, type: !526, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "i2c1_sam_config", scope: !522, file: !629, line: 381, type: !735, isLocal: true, isDefinition: true)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_sam_twi_dev_cfg", file: !629, line: 42, size: 160, elements: !737)
!737 = !{!738, !771, !773, !774, !776, !777}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !736, file: !629, line: 43, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "Twi", file: !741, line: 65, baseType: !742)
!741 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/twi.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !741, line: 41, size: 2368, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !751, !752, !753, !754, !755, !756, !757, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_CR", scope: !742, file: !741, line: 42, baseType: !120, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_MMR", scope: !742, file: !741, line: 43, baseType: !120, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_SMR", scope: !742, file: !741, line: 44, baseType: !120, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_IADR", scope: !742, file: !741, line: 45, baseType: !120, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_CWGR", scope: !742, file: !741, line: 46, baseType: !120, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !742, file: !741, line: 47, baseType: !750, size: 96, offset: 160)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 96, elements: !152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_SR", scope: !742, file: !741, line: 48, baseType: !124, size: 32, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_IER", scope: !742, file: !741, line: 49, baseType: !120, size: 32, offset: 288)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_IDR", scope: !742, file: !741, line: 50, baseType: !120, size: 32, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_IMR", scope: !742, file: !741, line: 51, baseType: !124, size: 32, offset: 352)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RHR", scope: !742, file: !741, line: 52, baseType: !124, size: 32, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_THR", scope: !742, file: !741, line: 53, baseType: !120, size: 32, offset: 416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !742, file: !741, line: 54, baseType: !758, size: 1600, offset: 448)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1600, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 50)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RPR", scope: !742, file: !741, line: 55, baseType: !120, size: 32, offset: 2048)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RCR", scope: !742, file: !741, line: 56, baseType: !120, size: 32, offset: 2080)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_TPR", scope: !742, file: !741, line: 57, baseType: !120, size: 32, offset: 2112)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_TCR", scope: !742, file: !741, line: 58, baseType: !120, size: 32, offset: 2144)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RNPR", scope: !742, file: !741, line: 59, baseType: !120, size: 32, offset: 2176)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RNCR", scope: !742, file: !741, line: 60, baseType: !120, size: 32, offset: 2208)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_TNPR", scope: !742, file: !741, line: 61, baseType: !120, size: 32, offset: 2240)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_TNCR", scope: !742, file: !741, line: 62, baseType: !120, size: 32, offset: 2272)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_PTCR", scope: !742, file: !741, line: 63, baseType: !120, size: 32, offset: 2304)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_PTSR", scope: !742, file: !741, line: 64, baseType: !124, size: 32, offset: 2336)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "irq_config", scope: !736, file: !629, line: 44, baseType: !772, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !736, file: !629, line: 45, baseType: !121, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !736, file: !629, line: 46, baseType: !775, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !736, file: !629, line: 47, baseType: !202, size: 8, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "irq_id", scope: !736, file: !629, line: 48, baseType: !202, size: 8, offset: 136)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "__isr_i2c_sam_twi_isr_irq_1", scope: !780, file: !629, line: 381, type: !699, isLocal: true, isDefinition: true, align: 32)
!780 = distinct !DISubprogram(name: "i2c1_sam_irq_config", scope: !629, file: !629, line: 381, type: !697, scopeLine: 381, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !522, retainedNodes: !341)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_28", scope: !522, file: !629, line: 381, type: !708, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_28", scope: !522, file: !629, line: 381, type: !727, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_28", scope: !522, file: !629, line: 381, type: !730, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "bmi270_config_0", scope: !789, file: !1155, line: 767, type: !1191, isLocal: true, isDefinition: true)
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !791, retainedTypes: !902, globals: !1152, splitDebugInlining: false, nameTableKind: None)
!790 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/sensor/bmi270/bmi270.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bmi270")
!791 = !{!792, !856, !876, !30, !891, !897}
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !793, line: 53, baseType: !32, size: 32, elements: !794)
!793 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!795 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!796 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!797 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!798 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!799 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!800 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!801 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!802 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!803 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!804 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!805 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!806 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!807 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!808 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!809 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!810 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!811 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!812 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!813 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!814 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!815 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!816 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!817 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!818 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!819 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!820 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!821 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!822 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!823 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!824 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!825 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!826 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!827 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!828 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!829 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!830 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!831 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!832 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!833 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!834 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!835 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!836 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!837 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!838 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!839 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!840 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!841 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!842 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!843 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!844 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!845 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!846 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!847 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!848 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!849 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!850 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!851 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!852 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!853 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!854 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!855 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !793, line: 274, baseType: !32, size: 32, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!858 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!859 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!860 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!861 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!862 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!863 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!864 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!865 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!866 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!867 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!868 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!869 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!870 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!871 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!872 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!873 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!874 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!875 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !793, line: 203, baseType: !32, size: 32, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!878 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!879 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!880 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!881 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!882 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!883 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!884 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!885 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!886 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!887 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!888 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!889 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!890 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!891 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !892, line: 506, baseType: !32, size: 32, elements: !893)
!892 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!893 = !{!894, !895, !896}
!894 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!895 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!896 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !892, line: 512, baseType: !32, size: 32, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!900 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!901 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!902 = !{!903, !102, !103, !964, !1018, !1023, !984, !897, !891, !1028, !1029, !1076, !1143, !938, !1151, !211, !284, !299, !202}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !793, line: 397, size: 160, elements: !906)
!906 = !{!907, !933, !939, !954, !959}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !905, file: !793, line: 398, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !793, line: 354, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(types: !911)
!911 = !{!103, !912, !792, !856, !927}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !915)
!915 = !{!916, !917, !918, !919, !925, !926}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !914, file: !189, line: 380, baseType: !192, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !914, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !914, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !914, file: !189, line: 386, baseType: !920, size: 32, offset: 96)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !921, file: !189, line: 359, baseType: !202, size: 8)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !921, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !914, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !914, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !793, line: 43, size: 64, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !929, file: !793, line: 45, baseType: !702, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !929, file: !793, line: 47, baseType: !702, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !905, file: !793, line: 399, baseType: !934, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !793, line: 365, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{!103, !912, !792, !856, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !905, file: !793, line: 400, baseType: !940, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !793, line: 376, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{!103, !912, !944, !950}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !793, line: 264, size: 64, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !946, file: !793, line: 266, baseType: !876, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !946, file: !793, line: 268, baseType: !792, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !793, line: 345, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !912, !944}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !905, file: !793, line: 401, baseType: !955, size: 32, offset: 96)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !793, line: 385, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DISubroutineType(types: !958)
!958 = !{!103, !912, !792}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !905, file: !793, line: 402, baseType: !960, size: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !793, line: 393, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{!103, !912, !792, !938}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !892, line: 523, size: 288, elements: !967)
!967 = !{!968, !974, !980, !985, !989, !990, !991, !995, !1014}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !966, file: !892, line: 524, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!103, !912, !972, !973}
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !892, line: 237, baseType: !202)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !892, line: 257, baseType: !121)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !966, file: !892, line: 530, baseType: !975, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!103, !912, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !892, line: 229, baseType: !121)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !966, file: !892, line: 532, baseType: !981, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{!103, !912, !984, !979}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !892, line: 216, baseType: !121)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !966, file: !892, line: 535, baseType: !986, size: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{!103, !912, !984}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !966, file: !892, line: 537, baseType: !986, size: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !966, file: !892, line: 539, baseType: !986, size: 32, offset: 160)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !966, file: !892, line: 541, baseType: !992, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{!103, !912, !972, !891, !897}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !966, file: !892, line: 544, baseType: !996, size: 32, offset: 224)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DISubroutineType(types: !998)
!998 = !{!103, !912, !999, !205}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !892, line: 478, size: 96, elements: !1001)
!1001 = !{!1002, !1008, !1013}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1000, file: !892, line: 482, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !578, line: 33, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !578, line: 29, size: 32, elements: !1005)
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1004, file: !578, line: 30, baseType: !1007, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1000, file: !892, line: 485, baseType: !1009, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !892, line: 464, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !912, !999, !984}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1000, file: !892, line: 493, baseType: !984, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !966, file: !892, line: 547, baseType: !1015, size: 32, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!121, !912}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !892, line: 428, size: 32, elements: !1021)
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1020, file: !892, line: 434, baseType: !984, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !892, line: 441, size: 32, elements: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1025, file: !892, line: 447, baseType: !984, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spi_driver_api", file: !1032, line: 495, size: 64, elements: !1033)
!1032 = !DIFile(filename: "zephyr/include/zephyr/drivers/spi.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1033 = !{!1034, !1071}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "transceive", scope: !1031, file: !1032, line: 496, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "spi_api_io", file: !1032, line: 456, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!103, !912, !1039, !1059, !1059}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spi_config", file: !1032, line: 309, size: 96, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1041, file: !1032, line: 310, baseType: !121, size: 32)
