; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/tracing/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/tracing/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/tracing")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/tracing")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !114, line: 63, type: !115, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/tracing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/tracing")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !141, !281, !285, !290, !292, !294}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !114, line: 64, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/tracing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !116, line: 2909, size: 128, elements: !117)
!116 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !{!118, !139, !140}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !115, file: !116, line: 2910, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !120, line: 233, baseType: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 231, size: 64, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !121, file: !120, line: 232, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !125, line: 48, baseType: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !125, line: 37, size: 64, elements: !127)
!127 = !{!128, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !125, line: 38, baseType: !129, size: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !125, line: 38, size: 32, elements: !130)
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !125, line: 39, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !125, line: 40, baseType: !132, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !125, line: 42, baseType: !135, size: 32, offset: 32)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !125, line: 42, size: 32, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !135, file: !125, line: 43, baseType: !132, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !125, line: 44, baseType: !132, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !115, file: !116, line: 2911, baseType: !32, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !115, file: !116, line: 2912, baseType: !32, size: 32, offset: 96)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_a", scope: !27, file: !114, line: 111, type: !143, isLocal: false, isDefinition: true, align: 32)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !116, line: 620, size: 384, elements: !144)
!144 = !{!145, !258, !265, !266, !267, !268, !269, !270, !271, !272, !274, !278}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !143, file: !116, line: 621, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !148, line: 245, size: 1344, elements: !149)
!148 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!149 = !{!150, !199, !212, !213, !214, !226, !227, !232, !233, !253}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !147, file: !148, line: 247, baseType: !151, size: 384)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !148, line: 57, size: 384, elements: !152)
!152 = !{!153, !167, !169, !172, !173, !186, !187, !188}
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !148, line: 60, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !148, line: 60, size: 64, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !154, file: !148, line: 61, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !125, line: 49, baseType: !126)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !154, file: !148, line: 62, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !160, line: 49, size: 64, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !159, file: !160, line: 50, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !165)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!165 = !{!166}
!166 = !DISubrange(count: 2)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !151, file: !148, line: 68, baseType: !168, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !151, file: !148, line: 71, baseType: !170, size: 8, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !171)
!171 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !151, file: !148, line: 74, baseType: !170, size: 8, offset: 104)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !148, line: 90, baseType: !174, size: 16, offset: 112)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !148, line: 90, size: 16, elements: !175)
!175 = !{!176, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !148, line: 91, baseType: !177, size: 16)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !174, file: !148, line: 91, size: 16, elements: !178)
!178 = !{!179, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !177, file: !148, line: 96, baseType: !180, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !181)
!181 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !177, file: !148, line: 97, baseType: !170, size: 8, offset: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !174, file: !148, line: 100, baseType: !184, size: 16)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !185)
!185 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !151, file: !148, line: 107, baseType: !108, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !151, file: !148, line: 127, baseType: !106, size: 32, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !151, file: !148, line: 131, baseType: !189, size: 192, offset: 192)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !120, line: 244, size: 192, elements: !190)
!190 = !{!191, !192, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !189, file: !120, line: 245, baseType: !157, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !189, file: !120, line: 246, baseType: !193, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !120, line: 242, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !189, file: !120, line: 249, baseType: !104, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !147, file: !148, line: 250, baseType: !200, size: 288, offset: 384)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !201, line: 25, size: 288, elements: !202)
!201 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !200, file: !201, line: 26, baseType: !108, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !200, file: !201, line: 27, baseType: !108, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !200, file: !201, line: 28, baseType: !108, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !200, file: !201, line: 29, baseType: !108, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !200, file: !201, line: 30, baseType: !108, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !200, file: !201, line: 31, baseType: !108, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !200, file: !201, line: 32, baseType: !108, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !200, file: !201, line: 33, baseType: !108, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !200, file: !201, line: 34, baseType: !108, size: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !147, file: !148, line: 253, baseType: !106, size: 32, offset: 672)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !147, file: !148, line: 256, baseType: !119, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !147, file: !148, line: 271, baseType: !215, size: 128, offset: 768)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !148, line: 34, size: 128, elements: !216)
!216 = !{!217, !223, !224, !225}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !215, file: !148, line: 35, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !219, line: 46, baseType: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !106, !106, !106}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !215, file: !148, line: 36, baseType: !106, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !215, file: !148, line: 37, baseType: !106, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !215, file: !148, line: 38, baseType: !106, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !147, file: !148, line: 274, baseType: !146, size: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 279, baseType: !228, size: 256, offset: 928)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 256, elements: !230)
!229 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!230 = !{!231}
!231 = !DISubrange(count: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !147, file: !148, line: 294, baseType: !107, size: 32, offset: 1184)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !147, file: !148, line: 325, baseType: !234, size: 32, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !116, line: 5073, size: 160, elements: !236)
!236 = !{!237, !248, !249}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !235, file: !116, line: 5074, baseType: !238, size: 96)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !239, line: 56, size: 96, elements: !240)
!239 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = !{!241, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !238, file: !239, line: 57, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !239, line: 57, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !238, file: !239, line: 58, baseType: !106, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !238, file: !239, line: 59, baseType: !246, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 214, baseType: !32)
!247 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !235, file: !116, line: 5075, baseType: !119, size: 64, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !235, file: !116, line: 5076, baseType: !250, offset: 160)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !147, file: !148, line: 343, baseType: !254, size: 64, offset: 1248)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !201, line: 60, size: 64, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !254, file: !201, line: 63, baseType: !108, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !254, file: !201, line: 66, baseType: !108, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !143, file: !116, line: 622, baseType: !259, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !219, line: 44, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !262, line: 47, size: 8, elements: !263)
!262 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !262, line: 48, baseType: !229, size: 8)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !143, file: !116, line: 623, baseType: !32, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !143, file: !116, line: 624, baseType: !218, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !143, file: !116, line: 625, baseType: !106, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !143, file: !116, line: 626, baseType: !106, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !143, file: !116, line: 627, baseType: !106, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !143, file: !116, line: 628, baseType: !107, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !143, file: !116, line: 629, baseType: !108, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !143, file: !116, line: 630, baseType: !273, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !143, file: !116, line: 631, baseType: !275, size: 32, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !143, file: !116, line: 632, baseType: !279, size: 32, offset: 352)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "thread_a", scope: !27, file: !114, line: 111, type: !283, isLocal: false, isDefinition: true)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !148, line: 347, baseType: !146)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !114, line: 79, type: !287, isLocal: false, isDefinition: true, align: 64)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 16384, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 2048)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !114, line: 80, type: !147, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_a", scope: !27, file: !114, line: 111, type: !287, isLocal: false, isDefinition: true, align: 64)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_a", scope: !27, file: !114, line: 111, type: !147, isLocal: false, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "_char_out", scope: !298, file: !302, line: 54, type: !303, isLocal: false, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !300, globals: !301, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/tracing")
!300 = !{!106, !107}
!301 = !{!296}
!302 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{!107, !107}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !308, file: !1042, line: 202, type: !1043, isLocal: true, isDefinition: true, align: 32)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !310, globals: !1041, splitDebugInlining: false, nameTableKind: None)
!309 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/tracing")
!310 = !{!106, !107, !311, !433, !772, !773, !840}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !313, line: 335, baseType: !314)
!313 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !313, line: 320, size: 288, elements: !315)
!315 = !{!316, !327, !333, !347, !358, !369, !373, !384, !385, !396, !397, !412, !413, !423}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !314, file: !313, line: 321, baseType: !317, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !313, line: 50, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 43, size: 16, elements: !320)
!320 = !{!321, !326}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !319, file: !313, line: 48, baseType: !322, size: 16)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !319, file: !313, line: 44, size: 16, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !322, file: !313, line: 45, baseType: !184, size: 7, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !322, file: !313, line: 47, baseType: !184, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !319, file: !313, line: 49, baseType: !184, size: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !314, file: !313, line: 322, baseType: !328, size: 16, offset: 16)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 16, elements: !165)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !330, line: 52, baseType: !331)
!330 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !314, file: !313, line: 323, baseType: !334, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !313, line: 107, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 94, size: 32, elements: !337)
!337 = !{!338, !346}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !336, file: !313, line: 105, baseType: !339, size: 32)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !336, file: !313, line: 95, size: 32, elements: !340)
!340 = !{!341, !342, !343, !344, !345}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !339, file: !313, line: 97, baseType: !108, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !339, file: !313, line: 99, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !339, file: !313, line: 100, baseType: !108, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !339, file: !313, line: 102, baseType: !108, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !339, file: !313, line: 103, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !336, file: !313, line: 106, baseType: !108, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !314, file: !313, line: 324, baseType: !348, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !313, line: 155, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 148, size: 32, elements: !351)
!351 = !{!352, !357}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !350, file: !313, line: 153, baseType: !353, size: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !350, file: !313, line: 149, size: 32, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !353, file: !313, line: 150, baseType: !108, size: 16, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !353, file: !313, line: 151, baseType: !108, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !350, file: !313, line: 154, baseType: !108, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !314, file: !313, line: 325, baseType: !359, size: 8, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !313, line: 194, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 187, size: 8, elements: !362)
!362 = !{!363, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !361, file: !313, line: 192, baseType: !364, size: 8)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !361, file: !313, line: 188, size: 8, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !364, file: !313, line: 189, baseType: !170, size: 1, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !364, file: !313, line: 190, baseType: !170, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !361, file: !313, line: 193, baseType: !170, size: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !314, file: !313, line: 326, baseType: !370, size: 24, offset: 104)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 24, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 3)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !314, file: !313, line: 327, baseType: !374, size: 8, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !313, line: 215, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 208, size: 8, elements: !377)
!377 = !{!378, !383}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !376, file: !313, line: 213, baseType: !379, size: 8)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !376, file: !313, line: 209, size: 8, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !379, file: !313, line: 210, baseType: !170, size: 1, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !379, file: !313, line: 211, baseType: !170, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !376, file: !313, line: 214, baseType: !170, size: 8)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !314, file: !313, line: 328, baseType: !370, size: 24, offset: 136)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !314, file: !313, line: 329, baseType: !386, size: 8, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !313, line: 236, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 229, size: 8, elements: !389)
!389 = !{!390, !395}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !388, file: !313, line: 234, baseType: !391, size: 8)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !313, line: 230, size: 8, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !391, file: !313, line: 231, baseType: !331, size: 1, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !391, file: !313, line: 232, baseType: !331, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !388, file: !313, line: 235, baseType: !170, size: 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !314, file: !313, line: 330, baseType: !370, size: 24, offset: 168)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !314, file: !313, line: 331, baseType: !398, size: 16, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !313, line: 262, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 250, size: 16, elements: !401)
!401 = !{!402, !411}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !400, file: !313, line: 260, baseType: !403, size: 16)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !313, line: 251, size: 16, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !403, file: !313, line: 252, baseType: !184, size: 1, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !403, file: !313, line: 253, baseType: !184, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !403, file: !313, line: 254, baseType: !184, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !403, file: !313, line: 255, baseType: !184, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !403, file: !313, line: 256, baseType: !184, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !403, file: !313, line: 258, baseType: !184, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !400, file: !313, line: 261, baseType: !184, size: 16)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !314, file: !313, line: 332, baseType: !328, size: 16, offset: 208)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !314, file: !313, line: 333, baseType: !414, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !313, line: 290, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 284, size: 32, elements: !417)
!417 = !{!418, !422}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !416, file: !313, line: 288, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !416, file: !313, line: 285, size: 32, elements: !420)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !419, file: !313, line: 286, baseType: !108, size: 22, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !416, file: !313, line: 289, baseType: !108, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !314, file: !313, line: 334, baseType: !424, size: 16, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !313, line: 308, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !313, line: 303, size: 16, elements: !427)
!427 = !{!428, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !426, file: !313, line: 306, baseType: !429, size: 16)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !426, file: !313, line: 304, size: 16, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !429, file: !313, line: 305, baseType: !184, size: 16, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !426, file: !313, line: 307, baseType: !184, size: 16)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !435, line: 928, baseType: !436)
!435 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 899, size: 672, elements: !437)
!437 = !{!438, !462, !486, !512, !537, !553, !554, !572, !573, !590, !601, !602, !617, !637, !638, !650, !662, !672, !673, !690, !694, !705, !706, !718, !730, !731, !742, !758}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !436, file: !435, line: 900, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !435, line: 64, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 43, size: 32, elements: !442)
!442 = !{!443, !461}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !441, file: !435, line: 62, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !435, line: 44, size: 32, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !444, file: !435, line: 45, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !444, file: !435, line: 46, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !444, file: !435, line: 47, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !444, file: !435, line: 48, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !444, file: !435, line: 49, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !444, file: !435, line: 50, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !444, file: !435, line: 51, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !444, file: !435, line: 52, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !444, file: !435, line: 53, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !444, file: !435, line: 54, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !444, file: !435, line: 55, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !444, file: !435, line: 56, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !444, file: !435, line: 58, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !444, file: !435, line: 59, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !444, file: !435, line: 60, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !441, file: !435, line: 63, baseType: !108, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !436, file: !435, line: 901, baseType: !463, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !435, line: 125, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 104, size: 32, elements: !466)
!466 = !{!467, !485}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !465, file: !435, line: 123, baseType: !468, size: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !465, file: !435, line: 105, size: 32, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !468, file: !435, line: 106, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !468, file: !435, line: 107, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !468, file: !435, line: 108, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !468, file: !435, line: 109, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !468, file: !435, line: 110, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !468, file: !435, line: 111, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !468, file: !435, line: 112, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !468, file: !435, line: 113, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !468, file: !435, line: 114, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !468, file: !435, line: 115, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !468, file: !435, line: 116, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !468, file: !435, line: 117, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !468, file: !435, line: 119, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !468, file: !435, line: 120, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !468, file: !435, line: 121, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !465, file: !435, line: 124, baseType: !108, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !436, file: !435, line: 902, baseType: !487, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !435, line: 186, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 165, size: 32, elements: !490)
!490 = !{!491, !511}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !489, file: !435, line: 184, baseType: !492, size: 32)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !489, file: !435, line: 166, size: 32, elements: !493)
!493 = !{!494, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !492, file: !435, line: 167, baseType: !495, size: 1, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !492, file: !435, line: 168, baseType: !495, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !492, file: !435, line: 169, baseType: !495, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !492, file: !435, line: 170, baseType: !495, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !492, file: !435, line: 171, baseType: !495, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !492, file: !435, line: 172, baseType: !495, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !492, file: !435, line: 173, baseType: !495, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !492, file: !435, line: 174, baseType: !495, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !492, file: !435, line: 175, baseType: !495, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !492, file: !435, line: 176, baseType: !495, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !492, file: !435, line: 177, baseType: !495, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !492, file: !435, line: 178, baseType: !495, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !492, file: !435, line: 180, baseType: !495, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !492, file: !435, line: 181, baseType: !495, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !492, file: !435, line: 182, baseType: !495, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !489, file: !435, line: 185, baseType: !108, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !436, file: !435, line: 903, baseType: !513, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !435, line: 247, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 226, size: 32, elements: !517)
!517 = !{!518, !536}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !516, file: !435, line: 245, baseType: !519, size: 32)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !516, file: !435, line: 227, size: 32, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !519, file: !435, line: 228, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !519, file: !435, line: 229, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !519, file: !435, line: 230, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !519, file: !435, line: 231, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !519, file: !435, line: 232, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !519, file: !435, line: 233, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !519, file: !435, line: 234, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !519, file: !435, line: 235, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !519, file: !435, line: 236, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !519, file: !435, line: 237, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !519, file: !435, line: 238, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !519, file: !435, line: 239, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !519, file: !435, line: 241, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !519, file: !435, line: 242, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !519, file: !435, line: 243, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !516, file: !435, line: 246, baseType: !108, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !436, file: !435, line: 904, baseType: !538, size: 16, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !435, line: 300, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 287, size: 16, elements: !541)
!541 = !{!542, !552}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !540, file: !435, line: 298, baseType: !543, size: 16)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !435, line: 288, size: 16, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !543, file: !435, line: 290, baseType: !184, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !543, file: !435, line: 291, baseType: !184, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !543, file: !435, line: 293, baseType: !184, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !543, file: !435, line: 294, baseType: !184, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !543, file: !435, line: 295, baseType: !184, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !543, file: !435, line: 296, baseType: !184, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !543, file: !435, line: 297, baseType: !184, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !540, file: !435, line: 299, baseType: !184, size: 16)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !436, file: !435, line: 905, baseType: !328, size: 16, offset: 144)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !436, file: !435, line: 906, baseType: !555, size: 16, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !435, line: 352, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 336, size: 16, elements: !558)
!558 = !{!559, !571}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !557, file: !435, line: 350, baseType: !560, size: 16)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !557, file: !435, line: 337, size: 16, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !560, file: !435, line: 339, baseType: !184, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !560, file: !435, line: 340, baseType: !184, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !560, file: !435, line: 341, baseType: !184, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !560, file: !435, line: 342, baseType: !184, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !560, file: !435, line: 343, baseType: !184, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !560, file: !435, line: 344, baseType: !184, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !560, file: !435, line: 345, baseType: !184, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !560, file: !435, line: 346, baseType: !184, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !560, file: !435, line: 348, baseType: !184, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !557, file: !435, line: 351, baseType: !184, size: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !436, file: !435, line: 907, baseType: !328, size: 16, offset: 176)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !436, file: !435, line: 908, baseType: !574, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !435, line: 398, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 381, size: 32, elements: !577)
!577 = !{!578, !589}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !576, file: !435, line: 396, baseType: !579, size: 32)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !435, line: 382, size: 32, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !579, file: !435, line: 384, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !579, file: !435, line: 385, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !579, file: !435, line: 386, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !579, file: !435, line: 388, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !579, file: !435, line: 389, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !579, file: !435, line: 390, baseType: !108, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !579, file: !435, line: 392, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !579, file: !435, line: 394, baseType: !108, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !576, file: !435, line: 397, baseType: !108, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !436, file: !435, line: 909, baseType: !591, size: 8, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !435, line: 433, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 426, size: 8, elements: !594)
!594 = !{!595, !600}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !593, file: !435, line: 431, baseType: !596, size: 8)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !593, file: !435, line: 427, size: 8, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !596, file: !435, line: 428, baseType: !170, size: 5, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !596, file: !435, line: 430, baseType: !170, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !593, file: !435, line: 432, baseType: !170, size: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !436, file: !435, line: 910, baseType: !370, size: 24, offset: 232)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !436, file: !435, line: 911, baseType: !603, size: 32, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !435, line: 462, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 448, size: 32, elements: !606)
!606 = !{!607, !616}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !605, file: !435, line: 460, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !605, file: !435, line: 449, size: 32, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !608, file: !435, line: 451, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !608, file: !435, line: 453, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !608, file: !435, line: 454, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !608, file: !435, line: 455, baseType: !108, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !608, file: !435, line: 457, baseType: !108, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !608, file: !435, line: 459, baseType: !108, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !605, file: !435, line: 461, baseType: !108, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !436, file: !435, line: 912, baseType: !618, size: 16, offset: 288)
!618 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !435, line: 520, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 503, size: 16, elements: !621)
!621 = !{!622, !636}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !620, file: !435, line: 518, baseType: !623, size: 16)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !620, file: !435, line: 504, size: 16, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !623, file: !435, line: 506, baseType: !184, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !623, file: !435, line: 507, baseType: !184, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !623, file: !435, line: 508, baseType: !184, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !623, file: !435, line: 509, baseType: !184, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !623, file: !435, line: 510, baseType: !184, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !623, file: !435, line: 511, baseType: !184, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !623, file: !435, line: 512, baseType: !184, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !623, file: !435, line: 513, baseType: !184, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !623, file: !435, line: 514, baseType: !184, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !623, file: !435, line: 515, baseType: !184, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !623, file: !435, line: 516, baseType: !184, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !620, file: !435, line: 519, baseType: !184, size: 16)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !436, file: !435, line: 913, baseType: !328, size: 16, offset: 304)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !436, file: !435, line: 914, baseType: !639, size: 32, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !435, line: 559, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 552, size: 32, elements: !642)
!642 = !{!643, !649}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !641, file: !435, line: 557, baseType: !644, size: 32)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !641, file: !435, line: 553, size: 32, elements: !645)
!645 = !{!646, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !644, file: !435, line: 554, baseType: !108, size: 10, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !644, file: !435, line: 555, baseType: !108, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !644, file: !435, line: 556, baseType: !108, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !641, file: !435, line: 558, baseType: !108, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !436, file: !435, line: 915, baseType: !651, size: 32, offset: 352)
!651 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !435, line: 585, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 578, size: 32, elements: !654)
!654 = !{!655, !661}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !653, file: !435, line: 583, baseType: !656, size: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !653, file: !435, line: 579, size: 32, elements: !657)
!657 = !{!658, !659, !660}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !656, file: !435, line: 580, baseType: !108, size: 16, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !656, file: !435, line: 581, baseType: !108, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !656, file: !435, line: 582, baseType: !108, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !653, file: !435, line: 584, baseType: !108, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !436, file: !435, line: 916, baseType: !663, size: 8, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !435, line: 610, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 604, size: 8, elements: !666)
!666 = !{!667, !671}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !665, file: !435, line: 608, baseType: !668, size: 8)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !435, line: 605, size: 8, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !668, file: !435, line: 607, baseType: !170, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !665, file: !435, line: 609, baseType: !170, size: 8)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !436, file: !435, line: 917, baseType: !370, size: 24, offset: 392)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !436, file: !435, line: 918, baseType: !674, size: 32, offset: 416)
!674 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !435, line: 639, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 622, size: 32, elements: !677)
!677 = !{!678, !689}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !676, file: !435, line: 637, baseType: !679, size: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !676, file: !435, line: 623, size: 32, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !679, file: !435, line: 625, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !679, file: !435, line: 626, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !679, file: !435, line: 627, baseType: !108, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !679, file: !435, line: 629, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !679, file: !435, line: 631, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !679, file: !435, line: 632, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !679, file: !435, line: 634, baseType: !108, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !679, file: !435, line: 635, baseType: !108, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !676, file: !435, line: 638, baseType: !108, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !436, file: !435, line: 919, baseType: !691, size: 32, offset: 448)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 32, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 4)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !436, file: !435, line: 920, baseType: !695, size: 16, offset: 480)
!695 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !435, line: 715, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 706, size: 16, elements: !698)
!698 = !{!699, !704}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !697, file: !435, line: 713, baseType: !700, size: 16)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !697, file: !435, line: 707, size: 16, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !700, file: !435, line: 709, baseType: !184, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !700, file: !435, line: 711, baseType: !184, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !697, file: !435, line: 714, baseType: !184, size: 16)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !436, file: !435, line: 921, baseType: !328, size: 16, offset: 496)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !436, file: !435, line: 922, baseType: !707, size: 32, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !435, line: 739, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 729, size: 32, elements: !710)
!710 = !{!711, !717}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !709, file: !435, line: 737, baseType: !712, size: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !709, file: !435, line: 730, size: 32, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !712, file: !435, line: 732, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !712, file: !435, line: 733, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !712, file: !435, line: 735, baseType: !108, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !709, file: !435, line: 738, baseType: !108, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !436, file: !435, line: 923, baseType: !719, size: 8, offset: 544)
!719 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !435, line: 765, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 756, size: 8, elements: !722)
!722 = !{!723, !729}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !721, file: !435, line: 763, baseType: !724, size: 8)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !721, file: !435, line: 757, size: 8, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !724, file: !435, line: 759, baseType: !170, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !724, file: !435, line: 761, baseType: !170, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !724, file: !435, line: 762, baseType: !170, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !721, file: !435, line: 764, baseType: !170, size: 8)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !436, file: !435, line: 924, baseType: !370, size: 24, offset: 552)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !436, file: !435, line: 925, baseType: !732, size: 32, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !435, line: 789, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 781, size: 32, elements: !735)
!735 = !{!736, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !734, file: !435, line: 787, baseType: !737, size: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !734, file: !435, line: 782, size: 32, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !737, file: !435, line: 783, baseType: !108, size: 12, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !737, file: !435, line: 785, baseType: !108, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !734, file: !435, line: 788, baseType: !108, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !436, file: !435, line: 926, baseType: !743, size: 32, offset: 608)
!743 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !435, line: 820, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 805, size: 32, elements: !746)
!746 = !{!747, !757}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !745, file: !435, line: 818, baseType: !748, size: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !745, file: !435, line: 806, size: 32, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !748, file: !435, line: 807, baseType: !108, size: 2, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !748, file: !435, line: 808, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !748, file: !435, line: 809, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !748, file: !435, line: 810, baseType: !108, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !748, file: !435, line: 812, baseType: !108, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !748, file: !435, line: 814, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !748, file: !435, line: 816, baseType: !108, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !745, file: !435, line: 819, baseType: !108, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !436, file: !435, line: 927, baseType: !759, size: 8, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !435, line: 881, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !435, line: 872, size: 8, elements: !763)
!763 = !{!764, !771}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !762, file: !435, line: 879, baseType: !765, size: 8)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !762, file: !435, line: 873, size: 8, elements: !766)
!766 = !{!767, !768, !769, !770}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !765, file: !435, line: 874, baseType: !170, size: 1, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !765, file: !435, line: 875, baseType: !170, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !765, file: !435, line: 876, baseType: !170, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !765, file: !435, line: 877, baseType: !170, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !762, file: !435, line: 880, baseType: !170, size: 8)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !775, line: 290, baseType: !776)
!775 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !775, line: 284, size: 96, elements: !777)
!777 = !{!778, !788, !799, !812, !829}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !776, file: !775, line: 285, baseType: !779, size: 8)
!779 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !775, line: 49, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !775, line: 43, size: 8, elements: !782)
!782 = !{!783, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !781, file: !775, line: 47, baseType: !784, size: 8)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !781, file: !775, line: 44, size: 8, elements: !785)
!785 = !{!786}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !784, file: !775, line: 45, baseType: !170, size: 1, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !781, file: !775, line: 48, baseType: !170, size: 8)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !776, file: !775, line: 286, baseType: !789, size: 8, offset: 8)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !775, line: 67, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !775, line: 61, size: 8, elements: !793)
!793 = !{!794, !798}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !792, file: !775, line: 65, baseType: !795, size: 8)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !792, file: !775, line: 62, size: 8, elements: !796)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !795, file: !775, line: 64, baseType: !170, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !792, file: !775, line: 66, baseType: !170, size: 8)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !776, file: !775, line: 287, baseType: !800, size: 16, offset: 16)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !775, line: 89, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !775, line: 79, size: 16, elements: !803)
!803 = !{!804, !811}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !802, file: !775, line: 87, baseType: !805, size: 16)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !802, file: !775, line: 80, size: 16, elements: !806)
!806 = !{!807, !808, !809, !810}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !805, file: !775, line: 81, baseType: !184, size: 6, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !805, file: !775, line: 83, baseType: !184, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !805, file: !775, line: 85, baseType: !184, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !805, file: !775, line: 86, baseType: !184, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !802, file: !775, line: 88, baseType: !184, size: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !776, file: !775, line: 288, baseType: !813, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !775, line: 214, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !775, line: 199, size: 32, elements: !816)
!816 = !{!817, !828}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !815, file: !775, line: 212, baseType: !818, size: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !815, file: !775, line: 200, size: 32, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !818, file: !775, line: 201, baseType: !108, size: 4, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !818, file: !775, line: 203, baseType: !108, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !818, file: !775, line: 205, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !818, file: !775, line: 206, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !818, file: !775, line: 207, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !818, file: !775, line: 208, baseType: !108, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !818, file: !775, line: 209, baseType: !108, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !818, file: !775, line: 210, baseType: !108, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !815, file: !775, line: 213, baseType: !108, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !776, file: !775, line: 289, baseType: !830, size: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !775, line: 268, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !775, line: 260, size: 32, elements: !833)
!833 = !{!834, !839}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !832, file: !775, line: 266, baseType: !835, size: 32)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !832, file: !775, line: 261, size: 32, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !835, file: !775, line: 262, baseType: !108, size: 4, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !835, file: !775, line: 264, baseType: !108, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !832, file: !775, line: 267, baseType: !108, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !842, line: 513, baseType: !843)
!842 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !842, line: 494, size: 480, elements: !844)
!844 = !{!845, !851, !861, !865, !875, !885, !895, !905, !909, !925, !941, !957, !987, !991, !1001, !1011, !1021, !1025}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !843, file: !842, line: 495, baseType: !846, size: 8)
!846 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !842, line: 45, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !842, line: 43, size: 8, elements: !849)
!849 = !{!850}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !848, file: !842, line: 44, baseType: !170, size: 8)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !843, file: !842, line: 496, baseType: !852, size: 8, offset: 8)
!852 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !842, line: 61, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !842, line: 55, size: 8, elements: !855)
!855 = !{!856, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !854, file: !842, line: 59, baseType: !857, size: 8)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !842, line: 56, size: 8, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !857, file: !842, line: 57, baseType: !170, size: 2, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !854, file: !842, line: 60, baseType: !170, size: 8)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !843, file: !842, line: 497, baseType: !862, size: 48, offset: 16)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 48, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 6)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !843, file: !842, line: 498, baseType: !866, size: 8, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !842, line: 86, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !842, line: 80, size: 8, elements: !869)
!869 = !{!870, !874}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !868, file: !842, line: 84, baseType: !871, size: 8)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !868, file: !842, line: 81, size: 8, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !871, file: !842, line: 82, baseType: !170, size: 3, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !868, file: !842, line: 85, baseType: !170, size: 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !843, file: !842, line: 499, baseType: !876, size: 8, offset: 72)
!876 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !842, line: 121, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !842, line: 115, size: 8, elements: !879)
!879 = !{!880, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !878, file: !842, line: 119, baseType: !881, size: 8)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !842, line: 116, size: 8, elements: !882)
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !881, file: !842, line: 117, baseType: !170, size: 3, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !878, file: !842, line: 120, baseType: !170, size: 8)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !843, file: !842, line: 500, baseType: !886, size: 8, offset: 80)
!886 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !842, line: 156, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !842, line: 150, size: 8, elements: !889)
!889 = !{!890, !894}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !888, file: !842, line: 154, baseType: !891, size: 8)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !888, file: !842, line: 151, size: 8, elements: !892)
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !891, file: !842, line: 152, baseType: !170, size: 3, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !888, file: !842, line: 155, baseType: !170, size: 8)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !843, file: !842, line: 501, baseType: !896, size: 8, offset: 88)
!896 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !842, line: 191, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !842, line: 185, size: 8, elements: !899)
!899 = !{!900, !904}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !898, file: !842, line: 189, baseType: !901, size: 8)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !898, file: !842, line: 186, size: 8, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !901, file: !842, line: 187, baseType: !170, size: 3, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !898, file: !842, line: 190, baseType: !170, size: 8)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !843, file: !842, line: 502, baseType: !906, size: 64, offset: 96)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 64, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 8)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !843, file: !842, line: 503, baseType: !910, size: 32, offset: 160)
!910 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !911)
