; ModuleID = 'build/arduino_due/subsys/rtio/sensor_batch_processing/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.rtio_executor_api = type { i32 (%struct.rtio*)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)* }
%struct.rtio = type { %struct.rtio_executor*, i32, %struct.rtio_sq*, %struct.rtio_cq* }
%struct.rtio_executor = type { %struct.rtio_executor_api* }
%struct.rtio_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_sqe] }
%struct.rtio_spsc = type { i32, i32, i32, i32, i32 }
%struct.rtio_sqe = type { i8, i8, i16, %struct.rtio_iodev*, i8*, %union.anon.3 }
%struct.rtio_iodev = type { %struct.rtio_iodev_api*, %struct.rtio_iodev_sq*, i8* }
%struct.rtio_iodev_api = type { void (%struct.rtio_sqe*, %struct.rtio*)* }
%struct.rtio_iodev_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_iodev_sqe] }
%struct.rtio_iodev_sqe = type { %struct.rtio_sqe*, %struct.rtio* }
%union.anon.3 = type { %struct.anon.4 }
%struct.anon.4 = type { i32, i8* }
%struct.rtio_cq = type { %struct.rtio_spsc, [0 x %struct.anon.4] }
%struct.rtio_simple_executor = type { %struct.rtio_executor }
%struct.rtio_spsc__sq_ez_io = type { %struct.rtio_spsc, [8 x %struct.rtio_sqe] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !119, line: 12, type: !252, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !103, globals: !116, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_RTIO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_RTIO_IODEV", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_LAST", value: 68)
!103 = !{!104, !105, !108, !109, !113, !114}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !112)
!112 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !{!25, !117, !227, !229, !235, !237, !245}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "simple_exec", scope: !27, file: !119, line: 24, type: !120, isLocal: false, isDefinition: true)
!119 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_simple_executor", file: !121, line: 57, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_executor_simple.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !120, file: !121, line: 58, baseType: !124, size: 32)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !124, file: !125, line: 211, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !131)
!131 = !{!132, !222, !226}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !130, file: !125, line: 177, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!108, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !138)
!138 = !{!139, !141, !145, !210}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !137, file: !125, line: 228, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !137, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !143, line: 22, baseType: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !137, file: !125, line: 254, baseType: !146, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !148)
!148 = !{!149, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !147, file: !125, line: 143, baseType: !150, size: 160)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_spsc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !150, file: !151, line: 60, baseType: !24, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !150, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !150, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !150, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !150, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !147, file: !125, line: 144, baseType: !160, offset: 160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, elements: !197)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !162)
!162 = !{!163, !166, !167, !170, !200, !201}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !161, file: !125, line: 110, baseType: !164, size: 8)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !165)
!165 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !161, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !161, file: !125, line: 116, baseType: !171, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !174)
!174 = !{!175, !186, !199}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !173, file: !125, line: 308, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !178, file: !125, line: 271, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !136}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !173, file: !125, line: 311, baseType: !187, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !188, file: !125, line: 299, baseType: !150, size: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !188, file: !125, line: 300, baseType: !192, offset: 160)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, elements: !197)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !193, file: !125, line: 289, baseType: !184, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !193, file: !125, line: 290, baseType: !136, size: 32, offset: 32)
!197 = !{!198}
!198 = !DISubrange(count: -1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !161, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !125, line: 127, baseType: !202, size: 64, offset: 96)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !125, line: 127, size: 64, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !125, line: 128, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !125, line: 128, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !205, file: !125, line: 129, baseType: !113, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !205, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !137, file: !125, line: 257, baseType: !211, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !212, file: !125, line: 162, baseType: !150, size: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !212, file: !125, line: 163, baseType: !216, offset: 160)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, elements: !197)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !218)
!218 = !{!219, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !217, file: !125, line: 151, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !217, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !130, file: !125, line: 182, baseType: !223, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !136, !184, !108}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !130, file: !125, line: 187, baseType: !223, size: 32, offset: 64)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "ez_io", scope: !27, file: !119, line: 25, type: !137, isLocal: false, isDefinition: true, align: 32)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "bufs", scope: !27, file: !119, line: 27, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1024, elements: !232)
!232 = !{!233, !234}
!233 = !DISubrange(count: 8)
!234 = !DISubrange(count: 16)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "z_rtio_simple_api", scope: !27, file: !121, line: 64, type: !129, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "_sq_ez_io", scope: !27, file: !119, line: 25, type: !239, isLocal: true, isDefinition: true)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__sq_ez_io", file: !119, line: 25, size: 1440, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !239, file: !119, line: 25, baseType: !150, size: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !239, file: !119, line: 25, baseType: !243, size: 1280, offset: 160)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1280, elements: !244)
!244 = !{!233}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "_cq_ez_io", scope: !27, file: !119, line: 25, type: !247, isLocal: true, isDefinition: true)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__cq_ez_io", file: !119, line: 25, size: 672, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !247, file: !119, line: 25, baseType: !150, size: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !247, file: !119, line: 25, baseType: !251, size: 512, offset: 160)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 512, elements: !244)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !254, line: 17, baseType: !105, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !253, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "log_const_vnd_sensor", scope: !260, file: !265, line: 14, type: !489, isLocal: false, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !262, globals: !450, splitDebugInlining: false, nameTableKind: None)
!261 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!262 = !{!104, !108, !263, !109, !443, !113, !114}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_data", file: !265, line: 21, size: 960, elements: !266)
!265 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !{!267, !357, !407, !430, !449}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !264, file: !265, line: 22, baseType: !268, size: 96)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !269)
!269 = !{!270, !345, !356}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !268, file: !125, line: 308, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !273, file: !125, line: 271, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !298}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !282)
!282 = !{!283, !284, !285, !286, !289, !290}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !281, file: !125, line: 110, baseType: !164, size: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !281, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !281, file: !125, line: 116, baseType: !287, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !281, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !125, line: 127, baseType: !291, size: 64, offset: 96)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !125, line: 127, size: 64, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !291, file: !125, line: 128, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !125, line: 128, size: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !294, file: !125, line: 129, baseType: !113, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !294, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !300)
!300 = !{!301, !319, !320, !334}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !299, file: !125, line: 228, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !303, file: !125, line: 211, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !309)
!309 = !{!310, !314, !318}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !308, file: !125, line: 177, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!108, !298}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !308, file: !125, line: 182, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !298, !279, !108}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !308, file: !125, line: 187, baseType: !315, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !299, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !299, file: !125, line: 254, baseType: !321, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !323)
!323 = !{!324, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !322, file: !125, line: 143, baseType: !325, size: 160)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !326)
!326 = !{!327, !328, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !325, file: !151, line: 60, baseType: !24, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !325, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !325, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !325, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !325, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !322, file: !125, line: 144, baseType: !333, offset: 160)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, elements: !197)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !299, file: !125, line: 257, baseType: !335, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !336, file: !125, line: 162, baseType: !325, size: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !336, file: !125, line: 163, baseType: !340, offset: 160)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, elements: !197)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !341, file: !125, line: 151, baseType: !220, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !341, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !268, file: !125, line: 311, baseType: !346, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !347, file: !125, line: 299, baseType: !325, size: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !347, file: !125, line: 300, baseType: !351, offset: 160)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, elements: !197)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !352, file: !125, line: 289, baseType: !279, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !352, file: !125, line: 290, baseType: !298, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !264, file: !265, line: 23, baseType: !358, size: 448, offset: 128)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !359, line: 1318, size: 448, elements: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361, !388, !394, !399, !400, !405, !406}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !358, file: !359, line: 1324, baseType: !362, size: 192)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !363, line: 244, size: 192, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !381, !387}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !362, file: !363, line: 245, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !367, line: 49, baseType: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !367, line: 37, size: 64, elements: !369)
!369 = !{!370, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 38, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 38, size: 32, elements: !372)
!372 = !{!373, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !371, file: !367, line: 39, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !367, line: 40, baseType: !374, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 42, baseType: !377, size: 32, offset: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 42, size: 32, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !377, file: !367, line: 43, baseType: !374, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !377, file: !367, line: 44, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !362, file: !363, line: 246, baseType: !382, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !363, line: 242, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !362, file: !363, line: 249, baseType: !111, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !358, file: !359, line: 1327, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !363, line: 233, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 231, size: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !390, file: !363, line: 232, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !367, line: 48, baseType: !368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !358, file: !359, line: 1330, baseType: !395, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !358, file: !359, line: 1333, baseType: !395, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !358, file: !359, line: 1336, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !110, line: 67, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 65, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !402, file: !110, line: 66, baseType: !109, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !358, file: !359, line: 1339, baseType: !113, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !358, file: !359, line: 1342, baseType: !104, size: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !264, file: !265, line: 24, baseType: !408, size: 32, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !411, line: 378, size: 192, elements: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413, !414, !415, !416, !423, !424}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !411, line: 380, baseType: !105, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !410, file: !411, line: 382, baseType: !13, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !410, file: !411, line: 384, baseType: !13, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !410, file: !411, line: 386, baseType: !417, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !411, line: 351, size: 16, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !418, file: !411, line: 359, baseType: !164, size: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !418, file: !411, line: 364, baseType: !422, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!422 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !411, line: 388, baseType: !104, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !410, file: !411, line: 396, baseType: !425, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !411, line: 43, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !429)
!429 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !264, file: !265, line: 25, baseType: !431, size: 320, offset: 608)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !359, line: 4204, size: 320, elements: !432)
!432 = !{!433, !434, !438, !441, !442, !444, !445, !446, !447, !448}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !431, file: !359, line: 4206, baseType: !389, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !431, file: !359, line: 4208, baseType: !435, offset: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !431, file: !359, line: 4210, baseType: !439, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !440, line: 214, baseType: !32)
!440 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !431, file: !359, line: 4212, baseType: !113, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !431, file: !359, line: 4214, baseType: !443, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !431, file: !359, line: 4216, baseType: !443, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !431, file: !359, line: 4218, baseType: !443, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !431, file: !359, line: 4220, baseType: !443, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !431, file: !359, line: 4222, baseType: !113, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !359, line: 4227, baseType: !164, size: 8, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_number", scope: !264, file: !265, line: 26, baseType: !113, size: 32, offset: 928)
!450 = !{!258, !451, !458, !463, !465, !476, !478, !485, !487}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_sq_0", scope: !260, file: !265, line: 152, type: !453, isLocal: false, isDefinition: true)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc_vnd_sensor_iodev_sq_0", file: !265, line: 152, size: 672, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !453, file: !265, line: 152, baseType: !325, size: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !453, file: !265, line: 152, baseType: !457, size: 512, offset: 160)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 512, elements: !244)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_4", scope: !260, file: !265, line: 152, type: !460, isLocal: false, isDefinition: true, align: 16)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 64, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 4)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "__device_dts_ord_4", scope: !260, file: !265, line: 152, type: !409, isLocal: false, isDefinition: true, align: 32)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_4", scope: !260, file: !265, line: 152, type: !467, isLocal: true, isDefinition: true, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !{!471, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !468, file: !469, line: 60, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DISubroutineType(types: !474)
!474 = !{!108, !408}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !468, file: !469, line: 65, baseType: !408, size: 32, offset: 32)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_4", scope: !260, file: !265, line: 152, type: !418, isLocal: true, isDefinition: true, align: 8)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "vnd_sensor_config_0", scope: !260, file: !265, line: 152, type: !480, isLocal: true, isDefinition: true)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_config", file: !265, line: 16, size: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sample_period", scope: !481, file: !265, line: 17, baseType: !113, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !481, file: !265, line: 18, baseType: !439, size: 32, offset: 32)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "vnd_sensor_data_0", scope: !260, file: !265, line: 152, type: !264, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_api", scope: !260, file: !265, line: 127, type: !272, isLocal: true, isDefinition: true)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !254, line: 17, baseType: !105, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !490, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_4", scope: !496, file: !501, line: 17, type: !502, isLocal: false, isDefinition: true, align: 16)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !498, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!498 = !{!499, !505, !494}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_29", scope: !496, file: !501, line: 7, type: !502, isLocal: false, isDefinition: true, align: 16)
!501 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 48, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 3)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !496, file: !501, line: 12, type: !502, isLocal: false, isDefinition: true, align: 16)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !509, file: !522, line: 18, type: !523, isLocal: false, isDefinition: true)
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !511, globals: !521, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!511 = !{!22, !104, !24, !512, !514, !516, !439, !108, !517, !518, !519, !520, !443, !209, !168, !105}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!521 = !{!507}
!522 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !254, line: 17, baseType: !105, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !524, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "_char_out", scope: !530, file: !534, line: 54, type: !535, isLocal: false, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !532, globals: !533, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!532 = !{!104, !108}
!533 = !{!528}
!534 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DISubroutineType(types: !537)
!537 = !{!108, !108}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !540, file: !603, line: 235, type: !604, isLocal: true, isDefinition: true, align: 32)
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !542, globals: !602, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!542 = !{!104, !108, !543, !554}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !545, line: 46, baseType: !546)
!545 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 41, size: 128, elements: !547)
!547 = !{!548, !550, !551, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !546, file: !545, line: 42, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !546, file: !545, line: 43, baseType: !549, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !546, file: !545, line: 44, baseType: !552, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !546, file: !545, line: 45, baseType: !552, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !556, line: 75, baseType: !557)
!556 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !556, line: 41, size: 2176, elements: !558)
!558 = !{!559, !560, !561, !562, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !580, !584, !585, !586, !587, !588, !589, !590, !591, !595, !596, !597, !598, !599, !600, !601}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !557, file: !556, line: 42, baseType: !549, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !557, file: !556, line: 43, baseType: !549, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !557, file: !556, line: 44, baseType: !552, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !557, file: !556, line: 45, baseType: !563, size: 32, offset: 96)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 32, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 1)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !557, file: !556, line: 46, baseType: !549, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !557, file: !556, line: 47, baseType: !549, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !557, file: !556, line: 48, baseType: !552, size: 32, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !557, file: !556, line: 49, baseType: !549, size: 32, offset: 224)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !557, file: !556, line: 50, baseType: !549, size: 32, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !557, file: !556, line: 51, baseType: !552, size: 32, offset: 288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !557, file: !556, line: 52, baseType: !549, size: 32, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !557, file: !556, line: 53, baseType: !563, size: 32, offset: 352)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !557, file: !556, line: 54, baseType: !549, size: 32, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !557, file: !556, line: 55, baseType: !563, size: 32, offset: 416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !557, file: !556, line: 56, baseType: !549, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !557, file: !556, line: 57, baseType: !563, size: 32, offset: 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !557, file: !556, line: 58, baseType: !579, size: 96, offset: 512)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 96, elements: !503)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !557, file: !556, line: 59, baseType: !581, size: 160, offset: 608)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 160, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 5)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !557, file: !556, line: 60, baseType: !549, size: 32, offset: 768)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !557, file: !556, line: 61, baseType: !549, size: 32, offset: 800)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !557, file: !556, line: 62, baseType: !552, size: 32, offset: 832)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !557, file: !556, line: 63, baseType: !552, size: 32, offset: 864)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !557, file: !556, line: 64, baseType: !549, size: 32, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !557, file: !556, line: 65, baseType: !549, size: 32, offset: 928)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !557, file: !556, line: 66, baseType: !549, size: 32, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !557, file: !556, line: 67, baseType: !592, size: 832, offset: 992)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 832, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 26)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !557, file: !556, line: 68, baseType: !549, size: 32, offset: 1824)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !557, file: !556, line: 69, baseType: !552, size: 32, offset: 1856)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !557, file: !556, line: 70, baseType: !581, size: 160, offset: 1888)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !557, file: !556, line: 71, baseType: !549, size: 32, offset: 2048)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !557, file: !556, line: 72, baseType: !549, size: 32, offset: 2080)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !557, file: !556, line: 73, baseType: !552, size: 32, offset: 2112)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !557, file: !556, line: 74, baseType: !549, size: 32, offset: 2144)
!602 = !{!538}
!603 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !606)
!606 = !{!607, !626}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !605, file: !469, line: 60, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DISubroutineType(types: !610)
!610 = !{!108, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !411, line: 378, size: 192, elements: !614)
!614 = !{!615, !616, !617, !618, !624, !625}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !411, line: 380, baseType: !105, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !613, file: !411, line: 382, baseType: !13, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !613, file: !411, line: 384, baseType: !13, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !613, file: !411, line: 386, baseType: !619, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !411, line: 351, size: 16, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !620, file: !411, line: 359, baseType: !164, size: 8)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !620, file: !411, line: 364, baseType: !422, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !613, file: !411, line: 388, baseType: !104, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !613, file: !411, line: 396, baseType: !425, size: 32, offset: 160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !605, file: !469, line: 65, baseType: !611, size: 32, offset: 32)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !629, file: !636, line: 17, type: !770, isLocal: false, isDefinition: true)
!629 = distinct !DICompileUnit(language: DW_LANG_C99, file: !630, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !631, globals: !632, splitDebugInlining: false, nameTableKind: None)
!630 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!631 = !{!439, !108, !113, !104}
!632 = !{!627, !633, !766}
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !635, file: !636, line: 198, type: !754, isLocal: true, isDefinition: true)
!635 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !636, file: !636, line: 175, type: !637, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !629, retainedNodes: !749)
!636 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!637 = !DISubroutineType(types: !638)
!638 = !{null, !639}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !641, line: 245, size: 1024, elements: !642)
!641 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!642 = !{!643, !706, !719, !720, !721, !722, !728, !744}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !640, file: !641, line: 247, baseType: !644, size: 384)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !641, line: 57, size: 384, elements: !645)
!645 = !{!646, !673, !680, !681, !682, !693, !694, !695}
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !644, file: !641, line: 60, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !641, line: 60, size: 64, elements: !648)
!648 = !{!649, !664}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !647, file: !641, line: 61, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !367, line: 49, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !367, line: 37, size: 64, elements: !652)
!652 = !{!653, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, scope: !651, file: !367, line: 38, baseType: !654, size: 32)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !651, file: !367, line: 38, size: 32, elements: !655)
!655 = !{!656, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !654, file: !367, line: 39, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !367, line: 40, baseType: !657, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, scope: !651, file: !367, line: 42, baseType: !660, size: 32, offset: 32)
!660 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !651, file: !367, line: 42, size: 32, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !660, file: !367, line: 43, baseType: !657, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !367, line: 44, baseType: !657, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !647, file: !641, line: 62, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !666, line: 49, size: 64, elements: !667)
!666 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !665, file: !666, line: 50, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, elements: !671)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!671 = !{!672}
!672 = !DISubrange(count: 2)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !644, file: !641, line: 68, baseType: !674, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !363, line: 233, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 231, size: 64, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !676, file: !363, line: 232, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !367, line: 48, baseType: !651)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !644, file: !641, line: 71, baseType: !164, size: 8, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !644, file: !641, line: 74, baseType: !164, size: 8, offset: 104)
!682 = !DIDerivedType(tag: DW_TAG_member, scope: !644, file: !641, line: 90, baseType: !683, size: 16, offset: 112)
!683 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !641, line: 90, size: 16, elements: !684)
!684 = !{!685, !692}
!685 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !641, line: 91, baseType: !686, size: 16)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !641, line: 91, size: 16, elements: !687)
!687 = !{!688, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !686, file: !641, line: 96, baseType: !689, size: 8)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !690)
!690 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !686, file: !641, line: 97, baseType: !164, size: 8, offset: 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !683, file: !641, line: 100, baseType: !168, size: 16)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !644, file: !641, line: 107, baseType: !113, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !644, file: !641, line: 127, baseType: !104, size: 32, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !644, file: !641, line: 131, baseType: !696, size: 192, offset: 192)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !363, line: 244, size: 192, elements: !697)
!697 = !{!698, !699, !705}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !696, file: !363, line: 245, baseType: !650, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !696, file: !363, line: 246, baseType: !700, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !363, line: 242, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !704}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !696, file: !363, line: 249, baseType: !111, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !640, file: !641, line: 250, baseType: !707, size: 288, offset: 384)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !708, line: 25, size: 288, elements: !709)
!708 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !707, file: !708, line: 26, baseType: !113, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !707, file: !708, line: 27, baseType: !113, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !707, file: !708, line: 28, baseType: !113, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !707, file: !708, line: 29, baseType: !113, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !707, file: !708, line: 30, baseType: !113, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !707, file: !708, line: 31, baseType: !113, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !707, file: !708, line: 32, baseType: !113, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !707, file: !708, line: 33, baseType: !113, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !707, file: !708, line: 34, baseType: !113, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !640, file: !641, line: 253, baseType: !104, size: 32, offset: 672)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !640, file: !641, line: 256, baseType: !675, size: 64, offset: 704)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !640, file: !641, line: 294, baseType: !108, size: 32, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !640, file: !641, line: 300, baseType: !723, size: 96, offset: 800)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !641, line: 149, size: 96, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !723, file: !641, line: 153, baseType: !22, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !723, file: !641, line: 162, baseType: !439, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !723, file: !641, line: 168, baseType: !439, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !640, file: !641, line: 325, baseType: !729, size: 32, offset: 896)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !359, line: 5073, size: 160, elements: !731)
!731 = !{!732, !741, !742}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !730, file: !359, line: 5074, baseType: !733, size: 96)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !734, line: 56, size: 96, elements: !735)
!734 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!735 = !{!736, !739, !740}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !733, file: !734, line: 57, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !734, line: 57, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !733, file: !734, line: 58, baseType: !104, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !733, file: !734, line: 59, baseType: !439, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !730, file: !359, line: 5075, baseType: !675, size: 64, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !730, file: !359, line: 5076, baseType: !743, offset: 160)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !640, file: !641, line: 343, baseType: !745, size: 64, offset: 928)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !708, line: 60, size: 64, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !745, file: !708, line: 63, baseType: !113, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !745, file: !708, line: 66, baseType: !113, size: 32, offset: 32)
!749 = !{!750, !751, !752, !753}
!750 = !DILocalVariable(name: "thread", arg: 1, scope: !635, file: !636, line: 175, type: !639)
!751 = !DILocalVariable(name: "region_num", scope: !635, file: !636, line: 200, type: !164)
!752 = !DILocalVariable(name: "guard_start", scope: !635, file: !636, line: 265, type: !22)
!753 = !DILocalVariable(name: "guard_size", scope: !635, file: !636, line: 266, type: !439)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 96, elements: !564)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !756, line: 52, size: 96, elements: !757)
!756 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !755, file: !756, line: 53, baseType: !22, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !755, file: !756, line: 54, baseType: !439, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !755, file: !756, line: 55, baseType: !761, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !762, line: 151, baseType: !763)
!762 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !762, line: 149, size: 32, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !763, file: !762, line: 150, baseType: !113, size: 32)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "static_regions", scope: !629, file: !636, line: 62, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 96, elements: !564)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !771, file: !254, line: 17, baseType: !105, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !771, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !777, file: !809, line: 39, type: !164, isLocal: true, isDefinition: true)
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !779, globals: !808, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!779 = !{!780, !104, !108, !796, !164}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !782, line: 1168, baseType: !783)
!782 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !782, line: 1155, size: 352, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !783, file: !782, line: 1157, baseType: !552, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !783, file: !782, line: 1158, baseType: !549, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !783, file: !782, line: 1159, baseType: !549, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !783, file: !782, line: 1160, baseType: !549, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !783, file: !782, line: 1161, baseType: !549, size: 32, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !783, file: !782, line: 1162, baseType: !549, size: 32, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !783, file: !782, line: 1163, baseType: !549, size: 32, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !783, file: !782, line: 1164, baseType: !549, size: 32, offset: 224)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !783, file: !782, line: 1165, baseType: !549, size: 32, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !783, file: !782, line: 1166, baseType: !549, size: 32, offset: 288)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !783, file: !782, line: 1167, baseType: !549, size: 32, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !799, line: 27, size: 96, elements: !800)
!799 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !798, file: !799, line: 29, baseType: !113, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !799, line: 31, baseType: !105, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !798, file: !799, line: 37, baseType: !804, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !762, line: 146, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !762, line: 141, size: 32, elements: !806)
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !805, file: !762, line: 143, baseType: !113, size: 32)
!808 = !{!775}
!809 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !812, file: !819, line: 21, type: !535, isLocal: true, isDefinition: true)
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !814, globals: !818, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!814 = !{!815, !108, !104}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !817, line: 22, baseType: !108)
!817 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!818 = !{!810}
!819 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !822, file: !827, line: 13, type: !844, isLocal: true, isDefinition: true)
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !824, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!824 = !{!825, !820}
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "mpu_config", scope: !822, file: !827, line: 37, type: !828, isLocal: false, isDefinition: true)
!827 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !799, line: 41, size: 64, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !829, file: !799, line: 43, baseType: !113, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !829, file: !799, line: 45, baseType: !833, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !799, line: 27, size: 96, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !835, file: !799, line: 29, baseType: !113, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !835, file: !799, line: 31, baseType: !105, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !835, file: !799, line: 37, baseType: !840, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !762, line: 146, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !762, line: 141, size: 32, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !841, file: !762, line: 143, baseType: !113, size: 32)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 192, elements: !671)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "log_const_rtio_executor_simple", scope: !847, file: !850, line: 12, type: !851, isLocal: false, isDefinition: true)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !532, globals: !849, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/rtio/rtio_executor_simple.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!849 = !{!845}
!850 = !DIFile(filename: "zephyr/subsys/rtio/rtio_executor_simple.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !852, file: !254, line: 17, baseType: !105, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !852, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "log_const_rtio_executor_concurrent", scope: !858, file: !967, line: 13, type: !968, isLocal: false, isDefinition: true)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !860, globals: !966, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/rtio/rtio_executor_concurrent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!860 = !{!861, !104, !108}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_concurrent_executor", file: !863, line: 61, size: 224, elements: !864)
!863 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_executor_concurrent.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!864 = !{!865, !955, !957, !958, !959, !960, !962, !963, !964}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !862, file: !863, line: 62, baseType: !866, size: 32)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !866, file: !125, line: 211, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !872)
!872 = !{!873, !950, !954}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !871, file: !125, line: 177, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DISubroutineType(types: !876)
!876 = !{!108, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !879)
!879 = !{!880, !882, !883, !939}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !878, file: !125, line: 228, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !878, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !878, file: !125, line: 254, baseType: !884, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !886)
!886 = !{!887, !895}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !885, file: !125, line: 143, baseType: !888, size: 160)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !889)
!889 = !{!890, !891, !892, !893, !894}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !888, file: !151, line: 60, baseType: !24, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !888, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !888, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !888, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !888, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !885, file: !125, line: 144, baseType: !896, offset: 160)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, elements: !197)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !898)
!898 = !{!899, !900, !901, !902, !930, !931}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !897, file: !125, line: 110, baseType: !164, size: 8)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !897, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !897, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !897, file: !125, line: 116, baseType: !903, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !906)
!906 = !{!907, !918, !929}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !905, file: !125, line: 308, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !911)
!911 = !{!912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !910, file: !125, line: 271, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !916, !877}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !905, file: !125, line: 311, baseType: !919, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !920, file: !125, line: 299, baseType: !888, size: 160)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !920, file: !125, line: 300, baseType: !924, offset: 160)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, elements: !197)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !925, file: !125, line: 289, baseType: !916, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !925, file: !125, line: 290, baseType: !877, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !905, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !897, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, scope: !897, file: !125, line: 127, baseType: !932, size: 64, offset: 96)
!932 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !897, file: !125, line: 127, size: 64, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, scope: !932, file: !125, line: 128, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !932, file: !125, line: 128, size: 64, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !935, file: !125, line: 129, baseType: !113, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !935, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !878, file: !125, line: 257, baseType: !940, size: 32, offset: 96)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !941, file: !125, line: 162, baseType: !888, size: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !941, file: !125, line: 163, baseType: !945, offset: 160)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, elements: !197)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !946, file: !125, line: 151, baseType: !220, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !946, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !871, file: !125, line: 182, baseType: !951, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !877, !916, !108}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !871, file: !125, line: 187, baseType: !951, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !862, file: !863, line: 65, baseType: !956, offset: 32)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "task_in", scope: !862, file: !863, line: 68, baseType: !168, size: 16, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "task_out", scope: !862, file: !863, line: 68, baseType: !168, size: 16, offset: 48)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "task_mask", scope: !862, file: !863, line: 68, baseType: !168, size: 16, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "pending_sqe", scope: !862, file: !863, line: 71, baseType: !961, size: 32, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "last_sqe", scope: !862, file: !863, line: 74, baseType: !961, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "task_status", scope: !862, file: !863, line: 77, baseType: !209, size: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "task_cur", scope: !862, file: !863, line: 80, baseType: !965, size: 32, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!966 = !{!856}
!967 = !DIFile(filename: "zephyr/subsys/rtio/rtio_executor_concurrent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !969, file: !254, line: 17, baseType: !105, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !969, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !975, file: !1032, line: 603, type: !1034, isLocal: true, isDefinition: true, align: 32)
!975 = distinct !DICompileUnit(language: DW_LANG_C99, file: !976, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !977, globals: !1029, splitDebugInlining: false, nameTableKind: None)
!976 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/rtio/sensor_batch_processing")
!977 = !{!104, !108, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !981, line: 336, size: 160, elements: !982)
!981 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!982 = !{!983, !1003, !1007, !1011, !1024}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !980, file: !981, line: 365, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!108, !987, !1002}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !411, line: 378, size: 192, elements: !990)
!990 = !{!991, !992, !993, !994, !1000, !1001}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !411, line: 380, baseType: !105, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !989, file: !411, line: 382, baseType: !13, size: 32, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !989, file: !411, line: 384, baseType: !13, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !989, file: !411, line: 386, baseType: !995, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !411, line: 351, size: 16, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !996, file: !411, line: 359, baseType: !164, size: 8)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !996, file: !411, line: 364, baseType: !422, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !989, file: !411, line: 388, baseType: !104, size: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !989, file: !411, line: 396, baseType: !425, size: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !980, file: !981, line: 366, baseType: !1004, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
