; ModuleID = 'build/96b_meerkat96/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !116, line: 149, type: !272, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !108, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !103)
!103 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!114, !25, !260, !263}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "fork_objs", scope: !27, file: !116, line: 146, type: !117, isLocal: false, isDefinition: true)
!116 = !DIFile(filename: "zephyr/samples/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 960, elements: !258)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !119, line: 2720, size: 160, elements: !120)
!119 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121, !142, !256, !257}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !118, file: !119, line: 2722, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !123, line: 233, baseType: !124)
!123 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 231, size: 64, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !124, file: !123, line: 232, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !130)
!130 = !{!131, !137}
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 38, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 38, size: 32, elements: !133)
!133 = !{!134, !136}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !128, line: 39, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !128, line: 40, baseType: !135, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 42, baseType: !138, size: 32, offset: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 42, size: 32, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !138, file: !128, line: 43, baseType: !135, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !128, line: 44, baseType: !135, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !118, file: !119, line: 2724, baseType: !143, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !145, line: 245, size: 1344, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !196, !209, !210, !211, !223, !224, !229, !230, !251}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !144, file: !145, line: 247, baseType: !148, size: 384)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !145, line: 57, size: 384, elements: !149)
!149 = !{!150, !164, !166, !169, !170, !183, !184, !185}
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 60, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 60, size: 64, elements: !152)
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !151, file: !145, line: 61, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !128, line: 49, baseType: !129)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !151, file: !145, line: 62, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !156, file: !157, line: 50, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !148, file: !145, line: 68, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !148, file: !145, line: 71, baseType: !167, size: 8, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !148, file: !145, line: 74, baseType: !167, size: 8, offset: 104)
!170 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 90, baseType: !171, size: 16, offset: 112)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 90, size: 16, elements: !172)
!172 = !{!173, !180}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !145, line: 91, baseType: !174, size: 16)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !145, line: 91, size: 16, elements: !175)
!175 = !{!176, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !174, file: !145, line: 96, baseType: !177, size: 8)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !178)
!178 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !174, file: !145, line: 97, baseType: !167, size: 8, offset: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !171, file: !145, line: 100, baseType: !181, size: 16)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !148, file: !145, line: 107, baseType: !110, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !148, file: !145, line: 127, baseType: !108, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !148, file: !145, line: 131, baseType: !186, size: 192, offset: 192)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !123, line: 244, size: 192, elements: !187)
!187 = !{!188, !189, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !186, file: !123, line: 245, baseType: !154, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !186, file: !123, line: 246, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !123, line: 242, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !186, file: !123, line: 249, baseType: !106, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !144, file: !145, line: 250, baseType: !197, size: 288, offset: 384)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !198, line: 25, size: 288, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !197, file: !198, line: 26, baseType: !110, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !197, file: !198, line: 27, baseType: !110, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !197, file: !198, line: 28, baseType: !110, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !197, file: !198, line: 29, baseType: !110, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !197, file: !198, line: 30, baseType: !110, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !197, file: !198, line: 31, baseType: !110, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !197, file: !198, line: 32, baseType: !110, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !197, file: !198, line: 33, baseType: !110, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !197, file: !198, line: 34, baseType: !110, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !144, file: !145, line: 253, baseType: !108, size: 32, offset: 672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !144, file: !145, line: 256, baseType: !122, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !144, file: !145, line: 271, baseType: !212, size: 128, offset: 768)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !145, line: 34, size: 128, elements: !213)
!213 = !{!214, !220, !221, !222}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !212, file: !145, line: 35, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !216, line: 46, baseType: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !108, !108, !108}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !212, file: !145, line: 36, baseType: !108, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !212, file: !145, line: 37, baseType: !108, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !212, file: !145, line: 38, baseType: !108, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !144, file: !145, line: 274, baseType: !143, size: 32, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !145, line: 279, baseType: !225, size: 256, offset: 928)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !227)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !{!228}
!228 = !DISubrange(count: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !144, file: !145, line: 294, baseType: !109, size: 32, offset: 1184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !144, file: !145, line: 325, baseType: !231, size: 32, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !119, line: 5073, size: 192, elements: !233)
!233 = !{!234, !245, !246}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !232, file: !119, line: 5074, baseType: !235, size: 96)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !236, line: 56, size: 96, elements: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !{!238, !241, !242}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !235, file: !236, line: 57, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !236, line: 57, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !235, file: !236, line: 58, baseType: !108, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !235, file: !236, line: 59, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !244, line: 214, baseType: !32)
!244 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !232, file: !119, line: 5075, baseType: !122, size: 64, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !232, file: !119, line: 5076, baseType: !247, size: 32, offset: 160)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !248, line: 43, size: 32, elements: !249)
!248 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !247, file: !248, line: 52, baseType: !22, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !144, file: !145, line: 343, baseType: !252, size: 64, offset: 1248)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !198, line: 60, size: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !252, file: !198, line: 63, baseType: !110, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !252, file: !198, line: 66, baseType: !110, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !118, file: !119, line: 2727, baseType: !110, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !118, file: !119, line: 2730, baseType: !109, size: 32, offset: 128)
!258 = !{!259}
!259 = !DISubrange(count: 6)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !116, line: 160, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8064, elements: !258)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !116, line: 159, type: !265, isLocal: true, isDefinition: true, align: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 98304, elements: !270)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !267, line: 47, size: 8, elements: !268)
!267 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !267, line: 48, baseType: !226, size: 8)
!270 = !{!259, !271}
!271 = !DISubrange(count: 2048)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 192, elements: !258)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "_char_out", scope: !276, file: !280, line: 54, type: !281, isLocal: false, isDefinition: true)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !278, globals: !279, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!278 = !{!108, !109}
!279 = !{!274}
!280 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{!109, !109}
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !286, file: !698, line: 258, type: !699, isLocal: true, isDefinition: true, align: 32)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !288, retainedTypes: !571, globals: !697, splitDebugInlining: false, nameTableKind: None)
!287 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!288 = !{!289, !321, !331, !380, !386, !507, !542}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !290, line: 54, baseType: !32, size: 32, elements: !291)
!290 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!292 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!293 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!294 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!295 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!296 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!297 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!298 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!299 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!300 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!301 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!302 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!303 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!304 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!305 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!306 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!307 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!308 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!309 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!310 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!311 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!312 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!313 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!314 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!315 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!316 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!317 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!318 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!319 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!320 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !290, line: 224, baseType: !32, size: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330}
!323 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!324 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!325 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!326 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!327 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!328 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!329 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!330 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !290, line: 275, baseType: !32, size: 32, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!333 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!334 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!335 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!336 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!337 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!338 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!339 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!340 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!341 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!342 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!343 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!344 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!345 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!346 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!347 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!348 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!349 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!350 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!351 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!352 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!353 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!354 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!355 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!356 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!357 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!358 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!359 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!360 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!361 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!362 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!363 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!364 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!365 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!366 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!367 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!368 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!369 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!370 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!371 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!372 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!373 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!374 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!375 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!376 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!377 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!378 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!379 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !290, line: 327, baseType: !32, size: 32, elements: !381)
!381 = !{!382, !383, !384, !385}
!382 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!383 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!384 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!385 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !387, line: 76, baseType: !32, size: 32, elements: !388)
!387 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!389 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!390 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!391 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!392 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!393 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!394 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!395 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!396 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!397 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!398 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!399 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!400 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!401 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!402 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!403 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!404 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!405 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!406 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!407 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!408 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!409 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!410 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!411 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!412 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!413 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!414 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!415 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!416 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!417 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!418 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!419 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!420 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!421 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!422 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!423 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!424 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!425 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!426 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!427 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!428 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!429 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!430 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!431 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!432 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!433 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!434 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!435 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!436 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!437 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!438 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!439 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!440 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!441 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!442 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!443 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!444 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!445 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!446 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!447 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!448 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!449 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!450 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!451 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!452 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!453 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!454 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!455 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!456 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!457 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!458 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!459 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!460 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!461 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!462 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!463 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!464 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!465 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!466 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!467 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!468 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!469 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!470 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!471 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!472 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!473 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!474 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!475 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!476 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!477 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!478 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!479 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!480 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!481 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!482 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!483 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!484 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!485 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!486 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!487 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!488 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!489 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!490 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!491 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!492 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!493 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!494 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!495 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!496 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!497 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!498 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!499 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!500 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!501 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!502 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!503 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!504 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!505 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!506 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !290, line: 237, baseType: !32, size: 32, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!509 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!510 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!511 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!512 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!513 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!514 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!515 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!516 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!517 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!518 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!519 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!520 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!521 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!522 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!523 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!524 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!525 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!526 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!527 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!528 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!529 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!530 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!531 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!532 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!533 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!534 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!535 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!536 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!537 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!538 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!539 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!540 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!541 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!542 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !387, line: 44, baseType: !32, size: 32, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!544 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!545 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!546 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!547 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!548 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!549 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!550 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!551 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!552 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!553 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!554 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!555 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!556 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!557 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!558 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!559 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!560 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!561 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!562 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!563 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!564 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!565 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!566 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!567 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!568 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!569 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!570 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!571 = !{!572, !644, !685, !696, !110}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !574, line: 4575, baseType: !575)
!574 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 4532, size: 390144, elements: !576)
!576 = !{!577, !579, !580, !581, !582, !586, !596, !600, !610, !614}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !575, file: !574, line: 4533, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !575, file: !574, line: 4534, baseType: !578, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !575, file: !574, line: 4535, baseType: !578, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !575, file: !574, line: 4536, baseType: !578, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !575, file: !574, line: 4537, baseType: !583, size: 16256, offset: 128)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 16256, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 2032)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !575, file: !574, line: 4543, baseType: !587, size: 4224, offset: 16384)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 4224, elements: !594)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !575, file: !574, line: 4538, size: 128, elements: !589)
!589 = !{!590, !591, !592, !593}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !588, file: !574, line: 4539, baseType: !578, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !588, file: !574, line: 4540, baseType: !578, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !588, file: !574, line: 4541, baseType: !578, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !588, file: !574, line: 4542, baseType: !578, size: 32, offset: 96)
!594 = !{!595}
!595 = !DISubrange(count: 33)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !575, file: !574, line: 4544, baseType: !597, size: 110464, offset: 20608)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 110464, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 13808)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !575, file: !574, line: 4550, baseType: !601, size: 24448, offset: 131072)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 24448, elements: !608)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !575, file: !574, line: 4545, size: 128, elements: !603)
!603 = !{!604, !605, !606, !607}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !602, file: !574, line: 4546, baseType: !578, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !602, file: !574, line: 4547, baseType: !578, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !602, file: !574, line: 4548, baseType: !578, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !602, file: !574, line: 4549, baseType: !578, size: 32, offset: 96)
!608 = !{!609}
!609 = !DISubrange(count: 191)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !575, file: !574, line: 4551, baseType: !611, size: 106624, offset: 155520)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 106624, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 13328)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !575, file: !574, line: 4574, baseType: !615, size: 128000, offset: 262144)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 128000, elements: !642)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !575, file: !574, line: 4552, size: 1024, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !638, !639, !640, !641}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !616, file: !574, line: 4553, baseType: !578, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !616, file: !574, line: 4554, baseType: !578, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !616, file: !574, line: 4555, baseType: !578, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !616, file: !574, line: 4556, baseType: !578, size: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !616, file: !574, line: 4557, baseType: !578, size: 32, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !616, file: !574, line: 4558, baseType: !578, size: 32, offset: 160)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !616, file: !574, line: 4559, baseType: !578, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !616, file: !574, line: 4560, baseType: !578, size: 32, offset: 224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !616, file: !574, line: 4561, baseType: !578, size: 32, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !616, file: !574, line: 4562, baseType: !578, size: 32, offset: 288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !616, file: !574, line: 4563, baseType: !578, size: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !616, file: !574, line: 4564, baseType: !578, size: 32, offset: 352)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !616, file: !574, line: 4565, baseType: !578, size: 32, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !616, file: !574, line: 4566, baseType: !578, size: 32, offset: 416)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !616, file: !574, line: 4567, baseType: !578, size: 32, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !616, file: !574, line: 4568, baseType: !578, size: 32, offset: 480)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !616, file: !574, line: 4569, baseType: !635, size: 384, offset: 512)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 384, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 48)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !616, file: !574, line: 4570, baseType: !578, size: 32, offset: 896)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !616, file: !574, line: 4571, baseType: !578, size: 32, offset: 928)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !616, file: !574, line: 4572, baseType: !578, size: 32, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !616, file: !574, line: 4573, baseType: !578, size: 32, offset: 992)
!642 = !{!643}
!643 = !DISubrange(count: 125)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !574, line: 38320, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 38303, size: 23040, elements: !647)
!647 = !{!648, !650, !652, !653, !654, !655, !659, !663, !667, !671, !675}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !646, file: !574, line: 38304, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !646, file: !574, line: 38305, baseType: !651, size: 256, offset: 32)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 256, elements: !227)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !646, file: !574, line: 38306, baseType: !578, size: 32, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !646, file: !574, line: 38307, baseType: !578, size: 32, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !646, file: !574, line: 38308, baseType: !578, size: 32, offset: 352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !646, file: !574, line: 38309, baseType: !656, size: 3712, offset: 384)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 3712, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 464)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !646, file: !574, line: 38310, baseType: !660, size: 864, offset: 4096)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 864, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 27)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !646, file: !574, line: 38311, baseType: !664, size: 3232, offset: 4960)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 3232, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 404)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !646, file: !574, line: 38312, baseType: !668, size: 3776, offset: 8192)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 3776, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 118)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !646, file: !574, line: 38313, baseType: !672, size: 4416, offset: 11968)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 4416, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 552)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !646, file: !574, line: 38319, baseType: !676, size: 6656, offset: 16384)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 6656, elements: !683)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !574, line: 38314, size: 128, elements: !678)
!678 = !{!679, !680, !681, !682}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !677, file: !574, line: 38315, baseType: !578, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !677, file: !574, line: 38316, baseType: !578, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !677, file: !574, line: 38317, baseType: !578, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !677, file: !574, line: 38318, baseType: !578, size: 32, offset: 96)
!683 = !{!684}
!684 = !DISubrange(count: 52)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !574, line: 43319, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 43313, size: 80, elements: !688)
!688 = !{!689, !691, !692, !694, !695}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !687, file: !574, line: 43314, baseType: !690, size: 16)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !181)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !687, file: !574, line: 43315, baseType: !690, size: 16, offset: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !687, file: !574, line: 43316, baseType: !693, size: 16, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !687, file: !574, line: 43317, baseType: !690, size: 16, offset: 48)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !687, file: !574, line: 43318, baseType: !690, size: 16, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!697 = !{!284}
!698 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !701, line: 51, size: 64, elements: !702)
!701 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = !{!703, !710}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !700, file: !701, line: 60, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DISubroutineType(types: !706)
!706 = !{!109, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !701, line: 48, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !700, file: !701, line: 65, baseType: !707, size: 32, offset: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "_kernel_thread_info_offsets", scope: !713, file: !718, line: 41, type: !721, isLocal: false, isDefinition: true)
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !278, globals: !715, splitDebugInlining: false, nameTableKind: None)
!714 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!715 = !{!711, !716, !719}
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "_kernel_thread_info_num_offsets", scope: !713, file: !718, line: 140, type: !243, isLocal: false, isDefinition: true)
!718 = !DIFile(filename: "zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "_kernel_thread_info_size_t_size", scope: !713, file: !718, line: 145, type: !167, isLocal: false, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 448, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 14)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !726, file: !826, line: 603, type: !828, isLocal: true, isDefinition: true, align: 32)
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !728, globals: !823, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!728 = !{!108, !109, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !732, line: 336, size: 608, elements: !733)
!732 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !{!734, !763, !767, !771, !784, !789, !795, !801, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !731, file: !732, line: 365, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DISubroutineType(types: !737)
!737 = !{!109, !738, !762}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !741, line: 378, size: 192, elements: !742)
!741 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!742 = !{!743, !746, !747, !748, !755, !756}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !740, file: !741, line: 380, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !740, file: !741, line: 382, baseType: !13, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !740, file: !741, line: 384, baseType: !13, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !740, file: !741, line: 386, baseType: !749, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !741, line: 351, size: 16, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !750, file: !741, line: 359, baseType: !167, size: 8)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !750, file: !741, line: 364, baseType: !754, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!754 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !740, file: !741, line: 388, baseType: !108, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !740, file: !741, line: 396, baseType: !757, size: 32, offset: 160)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !741, line: 43, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !761)
!761 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !731, file: !732, line: 366, baseType: !764, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !738, !168}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !731, file: !732, line: 374, baseType: !768, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DISubroutineType(types: !770)
!770 = !{!109, !738}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !731, file: !732, line: 377, baseType: !772, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{!109, !738, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !732, line: 122, size: 64, elements: !778)
!778 = !{!779, !780, !781, !782, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !777, file: !732, line: 123, baseType: !110, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !777, file: !732, line: 124, baseType: !167, size: 8, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !777, file: !732, line: 125, baseType: !167, size: 8, offset: 40)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !777, file: !732, line: 126, baseType: !167, size: 8, offset: 48)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !777, file: !732, line: 127, baseType: !167, size: 8, offset: 56)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !731, file: !732, line: 379, baseType: !785, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DISubroutineType(types: !787)
!787 = !{!109, !738, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !731, file: !732, line: 384, baseType: !790, size: 32, offset: 160)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DISubroutineType(types: !792)
!792 = !{!109, !738, !793, !109}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !731, file: !732, line: 393, baseType: !796, size: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DISubroutineType(types: !798)
!798 = !{!109, !738, !799, !800}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !731, file: !732, line: 402, baseType: !802, size: 32, offset: 224)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !738}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !731, file: !732, line: 405, baseType: !802, size: 32, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !731, file: !732, line: 408, baseType: !768, size: 32, offset: 288)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !731, file: !732, line: 411, baseType: !802, size: 32, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !731, file: !732, line: 414, baseType: !802, size: 32, offset: 352)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !731, file: !732, line: 417, baseType: !768, size: 32, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !731, file: !732, line: 420, baseType: !768, size: 32, offset: 416)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !731, file: !732, line: 423, baseType: !802, size: 32, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !731, file: !732, line: 426, baseType: !802, size: 32, offset: 480)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !731, file: !732, line: 429, baseType: !768, size: 32, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !731, file: !732, line: 432, baseType: !768, size: 32, offset: 544)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !731, file: !732, line: 435, baseType: !816, size: 32, offset: 576)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !738, !819, !108}
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !732, line: 142, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !738, !108}
!823 = !{!724, !824}
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !726, file: !826, line: 38, type: !827, isLocal: true, isDefinition: true)
!826 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !701, line: 51, size: 64, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !829, file: !701, line: 60, baseType: !768, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !829, file: !701, line: 65, baseType: !738, size: 32, offset: 32)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !835, file: !940, line: 318, type: !1017, isLocal: false, isDefinition: true)
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !837, retainedTypes: !854, globals: !937, splitDebugInlining: false, nameTableKind: None)
!836 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!837 = !{!838, !844, !849}
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !839, line: 506, baseType: !32, size: 32, elements: !840)
!839 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!840 = !{!841, !842, !843}
!841 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!842 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!843 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !839, line: 512, baseType: !32, size: 32, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!847 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!848 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!849 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !850, line: 66, baseType: !32, size: 32, elements: !851)
!850 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !{!852, !853}
!852 = !DIEnumerator(name: "gpioPinClear", value: 0)
!853 = !DIEnumerator(name: "gpioPinSet", value: 1)
!854 = !{!855, !925, !930, !890, !844, !838, !935, !108, !696, !905, !936}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !839, line: 523, size: 288, elements: !858)
!858 = !{!859, !880, !886, !891, !895, !896, !897, !901, !921}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !857, file: !839, line: 524, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!109, !863, !878, !879}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !741, line: 378, size: 192, elements: !866)
!866 = !{!867, !868, !869, !870, !876, !877}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !865, file: !741, line: 380, baseType: !744, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !865, file: !741, line: 382, baseType: !13, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !865, file: !741, line: 384, baseType: !13, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !865, file: !741, line: 386, baseType: !871, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !741, line: 351, size: 16, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !872, file: !741, line: 359, baseType: !167, size: 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !872, file: !741, line: 364, baseType: !754, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !865, file: !741, line: 388, baseType: !108, size: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !865, file: !741, line: 396, baseType: !757, size: 32, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !839, line: 237, baseType: !167)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !839, line: 257, baseType: !110)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !857, file: !839, line: 530, baseType: !881, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DISubroutineType(types: !883)
!883 = !{!109, !863, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !839, line: 229, baseType: !110)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !857, file: !839, line: 532, baseType: !887, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DISubroutineType(types: !889)
!889 = !{!109, !863, !890, !885}
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !839, line: 216, baseType: !110)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !857, file: !839, line: 535, baseType: !892, size: 32, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(types: !894)
!894 = !{!109, !863, !890}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !857, file: !839, line: 537, baseType: !892, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !857, file: !839, line: 539, baseType: !892, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !857, file: !839, line: 541, baseType: !898, size: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{!109, !863, !878, !838, !844}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !857, file: !839, line: 544, baseType: !902, size: 32, offset: 224)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!109, !863, !905, !754}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !839, line: 478, size: 96, elements: !907)
!907 = !{!908, !915, !920}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !906, file: !839, line: 482, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !910, line: 33, baseType: !911)
!910 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !910, line: 29, size: 32, elements: !912)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !911, file: !910, line: 30, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !906, file: !839, line: 485, baseType: !916, size: 32, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !839, line: 464, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !863, !905, !890}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !906, file: !839, line: 493, baseType: !890, size: 32, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !857, file: !839, line: 547, baseType: !922, size: 32, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!110, !863}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !839, line: 428, size: 32, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !927, file: !839, line: 434, baseType: !890, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !839, line: 441, size: 32, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !932, file: !839, line: 447, baseType: !890, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!937 = !{!833, !938, !944, !946, !956, !968, !970, !1001, !1003, !1015}
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !835, file: !940, line: 318, type: !941, isLocal: false, isDefinition: true, align: 16)
!940 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 400, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 25)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !835, file: !940, line: 318, type: !864, isLocal: false, isDefinition: true, align: 32)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !835, file: !940, line: 318, type: !948, isLocal: true, isDefinition: true, align: 32)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !701, line: 51, size: 64, elements: !950)
!950 = !{!951, !955}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !949, file: !701, line: 60, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DISubroutineType(types: !954)
!954 = !{!109, !863}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !949, file: !701, line: 65, baseType: !863, size: 32, offset: 32)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !835, file: !940, line: 318, type: !958, isLocal: true, isDefinition: true)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !940, line: 33, size: 96, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !940, line: 35, baseType: !932, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !958, file: !940, line: 37, baseType: !962, size: 64, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !910, line: 40, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !910, line: 35, size: 64, elements: !964)
!964 = !{!965, !967}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !963, file: !910, line: 36, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !963, file: !910, line: 37, baseType: !966, size: 32, offset: 32)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !835, file: !940, line: 318, type: !872, isLocal: true, isDefinition: true, align: 8)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !835, file: !940, line: 318, type: !972, isLocal: true, isDefinition: true)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !940, line: 23, size: 128, elements: !974)
!974 = !{!975, !976, !989, !1000}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !973, file: !940, line: 25, baseType: !927, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !973, file: !940, line: 26, baseType: !977, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !574, line: 19729, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 19720, size: 256, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !979, file: !574, line: 19721, baseType: !578, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !979, file: !574, line: 19722, baseType: !578, size: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !979, file: !574, line: 19723, baseType: !649, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !979, file: !574, line: 19724, baseType: !578, size: 32, offset: 96)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !979, file: !574, line: 19725, baseType: !578, size: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !979, file: !574, line: 19726, baseType: !578, size: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !979, file: !574, line: 19727, baseType: !578, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !979, file: !574, line: 19728, baseType: !578, size: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !973, file: !940, line: 28, baseType: !990, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !993, line: 51, size: 128, elements: !994)
!993 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!994 = !{!995, !996, !997, !998, !999}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !992, file: !993, line: 52, baseType: !110, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !992, file: !993, line: 53, baseType: !110, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !992, file: !993, line: 54, baseType: !110, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !992, file: !993, line: 55, baseType: !167, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !992, file: !993, line: 56, baseType: !110, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mux_count", scope: !973, file: !940, line: 29, baseType: !167, size: 8, offset: 96)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "imx_gpio_driver_api", scope: !835, file: !940, line: 249, type: !856, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_0", scope: !1005, file: !940, line: 318, type: !1008, isLocal: true, isDefinition: true, align: 32)
!1005 = distinct !DISubprogram(name: "imx_gpio_0_init", scope: !940, file: !940, line: 318, type: !953, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !835, retainedNodes: !1006)
!1006 = !{!1007}
!1007 = !DILocalVariable(name: "port", arg: 1, scope: !1005, file: !940, line: 318, type: !863)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1009)
!1009 = !{!1010, !1012, !1013, !1014}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1008, file: !10, line: 55, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1008, file: !10, line: 57, baseType: !1011, size: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1008, file: !10, line: 59, baseType: !108, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1008, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_1", scope: !1005, file: !940, line: 318, type: !1008, isLocal: true, isDefinition: true, align: 32)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 2048, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 16)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !1022, file: !1027, line: 7, type: !1028, isLocal: false, isDefinition: true, align: 16)
!1022 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1023, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1024, splitDebugInlining: false, nameTableKind: None)
!1023 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!1024 = !{!1020, !1025}
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_198", scope: !1022, file: !1027, line: 12, type: !1028, isLocal: false, isDefinition: true, align: 16)
!1027 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 48, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 3)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "imx_uart_0_config", scope: !1033, file: !1230, line: 339, type: !1228, isLocal: true, isDefinition: true)
!1033 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1034, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1035, retainedTypes: !1121, globals: !1266, splitDebugInlining: false, nameTableKind: None)
!1034 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/philosophers")
!1035 = !{!30, !1036, !1074, !1102, !1106, !1110, !1115}
!1036 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_status_flag", file: !1037, line: 122, baseType: !32, size: 32, elements: !1038)
!1037 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./uart_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073}
!1039 = !DIEnumerator(name: "uartStatusRxCharReady", value: 15)
!1040 = !DIEnumerator(name: "uartStatusRxError", value: 14)
!1041 = !DIEnumerator(name: "uartStatusRxOverrunError", value: 13)
!1042 = !DIEnumerator(name: "uartStatusRxFrameError", value: 12)
!1043 = !DIEnumerator(name: "uartStatusRxBreakDetect", value: 11)
!1044 = !DIEnumerator(name: "uartStatusRxParityError", value: 10)
!1045 = !DIEnumerator(name: "uartStatusParityError", value: 9699343)
!1046 = !DIEnumerator(name: "uartStatusRtsStatus", value: 9699342)
!1047 = !DIEnumerator(name: "uartStatusTxReady", value: 9699341)
!1048 = !DIEnumerator(name: "uartStatusRtsDelta", value: 9699340)
!1049 = !DIEnumerator(name: "uartStatusEscape", value: 9699339)
!1050 = !DIEnumerator(name: "uartStatusFrameError", value: 9699338)
!1051 = !DIEnumerator(name: "uartStatusRxReady", value: 9699337)
!1052 = !DIEnumerator(name: "uartStatusAgingTimer", value: 9699336)
!1053 = !DIEnumerator(name: "uartStatusDtrDelta", value: 9699335)
!1054 = !DIEnumerator(name: "uartStatusRxDs", value: 9699334)
!1055 = !DIEnumerator(name: "uartStatustAirWake", value: 9699333)
!1056 = !DIEnumerator(name: "uartStatusAwake", value: 9699332)
!1057 = !DIEnumerator(name: "uartStatusRs485SlaveAddrMatch", value: 9699331)
!1058 = !DIEnumerator(name: "uartStatusAutoBaud", value: 9961487)
!1059 = !DIEnumerator(name: "uartStatusTxEmpty", value: 9961486)
!1060 = !DIEnumerator(name: "uartStatusDtr", value: 9961485)
!1061 = !DIEnumerator(name: "uartStatusIdle", value: 9961484)
!1062 = !DIEnumerator(name: "uartStatusAutoBaudCntStop", value: 9961483)
!1063 = !DIEnumerator(name: "uartStatusRiDelta", value: 9961482)
!1064 = !DIEnumerator(name: "uartStatusRi", value: 9961481)
!1065 = !DIEnumerator(name: "uartStatusIr", value: 9961480)
!1066 = !DIEnumerator(name: "uartStatusWake", value: 9961479)
!1067 = !DIEnumerator(name: "uartStatusDcdDelta", value: 9961478)
!1068 = !DIEnumerator(name: "uartStatusDcd", value: 9961477)
!1069 = !DIEnumerator(name: "uartStatusRts", value: 9961476)
!1070 = !DIEnumerator(name: "uartStatusTxComplete", value: 9961475)
!1071 = !DIEnumerator(name: "uartStatusBreakDetect", value: 9961474)
!1072 = !DIEnumerator(name: "uartStatusRxOverrun", value: 9961473)
!1073 = !DIEnumerator(name: "uartStatusRxDataReady", value: 9961472)
!1074 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_interrupt", file: !1037, line: 91, baseType: !32, size: 32, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101}
!1076 = !DIEnumerator(name: "uartIntAutoBaud", value: 8388623)
!1077 = !DIEnumerator(name: "uartIntTxReady", value: 8388621)
!1078 = !DIEnumerator(name: "uartIntIdle", value: 8388620)
!1079 = !DIEnumerator(name: "uartIntRxReady", value: 8388617)
!1080 = !DIEnumerator(name: "uartIntTxEmpty", value: 8388614)
!1081 = !DIEnumerator(name: "uartIntRtsDelta", value: 8388613)
!1082 = !DIEnumerator(name: "uartIntEscape", value: 8650767)
!1083 = !DIEnumerator(name: "uartIntRts", value: 8650756)
!1084 = !DIEnumerator(name: "uartIntAgingTimer", value: 8650755)
!1085 = !DIEnumerator(name: "uartIntDtr", value: 8912909)
!1086 = !DIEnumerator(name: "uartIntParityError", value: 8912908)
!1087 = !DIEnumerator(name: "uartIntFrameError", value: 8912907)
!1088 = !DIEnumerator(name: "uartIntDcd", value: 8912905)
!1089 = !DIEnumerator(name: "uartIntRi", value: 8912904)
!1090 = !DIEnumerator(name: "uartIntRxDs", value: 8912902)
!1091 = !DIEnumerator(name: "uartInttAirWake", value: 8912901)
!1092 = !DIEnumerator(name: "uartIntAwake", value: 8912900)
!1093 = !DIEnumerator(name: "uartIntDtrDelta", value: 8912899)
!1094 = !DIEnumerator(name: "uartIntAutoBaudCnt", value: 8912896)
!1095 = !DIEnumerator(name: "uartIntIr", value: 9175048)
!1096 = !DIEnumerator(name: "uartIntWake", value: 9175047)
!1097 = !DIEnumerator(name: "uartIntTxComplete", value: 9175043)
!1098 = !DIEnumerator(name: "uartIntBreakDetect", value: 9175042)
!1099 = !DIEnumerator(name: "uartIntRxOverrun", value: 9175041)
!1100 = !DIEnumerator(name: "uartIntRxDataReady", value: 9175040)
!1101 = !DIEnumerator(name: "uartIntRs485SlaveAddrMatch", value: 12058627)
!1102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_word_length", file: !1037, line: 60, baseType: !32, size: 32, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIEnumerator(name: "uartWordLength7Bits", value: 0)
!1105 = !DIEnumerator(name: "uartWordLength8Bits", value: 32)
!1106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_stop_bit_num", file: !1037, line: 67, baseType: !32, size: 32, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIEnumerator(name: "uartStopBitNumOne", value: 0)
!1109 = !DIEnumerator(name: "uartStopBitNumTwo", value: 64)
!1110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_partity_mode", file: !1037, line: 74, baseType: !32, size: 32, elements: !1111)
!1111 = !{!1112, !1113, !1114}
!1112 = !DIEnumerator(name: "uartParityDisable", value: 0)
!1113 = !DIEnumerator(name: "uartParityEven", value: 256)
!1114 = !DIEnumerator(name: "uartParityOdd", value: 384)
!1115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_direction_mode", file: !1037, line: 82, baseType: !32, size: 32, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120}
!1117 = !DIEnumerator(name: "uartDirectionDisable", value: 0)
!1118 = !DIEnumerator(name: "uartDirectionTx", value: 4)
!1119 = !DIEnumerator(name: "uartDirectionRx", value: 2)
!1120 = !DIEnumerator(name: "uartDirectionTxRx", value: 6)
!1121 = !{!108, !109, !1122, !1201, !1227, !1265, !110, !754, !167}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 32)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !732, line: 336, size: 608, elements: !1125)
!1125 = !{!1126, !1145, !1149, !1153, !1166, !1171, !1175, !1179, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1124, file: !732, line: 365, baseType: !1127, size: 32)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 32)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!109, !1130, !762}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 32)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !741, line: 378, size: 192, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1143, !1144}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1132, file: !741, line: 380, baseType: !744, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1132, file: !741, line: 382, baseType: !13, size: 32, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1132, file: !741, line: 384, baseType: !13, size: 32, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1132, file: !741, line: 386, baseType: !1138, size: 32, offset: 96)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 32)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !741, line: 351, size: 16, elements: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1139, file: !741, line: 359, baseType: !167, size: 8)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1139, file: !741, line: 364, baseType: !754, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1132, file: !741, line: 388, baseType: !108, size: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1132, file: !741, line: 396, baseType: !757, size: 32, offset: 160)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !1124, file: !732, line: 366, baseType: !1146, size: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 32)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{null, !1130, !168}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !1124, file: !732, line: 374, baseType: !1150, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 32)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!109, !1130}
