; ModuleID = 'build/arduino_mkrzero/userspace/hello_world_user/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.z_thread_stack_element] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/userspace/hello_world_user/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/userspace/hello_world_user")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/userspace/hello_world_user")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "user_thread", scope: !27, file: !114, line: 11, type: !123, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/userspace/hello_world_user/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/userspace/hello_world_user")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "user_stack", scope: !27, file: !114, line: 12, type: !115, isLocal: false, isDefinition: true, align: 64)
!114 = !DIFile(filename: "zephyr/samples/userspace/hello_world_user/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 16384, elements: !121)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !117, line: 47, size: 8, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !117, line: 48, baseType: !120, size: 8)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !{!122}
!122 = !DISubrange(count: 2048)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !124, line: 245, size: 896, elements: !125)
!124 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!125 = !{!126, !195, !208, !209, !210, !211, !233}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !123, file: !124, line: 247, baseType: !127, size: 384)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !124, line: 57, size: 384, elements: !128)
!128 = !{!129, !157, !165, !168, !169, !182, !183, !184}
!129 = !DIDerivedType(tag: DW_TAG_member, scope: !127, file: !124, line: 60, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !124, line: 60, size: 64, elements: !131)
!131 = !{!132, !148}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !130, file: !124, line: 61, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !134, line: 49, baseType: !135)
!134 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !134, line: 37, size: 64, elements: !136)
!136 = !{!137, !143}
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !135, file: !134, line: 38, baseType: !138, size: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !134, line: 38, size: 32, elements: !139)
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !138, file: !134, line: 39, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !134, line: 40, baseType: !141, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !135, file: !134, line: 42, baseType: !144, size: 32, offset: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !134, line: 42, size: 32, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !144, file: !134, line: 43, baseType: !141, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !144, file: !134, line: 44, baseType: !141, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !130, file: !124, line: 62, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !150, line: 49, size: 64, elements: !151)
!150 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !149, file: !150, line: 50, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, elements: !155)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!155 = !{!156}
!156 = !DISubrange(count: 2)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !127, file: !124, line: 68, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !160, line: 233, baseType: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 231, size: 64, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !161, file: !160, line: 232, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !134, line: 48, baseType: !135)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !127, file: !124, line: 71, baseType: !166, size: 8, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !167)
!167 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !127, file: !124, line: 74, baseType: !166, size: 8, offset: 104)
!169 = !DIDerivedType(tag: DW_TAG_member, scope: !127, file: !124, line: 90, baseType: !170, size: 16, offset: 112)
!170 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !124, line: 90, size: 16, elements: !171)
!171 = !{!172, !179}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !124, line: 91, baseType: !173, size: 16)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !170, file: !124, line: 91, size: 16, elements: !174)
!174 = !{!175, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !173, file: !124, line: 96, baseType: !176, size: 8)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !177)
!177 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !173, file: !124, line: 97, baseType: !166, size: 8, offset: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !170, file: !124, line: 100, baseType: !180, size: 16)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !181)
!181 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !127, file: !124, line: 107, baseType: !108, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !127, file: !124, line: 127, baseType: !102, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !127, file: !124, line: 131, baseType: !185, size: 192, offset: 192)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !160, line: 244, size: 192, elements: !186)
!186 = !{!187, !188, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !185, file: !160, line: 245, baseType: !133, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !185, file: !160, line: 246, baseType: !189, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !160, line: 242, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !185, file: !160, line: 249, baseType: !105, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !123, file: !124, line: 250, baseType: !196, size: 288, offset: 384)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !197, line: 25, size: 288, elements: !198)
!197 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !196, file: !197, line: 26, baseType: !108, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !196, file: !197, line: 27, baseType: !108, size: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !196, file: !197, line: 28, baseType: !108, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !196, file: !197, line: 29, baseType: !108, size: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !196, file: !197, line: 30, baseType: !108, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !196, file: !197, line: 31, baseType: !108, size: 32, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !196, file: !197, line: 32, baseType: !108, size: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !196, file: !197, line: 33, baseType: !108, size: 32, offset: 224)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !196, file: !197, line: 34, baseType: !108, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !123, file: !124, line: 253, baseType: !102, size: 32, offset: 672)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !123, file: !124, line: 256, baseType: !159, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !123, file: !124, line: 294, baseType: !107, size: 32, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !123, file: !124, line: 325, baseType: !212, size: 32, offset: 800)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !214, line: 5073, size: 192, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !227, !228}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !213, file: !214, line: 5074, baseType: !217, size: 96)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !218, line: 56, size: 96, elements: !219)
!218 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!219 = !{!220, !223, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !217, file: !218, line: 57, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !218, line: 57, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !217, file: !218, line: 58, baseType: !102, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !217, file: !218, line: 59, baseType: !225, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 214, baseType: !32)
!226 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !213, file: !214, line: 5075, baseType: !159, size: 64, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !213, file: !214, line: 5076, baseType: !229, size: 32, offset: 160)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !230, line: 43, size: 32, elements: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !229, file: !230, line: 52, baseType: !22, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !123, file: !124, line: 343, baseType: !234, size: 64, offset: 832)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !197, line: 60, size: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !234, file: !197, line: 63, baseType: !108, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !234, file: !197, line: 66, baseType: !108, size: 32, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !240, file: !258, line: 18, type: !259, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !242, globals: !257, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/userspace/hello_world_user")
!242 = !{!22, !102, !24, !243, !245, !247, !225, !107, !250, !251, !253, !254, !255, !256, !180, !248}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!257 = !{!238}
!258 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !261, line: 16, size: 64, elements: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !261, line: 17, baseType: !248, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !260, file: !261, line: 18, baseType: !166, size: 8, offset: 32)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "_char_out", scope: !267, file: !271, line: 54, type: !272, isLocal: false, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !269, globals: !270, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/userspace/hello_world_user")
!269 = !{!102, !107}
!270 = !{!265}
!271 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DISubroutineType(types: !274)
!274 = !{!107, !107}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !277, file: !1011, line: 202, type: !1012, isLocal: true, isDefinition: true, align: 32)
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !279, globals: !1010, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/userspace/hello_world_user")
!279 = !{!102, !107, !280, !402, !741, !742, !809}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !282, line: 335, baseType: !283)
!282 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 320, size: 288, elements: !284)
!284 = !{!285, !296, !302, !316, !327, !338, !342, !353, !354, !365, !366, !381, !382, !392}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !283, file: !282, line: 321, baseType: !286, size: 16)
!286 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !282, line: 50, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 43, size: 16, elements: !289)
!289 = !{!290, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !288, file: !282, line: 48, baseType: !291, size: 16)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !282, line: 44, size: 16, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !291, file: !282, line: 45, baseType: !180, size: 7, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !291, file: !282, line: 47, baseType: !180, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !288, file: !282, line: 49, baseType: !180, size: 16)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !283, file: !282, line: 322, baseType: !297, size: 16, offset: 16)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 16, elements: !155)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !299, line: 52, baseType: !300)
!299 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !166)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !283, file: !282, line: 323, baseType: !303, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !282, line: 107, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 94, size: 32, elements: !306)
!306 = !{!307, !315}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !305, file: !282, line: 105, baseType: !308, size: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !305, file: !282, line: 95, size: 32, elements: !309)
!309 = !{!310, !311, !312, !313, !314}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !308, file: !282, line: 97, baseType: !108, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !308, file: !282, line: 99, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !308, file: !282, line: 100, baseType: !108, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !308, file: !282, line: 102, baseType: !108, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !308, file: !282, line: 103, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !305, file: !282, line: 106, baseType: !108, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !283, file: !282, line: 324, baseType: !317, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !282, line: 155, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 148, size: 32, elements: !320)
!320 = !{!321, !326}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !319, file: !282, line: 153, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !319, file: !282, line: 149, size: 32, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !322, file: !282, line: 150, baseType: !108, size: 16, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !322, file: !282, line: 151, baseType: !108, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !319, file: !282, line: 154, baseType: !108, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !283, file: !282, line: 325, baseType: !328, size: 8, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !282, line: 194, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 187, size: 8, elements: !331)
!331 = !{!332, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !330, file: !282, line: 192, baseType: !333, size: 8)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !282, line: 188, size: 8, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !333, file: !282, line: 189, baseType: !166, size: 1, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !333, file: !282, line: 190, baseType: !166, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !330, file: !282, line: 193, baseType: !166, size: 8)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !283, file: !282, line: 326, baseType: !339, size: 24, offset: 104)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 24, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 3)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !283, file: !282, line: 327, baseType: !343, size: 8, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !282, line: 215, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 208, size: 8, elements: !346)
!346 = !{!347, !352}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !345, file: !282, line: 213, baseType: !348, size: 8)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !345, file: !282, line: 209, size: 8, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !348, file: !282, line: 210, baseType: !166, size: 1, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !348, file: !282, line: 211, baseType: !166, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !345, file: !282, line: 214, baseType: !166, size: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !283, file: !282, line: 328, baseType: !339, size: 24, offset: 136)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !283, file: !282, line: 329, baseType: !355, size: 8, offset: 160)
!355 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !282, line: 236, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 229, size: 8, elements: !358)
!358 = !{!359, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !357, file: !282, line: 234, baseType: !360, size: 8)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !357, file: !282, line: 230, size: 8, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !360, file: !282, line: 231, baseType: !300, size: 1, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !360, file: !282, line: 232, baseType: !300, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !357, file: !282, line: 235, baseType: !166, size: 8)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !283, file: !282, line: 330, baseType: !339, size: 24, offset: 168)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !283, file: !282, line: 331, baseType: !367, size: 16, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !282, line: 262, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 250, size: 16, elements: !370)
!370 = !{!371, !380}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !369, file: !282, line: 260, baseType: !372, size: 16)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !282, line: 251, size: 16, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !372, file: !282, line: 252, baseType: !180, size: 1, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !372, file: !282, line: 253, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !372, file: !282, line: 254, baseType: !180, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !372, file: !282, line: 255, baseType: !180, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !372, file: !282, line: 256, baseType: !180, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !372, file: !282, line: 258, baseType: !180, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !369, file: !282, line: 261, baseType: !180, size: 16)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !283, file: !282, line: 332, baseType: !297, size: 16, offset: 208)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !283, file: !282, line: 333, baseType: !383, size: 32, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !282, line: 290, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 284, size: 32, elements: !386)
!386 = !{!387, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !385, file: !282, line: 288, baseType: !388, size: 32)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !385, file: !282, line: 285, size: 32, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !388, file: !282, line: 286, baseType: !108, size: 22, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !385, file: !282, line: 289, baseType: !108, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !283, file: !282, line: 334, baseType: !393, size: 16, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !282, line: 308, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !282, line: 303, size: 16, elements: !396)
!396 = !{!397, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !395, file: !282, line: 306, baseType: !398, size: 16)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !395, file: !282, line: 304, size: 16, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !398, file: !282, line: 305, baseType: !180, size: 16, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !395, file: !282, line: 307, baseType: !180, size: 16)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !404, line: 928, baseType: !405)
!404 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 899, size: 672, elements: !406)
!406 = !{!407, !431, !455, !481, !506, !522, !523, !541, !542, !559, !570, !571, !586, !606, !607, !619, !631, !641, !642, !659, !663, !674, !675, !687, !699, !700, !711, !727}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !405, file: !404, line: 900, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !404, line: 64, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 43, size: 32, elements: !411)
!411 = !{!412, !430}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !410, file: !404, line: 62, baseType: !413, size: 32)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !404, line: 44, size: 32, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !413, file: !404, line: 45, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !413, file: !404, line: 46, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !413, file: !404, line: 47, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !413, file: !404, line: 48, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !413, file: !404, line: 49, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !413, file: !404, line: 50, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !413, file: !404, line: 51, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !413, file: !404, line: 52, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !413, file: !404, line: 53, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !413, file: !404, line: 54, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !413, file: !404, line: 55, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !413, file: !404, line: 56, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !413, file: !404, line: 58, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !413, file: !404, line: 59, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !413, file: !404, line: 60, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !410, file: !404, line: 63, baseType: !108, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !405, file: !404, line: 901, baseType: !432, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !404, line: 125, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 104, size: 32, elements: !435)
!435 = !{!436, !454}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !434, file: !404, line: 123, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !434, file: !404, line: 105, size: 32, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !437, file: !404, line: 106, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !437, file: !404, line: 107, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !437, file: !404, line: 108, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !437, file: !404, line: 109, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !437, file: !404, line: 110, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !437, file: !404, line: 111, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !437, file: !404, line: 112, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !437, file: !404, line: 113, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !437, file: !404, line: 114, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !437, file: !404, line: 115, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !437, file: !404, line: 116, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !437, file: !404, line: 117, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !437, file: !404, line: 119, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !437, file: !404, line: 120, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !437, file: !404, line: 121, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !434, file: !404, line: 124, baseType: !108, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !405, file: !404, line: 902, baseType: !456, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !404, line: 186, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 165, size: 32, elements: !459)
!459 = !{!460, !480}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !458, file: !404, line: 184, baseType: !461, size: 32)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !404, line: 166, size: 32, elements: !462)
!462 = !{!463, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !461, file: !404, line: 167, baseType: !464, size: 1, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !461, file: !404, line: 168, baseType: !464, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !461, file: !404, line: 169, baseType: !464, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !461, file: !404, line: 170, baseType: !464, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !461, file: !404, line: 171, baseType: !464, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !461, file: !404, line: 172, baseType: !464, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !461, file: !404, line: 173, baseType: !464, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !461, file: !404, line: 174, baseType: !464, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !461, file: !404, line: 175, baseType: !464, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !461, file: !404, line: 176, baseType: !464, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !461, file: !404, line: 177, baseType: !464, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !461, file: !404, line: 178, baseType: !464, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !461, file: !404, line: 180, baseType: !464, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !461, file: !404, line: 181, baseType: !464, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !461, file: !404, line: 182, baseType: !464, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !458, file: !404, line: 185, baseType: !108, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !405, file: !404, line: 903, baseType: !482, size: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !404, line: 247, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 226, size: 32, elements: !486)
!486 = !{!487, !505}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !485, file: !404, line: 245, baseType: !488, size: 32)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !404, line: 227, size: 32, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !488, file: !404, line: 228, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !488, file: !404, line: 229, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !488, file: !404, line: 230, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !488, file: !404, line: 231, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !488, file: !404, line: 232, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !488, file: !404, line: 233, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !488, file: !404, line: 234, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !488, file: !404, line: 235, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !488, file: !404, line: 236, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !488, file: !404, line: 237, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !488, file: !404, line: 238, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !488, file: !404, line: 239, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !488, file: !404, line: 241, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !488, file: !404, line: 242, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !488, file: !404, line: 243, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !485, file: !404, line: 246, baseType: !108, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !405, file: !404, line: 904, baseType: !507, size: 16, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !404, line: 300, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 287, size: 16, elements: !510)
!510 = !{!511, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !509, file: !404, line: 298, baseType: !512, size: 16)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !404, line: 288, size: 16, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !512, file: !404, line: 290, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !512, file: !404, line: 291, baseType: !180, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !512, file: !404, line: 293, baseType: !180, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !512, file: !404, line: 294, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !512, file: !404, line: 295, baseType: !180, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !512, file: !404, line: 296, baseType: !180, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !512, file: !404, line: 297, baseType: !180, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !509, file: !404, line: 299, baseType: !180, size: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !405, file: !404, line: 905, baseType: !297, size: 16, offset: 144)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !405, file: !404, line: 906, baseType: !524, size: 16, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !404, line: 352, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 336, size: 16, elements: !527)
!527 = !{!528, !540}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !526, file: !404, line: 350, baseType: !529, size: 16)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !404, line: 337, size: 16, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !529, file: !404, line: 339, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !529, file: !404, line: 340, baseType: !180, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !529, file: !404, line: 341, baseType: !180, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !529, file: !404, line: 342, baseType: !180, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !529, file: !404, line: 343, baseType: !180, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !529, file: !404, line: 344, baseType: !180, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !529, file: !404, line: 345, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !529, file: !404, line: 346, baseType: !180, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !529, file: !404, line: 348, baseType: !180, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !526, file: !404, line: 351, baseType: !180, size: 16)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !405, file: !404, line: 907, baseType: !297, size: 16, offset: 176)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !405, file: !404, line: 908, baseType: !543, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !404, line: 398, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 381, size: 32, elements: !546)
!546 = !{!547, !558}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !545, file: !404, line: 396, baseType: !548, size: 32)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !545, file: !404, line: 382, size: 32, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !548, file: !404, line: 384, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !548, file: !404, line: 385, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !548, file: !404, line: 386, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !548, file: !404, line: 388, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !548, file: !404, line: 389, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !548, file: !404, line: 390, baseType: !108, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !548, file: !404, line: 392, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !548, file: !404, line: 394, baseType: !108, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !545, file: !404, line: 397, baseType: !108, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !405, file: !404, line: 909, baseType: !560, size: 8, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !404, line: 433, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 426, size: 8, elements: !563)
!563 = !{!564, !569}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !562, file: !404, line: 431, baseType: !565, size: 8)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !562, file: !404, line: 427, size: 8, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !565, file: !404, line: 428, baseType: !166, size: 5, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !565, file: !404, line: 430, baseType: !166, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !562, file: !404, line: 432, baseType: !166, size: 8)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !405, file: !404, line: 910, baseType: !339, size: 24, offset: 232)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !405, file: !404, line: 911, baseType: !572, size: 32, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !404, line: 462, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 448, size: 32, elements: !575)
!575 = !{!576, !585}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !574, file: !404, line: 460, baseType: !577, size: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !574, file: !404, line: 449, size: 32, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !577, file: !404, line: 451, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !577, file: !404, line: 453, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !577, file: !404, line: 454, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !577, file: !404, line: 455, baseType: !108, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !577, file: !404, line: 457, baseType: !108, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !577, file: !404, line: 459, baseType: !108, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !574, file: !404, line: 461, baseType: !108, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !405, file: !404, line: 912, baseType: !587, size: 16, offset: 288)
!587 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !404, line: 520, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 503, size: 16, elements: !590)
!590 = !{!591, !605}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !589, file: !404, line: 518, baseType: !592, size: 16)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !589, file: !404, line: 504, size: 16, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !592, file: !404, line: 506, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !592, file: !404, line: 507, baseType: !180, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !592, file: !404, line: 508, baseType: !180, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !592, file: !404, line: 509, baseType: !180, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !592, file: !404, line: 510, baseType: !180, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !592, file: !404, line: 511, baseType: !180, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !592, file: !404, line: 512, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !592, file: !404, line: 513, baseType: !180, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !592, file: !404, line: 514, baseType: !180, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !592, file: !404, line: 515, baseType: !180, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !592, file: !404, line: 516, baseType: !180, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !589, file: !404, line: 519, baseType: !180, size: 16)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !405, file: !404, line: 913, baseType: !297, size: 16, offset: 304)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !405, file: !404, line: 914, baseType: !608, size: 32, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !404, line: 559, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 552, size: 32, elements: !611)
!611 = !{!612, !618}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !610, file: !404, line: 557, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !610, file: !404, line: 553, size: 32, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !613, file: !404, line: 554, baseType: !108, size: 10, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !613, file: !404, line: 555, baseType: !108, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !613, file: !404, line: 556, baseType: !108, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !610, file: !404, line: 558, baseType: !108, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !405, file: !404, line: 915, baseType: !620, size: 32, offset: 352)
!620 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !404, line: 585, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 578, size: 32, elements: !623)
!623 = !{!624, !630}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !622, file: !404, line: 583, baseType: !625, size: 32)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !622, file: !404, line: 579, size: 32, elements: !626)
!626 = !{!627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !625, file: !404, line: 580, baseType: !108, size: 16, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !625, file: !404, line: 581, baseType: !108, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !625, file: !404, line: 582, baseType: !108, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !622, file: !404, line: 584, baseType: !108, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !405, file: !404, line: 916, baseType: !632, size: 8, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !404, line: 610, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 604, size: 8, elements: !635)
!635 = !{!636, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !634, file: !404, line: 608, baseType: !637, size: 8)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !404, line: 605, size: 8, elements: !638)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !637, file: !404, line: 607, baseType: !166, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !634, file: !404, line: 609, baseType: !166, size: 8)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !405, file: !404, line: 917, baseType: !339, size: 24, offset: 392)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !405, file: !404, line: 918, baseType: !643, size: 32, offset: 416)
!643 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !404, line: 639, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 622, size: 32, elements: !646)
!646 = !{!647, !658}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !645, file: !404, line: 637, baseType: !648, size: 32)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !645, file: !404, line: 623, size: 32, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !648, file: !404, line: 625, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !648, file: !404, line: 626, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !648, file: !404, line: 627, baseType: !108, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !648, file: !404, line: 629, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !648, file: !404, line: 631, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !648, file: !404, line: 632, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !648, file: !404, line: 634, baseType: !108, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !648, file: !404, line: 635, baseType: !108, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !645, file: !404, line: 638, baseType: !108, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !405, file: !404, line: 919, baseType: !660, size: 32, offset: 448)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 32, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 4)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !405, file: !404, line: 920, baseType: !664, size: 16, offset: 480)
!664 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !404, line: 715, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 706, size: 16, elements: !667)
!667 = !{!668, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !666, file: !404, line: 713, baseType: !669, size: 16)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !666, file: !404, line: 707, size: 16, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !669, file: !404, line: 709, baseType: !180, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !669, file: !404, line: 711, baseType: !180, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !666, file: !404, line: 714, baseType: !180, size: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !405, file: !404, line: 921, baseType: !297, size: 16, offset: 496)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !405, file: !404, line: 922, baseType: !676, size: 32, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !404, line: 739, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 729, size: 32, elements: !679)
!679 = !{!680, !686}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !678, file: !404, line: 737, baseType: !681, size: 32)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !404, line: 730, size: 32, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !681, file: !404, line: 732, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !681, file: !404, line: 733, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !681, file: !404, line: 735, baseType: !108, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !678, file: !404, line: 738, baseType: !108, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !405, file: !404, line: 923, baseType: !688, size: 8, offset: 544)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !404, line: 765, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 756, size: 8, elements: !691)
!691 = !{!692, !698}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !690, file: !404, line: 763, baseType: !693, size: 8)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !690, file: !404, line: 757, size: 8, elements: !694)
!694 = !{!695, !696, !697}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !693, file: !404, line: 759, baseType: !166, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !693, file: !404, line: 761, baseType: !166, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !693, file: !404, line: 762, baseType: !166, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !690, file: !404, line: 764, baseType: !166, size: 8)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !405, file: !404, line: 924, baseType: !339, size: 24, offset: 552)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !405, file: !404, line: 925, baseType: !701, size: 32, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !404, line: 789, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 781, size: 32, elements: !704)
!704 = !{!705, !710}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !703, file: !404, line: 787, baseType: !706, size: 32)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !703, file: !404, line: 782, size: 32, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !706, file: !404, line: 783, baseType: !108, size: 12, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !706, file: !404, line: 785, baseType: !108, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !703, file: !404, line: 788, baseType: !108, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !405, file: !404, line: 926, baseType: !712, size: 32, offset: 608)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !404, line: 820, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 805, size: 32, elements: !715)
!715 = !{!716, !726}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !404, line: 818, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !404, line: 806, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !717, file: !404, line: 807, baseType: !108, size: 2, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !717, file: !404, line: 808, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !717, file: !404, line: 809, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !717, file: !404, line: 810, baseType: !108, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !717, file: !404, line: 812, baseType: !108, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !717, file: !404, line: 814, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !717, file: !404, line: 816, baseType: !108, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !404, line: 819, baseType: !108, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !405, file: !404, line: 927, baseType: !728, size: 8, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !404, line: 881, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !404, line: 872, size: 8, elements: !732)
!732 = !{!733, !740}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !731, file: !404, line: 879, baseType: !734, size: 8)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !404, line: 873, size: 8, elements: !735)
!735 = !{!736, !737, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !734, file: !404, line: 874, baseType: !166, size: 1, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !734, file: !404, line: 875, baseType: !166, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !734, file: !404, line: 876, baseType: !166, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !734, file: !404, line: 877, baseType: !166, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !731, file: !404, line: 880, baseType: !166, size: 8)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !744, line: 290, baseType: !745)
!744 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !744, line: 284, size: 96, elements: !746)
!746 = !{!747, !757, !768, !781, !798}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !745, file: !744, line: 285, baseType: !748, size: 8)
!748 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !744, line: 49, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 43, size: 8, elements: !751)
!751 = !{!752, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !750, file: !744, line: 47, baseType: !753, size: 8)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !750, file: !744, line: 44, size: 8, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !753, file: !744, line: 45, baseType: !166, size: 1, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !750, file: !744, line: 48, baseType: !166, size: 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !745, file: !744, line: 286, baseType: !758, size: 8, offset: 8)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !744, line: 67, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 61, size: 8, elements: !762)
!762 = !{!763, !767}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !761, file: !744, line: 65, baseType: !764, size: 8)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !761, file: !744, line: 62, size: 8, elements: !765)
!765 = !{!766}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !764, file: !744, line: 64, baseType: !166, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !761, file: !744, line: 66, baseType: !166, size: 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !745, file: !744, line: 287, baseType: !769, size: 16, offset: 16)
!769 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !744, line: 89, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 79, size: 16, elements: !772)
!772 = !{!773, !780}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !771, file: !744, line: 87, baseType: !774, size: 16)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !771, file: !744, line: 80, size: 16, elements: !775)
!775 = !{!776, !777, !778, !779}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !774, file: !744, line: 81, baseType: !180, size: 6, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !774, file: !744, line: 83, baseType: !180, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !774, file: !744, line: 85, baseType: !180, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !774, file: !744, line: 86, baseType: !180, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !771, file: !744, line: 88, baseType: !180, size: 16)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !745, file: !744, line: 288, baseType: !782, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !744, line: 214, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 199, size: 32, elements: !785)
!785 = !{!786, !797}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !784, file: !744, line: 212, baseType: !787, size: 32)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !784, file: !744, line: 200, size: 32, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !787, file: !744, line: 201, baseType: !108, size: 4, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !787, file: !744, line: 203, baseType: !108, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !787, file: !744, line: 205, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !787, file: !744, line: 206, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !787, file: !744, line: 207, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !787, file: !744, line: 208, baseType: !108, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !787, file: !744, line: 209, baseType: !108, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !787, file: !744, line: 210, baseType: !108, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !784, file: !744, line: 213, baseType: !108, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !745, file: !744, line: 289, baseType: !799, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !744, line: 268, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 260, size: 32, elements: !802)
!802 = !{!803, !808}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !801, file: !744, line: 266, baseType: !804, size: 32)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !801, file: !744, line: 261, size: 32, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !804, file: !744, line: 262, baseType: !108, size: 4, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !804, file: !744, line: 264, baseType: !108, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !801, file: !744, line: 267, baseType: !108, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !811, line: 513, baseType: !812)
!811 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !811, line: 494, size: 480, elements: !813)
!813 = !{!814, !820, !830, !834, !844, !854, !864, !874, !878, !894, !910, !926, !956, !960, !970, !980, !990, !994}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !812, file: !811, line: 495, baseType: !815, size: 8)
!815 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !811, line: 45, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 43, size: 8, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !817, file: !811, line: 44, baseType: !166, size: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !812, file: !811, line: 496, baseType: !821, size: 8, offset: 8)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !811, line: 61, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 55, size: 8, elements: !824)
!824 = !{!825, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !823, file: !811, line: 59, baseType: !826, size: 8)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !811, line: 56, size: 8, elements: !827)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !826, file: !811, line: 57, baseType: !166, size: 2, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !823, file: !811, line: 60, baseType: !166, size: 8)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !812, file: !811, line: 497, baseType: !831, size: 48, offset: 16)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 48, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 6)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !812, file: !811, line: 498, baseType: !835, size: 8, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !811, line: 86, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 80, size: 8, elements: !838)
!838 = !{!839, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !837, file: !811, line: 84, baseType: !840, size: 8)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !837, file: !811, line: 81, size: 8, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !840, file: !811, line: 82, baseType: !166, size: 3, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !837, file: !811, line: 85, baseType: !166, size: 8)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !812, file: !811, line: 499, baseType: !845, size: 8, offset: 72)
!845 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !811, line: 121, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 115, size: 8, elements: !848)
!848 = !{!849, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !847, file: !811, line: 119, baseType: !850, size: 8)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !811, line: 116, size: 8, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !850, file: !811, line: 117, baseType: !166, size: 3, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !847, file: !811, line: 120, baseType: !166, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !812, file: !811, line: 500, baseType: !855, size: 8, offset: 80)
!855 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !811, line: 156, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 150, size: 8, elements: !858)
!858 = !{!859, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !857, file: !811, line: 154, baseType: !860, size: 8)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !857, file: !811, line: 151, size: 8, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !860, file: !811, line: 152, baseType: !166, size: 3, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !857, file: !811, line: 155, baseType: !166, size: 8)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !812, file: !811, line: 501, baseType: !865, size: 8, offset: 88)
!865 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !811, line: 191, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 185, size: 8, elements: !868)
!868 = !{!869, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !867, file: !811, line: 189, baseType: !870, size: 8)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !811, line: 186, size: 8, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !870, file: !811, line: 187, baseType: !166, size: 3, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !867, file: !811, line: 190, baseType: !166, size: 8)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !812, file: !811, line: 502, baseType: !875, size: 64, offset: 96)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 64, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 8)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !812, file: !811, line: 503, baseType: !879, size: 32, offset: 160)
!879 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !811, line: 232, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 220, size: 32, elements: !882)
!882 = !{!883, !893}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !881, file: !811, line: 230, baseType: !884, size: 32)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !881, file: !811, line: 221, size: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !884, file: !811, line: 222, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !884, file: !811, line: 223, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !884, file: !811, line: 224, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !884, file: !811, line: 225, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !884, file: !811, line: 226, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !884, file: !811, line: 227, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !884, file: !811, line: 228, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !881, file: !811, line: 231, baseType: !108, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !812, file: !811, line: 504, baseType: !895, size: 32, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !811, line: 268, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !811, line: 256, size: 32, elements: !898)
!898 = !{!899, !909}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !897, file: !811, line: 266, baseType: !900, size: 32)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !811, line: 257, size: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !900, file: !811, line: 258, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !900, file: !811, line: 259, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !900, file: !811, line: 260, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !900, file: !811, line: 261, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !900, file: !811, line: 262, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
