; ModuleID = 'build/adafruit_trinket_m0/drivers/uart/echo_bot/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.sam0_eic_data = type { [1 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }
%struct.SercomUsart = type { %union.PORT_DIR_Type, %union.PORT_DIR_Type, [4 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_PMUX_Type, [5 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_DIR_Type, [8 x i8], %union.SERCOM_USART_BAUD_Type, [6 x i8], %union.PORT_PMUX_Type }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/uart/echo_bot/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/uart/echo_bot")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/uart/echo_bot")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "uart_msgq", scope: !27, file: !209, line: 19, type: !223, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !206, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/uart/echo_bot")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !111, line: 336, size: 608, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !145, !149, !153, !167, !172, !178, !184, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !110, file: !111, line: 365, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DISubroutineType(types: !116)
!116 = !{!107, !117, !144}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = !{!122, !126, !127, !128, !137, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 380, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !119, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !119, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !119, file: !120, line: 386, baseType: !129, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !131)
!131 = !{!132, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !130, file: !120, line: 359, baseType: !133, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !130, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !119, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !120, line: 43, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !143)
!143 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !110, file: !111, line: 366, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !117, !134}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !110, file: !111, line: 374, baseType: !150, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DISubroutineType(types: !152)
!152 = !{!107, !117}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !110, file: !111, line: 377, baseType: !154, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{!107, !117, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !111, line: 122, size: 64, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !159, file: !111, line: 123, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !159, file: !111, line: 124, baseType: !133, size: 8, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !159, file: !111, line: 125, baseType: !133, size: 8, offset: 40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !159, file: !111, line: 126, baseType: !133, size: 8, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !159, file: !111, line: 127, baseType: !133, size: 8, offset: 56)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !110, file: !111, line: 379, baseType: !168, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!107, !117, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !110, file: !111, line: 384, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !117, !176, !107}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !110, file: !111, line: 393, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!107, !117, !182, !183}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !110, file: !111, line: 402, baseType: !185, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !117}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !110, file: !111, line: 405, baseType: !185, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !110, file: !111, line: 408, baseType: !150, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !110, file: !111, line: 411, baseType: !185, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !110, file: !111, line: 414, baseType: !185, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !110, file: !111, line: 417, baseType: !150, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !110, file: !111, line: 420, baseType: !150, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !110, file: !111, line: 423, baseType: !185, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !110, file: !111, line: 426, baseType: !185, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !110, file: !111, line: 429, baseType: !150, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !110, file: !111, line: 432, baseType: !150, size: 32, offset: 544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !110, file: !111, line: 435, baseType: !199, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !117, !202, !102}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !111, line: 142, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !117, !102}
!206 = !{!25, !207, !211, !216, !221}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "uart_dev", scope: !27, file: !209, line: 21, type: !210, isLocal: true, isDefinition: true)
!209 = !DIFile(filename: "zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "_k_fifo_buf_uart_msgq", scope: !27, file: !209, line: 19, type: !213, isLocal: true, isDefinition: true, align: 32)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2560, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 320)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "rx_buf", scope: !27, file: !209, line: 24, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 32)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "rx_buf_pos", scope: !27, file: !209, line: 25, type: !107, isLocal: true, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !224, line: 4204, size: 320, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !247, !251, !254, !255, !257, !258, !259, !260, !261}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !223, file: !224, line: 4206, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !229)
!228 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !229, file: !228, line: 232, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !235)
!235 = !{!236, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 38, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 38, size: 32, elements: !238)
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !237, file: !233, line: 39, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !233, line: 40, baseType: !240, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 42, baseType: !243, size: 32, offset: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 42, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !243, file: !233, line: 43, baseType: !240, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !233, line: 44, baseType: !240, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !223, file: !224, line: 4208, baseType: !248, offset: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !223, file: !224, line: 4210, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 214, baseType: !32)
!253 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !223, file: !224, line: 4212, baseType: !162, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !223, file: !224, line: 4214, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !223, file: !224, line: 4216, baseType: !256, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !223, file: !224, line: 4218, baseType: !256, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !223, file: !224, line: 4220, baseType: !256, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !223, file: !224, line: 4222, baseType: !162, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !224, line: 4227, baseType: !133, size: 8, offset: 288)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "_char_out", scope: !264, file: !268, line: 54, type: !269, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !266, globals: !267, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/uart/echo_bot")
!266 = !{!102, !107}
!267 = !{!262}
!268 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!107, !107}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !274, file: !1012, line: 202, type: !1013, isLocal: true, isDefinition: true, align: 32)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !276, globals: !1011, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/uart/echo_bot")
!276 = !{!102, !107, !277, !403, !742, !743, !810}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !279, line: 335, baseType: !280)
!279 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 320, size: 288, elements: !281)
!281 = !{!282, !295, !303, !317, !328, !339, !343, !354, !355, !366, !367, !382, !383, !393}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !280, file: !279, line: 321, baseType: !283, size: 16)
!283 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !279, line: 50, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 43, size: 16, elements: !286)
!286 = !{!287, !294}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !285, file: !279, line: 48, baseType: !288, size: 16)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !279, line: 44, size: 16, elements: !289)
!289 = !{!290, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !288, file: !279, line: 45, baseType: !291, size: 7, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !292)
!292 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !288, file: !279, line: 47, baseType: !291, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !285, file: !279, line: 49, baseType: !291, size: 16)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !280, file: !279, line: 322, baseType: !296, size: 16, offset: 16)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 16, elements: !301)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !298, line: 52, baseType: !299)
!298 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21e18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !280, file: !279, line: 323, baseType: !304, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !279, line: 107, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 94, size: 32, elements: !307)
!307 = !{!308, !316}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !306, file: !279, line: 105, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !279, line: 95, size: 32, elements: !310)
!310 = !{!311, !312, !313, !314, !315}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !309, file: !279, line: 97, baseType: !162, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !309, file: !279, line: 99, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !309, file: !279, line: 100, baseType: !162, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !309, file: !279, line: 102, baseType: !162, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !309, file: !279, line: 103, baseType: !162, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !306, file: !279, line: 106, baseType: !162, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !280, file: !279, line: 324, baseType: !318, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !279, line: 155, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 148, size: 32, elements: !321)
!321 = !{!322, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !320, file: !279, line: 153, baseType: !323, size: 32)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !279, line: 149, size: 32, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !323, file: !279, line: 150, baseType: !162, size: 16, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !323, file: !279, line: 151, baseType: !162, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !320, file: !279, line: 154, baseType: !162, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !280, file: !279, line: 325, baseType: !329, size: 8, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !279, line: 194, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 187, size: 8, elements: !332)
!332 = !{!333, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !331, file: !279, line: 192, baseType: !334, size: 8)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !331, file: !279, line: 188, size: 8, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !334, file: !279, line: 189, baseType: !133, size: 1, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !334, file: !279, line: 190, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !331, file: !279, line: 193, baseType: !133, size: 8)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !280, file: !279, line: 326, baseType: !340, size: 24, offset: 104)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 24, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 3)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !280, file: !279, line: 327, baseType: !344, size: 8, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !279, line: 215, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 208, size: 8, elements: !347)
!347 = !{!348, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !346, file: !279, line: 213, baseType: !349, size: 8)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !346, file: !279, line: 209, size: 8, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !349, file: !279, line: 210, baseType: !133, size: 1, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !349, file: !279, line: 211, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !346, file: !279, line: 214, baseType: !133, size: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !280, file: !279, line: 328, baseType: !340, size: 24, offset: 136)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !280, file: !279, line: 329, baseType: !356, size: 8, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !279, line: 236, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 229, size: 8, elements: !359)
!359 = !{!360, !365}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !358, file: !279, line: 234, baseType: !361, size: 8)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !279, line: 230, size: 8, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !361, file: !279, line: 231, baseType: !299, size: 1, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !361, file: !279, line: 232, baseType: !299, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !358, file: !279, line: 235, baseType: !133, size: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !280, file: !279, line: 330, baseType: !340, size: 24, offset: 168)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !280, file: !279, line: 331, baseType: !368, size: 16, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !279, line: 262, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 250, size: 16, elements: !371)
!371 = !{!372, !381}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !370, file: !279, line: 260, baseType: !373, size: 16)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !279, line: 251, size: 16, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !373, file: !279, line: 252, baseType: !291, size: 1, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !373, file: !279, line: 253, baseType: !291, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !373, file: !279, line: 254, baseType: !291, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !373, file: !279, line: 255, baseType: !291, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !373, file: !279, line: 256, baseType: !291, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !373, file: !279, line: 258, baseType: !291, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !370, file: !279, line: 261, baseType: !291, size: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !280, file: !279, line: 332, baseType: !296, size: 16, offset: 208)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !280, file: !279, line: 333, baseType: !384, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !279, line: 290, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 284, size: 32, elements: !387)
!387 = !{!388, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !386, file: !279, line: 288, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !279, line: 285, size: 32, elements: !390)
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !389, file: !279, line: 286, baseType: !162, size: 22, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !386, file: !279, line: 289, baseType: !162, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !280, file: !279, line: 334, baseType: !394, size: 16, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !279, line: 308, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 303, size: 16, elements: !397)
!397 = !{!398, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !396, file: !279, line: 306, baseType: !399, size: 16)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !396, file: !279, line: 304, size: 16, elements: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !399, file: !279, line: 305, baseType: !291, size: 16, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !396, file: !279, line: 307, baseType: !291, size: 16)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !405, line: 928, baseType: !406)
!405 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 899, size: 672, elements: !407)
!407 = !{!408, !432, !456, !482, !507, !523, !524, !542, !543, !560, !571, !572, !587, !607, !608, !620, !632, !642, !643, !660, !664, !675, !676, !688, !700, !701, !712, !728}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !406, file: !405, line: 900, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !405, line: 64, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 43, size: 32, elements: !412)
!412 = !{!413, !431}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !411, file: !405, line: 62, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !405, line: 44, size: 32, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !414, file: !405, line: 45, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !414, file: !405, line: 46, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !414, file: !405, line: 47, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !414, file: !405, line: 48, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !414, file: !405, line: 49, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !414, file: !405, line: 50, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !414, file: !405, line: 51, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !414, file: !405, line: 52, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !414, file: !405, line: 53, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !414, file: !405, line: 54, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !414, file: !405, line: 55, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !414, file: !405, line: 56, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !414, file: !405, line: 58, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !414, file: !405, line: 59, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !414, file: !405, line: 60, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !411, file: !405, line: 63, baseType: !162, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !406, file: !405, line: 901, baseType: !433, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !405, line: 125, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 104, size: 32, elements: !436)
!436 = !{!437, !455}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !435, file: !405, line: 123, baseType: !438, size: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !405, line: 105, size: 32, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !438, file: !405, line: 106, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !438, file: !405, line: 107, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !438, file: !405, line: 108, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !438, file: !405, line: 109, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !438, file: !405, line: 110, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !438, file: !405, line: 111, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !438, file: !405, line: 112, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !438, file: !405, line: 113, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !438, file: !405, line: 114, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !438, file: !405, line: 115, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !438, file: !405, line: 116, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !438, file: !405, line: 117, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !438, file: !405, line: 119, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !438, file: !405, line: 120, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !438, file: !405, line: 121, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !435, file: !405, line: 124, baseType: !162, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !406, file: !405, line: 902, baseType: !457, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !405, line: 186, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 165, size: 32, elements: !460)
!460 = !{!461, !481}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !459, file: !405, line: 184, baseType: !462, size: 32)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !405, line: 166, size: 32, elements: !463)
!463 = !{!464, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !462, file: !405, line: 167, baseType: !465, size: 1, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !462, file: !405, line: 168, baseType: !465, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !462, file: !405, line: 169, baseType: !465, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !462, file: !405, line: 170, baseType: !465, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !462, file: !405, line: 171, baseType: !465, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !462, file: !405, line: 172, baseType: !465, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !462, file: !405, line: 173, baseType: !465, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !462, file: !405, line: 174, baseType: !465, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !462, file: !405, line: 175, baseType: !465, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !462, file: !405, line: 176, baseType: !465, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !462, file: !405, line: 177, baseType: !465, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !462, file: !405, line: 178, baseType: !465, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !462, file: !405, line: 180, baseType: !465, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !462, file: !405, line: 181, baseType: !465, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !462, file: !405, line: 182, baseType: !465, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !459, file: !405, line: 185, baseType: !162, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !406, file: !405, line: 903, baseType: !483, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !405, line: 247, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 226, size: 32, elements: !487)
!487 = !{!488, !506}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !486, file: !405, line: 245, baseType: !489, size: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !486, file: !405, line: 227, size: 32, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !489, file: !405, line: 228, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !489, file: !405, line: 229, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !489, file: !405, line: 230, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !489, file: !405, line: 231, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !489, file: !405, line: 232, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !489, file: !405, line: 233, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !489, file: !405, line: 234, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !489, file: !405, line: 235, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !489, file: !405, line: 236, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !489, file: !405, line: 237, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !489, file: !405, line: 238, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !489, file: !405, line: 239, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !489, file: !405, line: 241, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !489, file: !405, line: 242, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !489, file: !405, line: 243, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !486, file: !405, line: 246, baseType: !162, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !406, file: !405, line: 904, baseType: !508, size: 16, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !405, line: 300, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 287, size: 16, elements: !511)
!511 = !{!512, !522}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !510, file: !405, line: 298, baseType: !513, size: 16)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !405, line: 288, size: 16, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !513, file: !405, line: 290, baseType: !291, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !513, file: !405, line: 291, baseType: !291, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !513, file: !405, line: 293, baseType: !291, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !513, file: !405, line: 294, baseType: !291, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !513, file: !405, line: 295, baseType: !291, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !513, file: !405, line: 296, baseType: !291, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !513, file: !405, line: 297, baseType: !291, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !510, file: !405, line: 299, baseType: !291, size: 16)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !406, file: !405, line: 905, baseType: !296, size: 16, offset: 144)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !406, file: !405, line: 906, baseType: !525, size: 16, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !405, line: 352, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 336, size: 16, elements: !528)
!528 = !{!529, !541}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !527, file: !405, line: 350, baseType: !530, size: 16)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !527, file: !405, line: 337, size: 16, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !530, file: !405, line: 339, baseType: !291, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !530, file: !405, line: 340, baseType: !291, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !530, file: !405, line: 341, baseType: !291, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !530, file: !405, line: 342, baseType: !291, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !530, file: !405, line: 343, baseType: !291, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !530, file: !405, line: 344, baseType: !291, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !530, file: !405, line: 345, baseType: !291, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !530, file: !405, line: 346, baseType: !291, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !530, file: !405, line: 348, baseType: !291, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !527, file: !405, line: 351, baseType: !291, size: 16)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !406, file: !405, line: 907, baseType: !296, size: 16, offset: 176)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !406, file: !405, line: 908, baseType: !544, size: 32, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !405, line: 398, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 381, size: 32, elements: !547)
!547 = !{!548, !559}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !546, file: !405, line: 396, baseType: !549, size: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !546, file: !405, line: 382, size: 32, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !549, file: !405, line: 384, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !549, file: !405, line: 385, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !549, file: !405, line: 386, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !549, file: !405, line: 388, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !549, file: !405, line: 389, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !549, file: !405, line: 390, baseType: !162, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !549, file: !405, line: 392, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !549, file: !405, line: 394, baseType: !162, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !546, file: !405, line: 397, baseType: !162, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !406, file: !405, line: 909, baseType: !561, size: 8, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !405, line: 433, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 426, size: 8, elements: !564)
!564 = !{!565, !570}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !563, file: !405, line: 431, baseType: !566, size: 8)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !563, file: !405, line: 427, size: 8, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !566, file: !405, line: 428, baseType: !133, size: 5, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !566, file: !405, line: 430, baseType: !133, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !563, file: !405, line: 432, baseType: !133, size: 8)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !406, file: !405, line: 910, baseType: !340, size: 24, offset: 232)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !406, file: !405, line: 911, baseType: !573, size: 32, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !405, line: 462, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 448, size: 32, elements: !576)
!576 = !{!577, !586}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !575, file: !405, line: 460, baseType: !578, size: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !575, file: !405, line: 449, size: 32, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !578, file: !405, line: 451, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !578, file: !405, line: 453, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !578, file: !405, line: 454, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !578, file: !405, line: 455, baseType: !162, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !578, file: !405, line: 457, baseType: !162, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !578, file: !405, line: 459, baseType: !162, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !575, file: !405, line: 461, baseType: !162, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !406, file: !405, line: 912, baseType: !588, size: 16, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !405, line: 520, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 503, size: 16, elements: !591)
!591 = !{!592, !606}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !590, file: !405, line: 518, baseType: !593, size: 16)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !590, file: !405, line: 504, size: 16, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !593, file: !405, line: 506, baseType: !291, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !593, file: !405, line: 507, baseType: !291, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !593, file: !405, line: 508, baseType: !291, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !593, file: !405, line: 509, baseType: !291, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !593, file: !405, line: 510, baseType: !291, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !593, file: !405, line: 511, baseType: !291, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !593, file: !405, line: 512, baseType: !291, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !593, file: !405, line: 513, baseType: !291, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !593, file: !405, line: 514, baseType: !291, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !593, file: !405, line: 515, baseType: !291, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !593, file: !405, line: 516, baseType: !291, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !590, file: !405, line: 519, baseType: !291, size: 16)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !406, file: !405, line: 913, baseType: !296, size: 16, offset: 304)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !406, file: !405, line: 914, baseType: !609, size: 32, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !405, line: 559, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 552, size: 32, elements: !612)
!612 = !{!613, !619}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !611, file: !405, line: 557, baseType: !614, size: 32)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !405, line: 553, size: 32, elements: !615)
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !614, file: !405, line: 554, baseType: !162, size: 10, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !614, file: !405, line: 555, baseType: !162, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !614, file: !405, line: 556, baseType: !162, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !611, file: !405, line: 558, baseType: !162, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !406, file: !405, line: 915, baseType: !621, size: 32, offset: 352)
!621 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !405, line: 585, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 578, size: 32, elements: !624)
!624 = !{!625, !631}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !623, file: !405, line: 583, baseType: !626, size: 32)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !623, file: !405, line: 579, size: 32, elements: !627)
!627 = !{!628, !629, !630}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !626, file: !405, line: 580, baseType: !162, size: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !626, file: !405, line: 581, baseType: !162, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !626, file: !405, line: 582, baseType: !162, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !623, file: !405, line: 584, baseType: !162, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !406, file: !405, line: 916, baseType: !633, size: 8, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !405, line: 610, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 604, size: 8, elements: !636)
!636 = !{!637, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !635, file: !405, line: 608, baseType: !638, size: 8)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !635, file: !405, line: 605, size: 8, elements: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !638, file: !405, line: 607, baseType: !133, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !635, file: !405, line: 609, baseType: !133, size: 8)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !406, file: !405, line: 917, baseType: !340, size: 24, offset: 392)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !406, file: !405, line: 918, baseType: !644, size: 32, offset: 416)
!644 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !405, line: 639, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 622, size: 32, elements: !647)
!647 = !{!648, !659}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !646, file: !405, line: 637, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !405, line: 623, size: 32, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !649, file: !405, line: 625, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !649, file: !405, line: 626, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !649, file: !405, line: 627, baseType: !162, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !649, file: !405, line: 629, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !649, file: !405, line: 631, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !649, file: !405, line: 632, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !649, file: !405, line: 634, baseType: !162, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !649, file: !405, line: 635, baseType: !162, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !646, file: !405, line: 638, baseType: !162, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !406, file: !405, line: 919, baseType: !661, size: 32, offset: 448)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 32, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 4)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !406, file: !405, line: 920, baseType: !665, size: 16, offset: 480)
!665 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !405, line: 715, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 706, size: 16, elements: !668)
!668 = !{!669, !674}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !667, file: !405, line: 713, baseType: !670, size: 16)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !667, file: !405, line: 707, size: 16, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !670, file: !405, line: 709, baseType: !291, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !670, file: !405, line: 711, baseType: !291, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !667, file: !405, line: 714, baseType: !291, size: 16)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !406, file: !405, line: 921, baseType: !296, size: 16, offset: 496)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !406, file: !405, line: 922, baseType: !677, size: 32, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !405, line: 739, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 729, size: 32, elements: !680)
!680 = !{!681, !687}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !679, file: !405, line: 737, baseType: !682, size: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !679, file: !405, line: 730, size: 32, elements: !683)
!683 = !{!684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !682, file: !405, line: 732, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !682, file: !405, line: 733, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !682, file: !405, line: 735, baseType: !162, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !679, file: !405, line: 738, baseType: !162, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !406, file: !405, line: 923, baseType: !689, size: 8, offset: 544)
!689 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !405, line: 765, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 756, size: 8, elements: !692)
!692 = !{!693, !699}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !691, file: !405, line: 763, baseType: !694, size: 8)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !405, line: 757, size: 8, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !694, file: !405, line: 759, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !694, file: !405, line: 761, baseType: !133, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !694, file: !405, line: 762, baseType: !133, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !691, file: !405, line: 764, baseType: !133, size: 8)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !406, file: !405, line: 924, baseType: !340, size: 24, offset: 552)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !406, file: !405, line: 925, baseType: !702, size: 32, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !405, line: 789, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 781, size: 32, elements: !705)
!705 = !{!706, !711}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !704, file: !405, line: 787, baseType: !707, size: 32)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !405, line: 782, size: 32, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !707, file: !405, line: 783, baseType: !162, size: 12, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !707, file: !405, line: 785, baseType: !162, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !704, file: !405, line: 788, baseType: !162, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !406, file: !405, line: 926, baseType: !713, size: 32, offset: 608)
!713 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !405, line: 820, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 805, size: 32, elements: !716)
!716 = !{!717, !727}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !715, file: !405, line: 818, baseType: !718, size: 32)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !715, file: !405, line: 806, size: 32, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !718, file: !405, line: 807, baseType: !162, size: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !718, file: !405, line: 808, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !718, file: !405, line: 809, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !718, file: !405, line: 810, baseType: !162, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !718, file: !405, line: 812, baseType: !162, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !718, file: !405, line: 814, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !718, file: !405, line: 816, baseType: !162, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !715, file: !405, line: 819, baseType: !162, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !406, file: !405, line: 927, baseType: !729, size: 8, offset: 640)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !405, line: 881, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 872, size: 8, elements: !733)
!733 = !{!734, !741}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !732, file: !405, line: 879, baseType: !735, size: 8)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !732, file: !405, line: 873, size: 8, elements: !736)
!736 = !{!737, !738, !739, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !735, file: !405, line: 874, baseType: !133, size: 1, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !735, file: !405, line: 875, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !735, file: !405, line: 876, baseType: !133, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !735, file: !405, line: 877, baseType: !133, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !732, file: !405, line: 880, baseType: !133, size: 8)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !745, line: 290, baseType: !746)
!745 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !745, line: 284, size: 96, elements: !747)
!747 = !{!748, !758, !769, !782, !799}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !746, file: !745, line: 285, baseType: !749, size: 8)
!749 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !745, line: 49, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !745, line: 43, size: 8, elements: !752)
!752 = !{!753, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !751, file: !745, line: 47, baseType: !754, size: 8)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !751, file: !745, line: 44, size: 8, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !754, file: !745, line: 45, baseType: !133, size: 1, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !751, file: !745, line: 48, baseType: !133, size: 8)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !746, file: !745, line: 286, baseType: !759, size: 8, offset: 8)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !745, line: 67, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !745, line: 61, size: 8, elements: !763)
!763 = !{!764, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !762, file: !745, line: 65, baseType: !765, size: 8)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !762, file: !745, line: 62, size: 8, elements: !766)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !765, file: !745, line: 64, baseType: !133, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !762, file: !745, line: 66, baseType: !133, size: 8)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !746, file: !745, line: 287, baseType: !770, size: 16, offset: 16)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !745, line: 89, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !745, line: 79, size: 16, elements: !773)
!773 = !{!774, !781}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !772, file: !745, line: 87, baseType: !775, size: 16)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !772, file: !745, line: 80, size: 16, elements: !776)
!776 = !{!777, !778, !779, !780}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !775, file: !745, line: 81, baseType: !291, size: 6, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !775, file: !745, line: 83, baseType: !291, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !775, file: !745, line: 85, baseType: !291, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !775, file: !745, line: 86, baseType: !291, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !772, file: !745, line: 88, baseType: !291, size: 16)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !746, file: !745, line: 288, baseType: !783, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !745, line: 214, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !745, line: 199, size: 32, elements: !786)
!786 = !{!787, !798}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !785, file: !745, line: 212, baseType: !788, size: 32)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !785, file: !745, line: 200, size: 32, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !788, file: !745, line: 201, baseType: !162, size: 4, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !788, file: !745, line: 203, baseType: !162, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !788, file: !745, line: 205, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !788, file: !745, line: 206, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !788, file: !745, line: 207, baseType: !162, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !788, file: !745, line: 208, baseType: !162, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !788, file: !745, line: 209, baseType: !162, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !788, file: !745, line: 210, baseType: !162, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !785, file: !745, line: 213, baseType: !162, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !746, file: !745, line: 289, baseType: !800, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !745, line: 268, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !745, line: 260, size: 32, elements: !803)
!803 = !{!804, !809}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !802, file: !745, line: 266, baseType: !805, size: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !802, file: !745, line: 261, size: 32, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !805, file: !745, line: 262, baseType: !162, size: 4, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !805, file: !745, line: 264, baseType: !162, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !802, file: !745, line: 267, baseType: !162, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !812, line: 513, baseType: !813)
!812 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !812, line: 494, size: 480, elements: !814)
!814 = !{!815, !821, !831, !835, !845, !855, !865, !875, !879, !895, !911, !927, !957, !961, !971, !981, !991, !995}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !813, file: !812, line: 495, baseType: !816, size: 8)
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !812, line: 45, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 43, size: 8, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !818, file: !812, line: 44, baseType: !133, size: 8)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !813, file: !812, line: 496, baseType: !822, size: 8, offset: 8)
!822 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !812, line: 61, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 55, size: 8, elements: !825)
!825 = !{!826, !830}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !824, file: !812, line: 59, baseType: !827, size: 8)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !824, file: !812, line: 56, size: 8, elements: !828)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !827, file: !812, line: 57, baseType: !133, size: 2, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !824, file: !812, line: 60, baseType: !133, size: 8)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !813, file: !812, line: 497, baseType: !832, size: 48, offset: 16)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 48, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 6)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !813, file: !812, line: 498, baseType: !836, size: 8, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !812, line: 86, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 80, size: 8, elements: !839)
!839 = !{!840, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !838, file: !812, line: 84, baseType: !841, size: 8)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !838, file: !812, line: 81, size: 8, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !841, file: !812, line: 82, baseType: !133, size: 3, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !838, file: !812, line: 85, baseType: !133, size: 8)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !813, file: !812, line: 499, baseType: !846, size: 8, offset: 72)
!846 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !812, line: 121, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 115, size: 8, elements: !849)
!849 = !{!850, !854}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !848, file: !812, line: 119, baseType: !851, size: 8)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !848, file: !812, line: 116, size: 8, elements: !852)
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !851, file: !812, line: 117, baseType: !133, size: 3, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !848, file: !812, line: 120, baseType: !133, size: 8)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !813, file: !812, line: 500, baseType: !856, size: 8, offset: 80)
!856 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !812, line: 156, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 150, size: 8, elements: !859)
!859 = !{!860, !864}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !858, file: !812, line: 154, baseType: !861, size: 8)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !858, file: !812, line: 151, size: 8, elements: !862)
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !861, file: !812, line: 152, baseType: !133, size: 3, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !858, file: !812, line: 155, baseType: !133, size: 8)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !813, file: !812, line: 501, baseType: !866, size: 8, offset: 88)
!866 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !812, line: 191, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 185, size: 8, elements: !869)
!869 = !{!870, !874}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !868, file: !812, line: 189, baseType: !871, size: 8)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !868, file: !812, line: 186, size: 8, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !871, file: !812, line: 187, baseType: !133, size: 3, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !868, file: !812, line: 190, baseType: !133, size: 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !813, file: !812, line: 502, baseType: !876, size: 64, offset: 96)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 64, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 8)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !813, file: !812, line: 503, baseType: !880, size: 32, offset: 160)
!880 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !812, line: 232, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 220, size: 32, elements: !883)
!883 = !{!884, !894}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !882, file: !812, line: 230, baseType: !885, size: 32)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !882, file: !812, line: 221, size: 32, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !885, file: !812, line: 222, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !885, file: !812, line: 223, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !885, file: !812, line: 224, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !885, file: !812, line: 225, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !885, file: !812, line: 226, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !885, file: !812, line: 227, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !885, file: !812, line: 228, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !882, file: !812, line: 231, baseType: !162, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !813, file: !812, line: 504, baseType: !896, size: 32, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !812, line: 268, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 256, size: 32, elements: !899)
!899 = !{!900, !910}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !898, file: !812, line: 266, baseType: !901, size: 32)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !898, file: !812, line: 257, size: 32, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !909}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !901, file: !812, line: 258, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !901, file: !812, line: 259, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !901, file: !812, line: 260, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !901, file: !812, line: 261, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !901, file: !812, line: 262, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !901, file: !812, line: 263, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !901, file: !812, line: 264, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !898, file: !812, line: 267, baseType: !162, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !813, file: !812, line: 505, baseType: !912, size: 32, offset: 224)
!912 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !812, line: 304, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !812, line: 292, size: 32, elements: !915)
!915 = !{!916, !926}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !914, file: !812, line: 302, baseType: !917, size: 32)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !914, file: !812, line: 293, size: 32, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925}
