; ModuleID = 'build/adafruit_trinket_m0/kernel/condition_variables/simple/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/kernel/condition_variables/simple/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/kernel/condition_variables/simple")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/kernel/condition_variables/simple")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "mutex", scope: !27, file: !116, line: 18, type: !256, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/kernel/condition_variables/simple")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !152, !254}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "condvar", scope: !27, file: !116, line: 19, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 14, type: !143, isLocal: false, isDefinition: true, align: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 163840, elements: !149)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !145, line: 47, size: 8, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !145, line: 48, baseType: !148, size: 8)
!148 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = !{!150, !151}
!150 = !DISubrange(count: 20)
!151 = !DISubrange(count: 1024)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 16, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 23040, elements: !253)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1152, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !207, !220, !221, !222, !226, !227, !248}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 384)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 384, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !107, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !197, size: 192, offset: 192)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !198)
!198 = !{!199, !200, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !197, file: !122, line: 245, baseType: !165, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !197, file: !122, line: 246, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !197, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !208, size: 288, offset: 384)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !208, file: !209, line: 26, baseType: !110, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !208, file: !209, line: 27, baseType: !110, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !208, file: !209, line: 28, baseType: !110, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !208, file: !209, line: 29, baseType: !110, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !208, file: !209, line: 30, baseType: !110, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !208, file: !209, line: 31, baseType: !110, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !208, file: !209, line: 32, baseType: !110, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !208, file: !209, line: 33, baseType: !110, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !208, file: !209, line: 34, baseType: !110, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !107, size: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !223, size: 256, offset: 768)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 256, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !228, size: 32, offset: 1056)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !230)
!230 = !{!231, !242, !243}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !229, file: !118, line: 5074, baseType: !232, size: 96)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !233, line: 56, size: 96, elements: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !{!235, !238, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !232, file: !233, line: 57, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !233, line: 57, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !232, file: !233, line: 58, baseType: !107, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !232, file: !233, line: 59, baseType: !240, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !241, line: 214, baseType: !32)
!241 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !229, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !229, file: !118, line: 5076, baseType: !244, size: 32, offset: 160)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, size: 32, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !244, file: !245, line: 52, baseType: !22, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !249, size: 64, offset: 1088)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !249, file: !209, line: 63, baseType: !110, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !249, file: !209, line: 66, baseType: !110, size: 32, offset: 32)
!253 = !{!150}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "done", scope: !27, file: !116, line: 21, type: !109, isLocal: true, isDefinition: true)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !257)
!257 = !{!258, !259, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !256, file: !118, line: 2722, baseType: !121, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !256, file: !118, line: 2724, baseType: !260, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !256, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !256, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !265, file: !282, line: 18, type: !283, isLocal: false, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !267, globals: !281, splitDebugInlining: false, nameTableKind: None)
!266 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/kernel/condition_variables/simple")
!267 = !{!22, !107, !24, !268, !270, !272, !240, !109, !275, !276, !277, !278, !279, !280, !192, !273}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!281 = !{!263}
!282 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !286)
!285 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !285, line: 17, baseType: !273, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !284, file: !285, line: 18, baseType: !178, size: 8, offset: 32)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_char_out", scope: !291, file: !295, line: 54, type: !296, isLocal: false, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !293, globals: !294, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/kernel/condition_variables/simple")
!293 = !{!107, !109}
!294 = !{!289}
!295 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{!109, !109}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !301, file: !1035, line: 202, type: !1036, isLocal: true, isDefinition: true, align: 32)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !303, globals: !1034, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/kernel/condition_variables/simple")
!303 = !{!107, !109, !304, !426, !765, !766, !833}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !306, line: 335, baseType: !307)
!306 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 320, size: 288, elements: !308)
!308 = !{!309, !320, !326, !340, !351, !362, !366, !377, !378, !389, !390, !405, !406, !416}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !307, file: !306, line: 321, baseType: !310, size: 16)
!310 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !306, line: 50, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 43, size: 16, elements: !313)
!313 = !{!314, !319}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !312, file: !306, line: 48, baseType: !315, size: 16)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !306, line: 44, size: 16, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !315, file: !306, line: 45, baseType: !192, size: 7, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !315, file: !306, line: 47, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !312, file: !306, line: 49, baseType: !192, size: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !307, file: !306, line: 322, baseType: !321, size: 16, offset: 16)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 16, elements: !173)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !323, line: 52, baseType: !324)
!323 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21e18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !178)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !307, file: !306, line: 323, baseType: !327, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !306, line: 107, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 94, size: 32, elements: !330)
!330 = !{!331, !339}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !329, file: !306, line: 105, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !306, line: 95, size: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !332, file: !306, line: 97, baseType: !110, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !332, file: !306, line: 99, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !332, file: !306, line: 100, baseType: !110, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !332, file: !306, line: 102, baseType: !110, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !332, file: !306, line: 103, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !329, file: !306, line: 106, baseType: !110, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !307, file: !306, line: 324, baseType: !341, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !306, line: 155, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 148, size: 32, elements: !344)
!344 = !{!345, !350}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !343, file: !306, line: 153, baseType: !346, size: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !306, line: 149, size: 32, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !346, file: !306, line: 150, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !346, file: !306, line: 151, baseType: !110, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !343, file: !306, line: 154, baseType: !110, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !307, file: !306, line: 325, baseType: !352, size: 8, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !306, line: 194, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 187, size: 8, elements: !355)
!355 = !{!356, !361}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !354, file: !306, line: 192, baseType: !357, size: 8)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !354, file: !306, line: 188, size: 8, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !357, file: !306, line: 189, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !357, file: !306, line: 190, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !354, file: !306, line: 193, baseType: !178, size: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !307, file: !306, line: 326, baseType: !363, size: 24, offset: 104)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 24, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 3)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !307, file: !306, line: 327, baseType: !367, size: 8, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !306, line: 215, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 208, size: 8, elements: !370)
!370 = !{!371, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !369, file: !306, line: 213, baseType: !372, size: 8)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !306, line: 209, size: 8, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !372, file: !306, line: 210, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !372, file: !306, line: 211, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !369, file: !306, line: 214, baseType: !178, size: 8)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !307, file: !306, line: 328, baseType: !363, size: 24, offset: 136)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !307, file: !306, line: 329, baseType: !379, size: 8, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !306, line: 236, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 229, size: 8, elements: !382)
!382 = !{!383, !388}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !381, file: !306, line: 234, baseType: !384, size: 8)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !381, file: !306, line: 230, size: 8, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !384, file: !306, line: 231, baseType: !324, size: 1, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !384, file: !306, line: 232, baseType: !324, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !381, file: !306, line: 235, baseType: !178, size: 8)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !307, file: !306, line: 330, baseType: !363, size: 24, offset: 168)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !307, file: !306, line: 331, baseType: !391, size: 16, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !306, line: 262, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 250, size: 16, elements: !394)
!394 = !{!395, !404}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !393, file: !306, line: 260, baseType: !396, size: 16)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !306, line: 251, size: 16, elements: !397)
!397 = !{!398, !399, !400, !401, !402, !403}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !396, file: !306, line: 252, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !396, file: !306, line: 253, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !396, file: !306, line: 254, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !396, file: !306, line: 255, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !396, file: !306, line: 256, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !396, file: !306, line: 258, baseType: !192, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !393, file: !306, line: 261, baseType: !192, size: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !307, file: !306, line: 332, baseType: !321, size: 16, offset: 208)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !307, file: !306, line: 333, baseType: !407, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !306, line: 290, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 284, size: 32, elements: !410)
!410 = !{!411, !415}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !409, file: !306, line: 288, baseType: !412, size: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !306, line: 285, size: 32, elements: !413)
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !412, file: !306, line: 286, baseType: !110, size: 22, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !409, file: !306, line: 289, baseType: !110, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !307, file: !306, line: 334, baseType: !417, size: 16, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !306, line: 308, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 303, size: 16, elements: !420)
!420 = !{!421, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !419, file: !306, line: 306, baseType: !422, size: 16)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !419, file: !306, line: 304, size: 16, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !422, file: !306, line: 305, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !419, file: !306, line: 307, baseType: !192, size: 16)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !428, line: 928, baseType: !429)
!428 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 899, size: 672, elements: !430)
!430 = !{!431, !455, !479, !505, !530, !546, !547, !565, !566, !583, !594, !595, !610, !630, !631, !643, !655, !665, !666, !683, !687, !698, !699, !711, !723, !724, !735, !751}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !429, file: !428, line: 900, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !428, line: 64, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 43, size: 32, elements: !435)
!435 = !{!436, !454}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !434, file: !428, line: 62, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !434, file: !428, line: 44, size: 32, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !437, file: !428, line: 45, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !437, file: !428, line: 46, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !437, file: !428, line: 47, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !437, file: !428, line: 48, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !437, file: !428, line: 49, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !437, file: !428, line: 50, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !437, file: !428, line: 51, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !437, file: !428, line: 52, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !437, file: !428, line: 53, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !437, file: !428, line: 54, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !437, file: !428, line: 55, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !437, file: !428, line: 56, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !437, file: !428, line: 58, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !437, file: !428, line: 59, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !437, file: !428, line: 60, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !434, file: !428, line: 63, baseType: !110, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !429, file: !428, line: 901, baseType: !456, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !428, line: 125, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 104, size: 32, elements: !459)
!459 = !{!460, !478}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !458, file: !428, line: 123, baseType: !461, size: 32)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !428, line: 105, size: 32, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !461, file: !428, line: 106, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !461, file: !428, line: 107, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !461, file: !428, line: 108, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !461, file: !428, line: 109, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !461, file: !428, line: 110, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !461, file: !428, line: 111, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !461, file: !428, line: 112, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !461, file: !428, line: 113, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !461, file: !428, line: 114, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !461, file: !428, line: 115, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !461, file: !428, line: 116, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !461, file: !428, line: 117, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !461, file: !428, line: 119, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !461, file: !428, line: 120, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !461, file: !428, line: 121, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !458, file: !428, line: 124, baseType: !110, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !429, file: !428, line: 902, baseType: !480, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !428, line: 186, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 165, size: 32, elements: !483)
!483 = !{!484, !504}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !482, file: !428, line: 184, baseType: !485, size: 32)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !428, line: 166, size: 32, elements: !486)
!486 = !{!487, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !485, file: !428, line: 167, baseType: !488, size: 1, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !485, file: !428, line: 168, baseType: !488, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !485, file: !428, line: 169, baseType: !488, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !485, file: !428, line: 170, baseType: !488, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !485, file: !428, line: 171, baseType: !488, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !485, file: !428, line: 172, baseType: !488, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !485, file: !428, line: 173, baseType: !488, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !485, file: !428, line: 174, baseType: !488, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !485, file: !428, line: 175, baseType: !488, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !485, file: !428, line: 176, baseType: !488, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !485, file: !428, line: 177, baseType: !488, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !485, file: !428, line: 178, baseType: !488, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !485, file: !428, line: 180, baseType: !488, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !485, file: !428, line: 181, baseType: !488, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !485, file: !428, line: 182, baseType: !488, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !482, file: !428, line: 185, baseType: !110, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !429, file: !428, line: 903, baseType: !506, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !428, line: 247, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 226, size: 32, elements: !510)
!510 = !{!511, !529}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !509, file: !428, line: 245, baseType: !512, size: 32)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !428, line: 227, size: 32, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !512, file: !428, line: 228, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !512, file: !428, line: 229, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !512, file: !428, line: 230, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !512, file: !428, line: 231, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !512, file: !428, line: 232, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !512, file: !428, line: 233, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !512, file: !428, line: 234, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !512, file: !428, line: 235, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !512, file: !428, line: 236, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !512, file: !428, line: 237, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !512, file: !428, line: 238, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !512, file: !428, line: 239, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !512, file: !428, line: 241, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !512, file: !428, line: 242, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !512, file: !428, line: 243, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !509, file: !428, line: 246, baseType: !110, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !429, file: !428, line: 904, baseType: !531, size: 16, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !428, line: 300, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 287, size: 16, elements: !534)
!534 = !{!535, !545}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !533, file: !428, line: 298, baseType: !536, size: 16)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !533, file: !428, line: 288, size: 16, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !536, file: !428, line: 290, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !536, file: !428, line: 291, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !536, file: !428, line: 293, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !536, file: !428, line: 294, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !536, file: !428, line: 295, baseType: !192, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !536, file: !428, line: 296, baseType: !192, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !536, file: !428, line: 297, baseType: !192, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !533, file: !428, line: 299, baseType: !192, size: 16)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !429, file: !428, line: 905, baseType: !321, size: 16, offset: 144)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !429, file: !428, line: 906, baseType: !548, size: 16, offset: 160)
!548 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !428, line: 352, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 336, size: 16, elements: !551)
!551 = !{!552, !564}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !550, file: !428, line: 350, baseType: !553, size: 16)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !550, file: !428, line: 337, size: 16, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !553, file: !428, line: 339, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !553, file: !428, line: 340, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !553, file: !428, line: 341, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !553, file: !428, line: 342, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !553, file: !428, line: 343, baseType: !192, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !553, file: !428, line: 344, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !553, file: !428, line: 345, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !553, file: !428, line: 346, baseType: !192, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !553, file: !428, line: 348, baseType: !192, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !550, file: !428, line: 351, baseType: !192, size: 16)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !429, file: !428, line: 907, baseType: !321, size: 16, offset: 176)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !429, file: !428, line: 908, baseType: !567, size: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !428, line: 398, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 381, size: 32, elements: !570)
!570 = !{!571, !582}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !569, file: !428, line: 396, baseType: !572, size: 32)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !428, line: 382, size: 32, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !572, file: !428, line: 384, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !572, file: !428, line: 385, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !572, file: !428, line: 386, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !572, file: !428, line: 388, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !572, file: !428, line: 389, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !572, file: !428, line: 390, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !572, file: !428, line: 392, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !572, file: !428, line: 394, baseType: !110, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !569, file: !428, line: 397, baseType: !110, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !429, file: !428, line: 909, baseType: !584, size: 8, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !428, line: 433, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 426, size: 8, elements: !587)
!587 = !{!588, !593}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !586, file: !428, line: 431, baseType: !589, size: 8)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !586, file: !428, line: 427, size: 8, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !589, file: !428, line: 428, baseType: !178, size: 5, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !589, file: !428, line: 430, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !586, file: !428, line: 432, baseType: !178, size: 8)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !429, file: !428, line: 910, baseType: !363, size: 24, offset: 232)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !429, file: !428, line: 911, baseType: !596, size: 32, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !428, line: 462, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 448, size: 32, elements: !599)
!599 = !{!600, !609}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !598, file: !428, line: 460, baseType: !601, size: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !598, file: !428, line: 449, size: 32, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !601, file: !428, line: 451, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !601, file: !428, line: 453, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !601, file: !428, line: 454, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !601, file: !428, line: 455, baseType: !110, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !601, file: !428, line: 457, baseType: !110, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !601, file: !428, line: 459, baseType: !110, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !598, file: !428, line: 461, baseType: !110, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !429, file: !428, line: 912, baseType: !611, size: 16, offset: 288)
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !428, line: 520, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 503, size: 16, elements: !614)
!614 = !{!615, !629}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !613, file: !428, line: 518, baseType: !616, size: 16)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !613, file: !428, line: 504, size: 16, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !616, file: !428, line: 506, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !616, file: !428, line: 507, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !616, file: !428, line: 508, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !616, file: !428, line: 509, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !616, file: !428, line: 510, baseType: !192, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !616, file: !428, line: 511, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !616, file: !428, line: 512, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !616, file: !428, line: 513, baseType: !192, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !616, file: !428, line: 514, baseType: !192, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !616, file: !428, line: 515, baseType: !192, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !616, file: !428, line: 516, baseType: !192, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !613, file: !428, line: 519, baseType: !192, size: 16)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !429, file: !428, line: 913, baseType: !321, size: 16, offset: 304)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !429, file: !428, line: 914, baseType: !632, size: 32, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !428, line: 559, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 552, size: 32, elements: !635)
!635 = !{!636, !642}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !634, file: !428, line: 557, baseType: !637, size: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !428, line: 553, size: 32, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !637, file: !428, line: 554, baseType: !110, size: 10, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !637, file: !428, line: 555, baseType: !110, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !637, file: !428, line: 556, baseType: !110, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !634, file: !428, line: 558, baseType: !110, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !429, file: !428, line: 915, baseType: !644, size: 32, offset: 352)
!644 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !428, line: 585, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 578, size: 32, elements: !647)
!647 = !{!648, !654}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !646, file: !428, line: 583, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !428, line: 579, size: 32, elements: !650)
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !649, file: !428, line: 580, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !649, file: !428, line: 581, baseType: !110, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !649, file: !428, line: 582, baseType: !110, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !646, file: !428, line: 584, baseType: !110, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !429, file: !428, line: 916, baseType: !656, size: 8, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !428, line: 610, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 604, size: 8, elements: !659)
!659 = !{!660, !664}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !658, file: !428, line: 608, baseType: !661, size: 8)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !428, line: 605, size: 8, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !661, file: !428, line: 607, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !658, file: !428, line: 609, baseType: !178, size: 8)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !429, file: !428, line: 917, baseType: !363, size: 24, offset: 392)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !429, file: !428, line: 918, baseType: !667, size: 32, offset: 416)
!667 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !428, line: 639, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 622, size: 32, elements: !670)
!670 = !{!671, !682}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !669, file: !428, line: 637, baseType: !672, size: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !669, file: !428, line: 623, size: 32, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !672, file: !428, line: 625, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !672, file: !428, line: 626, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !672, file: !428, line: 627, baseType: !110, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !672, file: !428, line: 629, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !672, file: !428, line: 631, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !672, file: !428, line: 632, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !672, file: !428, line: 634, baseType: !110, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !672, file: !428, line: 635, baseType: !110, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !669, file: !428, line: 638, baseType: !110, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !429, file: !428, line: 919, baseType: !684, size: 32, offset: 448)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 32, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 4)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !429, file: !428, line: 920, baseType: !688, size: 16, offset: 480)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !428, line: 715, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 706, size: 16, elements: !691)
!691 = !{!692, !697}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !690, file: !428, line: 713, baseType: !693, size: 16)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !690, file: !428, line: 707, size: 16, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !693, file: !428, line: 709, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !693, file: !428, line: 711, baseType: !192, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !690, file: !428, line: 714, baseType: !192, size: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !429, file: !428, line: 921, baseType: !321, size: 16, offset: 496)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !429, file: !428, line: 922, baseType: !700, size: 32, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !428, line: 739, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 729, size: 32, elements: !703)
!703 = !{!704, !710}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !702, file: !428, line: 737, baseType: !705, size: 32)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !702, file: !428, line: 730, size: 32, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !705, file: !428, line: 732, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !705, file: !428, line: 733, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !705, file: !428, line: 735, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !702, file: !428, line: 738, baseType: !110, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !429, file: !428, line: 923, baseType: !712, size: 8, offset: 544)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !428, line: 765, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 756, size: 8, elements: !715)
!715 = !{!716, !722}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !428, line: 763, baseType: !717, size: 8)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !428, line: 757, size: 8, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !717, file: !428, line: 759, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !717, file: !428, line: 761, baseType: !178, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !717, file: !428, line: 762, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !428, line: 764, baseType: !178, size: 8)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !429, file: !428, line: 924, baseType: !363, size: 24, offset: 552)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !429, file: !428, line: 925, baseType: !725, size: 32, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !428, line: 789, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 781, size: 32, elements: !728)
!728 = !{!729, !734}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !727, file: !428, line: 787, baseType: !730, size: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !428, line: 782, size: 32, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !730, file: !428, line: 783, baseType: !110, size: 12, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !730, file: !428, line: 785, baseType: !110, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !727, file: !428, line: 788, baseType: !110, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !429, file: !428, line: 926, baseType: !736, size: 32, offset: 608)
!736 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !428, line: 820, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 805, size: 32, elements: !739)
!739 = !{!740, !750}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !738, file: !428, line: 818, baseType: !741, size: 32)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !738, file: !428, line: 806, size: 32, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !741, file: !428, line: 807, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !741, file: !428, line: 808, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !741, file: !428, line: 809, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !741, file: !428, line: 810, baseType: !110, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !741, file: !428, line: 812, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !741, file: !428, line: 814, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !741, file: !428, line: 816, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !738, file: !428, line: 819, baseType: !110, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !429, file: !428, line: 927, baseType: !752, size: 8, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !428, line: 881, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !428, line: 872, size: 8, elements: !756)
!756 = !{!757, !764}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !755, file: !428, line: 879, baseType: !758, size: 8)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !755, file: !428, line: 873, size: 8, elements: !759)
!759 = !{!760, !761, !762, !763}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !758, file: !428, line: 874, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !758, file: !428, line: 875, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !758, file: !428, line: 876, baseType: !178, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !758, file: !428, line: 877, baseType: !178, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !755, file: !428, line: 880, baseType: !178, size: 8)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !768, line: 290, baseType: !769)
!768 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !768, line: 284, size: 96, elements: !770)
!770 = !{!771, !781, !792, !805, !822}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !769, file: !768, line: 285, baseType: !772, size: 8)
!772 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !768, line: 49, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !768, line: 43, size: 8, elements: !775)
!775 = !{!776, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !774, file: !768, line: 47, baseType: !777, size: 8)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !774, file: !768, line: 44, size: 8, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !777, file: !768, line: 45, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !774, file: !768, line: 48, baseType: !178, size: 8)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !769, file: !768, line: 286, baseType: !782, size: 8, offset: 8)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !768, line: 67, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !768, line: 61, size: 8, elements: !786)
!786 = !{!787, !791}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !785, file: !768, line: 65, baseType: !788, size: 8)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !785, file: !768, line: 62, size: 8, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !788, file: !768, line: 64, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !785, file: !768, line: 66, baseType: !178, size: 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !769, file: !768, line: 287, baseType: !793, size: 16, offset: 16)
!793 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !768, line: 89, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !768, line: 79, size: 16, elements: !796)
!796 = !{!797, !804}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !795, file: !768, line: 87, baseType: !798, size: 16)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !795, file: !768, line: 80, size: 16, elements: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !798, file: !768, line: 81, baseType: !192, size: 6, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !798, file: !768, line: 83, baseType: !192, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !798, file: !768, line: 85, baseType: !192, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !798, file: !768, line: 86, baseType: !192, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !795, file: !768, line: 88, baseType: !192, size: 16)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !769, file: !768, line: 288, baseType: !806, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !768, line: 214, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !768, line: 199, size: 32, elements: !809)
!809 = !{!810, !821}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !808, file: !768, line: 212, baseType: !811, size: 32)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !808, file: !768, line: 200, size: 32, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !811, file: !768, line: 201, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !811, file: !768, line: 203, baseType: !110, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !811, file: !768, line: 205, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !811, file: !768, line: 206, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !811, file: !768, line: 207, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !811, file: !768, line: 208, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !811, file: !768, line: 209, baseType: !110, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !811, file: !768, line: 210, baseType: !110, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !808, file: !768, line: 213, baseType: !110, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !769, file: !768, line: 289, baseType: !823, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !768, line: 268, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !768, line: 260, size: 32, elements: !826)
!826 = !{!827, !832}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !825, file: !768, line: 266, baseType: !828, size: 32)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !825, file: !768, line: 261, size: 32, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !828, file: !768, line: 262, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !828, file: !768, line: 264, baseType: !110, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !825, file: !768, line: 267, baseType: !110, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !835, line: 513, baseType: !836)
!835 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !835, line: 494, size: 480, elements: !837)
!837 = !{!838, !844, !854, !858, !868, !878, !888, !898, !902, !918, !934, !950, !980, !984, !994, !1004, !1014, !1018}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !836, file: !835, line: 495, baseType: !839, size: 8)
!839 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !835, line: 45, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !835, line: 43, size: 8, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !841, file: !835, line: 44, baseType: !178, size: 8)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !836, file: !835, line: 496, baseType: !845, size: 8, offset: 8)
!845 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !835, line: 61, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !835, line: 55, size: 8, elements: !848)
!848 = !{!849, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !847, file: !835, line: 59, baseType: !850, size: 8)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !835, line: 56, size: 8, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !850, file: !835, line: 57, baseType: !178, size: 2, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !847, file: !835, line: 60, baseType: !178, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !836, file: !835, line: 497, baseType: !855, size: 48, offset: 16)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 48, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 6)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !836, file: !835, line: 498, baseType: !859, size: 8, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !835, line: 86, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !835, line: 80, size: 8, elements: !862)
!862 = !{!863, !867}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !861, file: !835, line: 84, baseType: !864, size: 8)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !861, file: !835, line: 81, size: 8, elements: !865)
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !864, file: !835, line: 82, baseType: !178, size: 3, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !861, file: !835, line: 85, baseType: !178, size: 8)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !836, file: !835, line: 499, baseType: !869, size: 8, offset: 72)
!869 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !835, line: 121, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !835, line: 115, size: 8, elements: !872)
!872 = !{!873, !877}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !871, file: !835, line: 119, baseType: !874, size: 8)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !835, line: 116, size: 8, elements: !875)
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !874, file: !835, line: 117, baseType: !178, size: 3, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !871, file: !835, line: 120, baseType: !178, size: 8)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !836, file: !835, line: 500, baseType: !879, size: 8, offset: 80)
!879 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !835, line: 156, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !835, line: 150, size: 8, elements: !882)
!882 = !{!883, !887}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !881, file: !835, line: 154, baseType: !884, size: 8)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !881, file: !835, line: 151, size: 8, elements: !885)
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !884, file: !835, line: 152, baseType: !178, size: 3, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !881, file: !835, line: 155, baseType: !178, size: 8)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !836, file: !835, line: 501, baseType: !889, size: 8, offset: 88)
!889 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !835, line: 191, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !835, line: 185, size: 8, elements: !892)
!892 = !{!893, !897}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !891, file: !835, line: 189, baseType: !894, size: 8)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !891, file: !835, line: 186, size: 8, elements: !895)
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !894, file: !835, line: 187, baseType: !178, size: 3, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !891, file: !835, line: 190, baseType: !178, size: 8)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !836, file: !835, line: 502, baseType: !899, size: 64, offset: 96)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 64, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 8)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !836, file: !835, line: 503, baseType: !903, size: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !835, line: 232, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !835, line: 220, size: 32, elements: !906)
!906 = !{!907, !917}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !905, file: !835, line: 230, baseType: !908, size: 32)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !905, file: !835, line: 221, size: 32, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !908, file: !835, line: 222, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !908, file: !835, line: 223, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !908, file: !835, line: 224, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
