; ModuleID = 'build/96b_carbon/out_of_tree_driver/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.15 }
%union.anon.15 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.15 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.15, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 97, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5440, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 85)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2720, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dev", scope: !27, file: !106, line: 11, type: !107, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_HELLO_WORLD", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_LAST", value: 67)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !{!25}
!106 = !DIFile(filename: "zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !116, !117, !118, !127, !128}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 380, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !109, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !109, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !110, line: 386, baseType: !119, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !121)
!121 = !{!122, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !120, file: !110, line: 359, baseType: !123, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !124)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !120, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !109, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !110, line: 43, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !133)
!133 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "_char_out", scope: !136, file: !139, line: 54, type: !140, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !138, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!138 = !{!134}
!139 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{!104, !104}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !145, file: !163, line: 56, type: !164, isLocal: true, isDefinition: true, align: 32)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !147, globals: !162, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !150, line: 258, baseType: !151)
!150 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f401xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 249, size: 224, elements: !152)
!152 = !{!153, !156, !157, !158, !159, !160, !161}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !151, file: !150, line: 251, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !151, file: !150, line: 252, baseType: !154, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !151, file: !150, line: 253, baseType: !154, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !151, file: !150, line: 254, baseType: !154, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !151, file: !150, line: 255, baseType: !154, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !151, file: !150, line: 256, baseType: !154, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !151, file: !150, line: 257, baseType: !154, size: 32, offset: 192)
!162 = !{!143}
!163 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !167)
!166 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!167 = !{!168, !187}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !165, file: !166, line: 60, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{!104, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !175)
!175 = !{!176, !177, !178, !179, !185, !186}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !110, line: 380, baseType: !113, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !174, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !174, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !174, file: !110, line: 386, baseType: !180, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !181, file: !110, line: 359, baseType: !123, size: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !181, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !174, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !165, file: !166, line: 65, baseType: !172, size: 32, offset: 32)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !190, file: !193, line: 71, type: !194, isLocal: true, isDefinition: true, align: 32)
!190 = distinct !DICompileUnit(language: DW_LANG_C99, file: !191, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !192, splitDebugInlining: false, nameTableKind: None)
!191 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!192 = !{!188}
!193 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !196)
!196 = !{!197, !216}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !195, file: !166, line: 60, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!104, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !204)
!204 = !{!205, !206, !207, !208, !214, !215}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !110, line: 380, baseType: !113, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !203, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !203, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !203, file: !110, line: 386, baseType: !209, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !210, file: !110, line: 359, baseType: !123, size: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !210, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !203, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !203, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !195, file: !166, line: 65, baseType: !201, size: 32, offset: 32)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "static_regions", scope: !219, file: !228, line: 62, type: !369, isLocal: true, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !221, globals: !224, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!221 = !{!222, !104, !155, !103}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !223, line: 214, baseType: !32)
!223 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = !{!225, !217}
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !227, file: !228, line: 198, type: !355, isLocal: true, isDefinition: true)
!227 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !228, file: !228, line: 175, type: !229, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !219, retainedNodes: !350)
!228 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !233, line: 245, size: 1024, elements: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !{!235, !304, !317, !318, !319, !320, !326, !345}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !232, file: !233, line: 247, baseType: !236, size: 384)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !233, line: 57, size: 384, elements: !237)
!237 = !{!238, !266, !274, !275, !276, !289, !290, !291}
!238 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !233, line: 60, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !233, line: 60, size: 64, elements: !240)
!240 = !{!241, !257}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !239, file: !233, line: 61, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !243, line: 49, baseType: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !243, line: 37, size: 64, elements: !245)
!245 = !{!246, !252}
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !243, line: 38, baseType: !247, size: 32)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !243, line: 38, size: 32, elements: !248)
!248 = !{!249, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !247, file: !243, line: 39, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !243, line: 40, baseType: !250, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !243, line: 42, baseType: !253, size: 32, offset: 32)
!253 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !243, line: 42, size: 32, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !253, file: !243, line: 43, baseType: !250, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !243, line: 44, baseType: !250, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !239, file: !233, line: 62, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !259, line: 49, size: 64, elements: !260)
!259 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !258, file: !259, line: 50, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !264)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !236, file: !233, line: 68, baseType: !267, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !269, line: 233, baseType: !270)
!269 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 231, size: 64, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !270, file: !269, line: 232, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !243, line: 48, baseType: !244)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !236, file: !233, line: 71, baseType: !123, size: 8, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !236, file: !233, line: 74, baseType: !123, size: 8, offset: 104)
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !233, line: 90, baseType: !277, size: 16, offset: 112)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !233, line: 90, size: 16, elements: !278)
!278 = !{!279, !286}
!279 = !DIDerivedType(tag: DW_TAG_member, scope: !277, file: !233, line: 91, baseType: !280, size: 16)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !233, line: 91, size: 16, elements: !281)
!281 = !{!282, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !280, file: !233, line: 96, baseType: !283, size: 8)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !284)
!284 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !280, file: !233, line: 97, baseType: !123, size: 8, offset: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !277, file: !233, line: 100, baseType: !287, size: 16)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !288)
!288 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !236, file: !233, line: 107, baseType: !155, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !236, file: !233, line: 127, baseType: !103, size: 32, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !236, file: !233, line: 131, baseType: !292, size: 192, offset: 192)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !269, line: 244, size: 192, elements: !293)
!293 = !{!294, !295, !301}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !292, file: !269, line: 245, baseType: !242, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !292, file: !269, line: 246, baseType: !296, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !269, line: 242, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !292, file: !269, line: 249, baseType: !302, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !303)
!303 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !232, file: !233, line: 250, baseType: !305, size: 288, offset: 384)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !306, line: 25, size: 288, elements: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !305, file: !306, line: 26, baseType: !155, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !305, file: !306, line: 27, baseType: !155, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !305, file: !306, line: 28, baseType: !155, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !305, file: !306, line: 29, baseType: !155, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !305, file: !306, line: 30, baseType: !155, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !305, file: !306, line: 31, baseType: !155, size: 32, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !305, file: !306, line: 32, baseType: !155, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !305, file: !306, line: 33, baseType: !155, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !305, file: !306, line: 34, baseType: !155, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !232, file: !233, line: 253, baseType: !103, size: 32, offset: 672)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !232, file: !233, line: 256, baseType: !268, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !232, file: !233, line: 294, baseType: !104, size: 32, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !232, file: !233, line: 300, baseType: !321, size: 96, offset: 800)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !233, line: 149, size: 96, elements: !322)
!322 = !{!323, !324, !325}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !321, file: !233, line: 153, baseType: !22, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !321, file: !233, line: 162, baseType: !222, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !321, file: !233, line: 168, baseType: !222, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !232, file: !233, line: 325, baseType: !327, size: 32, offset: 896)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !329, line: 5073, size: 160, elements: !330)
!329 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!330 = !{!331, !340, !341}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !328, file: !329, line: 5074, baseType: !332, size: 96)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !333, line: 56, size: 96, elements: !334)
!333 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!334 = !{!335, !338, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !332, file: !333, line: 57, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !333, line: 57, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !332, file: !333, line: 58, baseType: !103, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !332, file: !333, line: 59, baseType: !222, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !328, file: !329, line: 5075, baseType: !268, size: 64, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !328, file: !329, line: 5076, baseType: !342, offset: 160)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !343, line: 43, elements: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = !{}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !232, file: !233, line: 343, baseType: !346, size: 64, offset: 928)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !306, line: 60, size: 64, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !346, file: !306, line: 63, baseType: !155, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !346, file: !306, line: 66, baseType: !155, size: 32, offset: 32)
!350 = !{!351, !352, !353, !354}
!351 = !DILocalVariable(name: "thread", arg: 1, scope: !227, file: !228, line: 175, type: !231)
!352 = !DILocalVariable(name: "region_num", scope: !227, file: !228, line: 200, type: !123)
!353 = !DILocalVariable(name: "guard_start", scope: !227, file: !228, line: 265, type: !22)
!354 = !DILocalVariable(name: "guard_size", scope: !227, file: !228, line: 266, type: !222)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 96, elements: !367)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !357, line: 52, size: 96, elements: !358)
!357 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !{!359, !360, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !356, file: !357, line: 53, baseType: !22, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !356, file: !357, line: 54, baseType: !222, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !356, file: !357, line: 55, baseType: !362, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !363, line: 151, baseType: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 149, size: 32, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !364, file: !363, line: 150, baseType: !155, size: 32)
!367 = !{!368}
!368 = !DISubrange(count: 1)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 96, elements: !367)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !373, file: !406, line: 39, type: !123, isLocal: true, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !375, globals: !405, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!375 = !{!376, !103, !104, !393, !123}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !378, line: 1226, baseType: !379)
!378 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 1213, size: 352, elements: !380)
!380 = !{!381, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !379, file: !378, line: 1215, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !379, file: !378, line: 1216, baseType: !154, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !379, file: !378, line: 1217, baseType: !154, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !379, file: !378, line: 1218, baseType: !154, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !379, file: !378, line: 1219, baseType: !154, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !379, file: !378, line: 1220, baseType: !154, size: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !379, file: !378, line: 1221, baseType: !154, size: 32, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !379, file: !378, line: 1222, baseType: !154, size: 32, offset: 224)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !379, file: !378, line: 1223, baseType: !154, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !379, file: !378, line: 1224, baseType: !154, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !379, file: !378, line: 1225, baseType: !154, size: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !396, line: 27, size: 96, elements: !397)
!396 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!397 = !{!398, !399, !400}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !395, file: !396, line: 29, baseType: !155, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !396, line: 31, baseType: !113, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !395, file: !396, line: 37, baseType: !401, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !363, line: 146, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !363, line: 141, size: 32, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !402, file: !363, line: 143, baseType: !155, size: 32)
!405 = !{!371}
!406 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !409, file: !416, line: 21, type: !140, isLocal: true, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !411, globals: !415, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!411 = !{!412, !104, !103}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !414, line: 22, baseType: !104)
!414 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!415 = !{!407}
!416 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !419, file: !424, line: 13, type: !441, isLocal: true, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !421, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!421 = !{!422, !417}
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "mpu_config", scope: !419, file: !424, line: 37, type: !425, isLocal: false, isDefinition: true)
!424 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !396, line: 41, size: 64, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !426, file: !396, line: 43, baseType: !155, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !426, file: !396, line: 45, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !396, line: 27, size: 96, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !432, file: !396, line: 29, baseType: !155, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !396, line: 31, baseType: !113, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !432, file: !396, line: 37, baseType: !437, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !363, line: 146, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !363, line: 141, size: 32, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !438, file: !363, line: 143, baseType: !155, size: 32)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 192, elements: !264)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !444, file: !527, line: 72, type: !611, isLocal: true, isDefinition: true)
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !446, retainedTypes: !513, globals: !524, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!446 = !{!30, !447}
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !150, line: 65, baseType: !104, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!449 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!450 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!451 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!452 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!453 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!454 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!455 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!456 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!457 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!458 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!459 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!460 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!461 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!462 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!463 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!464 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!465 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!466 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!467 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!468 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!469 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!470 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!471 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!472 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!473 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!474 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!475 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!476 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!477 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!478 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!479 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!480 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!481 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!482 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!483 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!484 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!485 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!486 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!487 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!488 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!489 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!490 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!491 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!492 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!493 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!494 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!495 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!496 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!497 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!498 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!499 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!500 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!501 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!502 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!503 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!504 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!505 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!506 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!507 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!508 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!509 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!510 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!511 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!512 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!513 = !{!222, !104, !103, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !150, line: 243, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 235, size: 192, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !516, file: !150, line: 237, baseType: !154, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !516, file: !150, line: 238, baseType: !154, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !516, file: !150, line: 239, baseType: !154, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !516, file: !150, line: 240, baseType: !154, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !516, file: !150, line: 241, baseType: !154, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !516, file: !150, line: 242, baseType: !154, size: 32, offset: 160)
!524 = !{!525, !531, !547, !558, !575, !442, !577, !591, !593, !595, !597, !599, !601, !603, !605, !607, !609}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !444, file: !527, line: 424, type: !528, isLocal: false, isDefinition: true, align: 16)
!527 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 4)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !444, file: !527, line: 424, type: !533, isLocal: false, isDefinition: true, align: 32)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !535)
!535 = !{!536, !537, !538, !539, !545, !546}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !534, file: !110, line: 380, baseType: !113, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !534, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !534, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !534, file: !110, line: 386, baseType: !540, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !541, file: !110, line: 359, baseType: !123, size: 8)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !541, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !534, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !534, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !444, file: !527, line: 424, type: !549, isLocal: true, isDefinition: true, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !551)
!551 = !{!552, !557}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !550, file: !166, line: 60, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DISubroutineType(types: !555)
!555 = !{!104, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !550, file: !166, line: 65, baseType: !556, size: 32, offset: 32)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "exti_data", scope: !444, file: !527, line: 423, type: !560, isLocal: true, isDefinition: true)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !527, line: 107, size: 1472, elements: !561)
!561 = !{!562}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !560, file: !527, line: 109, baseType: !563, size: 1472)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1472, elements: !573)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !527, line: 101, size: 64, elements: !565)
!565 = !{!566, !572}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !564, file: !527, line: 102, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !568, line: 63, baseType: !569)
!568 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !104, !103}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !564, file: !527, line: 103, baseType: !103, size: 32, offset: 32)
!573 = !{!574}
!574 = !DISubrange(count: 23)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !444, file: !527, line: 424, type: !541, isLocal: true, isDefinition: true, align: 8)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !579, file: !527, line: 493, type: !584, isLocal: true, isDefinition: true, align: 32)
!579 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !527, file: !527, line: 460, type: !580, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !444, retainedNodes: !582)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !556}
!582 = !{!583}
!583 = !DILocalVariable(name: "dev", arg: 1, scope: !579, file: !527, line: 460, type: !556)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !585)
!585 = !{!586, !588, !589, !590}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !584, file: !10, line: 55, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !104)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !584, file: !10, line: 57, baseType: !587, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !584, file: !10, line: 59, baseType: !103, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !584, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !579, file: !527, line: 497, type: !584, isLocal: true, isDefinition: true, align: 32)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !579, file: !527, line: 507, type: !584, isLocal: true, isDefinition: true, align: 32)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !579, file: !527, line: 512, type: !584, isLocal: true, isDefinition: true, align: 32)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !579, file: !527, line: 516, type: !584, isLocal: true, isDefinition: true, align: 32)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !579, file: !527, line: 523, type: !584, isLocal: true, isDefinition: true, align: 32)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !579, file: !527, line: 527, type: !584, isLocal: true, isDefinition: true, align: 32)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !579, file: !527, line: 581, type: !584, isLocal: true, isDefinition: true, align: 32)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !579, file: !527, line: 586, type: !584, isLocal: true, isDefinition: true, align: 32)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !579, file: !527, line: 591, type: !584, isLocal: true, isDefinition: true, align: 32)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !579, file: !527, line: 595, type: !584, isLocal: true, isDefinition: true, align: 32)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 736, elements: !573)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !150, line: 133, baseType: !447)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !616, file: !621, line: 24, type: !643, isLocal: false, isDefinition: true, align: 16)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !618, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!618 = !{!619, !614, !625, !627, !629, !631, !633, !635, !637, !639, !641, !646, !648, !650}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !616, file: !621, line: 19, type: !622, isLocal: false, isDefinition: true, align: 16)
!621 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 224, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 14)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !616, file: !621, line: 31, type: !528, isLocal: false, isDefinition: true, align: 16)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !616, file: !621, line: 38, type: !528, isLocal: false, isDefinition: true, align: 16)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !616, file: !621, line: 45, type: !528, isLocal: false, isDefinition: true, align: 16)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !616, file: !621, line: 52, type: !528, isLocal: false, isDefinition: true, align: 16)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !616, file: !621, line: 59, type: !528, isLocal: false, isDefinition: true, align: 16)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !616, file: !621, line: 66, type: !528, isLocal: false, isDefinition: true, align: 16)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_20", scope: !616, file: !621, line: 73, type: !528, isLocal: false, isDefinition: true, align: 16)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !616, file: !621, line: 80, type: !528, isLocal: false, isDefinition: true, align: 16)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__devicehdl_hello_world", scope: !616, file: !621, line: 85, type: !643, isLocal: false, isDefinition: true, align: 16)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 48, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 3)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_50", scope: !616, file: !621, line: 92, type: !528, isLocal: false, isDefinition: true, align: 16)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !616, file: !621, line: 99, type: !528, isLocal: false, isDefinition: true, align: 16)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_47", scope: !616, file: !621, line: 106, type: !528, isLocal: false, isDefinition: true, align: 16)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !654, file: !718, line: 398, type: !751, isLocal: true, isDefinition: true)
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !656, retainedTypes: !669, globals: !715, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!656 = !{!657, !30, !662}
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 197, baseType: !32, size: 32, elements: !659)
!658 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!659 = !{!660, !661}
!660 = !DIEnumerator(name: "SUCCESS", value: 0)
!661 = !DIEnumerator(name: "ERROR", value: 1)
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !663, line: 44, baseType: !32, size: 32, elements: !664)
!663 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!664 = !{!665, !666, !667, !668}
!665 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!666 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!667 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!668 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!669 = !{!103, !104, !155, !670, !708, !714}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !150, line: 369, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 335, size: 1152, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !707}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !672, file: !150, line: 337, baseType: !154, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !672, file: !150, line: 338, baseType: !154, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !672, file: !150, line: 339, baseType: !154, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !672, file: !150, line: 340, baseType: !154, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !672, file: !150, line: 341, baseType: !154, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !672, file: !150, line: 342, baseType: !154, size: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !672, file: !150, line: 343, baseType: !154, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !672, file: !150, line: 344, baseType: !155, size: 32, offset: 224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !672, file: !150, line: 345, baseType: !154, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !672, file: !150, line: 346, baseType: !154, size: 32, offset: 288)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !672, file: !150, line: 347, baseType: !685, size: 64, offset: 320)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 64, elements: !264)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !672, file: !150, line: 348, baseType: !154, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !672, file: !150, line: 349, baseType: !154, size: 32, offset: 416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !672, file: !150, line: 350, baseType: !154, size: 32, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !672, file: !150, line: 351, baseType: !155, size: 32, offset: 480)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !672, file: !150, line: 352, baseType: !154, size: 32, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !672, file: !150, line: 353, baseType: !154, size: 32, offset: 544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !672, file: !150, line: 354, baseType: !685, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !672, file: !150, line: 355, baseType: !154, size: 32, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !672, file: !150, line: 356, baseType: !154, size: 32, offset: 672)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !672, file: !150, line: 357, baseType: !154, size: 32, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !672, file: !150, line: 358, baseType: !155, size: 32, offset: 736)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !672, file: !150, line: 359, baseType: !154, size: 32, offset: 768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !672, file: !150, line: 360, baseType: !154, size: 32, offset: 800)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !672, file: !150, line: 361, baseType: !685, size: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !672, file: !150, line: 362, baseType: !154, size: 32, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !672, file: !150, line: 363, baseType: !154, size: 32, offset: 928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !672, file: !150, line: 364, baseType: !685, size: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !672, file: !150, line: 365, baseType: !154, size: 32, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !672, file: !150, line: 366, baseType: !154, size: 32, offset: 1056)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !672, file: !150, line: 367, baseType: !706, size: 32, offset: 1088)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 32, elements: !367)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !672, file: !150, line: 368, baseType: !154, size: 32, offset: 1120)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !710, line: 343, size: 64, elements: !711)
!710 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !709, file: !710, line: 344, baseType: !155, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !709, file: !710, line: 345, baseType: !155, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!715 = !{!716, !722, !738, !749, !652}
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !654, file: !718, line: 752, type: !719, isLocal: false, isDefinition: true, align: 16)
!718 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 640, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 40)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !654, file: !718, line: 752, type: !724, isLocal: false, isDefinition: true, align: 32)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !726)
!726 = !{!727, !728, !729, !730, !736, !737}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !110, line: 380, baseType: !113, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !725, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !725, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !725, file: !110, line: 386, baseType: !731, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !732, file: !110, line: 359, baseType: !123, size: 8)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !732, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !725, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !725, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !654, file: !718, line: 752, type: !740, isLocal: true, isDefinition: true, align: 32)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !742)
!742 = !{!743, !748}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !741, file: !166, line: 60, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{!104, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !741, file: !166, line: 65, baseType: !747, size: 32, offset: 32)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !654, file: !718, line: 752, type: !732, isLocal: true, isDefinition: true, align: 8)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !663, line: 100, size: 224, elements: !752)
!752 = !{!753, !759, !760, !769, !774, !779, !785}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !751, file: !663, line: 101, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !663, line: 76, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{!104, !747, !758}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !663, line: 56, baseType: !103)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !751, file: !663, line: 102, baseType: !754, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !751, file: !663, line: 103, baseType: !761, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !663, line: 83, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{!104, !747, !758, !765, !103}
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !663, line: 72, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !747, !758, !103}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !751, file: !663, line: 104, baseType: !770, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !663, line: 79, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DISubroutineType(types: !773)
!773 = !{!104, !747, !758, !714}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !751, file: !663, line: 105, baseType: !775, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !663, line: 88, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{!662, !747, !758}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !751, file: !663, line: 106, baseType: !780, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !663, line: 92, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!104, !747, !758, !784}
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !663, line: 64, baseType: !103)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !751, file: !663, line: 107, baseType: !786, size: 32, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !663, line: 96, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{!104, !747, !758, !103}
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !792, file: !849, line: 603, type: !851, isLocal: true, isDefinition: true, align: 32)
!792 = distinct !DICompileUnit(language: DW_LANG_C99, file: !793, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !794, globals: !846, splitDebugInlining: false, nameTableKind: None)
!793 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!794 = !{!103, !104, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !798, line: 336, size: 160, elements: !799)
!798 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = !{!800, !820, !824, !828, !841}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !797, file: !798, line: 365, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DISubroutineType(types: !803)
!803 = !{!104, !804, !819}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !807)
!807 = !{!808, !809, !810, !811, !817, !818}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !806, file: !110, line: 380, baseType: !113, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !806, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !806, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !806, file: !110, line: 386, baseType: !812, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !813, file: !110, line: 359, baseType: !123, size: 8)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !813, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !806, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !806, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !797, file: !798, line: 366, baseType: !821, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !804, !124}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !797, file: !798, line: 374, baseType: !825, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{!104, !804}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !797, file: !798, line: 377, baseType: !829, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DISubroutineType(types: !831)
!831 = !{!104, !804, !832}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !798, line: 122, size: 64, elements: !835)
!835 = !{!836, !837, !838, !839, !840}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !834, file: !798, line: 123, baseType: !155, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !834, file: !798, line: 124, baseType: !123, size: 8, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !834, file: !798, line: 125, baseType: !123, size: 8, offset: 40)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !834, file: !798, line: 126, baseType: !123, size: 8, offset: 48)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !834, file: !798, line: 127, baseType: !123, size: 8, offset: 56)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !797, file: !798, line: 379, baseType: !842, size: 32, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DISubroutineType(types: !844)
!844 = !{!104, !804, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!846 = !{!790, !847}
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !792, file: !849, line: 38, type: !850, isLocal: true, isDefinition: true)
!849 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !852, file: !166, line: 60, baseType: !825, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !852, file: !166, line: 65, baseType: !804, size: 32, offset: 32)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !858, file: !1028, line: 762, type: !1140, isLocal: true, isDefinition: true)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !860, retainedTypes: !878, globals: !1025, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/out_of_tree_driver")
!860 = !{!30, !861, !867, !872, !662}
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !862, line: 506, baseType: !32, size: 32, elements: !863)
!862 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!863 = !{!864, !865, !866}
!864 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!865 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!866 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !862, line: 512, baseType: !32, size: 32, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!870 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!871 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !568, line: 43, baseType: !32, size: 32, elements: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!875 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!876 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!877 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!878 = !{!103, !104, !879, !949, !954, !914, !867, !861, !959, !960, !155, !974, !929, !984, !985, !986}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !862, line: 523, size: 288, elements: !882)
!882 = !{!883, !904, !910, !915, !919, !920, !921, !925, !945}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !881, file: !862, line: 524, baseType: !884, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DISubroutineType(types: !886)
!886 = !{!104, !887, !902, !903}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !890)
!890 = !{!891, !892, !893, !894, !900, !901}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !889, file: !110, line: 380, baseType: !113, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !889, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !889, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !889, file: !110, line: 386, baseType: !895, size: 32, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !896, file: !110, line: 359, baseType: !123, size: 8)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !896, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !889, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !889, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !862, line: 237, baseType: !123)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !862, line: 257, baseType: !155)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !881, file: !862, line: 530, baseType: !905, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{!104, !887, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !862, line: 229, baseType: !155)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !881, file: !862, line: 532, baseType: !911, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DISubroutineType(types: !913)
!913 = !{!104, !887, !914, !909}
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !862, line: 216, baseType: !155)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !881, file: !862, line: 535, baseType: !916, size: 32, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DISubroutineType(types: !918)
!918 = !{!104, !887, !914}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !881, file: !862, line: 537, baseType: !916, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !881, file: !862, line: 539, baseType: !916, size: 32, offset: 160)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !881, file: !862, line: 541, baseType: !922, size: 32, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!104, !887, !902, !861, !867}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !881, file: !862, line: 544, baseType: !926, size: 32, offset: 224)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{!104, !887, !929, !126}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !862, line: 478, size: 96, elements: !931)
!931 = !{!932, !939, !944}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !930, file: !862, line: 482, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !934, line: 33, baseType: !935)
!934 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !934, line: 29, size: 32, elements: !936)
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !934, line: 30, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !930, file: !862, line: 485, baseType: !940, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !862, line: 464, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !887, !929, !914}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !930, file: !862, line: 493, baseType: !914, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !881, file: !862, line: 547, baseType: !946, size: 32, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DISubroutineType(types: !948)
!948 = !{!155, !887}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !862, line: 428, size: 32, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !951, file: !862, line: 434, baseType: !914, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !862, line: 441, size: 32, elements: !957)
!957 = !{!958}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !956, file: !862, line: 447, baseType: !914, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !150, line: 275, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 264, size: 320, elements: !963)
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !962, file: !150, line: 266, baseType: !154, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !962, file: !150, line: 267, baseType: !154, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !962, file: !150, line: 268, baseType: !154, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !962, file: !150, line: 269, baseType: !154, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !962, file: !150, line: 270, baseType: !154, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !962, file: !150, line: 271, baseType: !154, size: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !962, file: !150, line: 272, baseType: !154, size: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !962, file: !150, line: 273, baseType: !154, size: 32, offset: 224)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !962, file: !150, line: 274, baseType: !973, size: 64, offset: 256)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, elements: !264)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !150, line: 288, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 281, size: 288, elements: !977)
!977 = !{!978, !979, !980, !982, !983}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !976, file: !150, line: 283, baseType: !154, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !976, file: !150, line: 284, baseType: !154, size: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !976, file: !150, line: 285, baseType: !981, size: 128, offset: 64)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !529)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !976, file: !150, line: 286, baseType: !685, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !976, file: !150, line: 287, baseType: !154, size: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !663, line: 100, size: 224, elements: !989)
!989 = !{!990, !995, !996, !1005, !1010, !1015, !1020}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !988, file: !663, line: 101, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !663, line: 76, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{!104, !887, !758}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !988, file: !663, line: 102, baseType: !991, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !988, file: !663, line: 103, baseType: !997, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !663, line: 83, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!104, !887, !758, !1001, !103}
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !663, line: 72, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !887, !758, !103}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !988, file: !663, line: 104, baseType: !1006, size: 32, offset: 96)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !663, line: 79, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!104, !887, !758, !714}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !988, file: !663, line: 105, baseType: !1011, size: 32, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !663, line: 88, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!662, !887, !758}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !988, file: !663, line: 106, baseType: !1016, size: 32, offset: 160)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !663, line: 92, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!104, !887, !758, !784}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !988, file: !663, line: 107, baseType: !1021, size: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !663, line: 96, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!104, !887, !758, !103}
!1025 = !{!1026, !1032, !1034, !1044, !1046, !1048, !1050, !1055, !1057, !1059, !1064, !1066, !1068, !1070, !1072, !1074, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1092, !1106, !1108, !1110, !1112, !1114, !1116, !1118, !1120, !1122, !1124, !1126, !1128, !1130, !1132, !1134, !856, !1136, !1138, !1151, !1153, !1155, !1157, !1159, !1161}
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !858, file: !1028, line: 762, type: !1029, isLocal: false, isDefinition: true, align: 16)
!1028 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 112, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 7)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !858, file: !1028, line: 762, type: !888, isLocal: false, isDefinition: true, align: 32)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !858, file: !1028, line: 762, type: !1036, isLocal: true, isDefinition: true, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !1038)
!1038 = !{!1039, !1043}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1037, file: !166, line: 60, baseType: !1040, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!104, !887}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1037, file: !166, line: 65, baseType: !887, size: 32, offset: 32)
