; ModuleID = 'build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "gcounter", scope: !27, file: !170, line: 12, type: !103, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !169, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !{!110, !143, !154, !159, !164}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 99, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!103, !115, !103, !142, !13, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !124, !125, !126, !135, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 380, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 386, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !128, file: !118, line: 359, baseType: !131, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !128, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !117, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !118, line: 43, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !141)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !107, file: !108, line: 100, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !115, !148, !104}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !115, !104, !142, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !107, file: !108, line: 101, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!103, !115}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !107, file: !108, line: 102, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!142, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !107, file: !108, line: 103, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !115, !103}
!169 = !{!25}
!170 = !DIFile(filename: "zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "_char_out", scope: !173, file: !177, line: 54, type: !178, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!175 = !{!104, !103}
!176 = !{!171}
!177 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!103, !103}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !183, file: !224, line: 27, type: !251, isLocal: true, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !197, globals: !221, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!185 = !{!186, !30}
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !187, line: 27, baseType: !32, size: 32, elements: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196}
!189 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!190 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!191 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!192 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!193 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!194 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!195 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!196 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!197 = !{!104, !198, !103, !24, !202, !218, !142, !219}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !199, line: 46, baseType: !200)
!199 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !201)
!201 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !204, line: 54, size: 96, elements: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !{!206, !213, !217}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !203, file: !204, line: 55, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !208, line: 33, baseType: !209)
!208 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !208, line: 29, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !208, line: 30, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !203, file: !204, line: 60, baseType: !214, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !186}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !203, file: !204, line: 65, baseType: !214, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !220)
!220 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!221 = !{!181, !222, !228, !230, !241, !243}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !183, file: !224, line: 44, type: !225, isLocal: true, isDefinition: true)
!224 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !226, line: 43, elements: !227)
!226 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !{}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !183, file: !224, line: 49, type: !225, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !183, file: !224, line: 36, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 128, elements: !239)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !187, line: 114, size: 128, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !233, file: !187, line: 115, baseType: !186, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !233, file: !187, line: 141, baseType: !131, size: 8, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !233, file: !187, line: 149, baseType: !142, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !233, file: !187, line: 156, baseType: !142, size: 32, offset: 96)
!239 = !{!240}
!240 = !DISubrange(count: 1)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !183, file: !224, line: 40, type: !232, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !183, file: !224, line: 28, type: !245, isLocal: true, isDefinition: true)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !208, line: 40, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !208, line: 35, size: 64, elements: !247)
!247 = !{!248, !250}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !246, file: !208, line: 36, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !246, file: !208, line: 37, baseType: !249, size: 32, offset: 32)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 32, elements: !239)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !253, line: 22, baseType: !254)
!253 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!255 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!256 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !259, file: !288, line: 50, type: !275, isLocal: true, isDefinition: true)
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !261, globals: !285, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!261 = !{!140, !198, !262, !103, !104, !142, !219, !264, !218, !275, !276}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !263, line: 214, baseType: !32)
!263 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !266, line: 45, size: 64, elements: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = !{!268, !274}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !265, file: !266, line: 46, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !208, line: 33, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !208, line: 29, size: 32, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !208, line: 30, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !265, file: !266, line: 48, baseType: !142, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !266, line: 38, size: 64, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !277, file: !266, line: 39, baseType: !269, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !277, file: !266, line: 41, baseType: !281, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !266, line: 35, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !275}
!285 = !{!286, !290, !298, !257, !300, !310}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "latency_lock", scope: !259, file: !288, line: 44, type: !289, isLocal: true, isDefinition: true)
!288 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !226, line: 43, elements: !227)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !259, file: !288, line: 46, type: !292, isLocal: true, isDefinition: true)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !208, line: 40, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !208, line: 35, size: 64, elements: !294)
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !293, file: !208, line: 36, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !293, file: !208, line: 37, baseType: !296, size: 32, offset: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "latency_subs", scope: !259, file: !288, line: 52, type: !292, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !259, file: !288, line: 39, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, elements: !308)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !288, line: 35, size: 96, elements: !304)
!304 = !{!305, !306, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !303, file: !288, line: 36, baseType: !186, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !303, file: !288, line: 37, baseType: !131, size: 8, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !303, file: !288, line: 38, baseType: !252, size: 32, offset: 64)
!308 = !{!309}
!309 = !DISubrange(count: 0)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !259, file: !288, line: 48, type: !275, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !314, file: !321, line: 47, type: !335, isLocal: true, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !316, retainedTypes: !317, globals: !318, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!316 = !{!186}
!317 = !{!262, !103}
!318 = !{!319, !312, !331}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "cpus_states", scope: !314, file: !321, line: 50, type: !322, isLocal: true, isDefinition: true)
!321 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 32, elements: !239)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !187, line: 114, size: 128, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !325, file: !187, line: 115, baseType: !186, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !325, file: !187, line: 141, baseType: !131, size: 8, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !325, file: !187, line: 149, baseType: !142, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !325, file: !187, line: 156, baseType: !142, size: 32, offset: 96)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !314, file: !321, line: 55, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 8, elements: !239)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, elements: !308)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "static_regions", scope: !338, file: !345, line: 62, type: !478, isLocal: true, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !340, globals: !341, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!340 = !{!262, !103, !142, !104}
!341 = !{!342, !336}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !344, file: !345, line: 198, type: !466, isLocal: true, isDefinition: true)
!344 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !345, file: !345, line: 175, type: !346, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !338, retainedNodes: !463)
!345 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !350, line: 245, size: 1024, elements: !351)
!350 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!351 = !{!352, !419, !432, !433, !434, !435, !441, !458}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !349, file: !350, line: 247, baseType: !353, size: 384)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !350, line: 57, size: 384, elements: !354)
!354 = !{!355, !383, !391, !392, !393, !406, !407, !408}
!355 = !DIDerivedType(tag: DW_TAG_member, scope: !353, file: !350, line: 60, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !353, file: !350, line: 60, size: 64, elements: !357)
!357 = !{!358, !374}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !356, file: !350, line: 61, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !360, line: 49, baseType: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !360, line: 37, size: 64, elements: !362)
!362 = !{!363, !369}
!363 = !DIDerivedType(tag: DW_TAG_member, scope: !361, file: !360, line: 38, baseType: !364, size: 32)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !361, file: !360, line: 38, size: 32, elements: !365)
!365 = !{!366, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !364, file: !360, line: 39, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !360, line: 40, baseType: !367, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, scope: !361, file: !360, line: 42, baseType: !370, size: 32, offset: 32)
!370 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !361, file: !360, line: 42, size: 32, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !370, file: !360, line: 43, baseType: !367, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !370, file: !360, line: 44, baseType: !367, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !356, file: !350, line: 62, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !376, line: 49, size: 64, elements: !377)
!376 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !375, file: !376, line: 50, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 64, elements: !381)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!381 = !{!382}
!382 = !DISubrange(count: 2)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !353, file: !350, line: 68, baseType: !384, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !386, line: 233, baseType: !387)
!386 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 231, size: 64, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !387, file: !386, line: 232, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !360, line: 48, baseType: !361)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !353, file: !350, line: 71, baseType: !131, size: 8, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !353, file: !350, line: 74, baseType: !131, size: 8, offset: 104)
!393 = !DIDerivedType(tag: DW_TAG_member, scope: !353, file: !350, line: 90, baseType: !394, size: 16, offset: 112)
!394 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !353, file: !350, line: 90, size: 16, elements: !395)
!395 = !{!396, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, scope: !394, file: !350, line: 91, baseType: !397, size: 16)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !350, line: 91, size: 16, elements: !398)
!398 = !{!399, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !397, file: !350, line: 96, baseType: !400, size: 8)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !401)
!401 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !397, file: !350, line: 97, baseType: !131, size: 8, offset: 8)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !394, file: !350, line: 100, baseType: !404, size: 16)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !405)
!405 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !353, file: !350, line: 107, baseType: !142, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !353, file: !350, line: 127, baseType: !104, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !353, file: !350, line: 131, baseType: !409, size: 192, offset: 192)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !386, line: 244, size: 192, elements: !410)
!410 = !{!411, !412, !418}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !409, file: !386, line: 245, baseType: !359, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !409, file: !386, line: 246, baseType: !413, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !386, line: 242, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !409, file: !386, line: 249, baseType: !200, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !349, file: !350, line: 250, baseType: !420, size: 288, offset: 384)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !421, line: 25, size: 288, elements: !422)
!421 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !420, file: !421, line: 26, baseType: !142, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !420, file: !421, line: 27, baseType: !142, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !420, file: !421, line: 28, baseType: !142, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !420, file: !421, line: 29, baseType: !142, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !420, file: !421, line: 30, baseType: !142, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !420, file: !421, line: 31, baseType: !142, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !420, file: !421, line: 32, baseType: !142, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !420, file: !421, line: 33, baseType: !142, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !420, file: !421, line: 34, baseType: !142, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !349, file: !350, line: 253, baseType: !104, size: 32, offset: 672)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !349, file: !350, line: 256, baseType: !385, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !349, file: !350, line: 294, baseType: !103, size: 32, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !349, file: !350, line: 300, baseType: !436, size: 96, offset: 800)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !350, line: 149, size: 96, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !436, file: !350, line: 153, baseType: !22, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !436, file: !350, line: 162, baseType: !262, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !436, file: !350, line: 168, baseType: !262, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !349, file: !350, line: 325, baseType: !442, size: 32, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !444, line: 5073, size: 160, elements: !445)
!444 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!445 = !{!446, !455, !456}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !443, file: !444, line: 5074, baseType: !447, size: 96)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !448, line: 56, size: 96, elements: !449)
!448 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !{!450, !453, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !447, file: !448, line: 57, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !448, line: 57, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !447, file: !448, line: 58, baseType: !104, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !447, file: !448, line: 59, baseType: !262, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !443, file: !444, line: 5075, baseType: !385, size: 64, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !443, file: !444, line: 5076, baseType: !457, offset: 160)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !226, line: 43, elements: !227)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !349, file: !350, line: 343, baseType: !459, size: 64, offset: 928)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !421, line: 60, size: 64, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !459, file: !421, line: 63, baseType: !142, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !459, file: !421, line: 66, baseType: !142, size: 32, offset: 32)
!463 = !{!464, !465}
!464 = !DILocalVariable(name: "thread", arg: 1, scope: !344, file: !345, line: 175, type: !348)
!465 = !DILocalVariable(name: "region_num", scope: !344, file: !345, line: 200, type: !131)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, elements: !308)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !468, line: 52, size: 96, elements: !469)
!468 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !467, file: !468, line: 53, baseType: !22, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !467, file: !468, line: 54, baseType: !262, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !467, file: !468, line: 55, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !474, line: 151, baseType: !475)
!474 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 149, size: 32, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !475, file: !474, line: 150, baseType: !142, size: 32)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 96, elements: !239)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !482, file: !516, line: 39, type: !131, isLocal: true, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !484, globals: !515, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!484 = !{!485, !104, !103, !503, !131}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !487, line: 1226, baseType: !488)
!487 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !487, line: 1213, size: 352, elements: !489)
!489 = !{!490, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !488, file: !487, line: 1215, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !488, file: !487, line: 1216, baseType: !492, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !488, file: !487, line: 1217, baseType: !492, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !488, file: !487, line: 1218, baseType: !492, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !488, file: !487, line: 1219, baseType: !492, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !488, file: !487, line: 1220, baseType: !492, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !488, file: !487, line: 1221, baseType: !492, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !488, file: !487, line: 1222, baseType: !492, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !488, file: !487, line: 1223, baseType: !492, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !488, file: !487, line: 1224, baseType: !492, size: 32, offset: 288)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !488, file: !487, line: 1225, baseType: !492, size: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !506, line: 27, size: 96, elements: !507)
!506 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = !{!508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !505, file: !506, line: 29, baseType: !142, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !505, file: !506, line: 31, baseType: !121, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !505, file: !506, line: 37, baseType: !511, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !474, line: 146, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !474, line: 141, size: 32, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !512, file: !474, line: 143, baseType: !142, size: 32)
!515 = !{!480}
!516 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !519, file: !526, line: 21, type: !178, isLocal: true, isDefinition: true)
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !521, globals: !525, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!521 = !{!522, !103, !104}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !524, line: 22, baseType: !103)
!524 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!525 = !{!517}
!526 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !529, file: !534, line: 13, type: !551, isLocal: true, isDefinition: true)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !531, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!531 = !{!532, !527}
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "mpu_config", scope: !529, file: !534, line: 37, type: !535, isLocal: false, isDefinition: true)
!534 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !506, line: 41, size: 64, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !536, file: !506, line: 43, baseType: !142, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !536, file: !506, line: 45, baseType: !540, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !506, line: 27, size: 96, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !542, file: !506, line: 29, baseType: !142, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !542, file: !506, line: 31, baseType: !121, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !542, file: !506, line: 37, baseType: !547, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !474, line: 146, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !474, line: 141, size: 32, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !548, file: !474, line: 143, baseType: !142, size: 32)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 192, elements: !381)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !554, file: !724, line: 93, type: !725, isLocal: true, isDefinition: true, align: 32)
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !556, globals: !719, splitDebugInlining: false, nameTableKind: None)
!555 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!556 = !{!557, !131, !104, !103, !637, !142, !638, !674, !685}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !559, line: 1071, baseType: !560)
!559 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 1035, size: 19584, elements: !561)
!561 = !{!562, !566, !567, !568, !572, !573, !575, !576, !577, !578, !579, !580, !584, !585, !586, !590, !591, !595, !596, !600, !601, !605, !606, !607, !608, !609, !610, !611, !615, !616, !617, !618, !622, !623, !627}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !560, file: !559, line: 1036, baseType: !563, size: 960)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 960, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 30)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !560, file: !559, line: 1037, baseType: !492, size: 32, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !560, file: !559, line: 1038, baseType: !492, size: 32, offset: 992)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !560, file: !559, line: 1039, baseType: !569, size: 1088, offset: 1024)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 1088, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 34)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !560, file: !559, line: 1040, baseType: !492, size: 32, offset: 2112)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !560, file: !559, line: 1041, baseType: !574, size: 64, offset: 2144)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 64, elements: !381)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !560, file: !559, line: 1042, baseType: !492, size: 32, offset: 2208)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !560, file: !559, line: 1043, baseType: !492, size: 32, offset: 2240)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !560, file: !559, line: 1044, baseType: !492, size: 32, offset: 2272)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !560, file: !559, line: 1045, baseType: !492, size: 32, offset: 2304)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !560, file: !559, line: 1046, baseType: !492, size: 32, offset: 2336)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !560, file: !559, line: 1047, baseType: !581, size: 3808, offset: 2368)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 3808, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 119)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !560, file: !559, line: 1048, baseType: !492, size: 32, offset: 6176)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !560, file: !559, line: 1049, baseType: !492, size: 32, offset: 6208)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !560, file: !559, line: 1050, baseType: !587, size: 1952, offset: 6240)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 1952, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 61)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !560, file: !559, line: 1051, baseType: !492, size: 32, offset: 8192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !560, file: !559, line: 1052, baseType: !592, size: 288, offset: 8224)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 288, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 9)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !560, file: !559, line: 1053, baseType: !491, size: 32, offset: 8512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !560, file: !559, line: 1054, baseType: !597, size: 96, offset: 8544)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 96, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 3)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !560, file: !559, line: 1055, baseType: !491, size: 32, offset: 8640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !560, file: !559, line: 1056, baseType: !602, size: 1568, offset: 8672)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 1568, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 49)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !560, file: !559, line: 1057, baseType: !492, size: 32, offset: 10240)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !560, file: !559, line: 1058, baseType: !597, size: 96, offset: 10272)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !560, file: !559, line: 1059, baseType: !492, size: 32, offset: 10368)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !560, file: !559, line: 1060, baseType: !574, size: 64, offset: 10400)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !560, file: !559, line: 1061, baseType: !492, size: 32, offset: 10464)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !560, file: !559, line: 1062, baseType: !492, size: 32, offset: 10496)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !560, file: !559, line: 1063, baseType: !612, size: 672, offset: 10528)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 672, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 21)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !560, file: !559, line: 1064, baseType: !492, size: 32, offset: 11200)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !560, file: !559, line: 1065, baseType: !491, size: 32, offset: 11232)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !560, file: !559, line: 1066, baseType: !492, size: 32, offset: 11264)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !560, file: !559, line: 1067, baseType: !619, size: 1504, offset: 11296)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 1504, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 47)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !560, file: !559, line: 1068, baseType: !491, size: 32, offset: 12800)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !560, file: !559, line: 1069, baseType: !624, size: 5600, offset: 12832)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 5600, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 175)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !560, file: !559, line: 1070, baseType: !628, size: 1152, offset: 18432)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 1152, elements: !593)
!629 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !559, line: 278, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 272, size: 128, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !631, file: !559, line: 273, baseType: !492, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !631, file: !559, line: 274, baseType: !492, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !631, file: !559, line: 275, baseType: !492, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !631, file: !559, line: 277, baseType: !491, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !487, line: 468, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !487, line: 445, size: 1120, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !667, !671, !673}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !640, file: !487, line: 447, baseType: !491, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !640, file: !487, line: 448, baseType: !492, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !640, file: !487, line: 449, baseType: !492, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !640, file: !487, line: 450, baseType: !492, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !640, file: !487, line: 451, baseType: !492, size: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !640, file: !487, line: 452, baseType: !492, size: 32, offset: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !640, file: !487, line: 453, baseType: !649, size: 96, offset: 192)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 96, elements: !651)
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!651 = !{!652}
!652 = !DISubrange(count: 12)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !640, file: !487, line: 454, baseType: !492, size: 32, offset: 288)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !640, file: !487, line: 455, baseType: !492, size: 32, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !640, file: !487, line: 456, baseType: !492, size: 32, offset: 352)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !640, file: !487, line: 457, baseType: !492, size: 32, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !640, file: !487, line: 458, baseType: !492, size: 32, offset: 416)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !640, file: !487, line: 459, baseType: !492, size: 32, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !640, file: !487, line: 460, baseType: !492, size: 32, offset: 480)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !640, file: !487, line: 461, baseType: !574, size: 64, offset: 512)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !640, file: !487, line: 462, baseType: !491, size: 32, offset: 576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !640, file: !487, line: 463, baseType: !491, size: 32, offset: 608)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !640, file: !487, line: 464, baseType: !664, size: 128, offset: 640)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 128, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 4)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !640, file: !487, line: 465, baseType: !668, size: 160, offset: 768)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 160, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 5)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !640, file: !487, line: 466, baseType: !672, size: 160, offset: 928)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 160, elements: !669)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !640, file: !487, line: 467, baseType: !492, size: 32, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !676, file: !675, line: 167, baseType: !684)
!675 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!676 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !675, file: !675, line: 134, type: !677, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !554, retainedNodes: !679)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !142}
!679 = !{!680, !681, !683}
!680 = !DILocalVariable(name: "time_us", arg: 1, scope: !676, file: !675, line: 134, type: !142)
!681 = !DILocalVariable(name: "delay_cycles", scope: !676, file: !675, line: 168, type: !682)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!683 = !DILocalVariable(name: "cycles", scope: !676, file: !675, line: 171, type: !142)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !559, line: 2399, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 2373, size: 10880, elements: !688)
!688 = !{!689, !693, !694, !695, !696, !700, !701, !706, !707, !708, !709, !710, !711, !715, !716, !717, !718}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !687, file: !559, line: 2374, baseType: !690, size: 8192)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 8192, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !687, file: !559, line: 2375, baseType: !491, size: 32, offset: 8192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !687, file: !559, line: 2376, baseType: !491, size: 32, offset: 8224)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !687, file: !559, line: 2377, baseType: !491, size: 32, offset: 8256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !687, file: !559, line: 2378, baseType: !697, size: 1984, offset: 8288)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 1984, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 62)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !687, file: !559, line: 2379, baseType: !492, size: 32, offset: 10272)
!701 = !DIDerivedType(tag: DW_TAG_member, scope: !687, file: !559, line: 2381, baseType: !702, size: 32, offset: 10304)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !687, file: !559, line: 2381, size: 32, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !702, file: !559, line: 2382, baseType: !492, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !702, file: !559, line: 2383, baseType: !492, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !687, file: !559, line: 2386, baseType: !492, size: 32, offset: 10336)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !687, file: !559, line: 2387, baseType: !492, size: 32, offset: 10368)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !687, file: !559, line: 2389, baseType: !492, size: 32, offset: 10400)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !687, file: !559, line: 2391, baseType: !492, size: 32, offset: 10432)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !687, file: !559, line: 2393, baseType: !492, size: 32, offset: 10464)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !687, file: !559, line: 2394, baseType: !712, size: 256, offset: 10496)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 256, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 8)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !687, file: !559, line: 2395, baseType: !492, size: 32, offset: 10752)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !687, file: !559, line: 2396, baseType: !491, size: 32, offset: 10784)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !687, file: !559, line: 2397, baseType: !492, size: 32, offset: 10816)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !687, file: !559, line: 2398, baseType: !492, size: 32, offset: 10848)
!719 = !{!552, !720}
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !676, file: !675, line: 161, type: !722, isLocal: true, isDefinition: true, align: 128)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 48, elements: !598)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!724 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !727, line: 51, size: 64, elements: !728)
!727 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!728 = !{!729, !736}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !726, file: !727, line: 60, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DISubroutineType(types: !732)
!732 = !{!103, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !727, line: 48, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !726, file: !727, line: 65, baseType: !733, size: 32, offset: 32)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !739, file: !974, line: 733, type: !1075, isLocal: false, isDefinition: true, align: 32)
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !741, retainedTypes: !884, globals: !970, splitDebugInlining: false, nameTableKind: None)
!740 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/ipm/ipm_mcux")
!741 = !{!742, !748, !30, !753, !758, !765, !773, !781, !790, !794, !849, !856, !875}
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !743, line: 23, baseType: !32, size: 32, elements: !744)
!743 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!744 = !{!745, !746, !747}
!745 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!746 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!747 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !743, line: 48, baseType: !32, size: 32, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!751 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!752 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 167, baseType: !32, size: 32, elements: !755)
!754 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = !{!756, !757}
!756 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!757 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!758 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 107, baseType: !32, size: 32, elements: !759)
!759 = !{!760, !761, !762, !763, !764}
!760 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!761 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!762 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!763 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!764 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 208, baseType: !32, size: 32, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772}
!767 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!768 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!769 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!770 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!771 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!772 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 261, baseType: !32, size: 32, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780}
!775 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!776 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!777 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!778 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!779 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!780 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 237, baseType: !32, size: 32, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789}
!783 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!784 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!785 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!786 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!787 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!788 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!789 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 152, baseType: !32, size: 32, elements: !791)
!791 = !{!792, !793}
!792 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!793 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !559, line: 71, baseType: !103, size: 32, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!796 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!797 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!798 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!799 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!800 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!801 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!802 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!803 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!804 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!805 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!806 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!807 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!808 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!809 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!810 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!811 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!812 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!813 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!814 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!815 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!816 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!817 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!818 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!819 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!820 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!821 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!822 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!823 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!824 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!825 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!826 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!827 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!828 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!829 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!830 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!831 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!832 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!833 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!834 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!835 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!836 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!837 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!838 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!839 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!840 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!841 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!842 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!843 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!844 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!845 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!846 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!847 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!848 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!849 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !850, line: 44, baseType: !32, size: 32, elements: !851)
!850 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !{!852, !853, !854, !855}
!852 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!853 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!854 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!855 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !857, line: 54, baseType: !32, size: 32, elements: !858)
!857 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874}
!859 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!860 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!861 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!862 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!863 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!864 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!865 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!866 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!867 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!868 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!869 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!870 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!871 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!872 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!873 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!874 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !876, line: 53, baseType: !32, size: 32, elements: !877)
!876 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!877 = !{!878, !879, !880, !881, !882, !883}
!878 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!879 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!880 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!881 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!882 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!883 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!884 = !{!742, !104, !103, !885, !934, !935, !936, !937, !198, !142, !219, !134, !637, !938, !275, !939, !969, !262}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !559, line: 1022, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 979, size: 11712, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !900, !901, !902, !903, !904, !905, !906, !907, !908, !912, !913, !914, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !887, file: !559, line: 980, baseType: !492, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !887, file: !559, line: 981, baseType: !492, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !887, file: !559, line: 982, baseType: !492, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !887, file: !559, line: 983, baseType: !492, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !887, file: !559, line: 984, baseType: !492, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !887, file: !559, line: 985, baseType: !492, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !887, file: !559, line: 986, baseType: !492, size: 32, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !887, file: !559, line: 987, baseType: !897, size: 1824, offset: 224)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 1824, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 57)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !887, file: !559, line: 988, baseType: !492, size: 32, offset: 2048)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !887, file: !559, line: 989, baseType: !492, size: 32, offset: 2080)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !887, file: !559, line: 990, baseType: !491, size: 32, offset: 2112)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !887, file: !559, line: 991, baseType: !492, size: 32, offset: 2144)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !887, file: !559, line: 992, baseType: !492, size: 32, offset: 2176)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !887, file: !559, line: 993, baseType: !668, size: 160, offset: 2208)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !887, file: !559, line: 994, baseType: !492, size: 32, offset: 2368)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !887, file: !559, line: 996, baseType: !492, size: 32, offset: 2400)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !887, file: !559, line: 998, baseType: !909, size: 3744, offset: 2432)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 3744, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 117)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !887, file: !559, line: 999, baseType: !492, size: 32, offset: 6176)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !887, file: !559, line: 1000, baseType: !492, size: 32, offset: 6208)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !887, file: !559, line: 1001, baseType: !915, size: 2016, offset: 6240)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 2016, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 63)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !887, file: !559, line: 1002, baseType: !491, size: 32, offset: 8256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !887, file: !559, line: 1004, baseType: !491, size: 32, offset: 8288)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !887, file: !559, line: 1005, baseType: !491, size: 32, offset: 8320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !887, file: !559, line: 1006, baseType: !491, size: 32, offset: 8352)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !887, file: !559, line: 1008, baseType: !491, size: 32, offset: 8384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !887, file: !559, line: 1009, baseType: !491, size: 32, offset: 8416)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !887, file: !559, line: 1011, baseType: !697, size: 1984, offset: 8448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !887, file: !559, line: 1012, baseType: !492, size: 32, offset: 10432)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !887, file: !559, line: 1013, baseType: !597, size: 96, offset: 10464)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !887, file: !559, line: 1014, baseType: !492, size: 32, offset: 10560)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !887, file: !559, line: 1016, baseType: !597, size: 96, offset: 10592)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !887, file: !559, line: 1017, baseType: !492, size: 32, offset: 10688)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !887, file: !559, line: 1018, baseType: !712, size: 256, offset: 10720)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !887, file: !559, line: 1019, baseType: !492, size: 32, offset: 10976)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !887, file: !559, line: 1020, baseType: !612, size: 672, offset: 11008)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !887, file: !559, line: 1021, baseType: !492, size: 32, offset: 11680)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !754, line: 146, baseType: !758)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !754, line: 164, baseType: !790)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !487, line: 426, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !487, line: 411, size: 28704, elements: !942)
!942 = !{!943, !945, !949, !950, !951, !952, !953, !954, !955, !956, !960, !964, !968}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !941, file: !487, line: 413, baseType: !944, size: 256)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 256, elements: !713)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !941, file: !487, line: 414, baseType: !946, size: 768, offset: 256)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 768, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 24)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !941, file: !487, line: 415, baseType: !944, size: 256, offset: 1024)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !941, file: !487, line: 416, baseType: !946, size: 768, offset: 1280)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !941, file: !487, line: 417, baseType: !944, size: 256, offset: 2048)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !941, file: !487, line: 418, baseType: !946, size: 768, offset: 2304)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !941, file: !487, line: 419, baseType: !944, size: 256, offset: 3072)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !941, file: !487, line: 420, baseType: !946, size: 768, offset: 3328)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !941, file: !487, line: 421, baseType: !944, size: 256, offset: 4096)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !941, file: !487, line: 422, baseType: !957, size: 1792, offset: 4352)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 1792, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 56)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !941, file: !487, line: 423, baseType: !961, size: 1920, offset: 6144)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 1920, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 240)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !941, file: !487, line: 424, baseType: !965, size: 20608, offset: 8064)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 20608, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 644)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !941, file: !487, line: 425, baseType: !492, size: 32, offset: 28672)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !850, line: 56, baseType: !104)
!970 = !{!971, !1021, !1062, !737, !1065, !1090, !1092, !1109, !1111, !1121, !1124, !1139, !1177, !1191}
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "on", scope: !973, file: !974, line: 549, type: !252, isLocal: true, isDefinition: true)
!973 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !974, file: !974, line: 547, type: !975, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !739, retainedNodes: !977)
!974 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!975 = !DISubroutineType(types: !976)
!976 = !{null, !748}
!977 = !{!978, !979, !982}
!978 = !DILocalVariable(name: "start_mode", arg: 1, scope: !973, file: !974, line: 547, type: !748)
!979 = !DILocalVariable(name: "err", scope: !980, file: !974, line: 553, type: !103)
!980 = distinct !DILexicalBlock(scope: !981, file: !974, line: 552, column: 31)
!981 = distinct !DILexicalBlock(scope: !973, file: !974, line: 552, column: 6)
!982 = !DILocalVariable(name: "mgr", scope: !980, file: !974, line: 554, type: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !985, line: 154, size: 224, elements: !986)
!985 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!986 = !{!987, !999, !1000, !1016, !1018, !1019, !1020}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !984, file: !985, line: 158, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !208, line: 40, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !208, line: 35, size: 64, elements: !990)
!990 = !{!991, !998}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !989, file: !208, line: 36, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !208, line: 33, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !208, line: 29, size: 32, elements: !995)
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !994, file: !208, line: 30, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !989, file: !208, line: 37, baseType: !992, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !984, file: !985, line: 163, baseType: !988, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !984, file: !985, line: 166, baseType: !1001, size: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !985, line: 133, size: 96, elements: !1004)
!1004 = !{!1005, !1014, !1015}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1003, file: !985, line: 135, baseType: !1006, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !985, line: 129, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !983, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !985, line: 101, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{null, !983, !103}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1003, file: !985, line: 138, baseType: !1006, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1003, file: !985, line: 143, baseType: !1006, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !984, file: !985, line: 169, baseType: !1017, offset: 160)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !226, line: 43, elements: !227)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !984, file: !985, line: 172, baseType: !103, size: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !984, file: !985, line: 175, baseType: !404, size: 16, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !984, file: !985, line: 178, baseType: !404, size: 16, offset: 208)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "cli", scope: !973, file: !974, line: 550, type: !1023, isLocal: true, isDefinition: true)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !985, line: 273, size: 128, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1023, file: !985, line: 280, baseType: !993, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !1023, file: !985, line: 283, baseType: !1027, size: 96, offset: 32)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !1028, line: 138, size: 96, elements: !1029)
!1028 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1029 = !{!1030, !1059, !1060}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !1027, file: !1028, line: 149, baseType: !1031, size: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !1028, line: 139, size: 32, elements: !1032)
!1032 = !{!1033, !1054}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1031, file: !1028, line: 145, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !444, line: 5397, size: 128, elements: !1036)
!1036 = !{!1037, !1052, !1053}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !1035, file: !444, line: 5399, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !360, line: 48, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !360, line: 37, size: 64, elements: !1040)
!1040 = !{!1041, !1047}
!1041 = !DIDerivedType(tag: DW_TAG_member, scope: !1039, file: !360, line: 38, baseType: !1042, size: 32)
!1042 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1039, file: !360, line: 38, size: 32, elements: !1043)
!1043 = !{!1044, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1042, file: !360, line: 39, baseType: !1045, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1042, file: !360, line: 40, baseType: !1045, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, scope: !1039, file: !360, line: 42, baseType: !1048, size: 32, offset: 32)
!1048 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1039, file: !360, line: 42, size: 32, elements: !1049)
!1049 = !{!1050, !1051}
