; ModuleID = 'build/arduino_due/drivers/watchdog/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.wdt_timeout_cfg = type { %struct.wdt_window, void (%struct.device*, i32)*, i8 }
%struct.wdt_window = type { i32, i32 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.1, i8*, i32 }
%union.anon.1 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.16 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.1 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!26 = distinct !DIGlobalVariable(name: "handled_event", scope: !27, file: !28, line: 56, type: !50, isLocal: true, isDefinition: true)
!27 = distinct !DISubprogram(name: "wdt_callback", scope: !28, file: !28, line: 54, type: !29, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !60, retainedNodes: !182)
!28 = !DIFile(filename: "zephyr/samples/drivers/watchdog/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !59}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !34, line: 378, size: 192, elements: !35)
!34 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!35 = !{!36, !40, !41, !42, !51, !53}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !34, line: 380, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !33, file: !34, line: 382, baseType: !13, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !33, file: !34, line: 384, baseType: !13, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !33, file: !34, line: 386, baseType: !43, size: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !34, line: 351, size: 16, elements: !45)
!45 = !{!46, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !44, file: !34, line: 359, baseType: !47, size: 8)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !48)
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !44, file: !34, line: 364, baseType: !50, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!50 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !34, line: 388, baseType: !52, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !33, file: !34, line: 396, baseType: !54, size: 32, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !34, line: 43, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !58)
!58 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = distinct !DICompileUnit(language: DW_LANG_C99, file: !61, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !134, globals: !180, splitDebugInlining: false, nameTableKind: None)
!61 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/watchdog/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog")
!62 = !{!63}
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !64, line: 27, baseType: !65, size: 32, elements: !66)
!64 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!67 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!68 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!69 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!70 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!71 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!72 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!73 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!74 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!75 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!76 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!77 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!78 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!79 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!80 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!81 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!82 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!83 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!125 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!126 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!127 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!128 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!129 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!130 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!131 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!132 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!133 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!134 = !{!135, !52, !59, !139, !167, !178}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !136, line: 46, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !138)
!138 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !142, line: 134, size: 128, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !149, !154, !173}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !141, file: !142, line: 135, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !142, line: 113, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{!59, !31, !47}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !141, file: !142, line: 136, baseType: !150, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !142, line: 119, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DISubroutineType(types: !153)
!153 = !{!59, !31}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !141, file: !142, line: 137, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !142, line: 125, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!59, !31, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !142, line: 88, size: 128, elements: !162)
!162 = !{!163, !169, !172}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !161, file: !142, line: 90, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !142, line: 72, size: 64, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !164, file: !142, line: 74, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !65)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !164, file: !142, line: 76, baseType: !167, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !161, file: !142, line: 92, baseType: !170, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !142, line: 85, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !142, line: 104, baseType: !47, size: 8, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !141, file: !142, line: 138, baseType: !174, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !142, line: 132, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DISubroutineType(types: !177)
!177 = !{!59, !31, !59}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !179)
!179 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!180 = !{!181}
!181 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!182 = !{!183, !184}
!183 = !DILocalVariable(name: "wdt_dev", arg: 1, scope: !27, file: !28, line: 54, type: !31)
!184 = !DILocalVariable(name: "channel_id", arg: 2, scope: !27, file: !28, line: 54, type: !59)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !187, file: !257, line: 18, type: !259, isLocal: false, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !196, globals: !254, splitDebugInlining: false, nameTableKind: None)
!188 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog")
!189 = !{!190}
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !191, line: 121, baseType: !65, size: 32, elements: !192)
!191 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!192 = !{!193, !194, !195}
!193 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!194 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!195 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!196 = !{!22, !52, !24, !197, !199, !201, !202, !59, !204, !205, !207, !208, !209, !210, !211, !213, !225, !47, !226, !167, !37}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !203, line: 214, baseType: !65)
!203 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !212)
!212 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !215, line: 78, size: 32, elements: !216)
!215 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!216 = !{!217, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !214, file: !215, line: 80, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !215, line: 45, size: 32, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !218, file: !215, line: 47, baseType: !47, size: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !218, file: !215, line: 50, baseType: !47, size: 8, offset: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !218, file: !215, line: 53, baseType: !47, size: 8, offset: 16)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !218, file: !215, line: 56, baseType: !47, size: 8, offset: 24)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !214, file: !215, line: 82, baseType: !52, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !191, line: 88, size: 128, elements: !228)
!228 = !{!229, !246, !250}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !227, file: !191, line: 89, baseType: !230, size: 96)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !191, line: 66, size: 96, elements: !231)
!231 = !{!232, !243, !244}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !230, file: !191, line: 67, baseType: !233, size: 32)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !191, line: 51, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !233, file: !191, line: 52, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !233, file: !191, line: 52, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !191, line: 52, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !233, file: !191, line: 53, baseType: !167, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !233, file: !191, line: 54, baseType: !167, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !233, file: !191, line: 55, baseType: !167, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !233, file: !191, line: 56, baseType: !167, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !233, file: !191, line: 57, baseType: !167, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !230, file: !191, line: 75, baseType: !13, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !230, file: !191, line: 76, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !191, line: 35, baseType: !167)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !227, file: !191, line: 93, baseType: !247, size: 32, offset: 96)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 4)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !227, file: !191, line: 94, baseType: !251, offset: 128)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: -1)
!254 = !{!185, !255}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !187, file: !257, line: 18, type: !258, isLocal: true, isDefinition: true)
!257 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !261, line: 16, size: 64, elements: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !261, line: 17, baseType: !37, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !260, file: !261, line: 18, baseType: !47, size: 8, offset: 32)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "_char_out", scope: !267, file: !271, line: 54, type: !272, isLocal: false, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !269, globals: !270, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog")
!269 = !{!52, !59}
!270 = !{!265}
!271 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DISubroutineType(types: !274)
!274 = !{!59, !59}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !277, file: !342, line: 235, type: !343, isLocal: true, isDefinition: true, align: 32)
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !279, globals: !341, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog")
!279 = !{!52, !59, !280, !291}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !282, line: 46, baseType: !283)
!282 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 41, size: 128, elements: !284)
!284 = !{!285, !287, !288, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !283, file: !282, line: 42, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !283, file: !282, line: 43, baseType: !286, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !283, file: !282, line: 44, baseType: !289, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !283, file: !282, line: 45, baseType: !289, size: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !293, line: 75, baseType: !294)
!293 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 41, size: 2176, elements: !295)
!295 = !{!296, !297, !298, !299, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !323, !324, !325, !326, !327, !328, !329, !330, !334, !335, !336, !337, !338, !339, !340}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !294, file: !293, line: 42, baseType: !286, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !294, file: !293, line: 43, baseType: !286, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !294, file: !293, line: 44, baseType: !289, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !294, file: !293, line: 45, baseType: !300, size: 32, offset: 96)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 32, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 1)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !294, file: !293, line: 46, baseType: !286, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !294, file: !293, line: 47, baseType: !286, size: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !294, file: !293, line: 48, baseType: !289, size: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !294, file: !293, line: 49, baseType: !286, size: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !294, file: !293, line: 50, baseType: !286, size: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !294, file: !293, line: 51, baseType: !289, size: 32, offset: 288)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !294, file: !293, line: 52, baseType: !286, size: 32, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !294, file: !293, line: 53, baseType: !300, size: 32, offset: 352)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !294, file: !293, line: 54, baseType: !286, size: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !294, file: !293, line: 55, baseType: !300, size: 32, offset: 416)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !294, file: !293, line: 56, baseType: !286, size: 32, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !294, file: !293, line: 57, baseType: !300, size: 32, offset: 480)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !294, file: !293, line: 58, baseType: !316, size: 96, offset: 512)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 96, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 3)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !294, file: !293, line: 59, baseType: !320, size: 160, offset: 608)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 160, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 5)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !294, file: !293, line: 60, baseType: !286, size: 32, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !294, file: !293, line: 61, baseType: !286, size: 32, offset: 800)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !294, file: !293, line: 62, baseType: !289, size: 32, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !294, file: !293, line: 63, baseType: !289, size: 32, offset: 864)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !294, file: !293, line: 64, baseType: !286, size: 32, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !294, file: !293, line: 65, baseType: !286, size: 32, offset: 928)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !294, file: !293, line: 66, baseType: !286, size: 32, offset: 960)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !294, file: !293, line: 67, baseType: !331, size: 832, offset: 992)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 832, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 26)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !294, file: !293, line: 68, baseType: !286, size: 32, offset: 1824)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !294, file: !293, line: 69, baseType: !289, size: 32, offset: 1856)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !294, file: !293, line: 70, baseType: !320, size: 160, offset: 1888)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !294, file: !293, line: 71, baseType: !286, size: 32, offset: 2048)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !294, file: !293, line: 72, baseType: !286, size: 32, offset: 2080)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !294, file: !293, line: 73, baseType: !289, size: 32, offset: 2112)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !294, file: !293, line: 74, baseType: !286, size: 32, offset: 2144)
!341 = !{!275}
!342 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !345, line: 51, size: 64, elements: !346)
!345 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !{!347, !366}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !344, file: !345, line: 60, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DISubroutineType(types: !350)
!350 = !{!59, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !34, line: 378, size: 192, elements: !354)
!354 = !{!355, !356, !357, !358, !364, !365}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !34, line: 380, baseType: !37, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !353, file: !34, line: 382, baseType: !13, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !353, file: !34, line: 384, baseType: !13, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !34, line: 386, baseType: !359, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !34, line: 351, size: 16, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !360, file: !34, line: 359, baseType: !47, size: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !360, file: !34, line: 364, baseType: !50, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !353, file: !34, line: 388, baseType: !52, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !353, file: !34, line: 396, baseType: !54, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !344, file: !345, line: 65, baseType: !351, size: 32, offset: 32)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "log_const_log", scope: !369, file: !445, line: 25, type: !685, isLocal: false, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !371, retainedTypes: !377, globals: !442, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog")
!371 = !{!372, !190, !63}
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !373, line: 33, baseType: !65, size: 32, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!376 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!377 = !{!202, !59, !52, !378, !225, !389, !47, !390, !167, !411, !22, !24, !135, !178, !438, !440}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !215, line: 78, size: 32, elements: !380)
!380 = !{!381, !388}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !379, file: !215, line: 80, baseType: !382, size: 32)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !215, line: 45, size: 32, elements: !383)
!383 = !{!384, !385, !386, !387}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !382, file: !215, line: 47, baseType: !47, size: 8)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !382, file: !215, line: 50, baseType: !47, size: 8, offset: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !382, file: !215, line: 53, baseType: !47, size: 8, offset: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !382, file: !215, line: 56, baseType: !47, size: 8, offset: 24)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !379, file: !215, line: 82, baseType: !52, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !191, line: 88, size: 128, elements: !392)
!392 = !{!393, !409, !410}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !391, file: !191, line: 89, baseType: !394, size: 96)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !191, line: 66, size: 96, elements: !395)
!395 = !{!396, !407, !408}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !394, file: !191, line: 67, baseType: !397, size: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !191, line: 51, size: 32, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !397, file: !191, line: 52, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !397, file: !191, line: 52, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !397, file: !191, line: 52, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !397, file: !191, line: 53, baseType: !167, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !191, line: 54, baseType: !167, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !397, file: !191, line: 55, baseType: !167, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !397, file: !191, line: 56, baseType: !167, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !397, file: !191, line: 57, baseType: !167, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !394, file: !191, line: 75, baseType: !13, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !394, file: !191, line: 76, baseType: !245, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !391, file: !191, line: 93, baseType: !247, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !391, file: !191, line: 94, baseType: !251, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !191, line: 111, size: 128, elements: !413)
!413 = !{!414, !431, !437}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !412, file: !191, line: 112, baseType: !415, size: 32)
!415 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !416, line: 49, size: 32, elements: !417)
!416 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !{!418, !424, !430}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !415, file: !416, line: 50, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !416, line: 37, size: 32, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !419, file: !416, line: 38, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !419, file: !416, line: 38, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !419, file: !416, line: 39, baseType: !167, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !415, file: !416, line: 51, baseType: !425, size: 32)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !416, line: 43, size: 32, elements: !426)
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !425, file: !416, line: 44, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !425, file: !416, line: 44, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !425, file: !416, line: 45, baseType: !167, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !415, file: !416, line: 52, baseType: !167, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !412, file: !191, line: 113, baseType: !432, size: 32)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !191, line: 107, size: 32, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !432, file: !191, line: 108, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !432, file: !191, line: 108, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !191, line: 108, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !412, file: !191, line: 114, baseType: !391, size: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!442 = !{!367, !443, !472, !485, !487, !489, !493, !495, !497, !499, !501, !503, !509, !542, !545, !554, !646, !673, !680, !682, !690, !700, !705, !720, !724}
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !369, file: !445, line: 93, type: !446, isLocal: false, isDefinition: true, align: 32)
!445 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !447, line: 2909, size: 128, elements: !448)
!447 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!448 = !{!449, !470, !471}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !446, file: !447, line: 2910, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !451, line: 233, baseType: !452)
!451 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 231, size: 64, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !452, file: !451, line: 232, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !456, line: 48, baseType: !457)
!456 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !456, line: 37, size: 64, elements: !458)
!458 = !{!459, !465}
!459 = !DIDerivedType(tag: DW_TAG_member, scope: !457, file: !456, line: 38, baseType: !460, size: 32)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !457, file: !456, line: 38, size: 32, elements: !461)
!461 = !{!462, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !460, file: !456, line: 39, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !456, line: 40, baseType: !463, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, scope: !457, file: !456, line: 42, baseType: !466, size: 32, offset: 32)
!466 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !457, file: !456, line: 42, size: 32, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !466, file: !456, line: 43, baseType: !463, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !466, file: !456, line: 44, baseType: !463, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !446, file: !447, line: 2911, baseType: !65, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !446, file: !447, line: 2912, baseType: !65, size: 32, offset: 96)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !369, file: !445, line: 910, type: !474, isLocal: true, isDefinition: true, align: 32)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !345, line: 51, size: 64, elements: !476)
!476 = !{!477, !484}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !475, file: !345, line: 60, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DISubroutineType(types: !480)
!480 = !{!59, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !345, line: 48, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !475, file: !345, line: 65, baseType: !481, size: 32, offset: 32)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "panic_mode", scope: !369, file: !445, line: 96, type: !50, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "backend_attached", scope: !369, file: !445, line: 97, type: !50, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !369, file: !445, line: 98, type: !491, isLocal: true, isDefinition: true)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !492, line: 22, baseType: !206)
!492 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !369, file: !445, line: 99, type: !491, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !369, file: !445, line: 105, type: !167, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !369, file: !445, line: 107, type: !245, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !369, file: !445, line: 108, type: !491, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !369, file: !445, line: 109, type: !178, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !369, file: !445, line: 111, type: !505, isLocal: true, isDefinition: true, align: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !506, line: 29, size: 32, elements: !507)
!506 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !505, file: !506, line: 30, baseType: !411, size: 32)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "log_buffer", scope: !369, file: !445, line: 112, type: !511, isLocal: true, isDefinition: true, align: 32)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !512, line: 87, size: 448, elements: !513)
!512 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!513 = !{!514, !515, !516, !517, !518, !519, !523, !532, !537, !539, !540, !541}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !511, file: !512, line: 89, baseType: !167, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !511, file: !512, line: 92, baseType: !167, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !511, file: !512, line: 95, baseType: !167, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !511, file: !512, line: 98, baseType: !167, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !511, file: !512, line: 101, baseType: !167, size: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !511, file: !512, line: 104, baseType: !520, offset: 160)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !521, line: 43, elements: !522)
!521 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = !{}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !511, file: !512, line: 110, baseType: !524, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !512, line: 83, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !528, !530}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !511, file: !512, line: 113, baseType: !533, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !512, line: 75, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DISubroutineType(types: !536)
!536 = !{!167, !530}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !511, file: !512, line: 116, baseType: !538, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !512, line: 119, baseType: !167, size: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !511, file: !512, line: 122, baseType: !167, size: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !511, file: !512, line: 124, baseType: !446, size: 128, offset: 320)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !369, file: !445, line: 113, type: !544, isLocal: true, isDefinition: true)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "logging_stack", scope: !369, file: !445, line: 884, type: !547, isLocal: false, isDefinition: true, align: 512)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 6656, elements: !552)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !549, line: 47, size: 8, elements: !550)
!549 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !548, file: !549, line: 48, baseType: !39, size: 8)
!552 = !{!553}
!553 = !DISubrange(count: 832)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "logging_thread", scope: !369, file: !445, line: 885, type: !556, isLocal: false, isDefinition: true)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !557, line: 245, size: 1024, elements: !558)
!557 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!558 = !{!559, !604, !617, !618, !619, !620, !626, !641}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !556, file: !557, line: 247, baseType: !560, size: 384)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !557, line: 57, size: 384, elements: !561)
!561 = !{!562, !576, !578, !579, !580, !591, !592, !593}
!562 = !DIDerivedType(tag: DW_TAG_member, scope: !560, file: !557, line: 60, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !560, file: !557, line: 60, size: 64, elements: !564)
!564 = !{!565, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !563, file: !557, line: 61, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !456, line: 49, baseType: !457)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !563, file: !557, line: 62, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !569, line: 49, size: 64, elements: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !568, file: !569, line: 50, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 64, elements: !574)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!574 = !{!575}
!575 = !DISubrange(count: 2)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !560, file: !557, line: 68, baseType: !577, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !560, file: !557, line: 71, baseType: !47, size: 8, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !560, file: !557, line: 74, baseType: !47, size: 8, offset: 104)
!580 = !DIDerivedType(tag: DW_TAG_member, scope: !560, file: !557, line: 90, baseType: !581, size: 16, offset: 112)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !560, file: !557, line: 90, size: 16, elements: !582)
!582 = !{!583, !590}
!583 = !DIDerivedType(tag: DW_TAG_member, scope: !581, file: !557, line: 91, baseType: !584, size: 16)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !557, line: 91, size: 16, elements: !585)
!585 = !{!586, !589}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !584, file: !557, line: 96, baseType: !587, size: 8)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !588)
!588 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !584, file: !557, line: 97, baseType: !47, size: 8, offset: 8)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !581, file: !557, line: 100, baseType: !211, size: 16)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !560, file: !557, line: 107, baseType: !167, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !560, file: !557, line: 127, baseType: !52, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !560, file: !557, line: 131, baseType: !594, size: 192, offset: 192)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !451, line: 244, size: 192, elements: !595)
!595 = !{!596, !597, !603}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !594, file: !451, line: 245, baseType: !566, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !594, file: !451, line: 246, baseType: !598, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !451, line: 242, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !594, file: !451, line: 249, baseType: !137, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !556, file: !557, line: 250, baseType: !605, size: 288, offset: 384)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !606, line: 25, size: 288, elements: !607)
!606 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !605, file: !606, line: 26, baseType: !167, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !605, file: !606, line: 27, baseType: !167, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !605, file: !606, line: 28, baseType: !167, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !605, file: !606, line: 29, baseType: !167, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !605, file: !606, line: 30, baseType: !167, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !605, file: !606, line: 31, baseType: !167, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !605, file: !606, line: 32, baseType: !167, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !605, file: !606, line: 33, baseType: !167, size: 32, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !605, file: !606, line: 34, baseType: !167, size: 32, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !556, file: !557, line: 253, baseType: !52, size: 32, offset: 672)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !556, file: !557, line: 256, baseType: !450, size: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !556, file: !557, line: 294, baseType: !59, size: 32, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !556, file: !557, line: 300, baseType: !621, size: 96, offset: 800)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !557, line: 149, size: 96, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !621, file: !557, line: 153, baseType: !22, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !621, file: !557, line: 162, baseType: !202, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !621, file: !557, line: 168, baseType: !202, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !556, file: !557, line: 325, baseType: !627, size: 32, offset: 896)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !447, line: 5073, size: 160, elements: !629)
!629 = !{!630, !639, !640}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !628, file: !447, line: 5074, baseType: !631, size: 96)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !632, line: 56, size: 96, elements: !633)
!632 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!633 = !{!634, !637, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !631, file: !632, line: 57, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !632, line: 57, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !631, file: !632, line: 58, baseType: !52, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !631, file: !632, line: 59, baseType: !202, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !628, file: !447, line: 5075, baseType: !450, size: 64, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !628, file: !447, line: 5076, baseType: !520, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !556, file: !557, line: 343, baseType: !642, size: 64, offset: 928)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !606, line: 60, size: 64, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !642, file: !606, line: 63, baseType: !167, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !642, file: !606, line: 66, baseType: !167, size: 32, offset: 32)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "format_table", scope: !369, file: !445, line: 72, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 128, elements: !248)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !651, line: 105, baseType: !652)
!651 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !655, !390, !167}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !651, line: 89, size: 128, elements: !658)
!658 = !{!659, !664, !671, !672}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !657, file: !651, line: 90, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !651, line: 79, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DISubroutineType(types: !663)
!663 = !{!59, !210, !202, !52}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !657, file: !651, line: 91, baseType: !665, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !651, line: 82, size: 96, elements: !667)
!667 = !{!668, !669, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !666, file: !651, line: 83, baseType: !491, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !666, file: !651, line: 84, baseType: !52, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !666, file: !651, line: 85, baseType: !37, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !657, file: !651, line: 92, baseType: !210, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !657, file: !651, line: 93, baseType: !202, size: 32, offset: 96)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !369, file: !445, line: 104, type: !675, isLocal: true, isDefinition: true)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !676, line: 33, baseType: !677)
!676 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DISubroutineType(types: !679)
!679 = !{!245}
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "initialized", scope: !369, file: !445, line: 95, type: !491, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !369, file: !445, line: 25, type: !684, isLocal: true, isDefinition: true)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !261, line: 16, size: 64, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !261, line: 17, baseType: !37, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !686, file: !261, line: 18, baseType: !47, size: 8, offset: 32)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !369, file: !445, line: 121, type: !692, isLocal: true, isDefinition: true)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !512, line: 128, size: 160, elements: !694)
!694 = !{!695, !696, !697, !698, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !693, file: !512, line: 130, baseType: !538, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !693, file: !512, line: 133, baseType: !167, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !693, file: !512, line: 136, baseType: !524, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !693, file: !512, line: 137, baseType: !533, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !512, line: 140, baseType: !167, size: 32, offset: 128)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "buf32", scope: !369, file: !445, line: 116, type: !702, isLocal: true, isDefinition: true, align: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 8192, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 256)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "process_lock", scope: !707, file: !445, line: 157, type: !520, isLocal: true, isDefinition: true)
!707 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !445, file: !445, line: 152, type: !708, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !369, retainedNodes: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{null}
!710 = !{!711, !713}
!711 = !DILocalVariable(name: "cnt", scope: !707, file: !445, line: 154, type: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !492, line: 23, baseType: !491)
!713 = !DILocalVariable(name: "key", scope: !714, file: !445, line: 158, type: !716)
!714 = distinct !DILexicalBlock(scope: !715, file: !445, line: 156, column: 18)
!715 = distinct !DILexicalBlock(scope: !707, file: !445, line: 156, column: 6)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !521, line: 106, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !521, line: 32, size: 32, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !717, file: !521, line: 33, baseType: !59, size: 32)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "proc_tid", scope: !369, file: !445, line: 100, type: !722, isLocal: true, isDefinition: true)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !557, line: 347, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !369, file: !445, line: 101, type: !726, isLocal: true, isDefinition: true)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !447, line: 1318, size: 448, elements: !727)
!727 = !{!728, !729, !730, !735, !736, !741, !742}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !726, file: !447, line: 1324, baseType: !594, size: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !726, file: !447, line: 1327, baseType: !450, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !726, file: !447, line: 1330, baseType: !731, size: 32, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !726, file: !447, line: 1333, baseType: !731, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !726, file: !447, line: 1336, baseType: !737, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !136, line: 67, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 65, size: 64, elements: !739)
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !738, file: !136, line: 66, baseType: !135, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !726, file: !447, line: 1339, baseType: !167, size: 32, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !726, file: !447, line: 1342, baseType: !52, size: 32, offset: 416)
!743 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!744 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !747, file: !756, line: 14, type: !987, isLocal: false, isDefinition: true)
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !749, retainedTypes: !750, globals: !753, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/watchdog")
!749 = !{!372, !63}
!750 = !{!52, !59, !751, !210, !37, !22}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!753 = !{!745, !754, !782, !964, !966, !978, !980, !985}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "sname_cache", scope: !747, file: !756, line: 44, type: !757, isLocal: true, isDefinition: true)
!756 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !758, line: 30, size: 256, elements: !759)
!758 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!759 = !{!760, !773, !774, !779, !780, !781}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !757, file: !758, line: 31, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !762, line: 40, baseType: !763)
!762 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !762, line: 35, size: 64, elements: !764)
!764 = !{!765, !772}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !763, file: !762, line: 36, baseType: !766, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !762, line: 33, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !762, line: 29, size: 32, elements: !769)
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !768, file: !762, line: 30, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !763, file: !762, line: 37, baseType: !766, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !757, file: !758, line: 32, baseType: !761, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !757, file: !758, line: 33, baseType: !775, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !758, line: 21, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{!50, !22, !22}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !757, file: !758, line: 34, baseType: !167, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !757, file: !758, line: 35, baseType: !167, size: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !757, file: !758, line: 36, baseType: !202, size: 32, offset: 224)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !784, file: !756, line: 261, type: !37, isLocal: true, isDefinition: true)
!784 = distinct !DISubprogram(name: "link_domain_name_get", scope: !756, file: !756, line: 256, type: !785, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !747, retainedNodes: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{!37, !47}
!787 = !{!788, !789, !790, !791, !792, !795, !963}
!788 = !DILocalVariable(name: "domain_id", arg: 1, scope: !784, file: !756, line: 256, type: !47)
!789 = !DILocalVariable(name: "cached", scope: !784, file: !756, line: 258, type: !210)
!790 = !DILocalVariable(name: "cache_size", scope: !784, file: !756, line: 259, type: !202)
!791 = !DILocalVariable(name: "id", scope: !784, file: !756, line: 260, type: !22)
!792 = !DILocalVariable(name: "rel_domain_id", scope: !793, file: !756, line: 265, type: !47)
!793 = distinct !DILexicalBlock(scope: !794, file: !756, line: 264, column: 49)
!794 = distinct !DILexicalBlock(scope: !784, file: !756, line: 264, column: 6)
!795 = !DILocalVariable(name: "link", scope: !793, file: !756, line: 266, type: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !799, line: 61, size: 192, elements: !800)
!799 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!800 = !{!801, !890, !891, !900, !901, !953}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !798, file: !799, line: 62, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !799, line: 38, size: 192, elements: !805)
!805 = !{!806, !869, !873, !878, !882, !886}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !804, file: !799, line: 39, baseType: !807, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DISubroutineType(types: !809)
!809 = !{!59, !796, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !799, line: 33, size: 64, elements: !812)
!812 = !{!813, !864}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !811, file: !799, line: 34, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !799, line: 27, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !796, !818}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !191, line: 111, size: 128, elements: !820)
!820 = !{!821, !837, !843}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !819, file: !191, line: 112, baseType: !822, size: 32)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !416, line: 49, size: 32, elements: !823)
!823 = !{!824, !830, !836}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !822, file: !416, line: 50, baseType: !825, size: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !416, line: 37, size: 32, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !825, file: !416, line: 38, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !825, file: !416, line: 38, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !825, file: !416, line: 39, baseType: !167, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !822, file: !416, line: 51, baseType: !831, size: 32)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !416, line: 43, size: 32, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !831, file: !416, line: 44, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !831, file: !416, line: 44, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !831, file: !416, line: 45, baseType: !167, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !822, file: !416, line: 52, baseType: !167, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !819, file: !191, line: 113, baseType: !838, size: 32)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !191, line: 107, size: 32, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !838, file: !191, line: 108, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !838, file: !191, line: 108, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !838, file: !191, line: 108, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !819, file: !191, line: 114, baseType: !844, size: 128)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !191, line: 88, size: 128, elements: !845)
!845 = !{!846, !862, !863}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !844, file: !191, line: 89, baseType: !847, size: 96)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !191, line: 66, size: 96, elements: !848)
!848 = !{!849, !860, !861}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !847, file: !191, line: 67, baseType: !850, size: 32)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !191, line: 51, size: 32, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !850, file: !191, line: 52, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !850, file: !191, line: 52, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !850, file: !191, line: 52, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !850, file: !191, line: 53, baseType: !167, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !850, file: !191, line: 54, baseType: !167, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !850, file: !191, line: 55, baseType: !167, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !850, file: !191, line: 56, baseType: !167, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !850, file: !191, line: 57, baseType: !167, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !847, file: !191, line: 75, baseType: !13, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !847, file: !191, line: 76, baseType: !245, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !844, file: !191, line: 93, baseType: !247, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !844, file: !191, line: 94, baseType: !251, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !811, file: !799, line: 35, baseType: !865, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !799, line: 30, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !796, !167}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !804, file: !799, line: 40, baseType: !870, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DISubroutineType(types: !872)
!872 = !{!59, !796}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !804, file: !799, line: 41, baseType: !874, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DISubroutineType(types: !876)
!876 = !{!59, !796, !167, !209, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !804, file: !799, line: 43, baseType: !879, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DISubroutineType(types: !881)
!881 = !{!59, !796, !167, !211, !209, !877}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !804, file: !799, line: 45, baseType: !883, size: 32, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!884 = !DISubroutineType(types: !885)
!885 = !{!59, !796, !167, !211, !210, !210}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !804, file: !799, line: 48, baseType: !887, size: 32, offset: 160)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DISubroutineType(types: !889)
!889 = !{!59, !796, !167, !211, !47}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !799, line: 63, baseType: !37, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !798, file: !799, line: 64, baseType: !892, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !799, line: 52, size: 128, elements: !894)
!894 = !{!895, !896, !898, !899}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !893, file: !799, line: 53, baseType: !167, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !893, file: !799, line: 54, baseType: !897, size: 16, offset: 32)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 16, elements: !301)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !893, file: !799, line: 57, baseType: !167, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !893, file: !799, line: 58, baseType: !538, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !798, file: !799, line: 65, baseType: !52, size: 32, offset: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !798, file: !799, line: 66, baseType: !902, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !512, line: 87, size: 448, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !912, !921, !926, !927, !928, !929}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !903, file: !512, line: 89, baseType: !167, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !903, file: !512, line: 92, baseType: !167, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !903, file: !512, line: 95, baseType: !167, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !903, file: !512, line: 98, baseType: !167, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !512, line: 101, baseType: !167, size: 32, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !903, file: !512, line: 104, baseType: !911, offset: 160)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !521, line: 43, elements: !522)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !903, file: !512, line: 110, baseType: !913, size: 32, offset: 160)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !512, line: 83, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !917, !919}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !903, file: !512, line: 113, baseType: !922, size: 32, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !512, line: 75, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DISubroutineType(types: !925)
!925 = !{!167, !919}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !903, file: !512, line: 116, baseType: !538, size: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !903, file: !512, line: 119, baseType: !167, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !903, file: !512, line: 122, baseType: !167, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !903, file: !512, line: 124, baseType: !930, size: 128, offset: 320)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !447, line: 2909, size: 128, elements: !931)
!931 = !{!932, !951, !952}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !930, file: !447, line: 2910, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !451, line: 233, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 231, size: 64, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !934, file: !451, line: 232, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !456, line: 48, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !456, line: 37, size: 64, elements: !939)
!939 = !{!940, !946}
!940 = !DIDerivedType(tag: DW_TAG_member, scope: !938, file: !456, line: 38, baseType: !941, size: 32)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !938, file: !456, line: 38, size: 32, elements: !942)
!942 = !{!943, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !941, file: !456, line: 39, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !941, file: !456, line: 40, baseType: !944, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, scope: !938, file: !456, line: 42, baseType: !947, size: 32, offset: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !938, file: !456, line: 42, size: 32, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !947, file: !456, line: 43, baseType: !944, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !947, file: !456, line: 44, baseType: !944, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !930, file: !447, line: 2911, baseType: !65, size: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !930, file: !447, line: 2912, baseType: !65, size: 32, offset: 96)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !798, file: !799, line: 67, baseType: !954, size: 32, offset: 160)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !512, line: 128, size: 160, elements: !957)
!957 = !{!958, !959, !960, !961, !962}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !956, file: !512, line: 130, baseType: !538, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !956, file: !512, line: 133, baseType: !167, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !956, file: !512, line: 136, baseType: !913, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !956, file: !512, line: 137, baseType: !922, size: 32, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !956, file: !512, line: 140, baseType: !167, size: 32, offset: 128)
!963 = !DILocalVariable(name: "err", scope: !793, file: !756, line: 267, type: !59)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "dname_cache", scope: !747, file: !756, line: 43, type: !757, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "dname_cache_config", scope: !968, file: !756, line: 152, type: !971, isLocal: true, isDefinition: true)
!968 = distinct !DISubprogram(name: "cache_init", scope: !756, file: !756, line: 149, type: !708, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !747, retainedNodes: !969)
!969 = !{!970}
!970 = !DILocalVariable(name: "err", scope: !968, file: !756, line: 151, type: !59)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache_config", file: !758, line: 23, size: 128, elements: !973)
!973 = !{!974, !975, !976, !977}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !972, file: !758, line: 24, baseType: !52, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !972, file: !758, line: 25, baseType: !202, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !972, file: !758, line: 26, baseType: !202, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !972, file: !758, line: 27, baseType: !775, size: 32, offset: 96)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "sname_cache_config", scope: !968, file: !756, line: 158, type: !971, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "dname_cache_buffer", scope: !747, file: !756, line: 40, type: !982, isLocal: true, isDefinition: true, align: 32)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 72, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 9)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "sname_cache_buffer", scope: !747, file: !756, line: 41, type: !982, isLocal: true, isDefinition: true, align: 32)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !261, line: 16, size: 64, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !261, line: 17, baseType: !37, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !988, file: !261, line: 18, baseType: !47, size: 8, offset: 32)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "prefix", scope: !994, file: !995, line: 562, type: !1038, isLocal: true, isDefinition: true)
!994 = distinct !DISubprogram(name: "log_output_dropped_process", scope: !995, file: !995, line: 558, type: !996, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1012, retainedNodes: !1031)
!995 = !DIFile(filename: "zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!996 = !DISubroutineType(types: !997)
!997 = !{null, !998, !167}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !651, line: 89, size: 128, elements: !1001)
!1001 = !{!1002, !1003, !1010, !1011}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1000, file: !651, line: 90, baseType: !660, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !1000, file: !651, line: 91, baseType: !1004, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !651, line: 82, size: 96, elements: !1006)
!1006 = !{!1007, !1008, !1009}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1005, file: !651, line: 83, baseType: !491, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1005, file: !651, line: 84, baseType: !52, size: 32, offset: 32)
