; ModuleID = './build/des_encrypt_decrypt_data.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_aes_buffer_t = type { i8*, i32 }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque

!109 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!110 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!111 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!112 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!113 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!114 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!115 = !{!116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !71, line: 95, baseType: !70)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 43, baseType: !55)
!120 = !{!59, !121}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "g_aes_op_done", scope: !61, file: !62, line: 71, type: !123, isLocal: true, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !124)
!124 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !127, file: !128, line: 51, type: !123, isLocal: false, isDefinition: true)
!127 = distinct !DICompileUnit(language: DW_LANG_C99, file: !128, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !129, retainedTypes: !176, globals: !206, splitDebugInlining: false, nameTableKind: None)
!128 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!129 = !{!130, !141, !160, !167}
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 163, baseType: !66, size: 32, elements: !132)
!131 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140}
!133 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!134 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!135 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!136 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!137 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!138 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!139 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!140 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 186, baseType: !7, size: 32, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!143 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!144 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!145 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!146 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!147 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!148 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!149 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!150 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!151 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!152 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!153 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!154 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!155 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!156 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!157 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!158 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!159 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 176, baseType: !7, size: 32, elements: !161)
!161 = !{!162, !163, !164, !165, !166}
!162 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!163 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!164 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!165 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!166 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 99, baseType: !7, size: 32, elements: !169)
!168 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!169 = !{!170, !171, !172, !173, !174, !175}
!170 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!171 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!172 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!173 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!174 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!175 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!176 = !{!177, !116}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !179, line: 72, baseType: !180)
!179 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 56, size: 525312, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !196, !197, !201, !205}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !180, file: !179, line: 57, baseType: !11, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !180, file: !179, line: 58, baseType: !11, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !180, file: !179, line: 59, baseType: !11, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !180, file: !179, line: 60, baseType: !11, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !180, file: !179, line: 61, baseType: !11, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !180, file: !179, line: 62, baseType: !11, size: 32, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !180, file: !179, line: 63, baseType: !11, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !180, file: !179, line: 64, baseType: !11, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !180, file: !179, line: 65, baseType: !11, size: 32, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !180, file: !179, line: 66, baseType: !11, size: 32, offset: 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !180, file: !179, line: 67, baseType: !193, size: 32, offset: 320)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !180, file: !179, line: 68, baseType: !11, size: 32, offset: 352)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !180, file: !179, line: 69, baseType: !198, size: 523904, offset: 384)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 523904, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 16372)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !180, file: !179, line: 70, baseType: !202, size: 512, offset: 524288)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !180, file: !179, line: 71, baseType: !202, size: 512, offset: 524800)
!206 = !{!125}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "g_des_op_done", scope: !209, file: !210, line: 51, type: !11, isLocal: true, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !217, globals: !218, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_des.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!211 = !{!212, !70}
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !213, line: 286, baseType: !66, size: 32, elements: !214)
!213 = !DIFile(filename: "../../../../../driver/chip/inc/hal_des.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!214 = !{!215, !216}
!215 = !DIEnumerator(name: "HAL_DES_STATUS_ERROR", value: -1)
!216 = !DIEnumerator(name: "HAL_DES_STATUS_OK", value: 0)
!217 = !{!116, !117}
!218 = !{!207}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !221, file: !222, line: 53, type: !310, isLocal: false, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !232, globals: !309, splitDebugInlining: false, nameTableKind: None)
!222 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!223 = !{!224, !70}
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !225, line: 152, baseType: !66, size: 32, elements: !226)
!225 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!226 = !{!227, !228, !229, !230, !231}
!227 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!228 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!229 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!230 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!231 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!232 = !{!233, !116, !12, !234, !236, !270}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !71, line: 97, baseType: !117)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 44, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 77, baseType: !66)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !238, line: 378, baseType: !239)
!238 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 363, size: 28704, elements: !240)
!240 = !{!241, !245, !249, !250, !251, !252, !253, !254, !255, !256, !260, !265, !269}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !239, file: !238, line: 365, baseType: !242, size: 256)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 8)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !239, file: !238, line: 366, baseType: !246, size: 768, offset: 256)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 24)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !239, file: !238, line: 367, baseType: !242, size: 256, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !239, file: !238, line: 368, baseType: !246, size: 768, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !239, file: !238, line: 369, baseType: !242, size: 256, offset: 2048)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !239, file: !238, line: 370, baseType: !246, size: 768, offset: 2304)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !239, file: !238, line: 371, baseType: !242, size: 256, offset: 3072)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !239, file: !238, line: 372, baseType: !246, size: 768, offset: 3328)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !239, file: !238, line: 373, baseType: !242, size: 256, offset: 4096)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !239, file: !238, line: 374, baseType: !257, size: 1792, offset: 4352)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1792, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 56)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !239, file: !238, line: 375, baseType: !261, size: 1920, offset: 6144)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 1920, elements: !263)
!262 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!263 = !{!264}
!264 = !DISubrange(count: 240)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !239, file: !238, line: 376, baseType: !266, size: 20608, offset: 8064)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 20608, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 644)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !239, file: !238, line: 377, baseType: !11, size: 32, offset: 28672)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !238, line: 418, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 395, size: 1120, elements: !273)
!273 = !{!274, !276, !277, !278, !279, !280, !281, !285, !286, !287, !288, !289, !290, !291, !292, !296, !297, !298, !302, !306, !308}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !272, file: !238, line: 397, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !272, file: !238, line: 398, baseType: !11, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !272, file: !238, line: 399, baseType: !11, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !272, file: !238, line: 400, baseType: !11, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !272, file: !238, line: 401, baseType: !11, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !272, file: !238, line: 402, baseType: !11, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !272, file: !238, line: 403, baseType: !282, size: 96, offset: 192)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 96, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 12)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !272, file: !238, line: 404, baseType: !11, size: 32, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !272, file: !238, line: 405, baseType: !11, size: 32, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !272, file: !238, line: 406, baseType: !11, size: 32, offset: 352)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !272, file: !238, line: 407, baseType: !11, size: 32, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !272, file: !238, line: 408, baseType: !11, size: 32, offset: 416)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !272, file: !238, line: 409, baseType: !11, size: 32, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !272, file: !238, line: 410, baseType: !11, size: 32, offset: 480)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !272, file: !238, line: 411, baseType: !293, size: 64, offset: 512)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 64, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 2)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !272, file: !238, line: 412, baseType: !275, size: 32, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !272, file: !238, line: 413, baseType: !275, size: 32, offset: 608)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !272, file: !238, line: 414, baseType: !299, size: 128, offset: 640)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 128, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 4)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !272, file: !238, line: 415, baseType: !303, size: 160, offset: 768)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 160, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 5)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !272, file: !238, line: 416, baseType: !307, size: 160, offset: 928)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !272, file: !238, line: 417, baseType: !11, size: 32, offset: 1088)
!309 = !{!219}
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 6144, elements: !319)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !222, line: 50, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 47, size: 64, elements: !313)
!313 = !{!314, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !312, file: !222, line: 48, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !233}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !312, file: !222, line: 49, baseType: !12, size: 32, offset: 32)
!319 = !{!320}
!320 = !DISubrange(count: 96)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !323, file: !324, line: 77, type: !393, isLocal: true, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !325, retainedTypes: !376, globals: !378, splitDebugInlining: false, nameTableKind: None)
!324 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!325 = !{!326, !334, !340, !356, !362, !366, !26, !32, !371}
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 345, baseType: !66, size: 32, elements: !328)
!327 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!328 = !{!329, !330, !331, !332, !333}
!329 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!330 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!331 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!332 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!333 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !335, line: 109, baseType: !7, size: 32, elements: !336)
!335 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!336 = !{!337, !338, !339}
!337 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!338 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!339 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 302, baseType: !7, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!342 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!343 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!344 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!345 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!346 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!347 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!348 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!349 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!350 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!351 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!352 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!353 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!354 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!355 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 321, baseType: !7, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361}
!358 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!359 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!360 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!361 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 330, baseType: !7, size: 32, elements: !363)
!363 = !{!364, !365}
!364 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!365 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 337, baseType: !7, size: 32, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!369 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!370 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 355, baseType: !66, size: 32, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!374 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!375 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!376 = !{!7, !116, !55, !377, !118}
!377 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!378 = !{!321, !379}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "func_tbl", scope: !381, file: !324, line: 536, type: !391, isLocal: true, isDefinition: true)
!381 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !324, file: !324, line: 534, type: !382, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !389)
!382 = !DISubroutineType(types: !383)
!383 = !{!384, !388}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !33, line: 197, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DISubroutineType(types: !387)
!387 = !{null}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !335, line: 113, baseType: !334)
!389 = !{!390}
!390 = !DILocalVariable(name: "uart_port", arg: 1, scope: !381, file: !324, line: 534, type: !388)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 64, elements: !294)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 1024, elements: !294)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !324, line: 75, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 68, size: 512, elements: !396)
!396 = !{!397, !398, !410, !411, !422, !423}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !395, file: !324, line: 69, baseType: !124, size: 8)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !395, file: !324, line: 70, baseType: !399, size: 128, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !327, line: 378, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 373, size: 128, elements: !401)
!401 = !{!402, !404, !406, !408}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !400, file: !327, line: 374, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !327, line: 317, baseType: !340)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !400, file: !327, line: 375, baseType: !405, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !327, line: 326, baseType: !356)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !400, file: !327, line: 376, baseType: !407, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !327, line: 333, baseType: !362)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !400, file: !327, line: 377, baseType: !409, size: 32, offset: 96)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !327, line: 341, baseType: !366)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !395, file: !324, line: 71, baseType: !124, size: 8, offset: 160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !395, file: !324, line: 72, baseType: !412, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !324, line: 66, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 63, size: 64, elements: !414)
!414 = !{!415, !421}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !413, file: !324, line: 64, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !327, line: 410, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420, !116}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !327, line: 359, baseType: !371)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !413, file: !324, line: 65, baseType: !116, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !395, file: !324, line: 73, baseType: !124, size: 8, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !395, file: !324, line: 74, baseType: !424, size: 224, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !327, line: 390, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 382, size: 224, elements: !426)
!426 = !{!427, !429, !430, !431, !432, !433, !434}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !425, file: !327, line: 383, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !425, file: !327, line: 384, baseType: !12, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !425, file: !327, line: 385, baseType: !12, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !425, file: !327, line: 386, baseType: !428, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !425, file: !327, line: 387, baseType: !12, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !425, file: !327, line: 388, baseType: !12, size: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !425, file: !327, line: 389, baseType: !12, size: 32, offset: 192)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !437, file: !438, line: 59, type: !12, isLocal: false, isDefinition: true)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !439, globals: !492, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!439 = !{!440, !448, !473}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !238, line: 656, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 650, size: 128, elements: !443)
!443 = !{!444, !445, !446, !447}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !442, file: !238, line: 652, baseType: !11, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !442, file: !238, line: 653, baseType: !11, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !442, file: !238, line: 654, baseType: !11, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !442, file: !238, line: 655, baseType: !275, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !238, line: 418, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 395, size: 1120, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !450, file: !238, line: 397, baseType: !275, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !450, file: !238, line: 398, baseType: !11, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !450, file: !238, line: 399, baseType: !11, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !450, file: !238, line: 400, baseType: !11, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !450, file: !238, line: 401, baseType: !11, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !450, file: !238, line: 402, baseType: !11, size: 32, offset: 160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !450, file: !238, line: 403, baseType: !282, size: 96, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !450, file: !238, line: 404, baseType: !11, size: 32, offset: 288)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !450, file: !238, line: 405, baseType: !11, size: 32, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !450, file: !238, line: 406, baseType: !11, size: 32, offset: 352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !450, file: !238, line: 407, baseType: !11, size: 32, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !450, file: !238, line: 408, baseType: !11, size: 32, offset: 416)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !450, file: !238, line: 409, baseType: !11, size: 32, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !450, file: !238, line: 410, baseType: !11, size: 32, offset: 480)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !450, file: !238, line: 411, baseType: !293, size: 64, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !450, file: !238, line: 412, baseType: !275, size: 32, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !450, file: !238, line: 413, baseType: !275, size: 32, offset: 608)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !450, file: !238, line: 414, baseType: !299, size: 128, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !450, file: !238, line: 415, baseType: !303, size: 160, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !450, file: !238, line: 416, baseType: !307, size: 160, offset: 928)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !450, file: !238, line: 417, baseType: !11, size: 32, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !179, line: 72, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 56, size: 525312, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !475, file: !179, line: 57, baseType: !11, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !475, file: !179, line: 58, baseType: !11, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !475, file: !179, line: 59, baseType: !11, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !475, file: !179, line: 60, baseType: !11, size: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !475, file: !179, line: 61, baseType: !11, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !475, file: !179, line: 62, baseType: !11, size: 32, offset: 160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !475, file: !179, line: 63, baseType: !11, size: 32, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !475, file: !179, line: 64, baseType: !11, size: 32, offset: 224)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !475, file: !179, line: 65, baseType: !11, size: 32, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !475, file: !179, line: 66, baseType: !11, size: 32, offset: 288)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !475, file: !179, line: 67, baseType: !193, size: 32, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !475, file: !179, line: 68, baseType: !11, size: 32, offset: 352)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !475, file: !179, line: 69, baseType: !198, size: 523904, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !475, file: !179, line: 70, baseType: !202, size: 512, offset: 524288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !475, file: !179, line: 71, baseType: !202, size: 512, offset: 524800)
!492 = !{!435, !493}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !437, file: !438, line: 61, type: !11, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "heap_end", scope: !497, file: !498, line: 66, type: !503, isLocal: true, isDefinition: true)
!497 = distinct !DISubprogram(name: "_sbrk_r", scope: !498, file: !498, line: 63, type: !499, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !695, retainedNodes: !699)
!498 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !504, !694}
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !502, line: 123, baseType: !503)
!502 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !506, line: 377, size: 1920, elements: !507)
!506 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!507 = !{!508, !509, !583, !584, !585, !586, !587, !588, !589, !592, !613, !617, !618, !619, !620, !630, !643, !644, !649, !668, !669, !676, !677, !693}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !505, file: !506, line: 381, baseType: !66, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !505, file: !506, line: 386, baseType: !510, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !506, line: 292, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !506, line: 186, size: 832, elements: !513)
!513 = !{!514, !516, !517, !518, !520, !521, !526, !527, !528, !529, !533, !539, !546, !550, !551, !552, !553, !557, !559, !560, !561, !563, !569, !582}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !512, file: !506, line: 187, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !512, file: !506, line: 188, baseType: !66, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !512, file: !506, line: 189, baseType: !66, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !512, file: !506, line: 190, baseType: !519, size: 16, offset: 96)
!519 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !512, file: !506, line: 191, baseType: !519, size: 16, offset: 112)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !512, file: !506, line: 192, baseType: !522, size: 64, offset: 128)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !506, line: 122, size: 64, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !522, file: !506, line: 123, baseType: !515, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !522, file: !506, line: 124, baseType: !66, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !512, file: !506, line: 193, baseType: !66, size: 32, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !512, file: !506, line: 196, baseType: !504, size: 32, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !512, file: !506, line: 200, baseType: !116, size: 32, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !512, file: !506, line: 202, baseType: !530, size: 32, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DISubroutineType(types: !532)
!532 = !{!66, !504, !116, !503, !66}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !512, file: !506, line: 204, baseType: !534, size: 32, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DISubroutineType(types: !536)
!536 = !{!66, !504, !116, !537, !66}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !512, file: !506, line: 207, baseType: !540, size: 32, offset: 352)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !504, !116, !543, !66}
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !544, line: 116, baseType: !545)
!544 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!545 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !512, file: !506, line: 208, baseType: !547, size: 32, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{!66, !504, !116}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !512, file: !506, line: 211, baseType: !522, size: 64, offset: 416)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !512, file: !506, line: 212, baseType: !515, size: 32, offset: 480)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !512, file: !506, line: 213, baseType: !66, size: 32, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !512, file: !506, line: 216, baseType: !554, size: 24, offset: 544)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 3)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !512, file: !506, line: 217, baseType: !558, size: 8, offset: 568)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, elements: !194)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !512, file: !506, line: 220, baseType: !522, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !512, file: !506, line: 223, baseType: !66, size: 32, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !512, file: !506, line: 224, baseType: !562, size: 32, offset: 672)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !544, line: 46, baseType: !545)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !512, file: !506, line: 231, baseType: !564, size: 32, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !506, line: 35, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !566, line: 34, baseType: !567)
!566 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !566, line: 33, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !512, file: !506, line: 233, baseType: !570, size: 64, offset: 736)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !544, line: 170, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !544, line: 162, size: 64, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !571, file: !544, line: 164, baseType: !66, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !571, file: !544, line: 169, baseType: !575, size: 32, offset: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !571, file: !544, line: 165, size: 32, elements: !576)
!576 = !{!577, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !575, file: !544, line: 167, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !579, line: 116, baseType: !66)
!579 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !575, file: !544, line: 168, baseType: !581, size: 32)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !300)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !512, file: !506, line: 234, baseType: !66, size: 32, offset: 800)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !505, file: !506, line: 386, baseType: !510, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !505, file: !506, line: 386, baseType: !510, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !505, file: !506, line: 388, baseType: !66, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !505, file: !506, line: 390, baseType: !503, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !505, file: !506, line: 392, baseType: !66, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !505, file: !506, line: 394, baseType: !66, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !505, file: !506, line: 395, baseType: !590, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !506, line: 45, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !505, file: !506, line: 397, baseType: !593, size: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !506, line: 349, size: 128, elements: !595)
!595 = !{!596, !609, !610, !611}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !594, file: !506, line: 352, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !506, line: 52, size: 192, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !598, file: !506, line: 54, baseType: !597, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !598, file: !506, line: 55, baseType: !66, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !598, file: !506, line: 55, baseType: !66, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !598, file: !506, line: 55, baseType: !66, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !598, file: !506, line: 55, baseType: !66, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !598, file: !506, line: 56, baseType: !606, size: 32, offset: 160)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 32, elements: !194)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !506, line: 22, baseType: !608)
!608 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !594, file: !506, line: 353, baseType: !66, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !594, file: !506, line: 354, baseType: !597, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !594, file: !506, line: 355, baseType: !612, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !505, file: !506, line: 399, baseType: !614, size: 32, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !504}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !505, file: !506, line: 401, baseType: !66, size: 32, offset: 352)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !505, file: !506, line: 404, baseType: !66, size: 32, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !505, file: !506, line: 405, baseType: !503, size: 32, offset: 416)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !505, file: !506, line: 407, baseType: !621, size: 32, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !506, line: 324, size: 192, elements: !623)
!623 = !{!624, !626, !627, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !622, file: !506, line: 325, baseType: !625, size: 48)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !555)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !622, file: !506, line: 326, baseType: !625, size: 48, offset: 48)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !622, file: !506, line: 327, baseType: !53, size: 16, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !622, file: !506, line: 330, baseType: !629, size: 64, offset: 128)
!629 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !505, file: !506, line: 408, baseType: !631, size: 32, offset: 480)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !506, line: 60, size: 288, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !632, file: !506, line: 62, baseType: !66, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !632, file: !506, line: 63, baseType: !66, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !632, file: !506, line: 64, baseType: !66, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !632, file: !506, line: 65, baseType: !66, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !632, file: !506, line: 66, baseType: !66, size: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !632, file: !506, line: 67, baseType: !66, size: 32, offset: 160)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !632, file: !506, line: 68, baseType: !66, size: 32, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !632, file: !506, line: 69, baseType: !66, size: 32, offset: 224)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !632, file: !506, line: 70, baseType: !66, size: 32, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !505, file: !506, line: 409, baseType: !503, size: 32, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !505, file: !506, line: 412, baseType: !645, size: 32, offset: 544)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !66}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !505, file: !506, line: 416, baseType: !650, size: 32, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !506, line: 90, size: 1120, elements: !652)
!652 = !{!653, !654, !655, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !651, file: !506, line: 91, baseType: !650, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !651, file: !506, line: 92, baseType: !66, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !651, file: !506, line: 93, baseType: !656, size: 1024, offset: 64)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 1024, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !651, file: !506, line: 94, baseType: !660, size: 32, offset: 1088)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !506, line: 79, size: 2112, elements: !662)
!662 = !{!663, !665, !666, !667}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !661, file: !506, line: 80, baseType: !664, size: 1024)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 1024, elements: !657)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !661, file: !506, line: 81, baseType: !664, size: 1024, offset: 1024)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !661, file: !506, line: 83, baseType: !607, size: 32, offset: 2048)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !661, file: !506, line: 86, baseType: !607, size: 32, offset: 2080)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !505, file: !506, line: 417, baseType: !651, size: 1120, offset: 608)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !505, file: !506, line: 420, baseType: !670, size: 96, offset: 1728)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !506, line: 296, size: 96, elements: !671)
!671 = !{!672, !674, !675}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !670, file: !506, line: 298, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !670, file: !506, line: 299, baseType: !66, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !670, file: !506, line: 300, baseType: !510, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !505, file: !506, line: 421, baseType: !510, size: 32, offset: 1824)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !505, file: !506, line: 422, baseType: !678, size: 32, offset: 1856)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !506, line: 359, size: 640, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !687, !688, !689, !690, !691, !692}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !679, file: !506, line: 362, baseType: !503, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !679, file: !506, line: 363, baseType: !570, size: 64, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !679, file: !506, line: 364, baseType: !570, size: 64, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !679, file: !506, line: 365, baseType: !570, size: 64, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !679, file: !506, line: 366, baseType: !686, size: 64, offset: 224)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 64, elements: !243)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !679, file: !506, line: 367, baseType: !66, size: 32, offset: 288)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !679, file: !506, line: 368, baseType: !570, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !679, file: !506, line: 369, baseType: !570, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !679, file: !506, line: 370, baseType: !570, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !679, file: !506, line: 371, baseType: !570, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !679, file: !506, line: 372, baseType: !570, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !505, file: !506, line: 423, baseType: !503, size: 32, offset: 1888)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !579, line: 46, baseType: !7)
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !697, globals: !698, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!697 = !{!503, !501}
!698 = !{!495}
!699 = !{!700, !701, !702, !703}
!700 = !DILocalVariable(name: "r", arg: 1, scope: !497, file: !498, line: 63, type: !504)
!701 = !DILocalVariable(name: "nbytes", arg: 2, scope: !497, file: !498, line: 63, type: !694)
!702 = !DILocalVariable(name: "prev_heap_end", scope: !497, file: !498, line: 67, type: !503)
!703 = !DILocalVariable(name: "stack", scope: !497, file: !498, line: 68, type: !503)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !706, file: !711, line: 4, type: !717, isLocal: false, isDefinition: true)
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !708, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!708 = !{!704, !709, !715}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !706, file: !711, line: 5, type: !712, isLocal: false, isDefinition: true)
!711 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 88, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 11)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !706, file: !711, line: 6, type: !712, isLocal: false, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 248, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 31)
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !722, retainedTypes: !728, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!722 = !{!723}
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !724, line: 1209, baseType: !7, size: 32, elements: !725)
!724 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!725 = !{!726, !727}
!726 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!727 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!728 = !{!729, !731}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !9, line: 116, baseType: !7)
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !734, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!734 = !{!735}
!735 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 150, baseType: !7, size: 32, elements: !737)
!736 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!738 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!739 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!740 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!741 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!742 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!743 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!744 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!745 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!746 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!747 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!748 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!749 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!750 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!751 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!752 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!753 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!754 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!755 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!756 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!757 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!758 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!759 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!760 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!761 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!762 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!763 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!764 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!765 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!766 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!767 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!768 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!769 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!770 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!771 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!772 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!773 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!774 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!775 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!776 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!777 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!778 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!779 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!780 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!781 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!782 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!783 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!784 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!785 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!786 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!787 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!788 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!789 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!790 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!791 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!792 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!793 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!794 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!795 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!796 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!797 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!798 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!799 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!800 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!801 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!802 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!803 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!804 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!805 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!806 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!807 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!808 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!809 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!810 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!811 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!812 = !{!729, !8}
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !815, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!815 = !{!816, !841}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !238, line: 418, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 395, size: 1120, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !818, file: !238, line: 397, baseType: !275, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !818, file: !238, line: 398, baseType: !11, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !818, file: !238, line: 399, baseType: !11, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !818, file: !238, line: 400, baseType: !11, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !818, file: !238, line: 401, baseType: !11, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !818, file: !238, line: 402, baseType: !11, size: 32, offset: 160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !818, file: !238, line: 403, baseType: !282, size: 96, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !818, file: !238, line: 404, baseType: !11, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !818, file: !238, line: 405, baseType: !11, size: 32, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !818, file: !238, line: 406, baseType: !11, size: 32, offset: 352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !818, file: !238, line: 407, baseType: !11, size: 32, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !818, file: !238, line: 408, baseType: !11, size: 32, offset: 416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !818, file: !238, line: 409, baseType: !11, size: 32, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !818, file: !238, line: 410, baseType: !11, size: 32, offset: 480)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !818, file: !238, line: 411, baseType: !293, size: 64, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !818, file: !238, line: 412, baseType: !275, size: 32, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !818, file: !238, line: 413, baseType: !275, size: 32, offset: 608)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !818, file: !238, line: 414, baseType: !299, size: 128, offset: 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !818, file: !238, line: 415, baseType: !303, size: 160, offset: 768)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !818, file: !238, line: 416, baseType: !307, size: 160, offset: 928)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !818, file: !238, line: 417, baseType: !11, size: 32, offset: 1088)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !238, line: 378, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 363, size: 28704, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !843, file: !238, line: 365, baseType: !242, size: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !843, file: !238, line: 366, baseType: !246, size: 768, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !843, file: !238, line: 367, baseType: !242, size: 256, offset: 1024)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !843, file: !238, line: 368, baseType: !246, size: 768, offset: 1280)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !843, file: !238, line: 369, baseType: !242, size: 256, offset: 2048)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !843, file: !238, line: 370, baseType: !246, size: 768, offset: 2304)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !843, file: !238, line: 371, baseType: !242, size: 256, offset: 3072)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !843, file: !238, line: 372, baseType: !246, size: 768, offset: 3328)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !843, file: !238, line: 373, baseType: !242, size: 256, offset: 4096)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !843, file: !238, line: 374, baseType: !257, size: 1792, offset: 4352)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !843, file: !238, line: 375, baseType: !261, size: 1920, offset: 6144)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !843, file: !238, line: 376, baseType: !266, size: 20608, offset: 8064)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !843, file: !238, line: 377, baseType: !11, size: 32, offset: 28672)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !860, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!860 = !{!861, !735}
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 55, baseType: !7, size: 32, elements: !863)
!862 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!864 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!865 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!866 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!867 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!868 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!869 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!870 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!871 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!872 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!873 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!874 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!875 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!876 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!877 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!878 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!879 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!880 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!881 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!882 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!883 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!884 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!885 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!886 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!887 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!888 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!889 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!890 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!891 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !896, retainedTypes: !960, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!896 = !{!897, !904, !861, !935, !941, !945, !949, !955}
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 233, baseType: !66, size: 32, elements: !899)
!898 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!899 = !{!900, !901, !902, !903}
!900 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!901 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!902 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!903 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !335, line: 249, baseType: !7, size: 32, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!906 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!907 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!908 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!909 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!910 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!911 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!912 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!913 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!914 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!915 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!916 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!917 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!918 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!919 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!920 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!921 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!922 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!923 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!924 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!925 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!926 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!927 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!928 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!929 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!930 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!931 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!932 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!933 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!934 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 224, baseType: !66, size: 32, elements: !936)
!936 = !{!937, !938, !939, !940}
!937 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!938 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!939 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!940 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!941 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 217, baseType: !7, size: 32, elements: !942)
!942 = !{!943, !944}
!943 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!944 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!945 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 210, baseType: !7, size: 32, elements: !946)
!946 = !{!947, !948}
!947 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!948 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 242, baseType: !7, size: 32, elements: !950)
!950 = !{!951, !952, !953, !954}
!951 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!952 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!953 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!954 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !956, line: 57, baseType: !7, size: 32, elements: !957)
!956 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!957 = !{!958, !959}
!958 = !DIEnumerator(name: "eDirection_IN", value: 0)
!959 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!960 = !{!961, !116, !962, !118, !963, !964}
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !862, line: 87, baseType: !861)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !898, line: 220, baseType: !941)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !898, line: 247, baseType: !949)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !956, line: 60, baseType: !955)
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !967, splitDebugInlining: false, nameTableKind: None)
!966 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/des_encrypt_decrypt_data/GCC")
!967 = !{!334, !340, !356, !362, !366, !904}
!968 = !{!"Ubuntu clang version 14.0.6"}
!969 = !{i32 7, !"Dwarf Version", i32 2}
!970 = !{i32 2, !"Debug Info Version", i32 3}
!971 = !{i32 1, !"wchar_size", i32 4}
!972 = !{i32 1, !"min_enum_size", i32 4}
!973 = !{i32 1, !"branch-target-enforcement", i32 0}
!974 = !{i32 1, !"sign-return-address", i32 0}
!975 = !{i32 1, !"sign-return-address-all", i32 0}
!976 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!977 = !{i32 7, !"frame-pointer", i32 2}
!978 = distinct !DISubprogram(name: "halGPIO_ConfDirection", scope: !721, file: !721, line: 54, type: !979, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !720, retainedNodes: !982)
!979 = !DISubroutineType(types: !980)
!980 = !{!981, !8, !54}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !9, line: 56, baseType: !66)
!982 = !{!983, !984, !985, !987}
!983 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !978, file: !721, line: 54, type: !8)
!984 = !DILocalVariable(name: "outEnable", arg: 2, scope: !978, file: !721, line: 54, type: !54)
!985 = !DILocalVariable(name: "no", scope: !978, file: !721, line: 57, type: !986)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !9, line: 60, baseType: !53)
!987 = !DILocalVariable(name: "remainder", scope: !978, file: !721, line: 58, type: !986)
!988 = !DILocation(line: 0, scope: !978)
!989 = !DILocation(line: 59, column: 19, scope: !978)
!990 = !DILocation(line: 60, column: 17, scope: !978)
!991 = !DILocation(line: 61, column: 5, scope: !978)
!992 = !DILocation(line: 65, column: 27, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !721, line: 65, column: 17)
!994 = distinct !DILexicalBlock(scope: !978, file: !721, line: 61, column: 17)
!995 = !DILocation(line: 0, scope: !993)
!996 = !DILocation(line: 65, column: 17, scope: !994)
!997 = !DILocation(line: 66, column: 21, scope: !998)
!998 = distinct !DILexicalBlock(scope: !993, file: !721, line: 65, column: 33)
!999 = !DILocation(line: 67, column: 73, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !721, line: 66, column: 38)
!1001 = distinct !DILexicalBlock(scope: !998, file: !721, line: 66, column: 21)
!1002 = !DILocation(line: 67, column: 69, scope: !1000)
!1003 = !DILocation(line: 67, column: 66, scope: !1000)
!1004 = !DILocation(line: 68, column: 17, scope: !1000)
!1005 = !DILocation(line: 68, column: 28, scope: !1001)
!1006 = !DILocation(line: 69, column: 77, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !721, line: 68, column: 45)
!1008 = distinct !DILexicalBlock(scope: !1001, file: !721, line: 68, column: 28)
!1009 = !DILocation(line: 70, column: 77, scope: !1007)
!1010 = !DILocation(line: 71, column: 17, scope: !1007)
!1011 = !DILocation(line: 72, column: 77, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !721, line: 71, column: 45)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !721, line: 71, column: 28)
!1014 = !DILocation(line: 73, column: 77, scope: !1012)
!1015 = !DILocation(line: 74, column: 17, scope: !1012)
!1016 = !DILocation(line: 75, column: 79, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !721, line: 74, column: 45)
!1018 = distinct !DILexicalBlock(scope: !1013, file: !721, line: 74, column: 28)
!1019 = !DILocation(line: 76, column: 79, scope: !1017)
!1020 = !DILocation(line: 77, column: 17, scope: !1017)
!1021 = !DILocation(line: 78, column: 79, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !721, line: 77, column: 45)
!1023 = distinct !DILexicalBlock(scope: !1018, file: !721, line: 77, column: 28)
!1024 = !DILocation(line: 79, column: 79, scope: !1022)
!1025 = !DILocation(line: 80, column: 17, scope: !1022)
!1026 = !DILocation(line: 81, column: 79, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !721, line: 80, column: 45)
!1028 = distinct !DILexicalBlock(scope: !1023, file: !721, line: 80, column: 28)
!1029 = !DILocation(line: 82, column: 79, scope: !1027)
!1030 = !DILocation(line: 83, column: 17, scope: !1027)
!1031 = !DILocation(line: 85, column: 17, scope: !998)
!1032 = !DILocation(line: 86, column: 13, scope: !998)
!1033 = !DILocation(line: 88, column: 21, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !993, file: !721, line: 86, column: 20)
!1035 = !DILocation(line: 89, column: 72, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !721, line: 88, column: 38)
!1037 = distinct !DILexicalBlock(scope: !1034, file: !721, line: 88, column: 21)
!1038 = !DILocation(line: 89, column: 66, scope: !1036)
!1039 = !DILocation(line: 90, column: 17, scope: !1036)
!1040 = !DILocation(line: 90, column: 28, scope: !1037)
!1041 = !DILocation(line: 91, column: 77, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !721, line: 90, column: 45)
!1043 = distinct !DILexicalBlock(scope: !1037, file: !721, line: 90, column: 28)
!1044 = !DILocation(line: 92, column: 17, scope: !1042)
!1045 = !DILocation(line: 93, column: 77, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !721, line: 92, column: 45)
!1047 = distinct !DILexicalBlock(scope: !1043, file: !721, line: 92, column: 28)
!1048 = !DILocation(line: 94, column: 17, scope: !1046)
!1049 = !DILocation(line: 95, column: 79, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !721, line: 94, column: 45)
!1051 = distinct !DILexicalBlock(scope: !1047, file: !721, line: 94, column: 28)
!1052 = !DILocation(line: 96, column: 17, scope: !1050)
!1053 = !DILocation(line: 97, column: 79, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !721, line: 96, column: 45)
!1055 = distinct !DILexicalBlock(scope: !1051, file: !721, line: 96, column: 28)
!1056 = !DILocation(line: 98, column: 17, scope: !1054)
!1057 = !DILocation(line: 99, column: 79, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !721, line: 98, column: 45)
!1059 = distinct !DILexicalBlock(scope: !1055, file: !721, line: 98, column: 28)
!1060 = !DILocation(line: 100, column: 17, scope: !1058)
!1061 = !DILocation(line: 103, column: 17, scope: !1034)
!1062 = !DILocation(line: 109, column: 27, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !994, file: !721, line: 109, column: 17)
!1064 = !DILocation(line: 0, scope: !1063)
!1065 = !DILocation(line: 109, column: 17, scope: !994)
!1066 = !DILocation(line: 110, column: 21, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1063, file: !721, line: 109, column: 33)
!1068 = !DILocation(line: 111, column: 73, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !721, line: 110, column: 36)
!1070 = distinct !DILexicalBlock(scope: !1067, file: !721, line: 110, column: 21)
!1071 = !DILocation(line: 111, column: 69, scope: !1069)
!1072 = !DILocation(line: 111, column: 66, scope: !1069)
!1073 = !DILocation(line: 112, column: 17, scope: !1069)
!1074 = !DILocation(line: 113, column: 79, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1070, file: !721, line: 112, column: 24)
!1076 = !DILocation(line: 114, column: 79, scope: !1075)
!1077 = !DILocation(line: 117, column: 17, scope: !1067)
!1078 = !DILocation(line: 118, column: 13, scope: !1067)
!1079 = !DILocation(line: 120, column: 21, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1063, file: !721, line: 118, column: 20)
!1081 = !DILocation(line: 121, column: 72, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !721, line: 120, column: 36)
!1083 = distinct !DILexicalBlock(scope: !1080, file: !721, line: 120, column: 21)
!1084 = !DILocation(line: 121, column: 66, scope: !1082)
!1085 = !DILocation(line: 122, column: 17, scope: !1082)
!1086 = !DILocation(line: 123, column: 79, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1083, file: !721, line: 122, column: 24)
!1088 = !DILocation(line: 126, column: 17, scope: !1080)
!1089 = !DILocation(line: 133, column: 1, scope: !978)
!1090 = distinct !DISubprogram(name: "halGPO_Write", scope: !721, file: !721, line: 136, type: !979, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !720, retainedNodes: !1091)
!1091 = !{!1092, !1093, !1094, !1095}
!1092 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1090, file: !721, line: 136, type: !8)
!1093 = !DILocalVariable(name: "writeValue", arg: 2, scope: !1090, file: !721, line: 136, type: !54)
!1094 = !DILocalVariable(name: "no", scope: !1090, file: !721, line: 138, type: !986)
!1095 = !DILocalVariable(name: "remainder", scope: !1090, file: !721, line: 139, type: !986)
!1096 = !DILocation(line: 0, scope: !1090)
!1097 = !DILocation(line: 140, column: 19, scope: !1090)
!1098 = !DILocation(line: 141, column: 17, scope: !1090)
!1099 = !DILocation(line: 142, column: 5, scope: !1090)
!1100 = !DILocation(line: 145, column: 17, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !721, line: 145, column: 17)
!1102 = distinct !DILexicalBlock(scope: !1090, file: !721, line: 142, column: 17)
!1103 = !DILocation(line: 0, scope: !1101)
!1104 = !DILocation(line: 145, column: 17, scope: !1102)
!1105 = !DILocation(line: 146, column: 17, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1101, file: !721, line: 145, column: 29)
!1107 = !DILocation(line: 147, column: 13, scope: !1106)
!1108 = !DILocation(line: 148, column: 17, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1101, file: !721, line: 147, column: 20)
!1110 = !DILocation(line: 153, column: 17, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1102, file: !721, line: 153, column: 17)
!1112 = !DILocation(line: 0, scope: !1111)
!1113 = !DILocation(line: 153, column: 17, scope: !1102)
!1114 = !DILocation(line: 154, column: 17, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !721, line: 153, column: 29)
!1116 = !DILocation(line: 155, column: 13, scope: !1115)
!1117 = !DILocation(line: 156, column: 17, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1111, file: !721, line: 155, column: 20)
!1119 = !DILocation(line: 163, column: 1, scope: !1090)
!1120 = distinct !DISubprogram(name: "halgetGPIO_DOUT", scope: !721, file: !721, line: 169, type: !1121, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !720, retainedNodes: !1123)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!54, !8}
!1123 = !{!1124, !1125, !1126, !1127}
!1124 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1120, file: !721, line: 169, type: !8)
!1125 = !DILocalVariable(name: "no", scope: !1120, file: !721, line: 171, type: !986)
!1126 = !DILocalVariable(name: "remainder", scope: !1120, file: !721, line: 172, type: !986)
!1127 = !DILocalVariable(name: "dout", scope: !1120, file: !721, line: 175, type: !54)
!1128 = !DILocation(line: 0, scope: !1120)
!1129 = !DILocation(line: 173, column: 19, scope: !1120)
!1130 = !DILocation(line: 174, column: 17, scope: !1120)
!1131 = !DILocation(line: 177, column: 5, scope: !1120)
!1132 = !DILocation(line: 183, column: 13, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1120, file: !721, line: 177, column: 17)
!1134 = !DILocation(line: 0, scope: !1133)
!1135 = !DILocation(line: 187, column: 5, scope: !1120)
!1136 = !DILocation(line: 188, column: 1, scope: !1120)
!1137 = distinct !DISubprogram(name: "halgetGPIO_DIN", scope: !721, file: !721, line: 189, type: !1121, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !720, retainedNodes: !1138)
!1138 = !{!1139, !1140, !1141, !1142}
!1139 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1137, file: !721, line: 189, type: !8)
!1140 = !DILocalVariable(name: "no", scope: !1137, file: !721, line: 191, type: !986)
!1141 = !DILocalVariable(name: "remainder", scope: !1137, file: !721, line: 192, type: !986)
!1142 = !DILocalVariable(name: "din", scope: !1137, file: !721, line: 195, type: !54)
!1143 = !DILocation(line: 0, scope: !1137)
!1144 = !DILocation(line: 193, column: 19, scope: !1137)
!1145 = !DILocation(line: 194, column: 17, scope: !1137)
!1146 = !DILocation(line: 196, column: 5, scope: !1137)
!1147 = !DILocation(line: 203, column: 13, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1137, file: !721, line: 196, column: 17)
!1149 = !DILocation(line: 0, scope: !1148)
!1150 = !DILocation(line: 208, column: 5, scope: !1137)
!1151 = !DILocation(line: 209, column: 1, scope: !1137)
!1152 = distinct !DISubprogram(name: "halgetGPIO_OutEnable", scope: !721, file: !721, line: 210, type: !1121, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !720, retainedNodes: !1153)
!1153 = !{!1154, !1155, !1156, !1157}
!1154 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1152, file: !721, line: 210, type: !8)
!1155 = !DILocalVariable(name: "no", scope: !1152, file: !721, line: 212, type: !986)
!1156 = !DILocalVariable(name: "remainder", scope: !1152, file: !721, line: 213, type: !986)
!1157 = !DILocalVariable(name: "outEnable", scope: !1152, file: !721, line: 216, type: !54)
!1158 = !DILocation(line: 0, scope: !1152)
!1159 = !DILocation(line: 214, column: 19, scope: !1152)
!1160 = !DILocation(line: 215, column: 17, scope: !1152)
!1161 = !DILocation(line: 218, column: 5, scope: !1152)
!1162 = !DILocation(line: 224, column: 13, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1152, file: !721, line: 218, column: 17)
!1164 = !DILocation(line: 0, scope: !1163)
!1165 = !DILocation(line: 228, column: 5, scope: !1152)
!1166 = !DILocation(line: 229, column: 1, scope: !1152)
!1167 = distinct !DISubprogram(name: "halGPIO_PullUp_SET", scope: !721, file: !721, line: 232, type: !1168, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !720, retainedNodes: !1170)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!981, !8}
!1170 = !{!1171, !1172, !1173}
!1171 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1167, file: !721, line: 232, type: !8)
!1172 = !DILocalVariable(name: "no", scope: !1167, file: !721, line: 234, type: !986)
!1173 = !DILocalVariable(name: "remainder", scope: !1167, file: !721, line: 235, type: !986)
!1174 = !DILocation(line: 0, scope: !1167)
!1175 = !DILocation(line: 236, column: 19, scope: !1167)
!1176 = !DILocation(line: 237, column: 17, scope: !1167)
!1177 = !DILocation(line: 238, column: 5, scope: !1167)
!1178 = !DILocation(line: 239, column: 5, scope: !1167)
!1179 = !DILocation(line: 241, column: 27, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !721, line: 241, column: 17)
!1181 = distinct !DILexicalBlock(scope: !1167, file: !721, line: 239, column: 17)
!1182 = !DILocation(line: 241, column: 17, scope: !1181)
!1183 = !DILocation(line: 241, column: 17, scope: !1180)
!1184 = !DILocation(line: 242, column: 17, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1180, file: !721, line: 241, column: 34)
!1186 = !DILocation(line: 243, column: 13, scope: !1185)
!1187 = !DILocation(line: 243, column: 24, scope: !1180)
!1188 = !DILocation(line: 244, column: 73, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !721, line: 243, column: 41)
!1190 = distinct !DILexicalBlock(scope: !1180, file: !721, line: 243, column: 24)
!1191 = !DILocation(line: 245, column: 73, scope: !1189)
!1192 = !DILocation(line: 246, column: 13, scope: !1189)
!1193 = !DILocation(line: 247, column: 73, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !721, line: 246, column: 41)
!1195 = distinct !DILexicalBlock(scope: !1190, file: !721, line: 246, column: 24)
!1196 = !DILocation(line: 248, column: 73, scope: !1194)
!1197 = !DILocation(line: 249, column: 13, scope: !1194)
!1198 = !DILocation(line: 250, column: 75, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !721, line: 249, column: 41)
!1200 = distinct !DILexicalBlock(scope: !1195, file: !721, line: 249, column: 24)
!1201 = !DILocation(line: 251, column: 75, scope: !1199)
!1202 = !DILocation(line: 252, column: 13, scope: !1199)
!1203 = !DILocation(line: 253, column: 75, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1205, file: !721, line: 252, column: 41)
!1205 = distinct !DILexicalBlock(scope: !1200, file: !721, line: 252, column: 24)
!1206 = !DILocation(line: 254, column: 75, scope: !1204)
!1207 = !DILocation(line: 255, column: 13, scope: !1204)
!1208 = !DILocation(line: 256, column: 75, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1210, file: !721, line: 255, column: 41)
!1210 = distinct !DILexicalBlock(scope: !1205, file: !721, line: 255, column: 24)
!1211 = !DILocation(line: 257, column: 75, scope: !1209)
!1212 = !DILocation(line: 258, column: 13, scope: !1209)
!1213 = !DILocation(line: 261, column: 18, scope: !1214)
