; ModuleID = 'build/96b_wistrio/thermometer/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct.sensor_value }
%struct.sensor_value = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !111, file: !142, line: 60, type: !143, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !141, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!113 = !{!114, !135}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 386, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 448, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 372, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !117, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !117, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !117, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !117, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !117, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !117, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !117, file: !116, line: 379, baseType: !120, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !117, file: !116, line: 380, baseType: !120, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !117, file: !116, line: 381, baseType: !120, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !117, file: !116, line: 382, baseType: !120, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !117, file: !116, line: 383, baseType: !120, size: 32, offset: 352)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !117, file: !116, line: 384, baseType: !120, size: 32, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !117, file: !116, line: 385, baseType: !120, size: 32, offset: 416)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !116, line: 364, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 360, size: 64, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !137, file: !116, line: 362, baseType: !120, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !137, file: !116, line: 363, baseType: !120, size: 32, offset: 32)
!141 = !{!109}
!142 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !178}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !144, file: !145, line: 60, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DISubroutineType(types: !150)
!150 = !{!103, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !155)
!154 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = !{!156, !160, !161, !162, !171, !172}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 380, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !153, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !153, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !153, file: !154, line: 386, baseType: !163, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !165)
!165 = !{!166, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !164, file: !154, line: 359, baseType: !167, size: 8)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !164, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!170 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !153, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !154, line: 43, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !177)
!177 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !144, file: !145, line: 65, baseType: !151, size: 32, offset: 32)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !181, file: !184, line: 71, type: !185, isLocal: true, isDefinition: true, align: 32)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !183, splitDebugInlining: false, nameTableKind: None)
!182 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!183 = !{!179}
!184 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !187)
!187 = !{!188, !207}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !145, line: 60, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{!103, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !195)
!195 = !{!196, !197, !198, !199, !205, !206}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !154, line: 380, baseType: !157, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !194, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !194, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !194, file: !154, line: 386, baseType: !200, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !201, file: !154, line: 359, baseType: !167, size: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !201, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !194, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !145, line: 65, baseType: !192, size: 32, offset: 32)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "static_regions", scope: !210, file: !219, line: 62, type: !360, isLocal: true, isDefinition: true)
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !212, globals: !215, splitDebugInlining: false, nameTableKind: None)
!211 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!212 = !{!213, !103, !121, !102}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 214, baseType: !32)
!214 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !208}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !218, file: !219, line: 198, type: !346, isLocal: true, isDefinition: true)
!218 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !219, file: !219, line: 175, type: !220, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !210, retainedNodes: !341)
!219 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !224, line: 245, size: 1024, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !295, !308, !309, !310, !311, !317, !336}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !223, file: !224, line: 247, baseType: !227, size: 384)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !224, line: 57, size: 384, elements: !228)
!228 = !{!229, !257, !265, !266, !267, !280, !281, !282}
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !224, line: 60, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !224, line: 60, size: 64, elements: !231)
!231 = !{!232, !248}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !230, file: !224, line: 61, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !234, line: 49, baseType: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !234, line: 37, size: 64, elements: !236)
!236 = !{!237, !243}
!237 = !DIDerivedType(tag: DW_TAG_member, scope: !235, file: !234, line: 38, baseType: !238, size: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !234, line: 38, size: 32, elements: !239)
!239 = !{!240, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !238, file: !234, line: 39, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !234, line: 40, baseType: !241, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !235, file: !234, line: 42, baseType: !244, size: 32, offset: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !234, line: 42, size: 32, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !244, file: !234, line: 43, baseType: !241, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !234, line: 44, baseType: !241, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !230, file: !224, line: 62, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !250, line: 49, size: 64, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !249, file: !250, line: 50, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 64, elements: !255)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!255 = !{!256}
!256 = !DISubrange(count: 2)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !227, file: !224, line: 68, baseType: !258, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !260, line: 233, baseType: !261)
!260 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 231, size: 64, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !261, file: !260, line: 232, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !234, line: 48, baseType: !235)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !227, file: !224, line: 71, baseType: !167, size: 8, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !227, file: !224, line: 74, baseType: !167, size: 8, offset: 104)
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !224, line: 90, baseType: !268, size: 16, offset: 112)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !224, line: 90, size: 16, elements: !269)
!269 = !{!270, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, scope: !268, file: !224, line: 91, baseType: !271, size: 16)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !224, line: 91, size: 16, elements: !272)
!272 = !{!273, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !271, file: !224, line: 96, baseType: !274, size: 8)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !275)
!275 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !271, file: !224, line: 97, baseType: !167, size: 8, offset: 8)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !268, file: !224, line: 100, baseType: !278, size: 16)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !279)
!279 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !227, file: !224, line: 107, baseType: !121, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !227, file: !224, line: 127, baseType: !102, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !227, file: !224, line: 131, baseType: !283, size: 192, offset: 192)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !260, line: 244, size: 192, elements: !284)
!284 = !{!285, !286, !292}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !283, file: !260, line: 245, baseType: !233, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !283, file: !260, line: 246, baseType: !287, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !260, line: 242, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !283, file: !260, line: 249, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !294)
!294 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !223, file: !224, line: 250, baseType: !296, size: 288, offset: 384)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !297, line: 25, size: 288, elements: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !296, file: !297, line: 26, baseType: !121, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !296, file: !297, line: 27, baseType: !121, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !296, file: !297, line: 28, baseType: !121, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !296, file: !297, line: 29, baseType: !121, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !296, file: !297, line: 30, baseType: !121, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !296, file: !297, line: 31, baseType: !121, size: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !296, file: !297, line: 32, baseType: !121, size: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !296, file: !297, line: 33, baseType: !121, size: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !296, file: !297, line: 34, baseType: !121, size: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !223, file: !224, line: 253, baseType: !102, size: 32, offset: 672)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !223, file: !224, line: 256, baseType: !259, size: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !223, file: !224, line: 294, baseType: !103, size: 32, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !223, file: !224, line: 300, baseType: !312, size: 96, offset: 800)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !224, line: 149, size: 96, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !312, file: !224, line: 153, baseType: !22, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !312, file: !224, line: 162, baseType: !213, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !312, file: !224, line: 168, baseType: !213, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !223, file: !224, line: 325, baseType: !318, size: 32, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !320, line: 5073, size: 160, elements: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !{!322, !331, !332}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !319, file: !320, line: 5074, baseType: !323, size: 96)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !324, line: 56, size: 96, elements: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !{!326, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !323, file: !324, line: 57, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !324, line: 57, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !323, file: !324, line: 58, baseType: !102, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !323, file: !324, line: 59, baseType: !213, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !319, file: !320, line: 5075, baseType: !259, size: 64, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !319, file: !320, line: 5076, baseType: !333, offset: 160)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !223, file: !224, line: 343, baseType: !337, size: 64, offset: 928)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !297, line: 60, size: 64, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !337, file: !297, line: 63, baseType: !121, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !337, file: !297, line: 66, baseType: !121, size: 32, offset: 32)
!341 = !{!342, !343, !344, !345}
!342 = !DILocalVariable(name: "thread", arg: 1, scope: !218, file: !219, line: 175, type: !222)
!343 = !DILocalVariable(name: "region_num", scope: !218, file: !219, line: 200, type: !167)
!344 = !DILocalVariable(name: "guard_start", scope: !218, file: !219, line: 265, type: !22)
!345 = !DILocalVariable(name: "guard_size", scope: !218, file: !219, line: 266, type: !213)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 96, elements: !358)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !348, line: 52, size: 96, elements: !349)
!348 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !347, file: !348, line: 53, baseType: !22, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !347, file: !348, line: 54, baseType: !213, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !347, file: !348, line: 55, baseType: !353, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !354, line: 151, baseType: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 149, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !355, file: !354, line: 150, baseType: !121, size: 32)
!358 = !{!359}
!359 = !DISubrange(count: 1)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 96, elements: !358)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !364, file: !397, line: 39, type: !167, isLocal: true, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !366, globals: !396, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!366 = !{!367, !102, !103, !384, !167}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !369, line: 1168, baseType: !370)
!369 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 1155, size: 352, elements: !371)
!371 = !{!372, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !370, file: !369, line: 1157, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !370, file: !369, line: 1158, baseType: !120, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !370, file: !369, line: 1159, baseType: !120, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !370, file: !369, line: 1160, baseType: !120, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !370, file: !369, line: 1161, baseType: !120, size: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !370, file: !369, line: 1162, baseType: !120, size: 32, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !370, file: !369, line: 1163, baseType: !120, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !370, file: !369, line: 1164, baseType: !120, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !370, file: !369, line: 1165, baseType: !120, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !370, file: !369, line: 1166, baseType: !120, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !370, file: !369, line: 1167, baseType: !120, size: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !387, line: 27, size: 96, elements: !388)
!387 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !386, file: !387, line: 29, baseType: !121, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !386, file: !387, line: 31, baseType: !157, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !386, file: !387, line: 37, baseType: !392, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !354, line: 146, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !354, line: 141, size: 32, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !393, file: !354, line: 143, baseType: !121, size: 32)
!396 = !{!362}
!397 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !400, file: !407, line: 21, type: !106, isLocal: true, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !402, globals: !406, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!402 = !{!403, !103, !102}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !405, line: 22, baseType: !103)
!405 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !{!398}
!407 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !410, file: !415, line: 13, type: !432, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !412, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!412 = !{!413, !408}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "mpu_config", scope: !410, file: !415, line: 37, type: !416, isLocal: false, isDefinition: true)
!415 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !387, line: 41, size: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !417, file: !387, line: 43, baseType: !121, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !417, file: !387, line: 45, baseType: !421, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !387, line: 27, size: 96, elements: !424)
!424 = !{!425, !426, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !423, file: !387, line: 29, baseType: !121, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !423, file: !387, line: 31, baseType: !157, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !423, file: !387, line: 37, baseType: !428, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !354, line: 146, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !354, line: 141, size: 32, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !429, file: !354, line: 143, baseType: !121, size: 32)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 192, elements: !255)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !435, file: !532, line: 36, type: !533, isLocal: true, isDefinition: true, align: 32)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !449, globals: !531, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!437 = !{!438, !444}
!438 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !439, line: 506, baseType: !32, size: 32, elements: !440)
!439 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!440 = !{!441, !442, !443}
!441 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!442 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!443 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!444 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !439, line: 512, baseType: !32, size: 32, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!447 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!448 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!449 = !{!450, !520, !525, !485, !444, !438, !530, !102}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !439, line: 523, size: 288, elements: !453)
!453 = !{!454, !475, !481, !486, !490, !491, !492, !496, !516}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !452, file: !439, line: 524, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DISubroutineType(types: !457)
!457 = !{!103, !458, !473, !474}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !461)
!461 = !{!462, !463, !464, !465, !471, !472}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !460, file: !154, line: 380, baseType: !157, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !460, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !460, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !460, file: !154, line: 386, baseType: !466, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !467, file: !154, line: 359, baseType: !167, size: 8)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !467, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !460, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !439, line: 237, baseType: !167)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !439, line: 257, baseType: !121)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !452, file: !439, line: 530, baseType: !476, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DISubroutineType(types: !478)
!478 = !{!103, !458, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !439, line: 229, baseType: !121)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !452, file: !439, line: 532, baseType: !482, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DISubroutineType(types: !484)
!484 = !{!103, !458, !485, !480}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !439, line: 216, baseType: !121)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !452, file: !439, line: 535, baseType: !487, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DISubroutineType(types: !489)
!489 = !{!103, !458, !485}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !452, file: !439, line: 537, baseType: !487, size: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !452, file: !439, line: 539, baseType: !487, size: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !452, file: !439, line: 541, baseType: !493, size: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DISubroutineType(types: !495)
!495 = !{!103, !458, !473, !438, !444}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !452, file: !439, line: 544, baseType: !497, size: 32, offset: 224)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{!103, !458, !500, !170}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !439, line: 478, size: 96, elements: !502)
!502 = !{!503, !510, !515}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !501, file: !439, line: 482, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !505, line: 33, baseType: !506)
!505 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !505, line: 29, size: 32, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !505, line: 30, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !501, file: !439, line: 485, baseType: !511, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !439, line: 464, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !458, !500, !485}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !501, file: !439, line: 493, baseType: !485, size: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !452, file: !439, line: 547, baseType: !517, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DISubroutineType(types: !519)
!519 = !{!121, !458}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !439, line: 428, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !522, file: !439, line: 434, baseType: !485, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !439, line: 441, size: 32, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !527, file: !439, line: 447, baseType: !485, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!531 = !{!433}
!532 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !535)
!535 = !{!536, !540}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !534, file: !145, line: 60, baseType: !537, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DISubroutineType(types: !539)
!539 = !{!103, !458}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !534, file: !145, line: 65, baseType: !458, size: 32, offset: 32)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !543, file: !615, line: 48, type: !691, isLocal: true, isDefinition: true)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !545, retainedTypes: !601, globals: !612, splitDebugInlining: false, nameTableKind: None)
!544 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!545 = !{!30, !546}
!546 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 69, baseType: !103, size: 32, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!548 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!549 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!550 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!551 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!552 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!553 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!554 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!555 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!556 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!557 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!558 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!559 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!560 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!561 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!562 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!563 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!564 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!565 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!566 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!567 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!568 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!569 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!570 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!571 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!572 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!573 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!574 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!575 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!576 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!577 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!578 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!579 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!580 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!581 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!582 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!583 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!584 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!585 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!586 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!587 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!588 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!589 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!590 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!591 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!592 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!593 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!594 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!595 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!596 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!597 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!598 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!599 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!600 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!601 = !{!213, !103, !102, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 270, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 262, size: 192, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !604, file: !116, line: 264, baseType: !120, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !604, file: !116, line: 265, baseType: !120, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !604, file: !116, line: 266, baseType: !120, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !604, file: !116, line: 267, baseType: !120, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !604, file: !116, line: 268, baseType: !120, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !604, file: !116, line: 269, baseType: !120, size: 32, offset: 160)
!612 = !{!613, !619, !635, !646, !663, !541, !665, !679, !681, !683, !685, !687, !689}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !543, file: !615, line: 424, type: !616, isLocal: false, isDefinition: true, align: 16)
!615 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 4)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !543, file: !615, line: 424, type: !621, isLocal: false, isDefinition: true, align: 32)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !623)
!623 = !{!624, !625, !626, !627, !633, !634}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !622, file: !154, line: 380, baseType: !157, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !622, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !622, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !622, file: !154, line: 386, baseType: !628, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !629, file: !154, line: 359, baseType: !167, size: 8)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !629, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !622, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !622, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !543, file: !615, line: 424, type: !637, isLocal: true, isDefinition: true, align: 32)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !639)
!639 = !{!640, !645}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !638, file: !145, line: 60, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DISubroutineType(types: !643)
!643 = !{!103, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !638, file: !145, line: 65, baseType: !644, size: 32, offset: 32)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "exti_data", scope: !543, file: !615, line: 423, type: !648, isLocal: true, isDefinition: true)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !615, line: 107, size: 1024, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !648, file: !615, line: 109, baseType: !651, size: 1024)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 1024, elements: !661)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !615, line: 101, size: 64, elements: !653)
!653 = !{!654, !660}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !652, file: !615, line: 102, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !656, line: 63, baseType: !657)
!656 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !103, !102}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !652, file: !615, line: 103, baseType: !102, size: 32, offset: 32)
!661 = !{!662}
!662 = !DISubrange(count: 16)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !543, file: !615, line: 424, type: !629, isLocal: true, isDefinition: true, align: 8)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !667, file: !615, line: 493, type: !672, isLocal: true, isDefinition: true, align: 32)
!667 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !615, file: !615, line: 460, type: !668, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !543, retainedNodes: !670)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !644}
!670 = !{!671}
!671 = !DILocalVariable(name: "dev", arg: 1, scope: !667, file: !615, line: 460, type: !644)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !673)
!673 = !{!674, !676, !677, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !672, file: !10, line: 55, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !672, file: !10, line: 57, baseType: !675, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !672, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !672, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !667, file: !615, line: 497, type: !672, isLocal: true, isDefinition: true, align: 32)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !667, file: !615, line: 507, type: !672, isLocal: true, isDefinition: true, align: 32)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !667, file: !615, line: 512, type: !672, isLocal: true, isDefinition: true, align: 32)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !667, file: !615, line: 516, type: !672, isLocal: true, isDefinition: true, align: 32)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !667, file: !615, line: 523, type: !672, isLocal: true, isDefinition: true, align: 32)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !667, file: !615, line: 527, type: !672, isLocal: true, isDefinition: true, align: 32)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 512, elements: !661)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 127, baseType: !546)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !696, file: !701, line: 22, type: !728, isLocal: false, isDefinition: true, align: 16)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !698, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!698 = !{!699, !694, !705, !707, !709, !711, !713, !715, !717, !719, !721, !726}
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !696, file: !701, line: 17, type: !702, isLocal: false, isDefinition: true, align: 16)
!701 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 192, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 12)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !696, file: !701, line: 29, type: !616, isLocal: false, isDefinition: true, align: 16)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !696, file: !701, line: 36, type: !616, isLocal: false, isDefinition: true, align: 16)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !696, file: !701, line: 43, type: !616, isLocal: false, isDefinition: true, align: 16)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !696, file: !701, line: 50, type: !616, isLocal: false, isDefinition: true, align: 16)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !696, file: !701, line: 57, type: !616, isLocal: false, isDefinition: true, align: 16)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !696, file: !701, line: 64, type: !616, isLocal: false, isDefinition: true, align: 16)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !696, file: !701, line: 71, type: !616, isLocal: false, isDefinition: true, align: 16)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !696, file: !701, line: 78, type: !616, isLocal: false, isDefinition: true, align: 16)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_51", scope: !696, file: !701, line: 87, type: !723, isLocal: false, isDefinition: true, align: 16)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 80, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 5)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_52", scope: !696, file: !701, line: 94, type: !616, isLocal: false, isDefinition: true, align: 16)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 48, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 3)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !733, file: !777, line: 398, type: !810, isLocal: true, isDefinition: true)
!733 = distinct !DICompileUnit(language: DW_LANG_C99, file: !734, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !735, retainedTypes: !748, globals: !774, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!735 = !{!736, !30, !741}
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 190, baseType: !32, size: 32, elements: !738)
!737 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = !{!739, !740}
!739 = !DIEnumerator(name: "SUCCESS", value: 0)
!740 = !DIEnumerator(name: "ERROR", value: 1)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !742, line: 44, baseType: !32, size: 32, elements: !743)
!742 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!743 = !{!744, !745, !746, !747}
!744 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!745 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!746 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!747 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!748 = !{!102, !103, !121, !749, !767, !773}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 386, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 448, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !751, file: !116, line: 372, baseType: !120, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !751, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !751, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !751, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !751, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !751, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !751, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !751, file: !116, line: 379, baseType: !120, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !751, file: !116, line: 380, baseType: !120, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !751, file: !116, line: 381, baseType: !120, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !751, file: !116, line: 382, baseType: !120, size: 32, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !751, file: !116, line: 383, baseType: !120, size: 32, offset: 352)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !751, file: !116, line: 384, baseType: !120, size: 32, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !751, file: !116, line: 385, baseType: !120, size: 32, offset: 416)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !769, line: 343, size: 64, elements: !770)
!769 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !768, file: !769, line: 344, baseType: !121, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !768, file: !769, line: 345, baseType: !121, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!774 = !{!775, !781, !797, !808, !731}
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !733, file: !777, line: 752, type: !778, isLocal: false, isDefinition: true, align: 16)
!777 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 512, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 32)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !733, file: !777, line: 752, type: !783, isLocal: false, isDefinition: true, align: 32)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !785)
!785 = !{!786, !787, !788, !789, !795, !796}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !784, file: !154, line: 380, baseType: !157, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !784, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !784, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !784, file: !154, line: 386, baseType: !790, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !791, file: !154, line: 359, baseType: !167, size: 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !791, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !784, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !784, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !733, file: !777, line: 752, type: !799, isLocal: true, isDefinition: true, align: 32)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !801)
!801 = !{!802, !807}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !800, file: !145, line: 60, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{!103, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !800, file: !145, line: 65, baseType: !806, size: 32, offset: 32)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !733, file: !777, line: 752, type: !791, isLocal: true, isDefinition: true, align: 8)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !742, line: 100, size: 224, elements: !811)
!811 = !{!812, !818, !819, !828, !833, !838, !844}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !810, file: !742, line: 101, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !742, line: 76, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!103, !806, !817}
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !742, line: 56, baseType: !102)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !810, file: !742, line: 102, baseType: !813, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !810, file: !742, line: 103, baseType: !820, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !742, line: 83, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{!103, !806, !817, !824, !102}
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !742, line: 72, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !806, !817, !102}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !810, file: !742, line: 104, baseType: !829, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !742, line: 79, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DISubroutineType(types: !832)
!832 = !{!103, !806, !817, !773}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !810, file: !742, line: 105, baseType: !834, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !742, line: 88, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DISubroutineType(types: !837)
!837 = !{!741, !806, !817}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !810, file: !742, line: 106, baseType: !839, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !742, line: 92, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{!103, !806, !817, !843}
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !742, line: 64, baseType: !102)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !810, file: !742, line: 107, baseType: !845, size: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !742, line: 96, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{!103, !806, !817, !102}
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !851, file: !908, line: 603, type: !910, isLocal: true, isDefinition: true, align: 32)
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !853, globals: !905, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!853 = !{!102, !103, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !857, line: 336, size: 160, elements: !858)
!857 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!858 = !{!859, !879, !883, !887, !900}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !856, file: !857, line: 365, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!103, !863, !878}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !866)
!866 = !{!867, !868, !869, !870, !876, !877}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !865, file: !154, line: 380, baseType: !157, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !865, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !865, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !865, file: !154, line: 386, baseType: !871, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !872, file: !154, line: 359, baseType: !167, size: 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !872, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !865, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !865, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !856, file: !857, line: 366, baseType: !880, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !863, !168}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !856, file: !857, line: 374, baseType: !884, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DISubroutineType(types: !886)
!886 = !{!103, !863}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !856, file: !857, line: 377, baseType: !888, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DISubroutineType(types: !890)
!890 = !{!103, !863, !891}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !857, line: 122, size: 64, elements: !894)
!894 = !{!895, !896, !897, !898, !899}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !893, file: !857, line: 123, baseType: !121, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !893, file: !857, line: 124, baseType: !167, size: 8, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !893, file: !857, line: 125, baseType: !167, size: 8, offset: 40)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !893, file: !857, line: 126, baseType: !167, size: 8, offset: 48)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !893, file: !857, line: 127, baseType: !167, size: 8, offset: 56)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !856, file: !857, line: 379, baseType: !901, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!103, !863, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!905 = !{!849, !906}
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !851, file: !908, line: 38, type: !909, isLocal: true, isDefinition: true)
!908 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !863)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !911, file: !145, line: 60, baseType: !884, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !911, file: !145, line: 65, baseType: !863, size: 32, offset: 32)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !917, file: !1068, line: 762, type: !1163, isLocal: true, isDefinition: true)
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !919, retainedTypes: !926, globals: !1065, splitDebugInlining: false, nameTableKind: None)
!918 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/thermometer")
!919 = !{!30, !438, !444, !920, !741}
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !656, line: 43, baseType: !32, size: 32, elements: !921)
!921 = !{!922, !923, !924, !925}
!922 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!923 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!924 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!925 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!926 = !{!102, !103, !927, !991, !996, !485, !444, !438, !1001, !1002, !121, !1016, !972, !1024, !1025, !1026}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !439, line: 523, size: 288, elements: !930)
!930 = !{!931, !950, !954, !958, !962, !963, !964, !968, !987}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !929, file: !439, line: 524, baseType: !932, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{!103, !935, !473, !474}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !938)
!938 = !{!939, !940, !941, !942, !948, !949}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !937, file: !154, line: 380, baseType: !157, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !937, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !937, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !937, file: !154, line: 386, baseType: !943, size: 32, offset: 96)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !944, file: !154, line: 359, baseType: !167, size: 8)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !944, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !937, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !937, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !929, file: !439, line: 530, baseType: !951, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{!103, !935, !479}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !929, file: !439, line: 532, baseType: !955, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{!103, !935, !485, !480}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !929, file: !439, line: 535, baseType: !959, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DISubroutineType(types: !961)
!961 = !{!103, !935, !485}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !929, file: !439, line: 537, baseType: !959, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !929, file: !439, line: 539, baseType: !959, size: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !929, file: !439, line: 541, baseType: !965, size: 32, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{!103, !935, !473, !438, !444}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !929, file: !439, line: 544, baseType: !969, size: 32, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!103, !935, !972, !170}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !439, line: 478, size: 96, elements: !974)
!974 = !{!975, !981, !986}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !973, file: !439, line: 482, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !505, line: 33, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !505, line: 29, size: 32, elements: !978)
!978 = !{!979}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !977, file: !505, line: 30, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !973, file: !439, line: 485, baseType: !982, size: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !439, line: 464, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !935, !972, !485}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !973, file: !439, line: 493, baseType: !485, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !929, file: !439, line: 547, baseType: !988, size: 32, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DISubroutineType(types: !990)
!990 = !{!121, !935}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !439, line: 428, size: 32, elements: !994)
!994 = !{!995}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !993, file: !439, line: 434, baseType: !485, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !439, line: 441, size: 32, elements: !999)
!999 = !{!1000}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !998, file: !439, line: 447, baseType: !485, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 314, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 303, size: 320, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !1004, file: !116, line: 305, baseType: !120, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !1004, file: !116, line: 306, baseType: !120, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !1004, file: !116, line: 307, baseType: !120, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !1004, file: !116, line: 308, baseType: !120, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !1004, file: !116, line: 309, baseType: !120, size: 32, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !1004, file: !116, line: 310, baseType: !120, size: 32, offset: 160)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !1004, file: !116, line: 311, baseType: !120, size: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !1004, file: !116, line: 312, baseType: !120, size: 32, offset: 224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !1004, file: !116, line: 313, baseType: !1015, size: 64, offset: 256)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !255)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 325, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 320, size: 192, elements: !1019)
!1019 = !{!1020, !1021, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !1018, file: !116, line: 322, baseType: !120, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !1018, file: !116, line: 323, baseType: !120, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !1018, file: !116, line: 324, baseType: !1023, size: 128, offset: 64)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !617)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !742, line: 100, size: 224, elements: !1029)
!1029 = !{!1030, !1035, !1036, !1045, !1050, !1055, !1060}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1028, file: !742, line: 101, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !742, line: 76, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!103, !935, !817}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1028, file: !742, line: 102, baseType: !1031, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1028, file: !742, line: 103, baseType: !1037, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !742, line: 83, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!103, !935, !817, !1041, !102}
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !742, line: 72, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !935, !817, !102}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1028, file: !742, line: 104, baseType: !1046, size: 32, offset: 96)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !742, line: 79, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!103, !935, !817, !773}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1028, file: !742, line: 105, baseType: !1051, size: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !742, line: 88, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 32)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!741, !935, !817}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1028, file: !742, line: 106, baseType: !1056, size: 32, offset: 160)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !742, line: 92, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 32)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!103, !935, !817, !843}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1028, file: !742, line: 107, baseType: !1061, size: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !742, line: 96, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 32)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!103, !935, !817, !102}
