; ModuleID = 'build/96b_neonkey/accel_polling/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 98, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5504, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 86)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2752, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 259, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f411xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 250, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 252, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 253, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 254, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 255, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 256, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 257, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 258, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !347, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !333, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !328)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !323}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 160, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !324, size: 64, offset: 928)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !324, file: !284, line: 63, baseType: !121, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !324, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!328 = !{!329, !330, !331, !332}
!329 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!330 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!331 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!332 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 96, elements: !345)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !335, line: 52, size: 96, elements: !336)
!335 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !334, file: !335, line: 53, baseType: !22, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !335, line: 54, baseType: !200, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !334, file: !335, line: 55, baseType: !340, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !341, line: 151, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 149, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !342, file: !341, line: 150, baseType: !121, size: 32)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !345)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !351, file: !384, line: 39, type: !154, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !383, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!353 = !{!354, !102, !103, !371, !154}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !356, line: 1226, baseType: !357)
!356 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 1213, size: 352, elements: !358)
!358 = !{!359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !357, file: !356, line: 1215, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !357, file: !356, line: 1216, baseType: !120, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !357, file: !356, line: 1217, baseType: !120, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !357, file: !356, line: 1218, baseType: !120, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !357, file: !356, line: 1219, baseType: !120, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !357, file: !356, line: 1220, baseType: !120, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !357, file: !356, line: 1221, baseType: !120, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !357, file: !356, line: 1222, baseType: !120, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !357, file: !356, line: 1223, baseType: !120, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !357, file: !356, line: 1224, baseType: !120, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !357, file: !356, line: 1225, baseType: !120, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !373, file: !374, line: 29, baseType: !121, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !373, file: !374, line: 37, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !380, file: !341, line: 143, baseType: !121, size: 32)
!383 = !{!349}
!384 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !387, file: !394, line: 21, type: !106, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !389, globals: !393, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!389 = !{!390, !103, !102}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !392, line: 22, baseType: !103)
!392 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!385}
!394 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !397, file: !402, line: 13, type: !419, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !399, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!399 = !{!400, !395}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "mpu_config", scope: !397, file: !402, line: 37, type: !403, isLocal: false, isDefinition: true)
!402 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !374, line: 41, size: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !404, file: !374, line: 43, baseType: !121, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !404, file: !374, line: 45, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !410, file: !374, line: 29, baseType: !121, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !410, file: !374, line: 37, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !416, file: !341, line: 143, baseType: !121, size: 32)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 192, elements: !242)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !422, file: !506, line: 72, type: !590, isLocal: true, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !424, retainedTypes: !492, globals: !503, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!424 = !{!30, !425}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!427 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!428 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!429 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!430 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!431 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!432 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!433 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!434 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!435 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!436 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!437 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!438 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!439 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!440 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!441 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!442 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!443 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!444 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!445 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!446 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!447 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!448 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!449 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!450 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!451 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!452 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!453 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!454 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!455 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!456 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!457 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!458 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!459 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!460 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!461 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!462 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!463 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!464 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!465 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!466 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!467 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!468 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!469 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!470 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!471 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!472 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!473 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!474 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!475 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!476 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!477 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!478 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!479 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!480 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!481 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!482 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!483 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!484 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!485 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!486 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!487 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!488 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!489 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!490 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!491 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!492 = !{!200, !103, !102, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 244, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 236, size: 192, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !495, file: !116, line: 238, baseType: !120, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !495, file: !116, line: 239, baseType: !120, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !495, file: !116, line: 240, baseType: !120, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !495, file: !116, line: 241, baseType: !120, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !495, file: !116, line: 242, baseType: !120, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !495, file: !116, line: 243, baseType: !120, size: 32, offset: 160)
!503 = !{!504, !510, !526, !537, !554, !420, !556, !570, !572, !574, !576, !578, !580, !582, !584, !586, !588}
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !422, file: !506, line: 424, type: !507, isLocal: false, isDefinition: true, align: 16)
!506 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 4)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !422, file: !506, line: 424, type: !512, isLocal: false, isDefinition: true, align: 32)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !514)
!514 = !{!515, !516, !517, !518, !524, !525}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !513, file: !141, line: 380, baseType: !144, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !513, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !513, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !513, file: !141, line: 386, baseType: !519, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !520, file: !141, line: 359, baseType: !154, size: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !520, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !513, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !513, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !422, file: !506, line: 424, type: !528, isLocal: true, isDefinition: true, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !530)
!530 = !{!531, !536}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !529, file: !132, line: 60, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DISubroutineType(types: !534)
!534 = !{!103, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !529, file: !132, line: 65, baseType: !535, size: 32, offset: 32)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "exti_data", scope: !422, file: !506, line: 423, type: !539, isLocal: true, isDefinition: true)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !506, line: 107, size: 1472, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !539, file: !506, line: 109, baseType: !542, size: 1472)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1472, elements: !552)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !506, line: 101, size: 64, elements: !544)
!544 = !{!545, !551}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !543, file: !506, line: 102, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !547, line: 63, baseType: !548)
!547 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !103, !102}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !543, file: !506, line: 103, baseType: !102, size: 32, offset: 32)
!552 = !{!553}
!553 = !DISubrange(count: 23)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !422, file: !506, line: 424, type: !520, isLocal: true, isDefinition: true, align: 8)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !558, file: !506, line: 493, type: !563, isLocal: true, isDefinition: true, align: 32)
!558 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !506, file: !506, line: 460, type: !559, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !422, retainedNodes: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !535}
!561 = !{!562}
!562 = !DILocalVariable(name: "dev", arg: 1, scope: !558, file: !506, line: 460, type: !535)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !564)
!564 = !{!565, !567, !568, !569}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !563, file: !10, line: 55, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !563, file: !10, line: 57, baseType: !566, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !563, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !563, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !558, file: !506, line: 497, type: !563, isLocal: true, isDefinition: true, align: 32)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !558, file: !506, line: 507, type: !563, isLocal: true, isDefinition: true, align: 32)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !558, file: !506, line: 512, type: !563, isLocal: true, isDefinition: true, align: 32)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !558, file: !506, line: 516, type: !563, isLocal: true, isDefinition: true, align: 32)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !558, file: !506, line: 523, type: !563, isLocal: true, isDefinition: true, align: 32)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !558, file: !506, line: 527, type: !563, isLocal: true, isDefinition: true, align: 32)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !558, file: !506, line: 581, type: !563, isLocal: true, isDefinition: true, align: 32)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !558, file: !506, line: 586, type: !563, isLocal: true, isDefinition: true, align: 32)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !558, file: !506, line: 591, type: !563, isLocal: true, isDefinition: true, align: 32)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !558, file: !506, line: 595, type: !563, isLocal: true, isDefinition: true, align: 32)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 736, elements: !552)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 134, baseType: !425)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !595, file: !600, line: 22, type: !622, isLocal: false, isDefinition: true, align: 16)
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !597, splitDebugInlining: false, nameTableKind: None)
!596 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!597 = !{!598, !593, !604, !606, !608, !610, !612, !614, !616, !618, !620}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !595, file: !600, line: 17, type: !601, isLocal: false, isDefinition: true, align: 16)
!600 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 192, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 12)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !595, file: !600, line: 29, type: !507, isLocal: false, isDefinition: true, align: 16)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !595, file: !600, line: 36, type: !507, isLocal: false, isDefinition: true, align: 16)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !595, file: !600, line: 43, type: !507, isLocal: false, isDefinition: true, align: 16)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !595, file: !600, line: 50, type: !507, isLocal: false, isDefinition: true, align: 16)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !595, file: !600, line: 57, type: !507, isLocal: false, isDefinition: true, align: 16)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !595, file: !600, line: 64, type: !507, isLocal: false, isDefinition: true, align: 16)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !595, file: !600, line: 71, type: !507, isLocal: false, isDefinition: true, align: 16)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !595, file: !600, line: 78, type: !507, isLocal: false, isDefinition: true, align: 16)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !595, file: !600, line: 85, type: !507, isLocal: false, isDefinition: true, align: 16)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 3)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !627, file: !691, line: 398, type: !724, isLocal: true, isDefinition: true)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !642, globals: !688, splitDebugInlining: false, nameTableKind: None)
!628 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!629 = !{!630, !30, !635}
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !631, line: 197, baseType: !32, size: 32, elements: !632)
!631 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = !{!633, !634}
!633 = !DIEnumerator(name: "SUCCESS", value: 0)
!634 = !DIEnumerator(name: "ERROR", value: 1)
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !636, line: 44, baseType: !32, size: 32, elements: !637)
!636 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!637 = !{!638, !639, !640, !641}
!638 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!639 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!640 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!641 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!642 = !{!102, !103, !121, !643, !681, !687}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 370, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 336, size: 1152, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !680}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !645, file: !116, line: 338, baseType: !120, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !645, file: !116, line: 339, baseType: !120, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !645, file: !116, line: 340, baseType: !120, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !645, file: !116, line: 341, baseType: !120, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !645, file: !116, line: 342, baseType: !120, size: 32, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !645, file: !116, line: 343, baseType: !120, size: 32, offset: 160)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !645, file: !116, line: 344, baseType: !120, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !645, file: !116, line: 345, baseType: !121, size: 32, offset: 224)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !645, file: !116, line: 346, baseType: !120, size: 32, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !645, file: !116, line: 347, baseType: !120, size: 32, offset: 288)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !645, file: !116, line: 348, baseType: !658, size: 64, offset: 320)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !645, file: !116, line: 349, baseType: !120, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !645, file: !116, line: 350, baseType: !120, size: 32, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !645, file: !116, line: 351, baseType: !120, size: 32, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !645, file: !116, line: 352, baseType: !121, size: 32, offset: 480)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !645, file: !116, line: 353, baseType: !120, size: 32, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !645, file: !116, line: 354, baseType: !120, size: 32, offset: 544)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !645, file: !116, line: 355, baseType: !658, size: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !645, file: !116, line: 356, baseType: !120, size: 32, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !645, file: !116, line: 357, baseType: !120, size: 32, offset: 672)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !645, file: !116, line: 358, baseType: !120, size: 32, offset: 704)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !645, file: !116, line: 359, baseType: !121, size: 32, offset: 736)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !645, file: !116, line: 360, baseType: !120, size: 32, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !645, file: !116, line: 361, baseType: !120, size: 32, offset: 800)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !645, file: !116, line: 362, baseType: !658, size: 64, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !645, file: !116, line: 363, baseType: !120, size: 32, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !645, file: !116, line: 364, baseType: !120, size: 32, offset: 928)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !645, file: !116, line: 365, baseType: !658, size: 64, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !645, file: !116, line: 366, baseType: !120, size: 32, offset: 1024)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !645, file: !116, line: 367, baseType: !120, size: 32, offset: 1056)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !645, file: !116, line: 368, baseType: !679, size: 32, offset: 1088)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 32, elements: !345)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !645, file: !116, line: 369, baseType: !120, size: 32, offset: 1120)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !683, line: 343, size: 64, elements: !684)
!683 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !682, file: !683, line: 344, baseType: !121, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !682, file: !683, line: 345, baseType: !121, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!688 = !{!689, !695, !711, !722, !625}
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !627, file: !691, line: 752, type: !692, isLocal: false, isDefinition: true, align: 16)
!691 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 704, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 44)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !627, file: !691, line: 752, type: !697, isLocal: false, isDefinition: true, align: 32)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !699)
!699 = !{!700, !701, !702, !703, !709, !710}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !698, file: !141, line: 380, baseType: !144, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !698, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !698, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !698, file: !141, line: 386, baseType: !704, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !705, file: !141, line: 359, baseType: !154, size: 8)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !705, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !698, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !698, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !627, file: !691, line: 752, type: !713, isLocal: true, isDefinition: true, align: 32)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !715)
!715 = !{!716, !721}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !714, file: !132, line: 60, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DISubroutineType(types: !719)
!719 = !{!103, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !714, file: !132, line: 65, baseType: !720, size: 32, offset: 32)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !627, file: !691, line: 752, type: !705, isLocal: true, isDefinition: true, align: 8)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !636, line: 100, size: 224, elements: !725)
!725 = !{!726, !732, !733, !742, !747, !752, !758}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !724, file: !636, line: 101, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !636, line: 76, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DISubroutineType(types: !730)
!730 = !{!103, !720, !731}
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !636, line: 56, baseType: !102)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !724, file: !636, line: 102, baseType: !727, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !724, file: !636, line: 103, baseType: !734, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !636, line: 83, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DISubroutineType(types: !737)
!737 = !{!103, !720, !731, !738, !102}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !636, line: 72, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !720, !731, !102}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !724, file: !636, line: 104, baseType: !743, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !636, line: 79, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{!103, !720, !731, !687}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !724, file: !636, line: 105, baseType: !748, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !636, line: 88, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DISubroutineType(types: !751)
!751 = !{!635, !720, !731}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !724, file: !636, line: 106, baseType: !753, size: 32, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !636, line: 92, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DISubroutineType(types: !756)
!756 = !{!103, !720, !731, !757}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !636, line: 64, baseType: !102)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !724, file: !636, line: 107, baseType: !759, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !636, line: 96, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DISubroutineType(types: !762)
!762 = !{!103, !720, !731, !102}
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !765, file: !822, line: 603, type: !824, isLocal: true, isDefinition: true, align: 32)
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !767, globals: !819, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!767 = !{!102, !103, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !771, line: 336, size: 160, elements: !772)
!771 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!772 = !{!773, !793, !797, !801, !814}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !770, file: !771, line: 365, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DISubroutineType(types: !776)
!776 = !{!103, !777, !792}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !780)
!780 = !{!781, !782, !783, !784, !790, !791}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !779, file: !141, line: 380, baseType: !144, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !779, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !779, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !779, file: !141, line: 386, baseType: !785, size: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !786, file: !141, line: 359, baseType: !154, size: 8)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !786, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !779, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !779, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !770, file: !771, line: 366, baseType: !794, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !777, !155}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !770, file: !771, line: 374, baseType: !798, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{!103, !777}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !770, file: !771, line: 377, baseType: !802, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DISubroutineType(types: !804)
!804 = !{!103, !777, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !771, line: 122, size: 64, elements: !808)
!808 = !{!809, !810, !811, !812, !813}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !807, file: !771, line: 123, baseType: !121, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !807, file: !771, line: 124, baseType: !154, size: 8, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !807, file: !771, line: 125, baseType: !154, size: 8, offset: 40)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !807, file: !771, line: 126, baseType: !154, size: 8, offset: 48)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !807, file: !771, line: 127, baseType: !154, size: 8, offset: 56)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !770, file: !771, line: 379, baseType: !815, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DISubroutineType(types: !817)
!817 = !{!103, !777, !818}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!819 = !{!763, !820}
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !765, file: !822, line: 38, type: !823, isLocal: true, isDefinition: true)
!822 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !825, file: !132, line: 60, baseType: !798, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !825, file: !132, line: 65, baseType: !777, size: 32, offset: 32)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !831, file: !1001, line: 762, type: !1110, isLocal: true, isDefinition: true)
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !833, retainedTypes: !851, globals: !998, splitDebugInlining: false, nameTableKind: None)
!832 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/accel_polling")
!833 = !{!30, !834, !840, !845, !635}
!834 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !835, line: 506, baseType: !32, size: 32, elements: !836)
!835 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!836 = !{!837, !838, !839}
!837 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!838 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!839 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!840 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !835, line: 512, baseType: !32, size: 32, elements: !841)
!841 = !{!842, !843, !844}
!842 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!843 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!844 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!845 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !547, line: 43, baseType: !32, size: 32, elements: !846)
!846 = !{!847, !848, !849, !850}
!847 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!848 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!849 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!850 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!851 = !{!102, !103, !852, !922, !927, !887, !840, !834, !932, !933, !121, !947, !902, !957, !958, !959}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !835, line: 523, size: 288, elements: !855)
!855 = !{!856, !877, !883, !888, !892, !893, !894, !898, !918}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !854, file: !835, line: 524, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{!103, !860, !875, !876}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !863)
!863 = !{!864, !865, !866, !867, !873, !874}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !862, file: !141, line: 380, baseType: !144, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !862, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !862, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !862, file: !141, line: 386, baseType: !868, size: 32, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !869, file: !141, line: 359, baseType: !154, size: 8)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !869, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !862, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !862, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !835, line: 237, baseType: !154)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !835, line: 257, baseType: !121)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !854, file: !835, line: 530, baseType: !878, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = !DISubroutineType(types: !880)
!880 = !{!103, !860, !881}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !835, line: 229, baseType: !121)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !854, file: !835, line: 532, baseType: !884, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DISubroutineType(types: !886)
!886 = !{!103, !860, !887, !882}
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !835, line: 216, baseType: !121)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !854, file: !835, line: 535, baseType: !889, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DISubroutineType(types: !891)
!891 = !{!103, !860, !887}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !854, file: !835, line: 537, baseType: !889, size: 32, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !854, file: !835, line: 539, baseType: !889, size: 32, offset: 160)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !854, file: !835, line: 541, baseType: !895, size: 32, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DISubroutineType(types: !897)
!897 = !{!103, !860, !875, !834, !840}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !854, file: !835, line: 544, baseType: !899, size: 32, offset: 224)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DISubroutineType(types: !901)
!901 = !{!103, !860, !902, !157}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !835, line: 478, size: 96, elements: !904)
!904 = !{!905, !912, !917}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !903, file: !835, line: 482, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !907, line: 33, baseType: !908)
!907 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !907, line: 29, size: 32, elements: !909)
!909 = !{!910}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !908, file: !907, line: 30, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !903, file: !835, line: 485, baseType: !913, size: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !835, line: 464, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !860, !902, !887}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !903, file: !835, line: 493, baseType: !887, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !854, file: !835, line: 547, baseType: !919, size: 32, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DISubroutineType(types: !921)
!921 = !{!121, !860}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !835, line: 428, size: 32, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !924, file: !835, line: 434, baseType: !887, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !835, line: 441, size: 32, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !929, file: !835, line: 447, baseType: !887, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 276, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 265, size: 320, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !935, file: !116, line: 267, baseType: !120, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !935, file: !116, line: 268, baseType: !120, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !935, file: !116, line: 269, baseType: !120, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !935, file: !116, line: 270, baseType: !120, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !935, file: !116, line: 271, baseType: !120, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !935, file: !116, line: 272, baseType: !120, size: 32, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !935, file: !116, line: 273, baseType: !120, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !935, file: !116, line: 274, baseType: !120, size: 32, offset: 224)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !935, file: !116, line: 275, baseType: !946, size: 64, offset: 256)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 289, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 282, size: 288, elements: !950)
!950 = !{!951, !952, !953, !955, !956}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !949, file: !116, line: 284, baseType: !120, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !949, file: !116, line: 285, baseType: !120, size: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !949, file: !116, line: 286, baseType: !954, size: 128, offset: 64)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !508)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !949, file: !116, line: 287, baseType: !658, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !949, file: !116, line: 288, baseType: !120, size: 32, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !636, line: 100, size: 224, elements: !962)
!962 = !{!963, !968, !969, !978, !983, !988, !993}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !961, file: !636, line: 101, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !636, line: 76, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{!103, !860, !731}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !961, file: !636, line: 102, baseType: !964, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !961, file: !636, line: 103, baseType: !970, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !636, line: 83, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DISubroutineType(types: !973)
!973 = !{!103, !860, !731, !974, !102}
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !636, line: 72, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{null, !860, !731, !102}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !961, file: !636, line: 104, baseType: !979, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !636, line: 79, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!103, !860, !731, !687}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !961, file: !636, line: 105, baseType: !984, size: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !636, line: 88, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{!635, !860, !731}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !961, file: !636, line: 106, baseType: !989, size: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !636, line: 92, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{!103, !860, !731, !757}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !961, file: !636, line: 107, baseType: !994, size: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !636, line: 96, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{!103, !860, !731, !102}
!998 = !{!999, !1005, !1007, !1017, !1022, !1024, !1026, !1028, !1030, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !829, !1106, !1108, !1121, !1123, !1125, !1127, !1129, !1131}
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !831, file: !1001, line: 762, type: !1002, isLocal: false, isDefinition: true, align: 16)
!1001 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 5)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "__device_dts_ord_67", scope: !831, file: !1001, line: 762, type: !861, isLocal: false, isDefinition: true, align: 32)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_67", scope: !831, file: !1001, line: 762, type: !1009, isLocal: true, isDefinition: true, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1011)
!1011 = !{!1012, !1016}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1010, file: !132, line: 60, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!103, !860}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1010, file: !132, line: 65, baseType: !860, size: 32, offset: 32)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !831, file: !1001, line: 766, type: !1019, isLocal: false, isDefinition: true, align: 16)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 160, elements: !1020)
!1020 = !{!1021}
!1021 = !DISubrange(count: 10)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "__device_dts_ord_19", scope: !831, file: !1001, line: 766, type: !861, isLocal: false, isDefinition: true, align: 32)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_19", scope: !831, file: !1001, line: 766, type: !1009, isLocal: true, isDefinition: true, align: 32)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !831, file: !1001, line: 770, type: !1002, isLocal: false, isDefinition: true, align: 16)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !831, file: !1001, line: 770, type: !861, isLocal: false, isDefinition: true, align: 32)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_68", scope: !831, file: !1001, line: 770, type: !1009, isLocal: true, isDefinition: true, align: 32)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !831, file: !1001, line: 774, type: !1002, isLocal: false, isDefinition: true, align: 16)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "__device_dts_ord_69", scope: !831, file: !1001, line: 774, type: !861, isLocal: false, isDefinition: true, align: 32)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_69", scope: !831, file: !1001, line: 774, type: !1009, isLocal: true, isDefinition: true, align: 32)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !831, file: !1001, line: 778, type: !1002, isLocal: false, isDefinition: true, align: 16)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "__device_dts_ord_70", scope: !831, file: !1001, line: 778, type: !861, isLocal: false, isDefinition: true, align: 32)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_70", scope: !831, file: !1001, line: 778, type: !1009, isLocal: true, isDefinition: true, align: 32)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !831, file: !1001, line: 782, type: !1002, isLocal: false, isDefinition: true, align: 16)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
