; ModuleID = 'build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.os_semaphore_def = type { i32 }
%struct.os_semaphore_cb = type opaque
%struct.os_thread_def = type { void (i8*)*, i32, i32, i32, i8*, %struct.k_thread*, %struct.k_poll_signal*, %struct.k_poll_event*, i32, i8* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, %struct.z_poller, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i8*, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct.z_poller = type { i8, i8 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.os_semaphore_def }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "os_semaphore_def_0", scope: !27, file: !140, line: 34, type: !141, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !130, globals: !137, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v1/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!29 = !{!30, !49, !119}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 99, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osEventSignal", value: 8)
!36 = !DIEnumerator(name: "osEventMessage", value: 16)
!37 = !DIEnumerator(name: "osEventMail", value: 32)
!38 = !DIEnumerator(name: "osEventTimeout", value: 64)
!39 = !DIEnumerator(name: "osErrorParameter", value: 128)
!40 = !DIEnumerator(name: "osErrorResource", value: 129)
!41 = !DIEnumerator(name: "osErrorTimeoutResource", value: 193)
!42 = !DIEnumerator(name: "osErrorISR", value: 130)
!43 = !DIEnumerator(name: "osErrorISRRecursive", value: 131)
!44 = !DIEnumerator(name: "osErrorPriority", value: 132)
!45 = !DIEnumerator(name: "osErrorNoMemory", value: 133)
!46 = !DIEnumerator(name: "osErrorValue", value: 134)
!47 = !DIEnumerator(name: "osErrorOS", value: 255)
!48 = !DIEnumerator(name: "os_status_reserved", value: 2147483647)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !50, line: 27, baseType: !32, size: 32, elements: !51)
!50 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!52 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!53 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!54 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!55 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!56 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!57 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!58 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!59 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!60 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!61 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!62 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!63 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!64 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!65 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!66 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!67 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!68 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!118 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 82, baseType: !120, size: 32, elements: !121)
!120 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129}
!122 = !DIEnumerator(name: "osPriorityIdle", value: -3)
!123 = !DIEnumerator(name: "osPriorityLow", value: -2)
!124 = !DIEnumerator(name: "osPriorityBelowNormal", value: -1)
!125 = !DIEnumerator(name: "osPriorityNormal", value: 0)
!126 = !DIEnumerator(name: "osPriorityAboveNormal", value: 1)
!127 = !DIEnumerator(name: "osPriorityHigh", value: 2)
!128 = !DIEnumerator(name: "osPriorityRealtime", value: 3)
!129 = !DIEnumerator(name: "osPriorityError", value: 132)
!130 = !{!131, !133, !120, !134, !135}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !132)
!132 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !136)
!136 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!137 = !{!25, !138, !146, !148, !150, !152, !154, !163, !401, !410, !413, !415, !417, !428}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "os_semaphore_def_1", scope: !27, file: !140, line: 35, type: !141, isLocal: false, isDefinition: true)
!140 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v1/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreDef_t", file: !31, line: 196, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_semaphore_def", file: !31, line: 194, size: 32, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !143, file: !31, line: 195, baseType: !134, size: 32)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "os_semaphore_def_2", scope: !27, file: !140, line: 36, type: !141, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "os_semaphore_def_3", scope: !27, file: !140, line: 37, type: !141, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "os_semaphore_def_4", scope: !27, file: !140, line: 38, type: !141, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "os_semaphore_def_5", scope: !27, file: !140, line: 39, type: !141, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !156, line: 70, type: !157, isLocal: false, isDefinition: true)
!156 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v1/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 192, elements: !161)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreId", file: !31, line: 149, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "os_semaphore_cb", file: !31, line: 149, flags: DIFlagFwdDecl)
!161 = !{!162}
!162 = !DISubrange(count: 6)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "os_thread_def_philosopher", scope: !27, file: !156, line: 177, type: !165, isLocal: true, isDefinition: true)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadDef_t", file: !31, line: 178, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_thread_def", file: !31, line: 166, size: 320, elements: !167)
!167 = !{!168, !170, !172, !173, !174, !175, !325, !332, !398, !400}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pthread", scope: !166, file: !31, line: 167, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "os_pthread", file: !31, line: 127, baseType: !16)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tpriority", scope: !166, file: !31, line: 168, baseType: !171, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "osPriority", file: !31, line: 91, baseType: !119)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "instances", scope: !166, file: !31, line: 169, baseType: !134, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !166, file: !31, line: 170, baseType: !134, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !166, file: !31, line: 171, baseType: !133, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "cm_thread", scope: !166, file: !31, line: 172, baseType: !176, size: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !178, line: 245, size: 1472, elements: !179)
!178 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!179 = !{!180, !251, !264, !265, !266, !272, !284, !285, !290, !291, !292, !300, !320}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !177, file: !178, line: 247, baseType: !181, size: 384)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !178, line: 57, size: 384, elements: !182)
!182 = !{!183, !211, !219, !222, !223, !236, !237, !238}
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !178, line: 60, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !181, file: !178, line: 60, size: 64, elements: !185)
!185 = !{!186, !202}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !184, file: !178, line: 61, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !188, line: 49, baseType: !189)
!188 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !188, line: 37, size: 64, elements: !190)
!190 = !{!191, !197}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !188, line: 38, baseType: !192, size: 32)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !188, line: 38, size: 32, elements: !193)
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !192, file: !188, line: 39, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !188, line: 40, baseType: !195, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !188, line: 42, baseType: !198, size: 32, offset: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !188, line: 42, size: 32, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !198, file: !188, line: 43, baseType: !195, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !198, file: !188, line: 44, baseType: !195, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !184, file: !178, line: 62, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !204, line: 49, size: 64, elements: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !203, file: !204, line: 50, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 64, elements: !209)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !181, file: !178, line: 68, baseType: !212, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !214, line: 233, baseType: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 231, size: 64, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !215, file: !214, line: 232, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !188, line: 48, baseType: !189)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !181, file: !178, line: 71, baseType: !220, size: 8, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !221)
!221 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !181, file: !178, line: 74, baseType: !220, size: 8, offset: 104)
!223 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !178, line: 90, baseType: !224, size: 16, offset: 112)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !181, file: !178, line: 90, size: 16, elements: !225)
!225 = !{!226, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, scope: !224, file: !178, line: 91, baseType: !227, size: 16)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !224, file: !178, line: 91, size: 16, elements: !228)
!228 = !{!229, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !227, file: !178, line: 96, baseType: !230, size: 8)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !231)
!231 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !227, file: !178, line: 97, baseType: !220, size: 8, offset: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !224, file: !178, line: 100, baseType: !234, size: 16)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !235)
!235 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !181, file: !178, line: 107, baseType: !134, size: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !181, file: !178, line: 127, baseType: !133, size: 32, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !181, file: !178, line: 131, baseType: !239, size: 192, offset: 192)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !214, line: 244, size: 192, elements: !240)
!240 = !{!241, !242, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !239, file: !214, line: 245, baseType: !187, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !239, file: !214, line: 246, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !214, line: 242, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !239, file: !214, line: 249, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !250)
!250 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !177, file: !178, line: 250, baseType: !252, size: 288, offset: 384)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !253, line: 25, size: 288, elements: !254)
!253 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !252, file: !253, line: 26, baseType: !134, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !252, file: !253, line: 27, baseType: !134, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !252, file: !253, line: 28, baseType: !134, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !252, file: !253, line: 29, baseType: !134, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !252, file: !253, line: 30, baseType: !134, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !252, file: !253, line: 31, baseType: !134, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !252, file: !253, line: 32, baseType: !134, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !252, file: !253, line: 33, baseType: !134, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !252, file: !253, line: 34, baseType: !134, size: 32, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !177, file: !178, line: 253, baseType: !133, size: 32, offset: 672)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !177, file: !178, line: 256, baseType: !213, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !177, file: !178, line: 259, baseType: !267, size: 16, offset: 768)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !178, line: 236, size: 16, elements: !268)
!268 = !{!269, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !267, file: !178, line: 237, baseType: !270, size: 8)
!270 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !267, file: !178, line: 238, baseType: !220, size: 8, offset: 8)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !177, file: !178, line: 271, baseType: !273, size: 128, offset: 800)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !178, line: 34, size: 128, elements: !274)
!274 = !{!275, !281, !282, !283}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !273, file: !178, line: 35, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !277, line: 46, baseType: !278)
!277 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !133, !133, !133}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !273, file: !178, line: 36, baseType: !133, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !273, file: !178, line: 37, baseType: !133, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !273, file: !178, line: 38, baseType: !133, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !177, file: !178, line: 274, baseType: !176, size: 32, offset: 928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !178, line: 279, baseType: !286, size: 256, offset: 960)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 256, elements: !288)
!287 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!288 = !{!289}
!289 = !DISubrange(count: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !177, file: !178, line: 284, baseType: !133, size: 32, offset: 1216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !177, file: !178, line: 294, baseType: !120, size: 32, offset: 1248)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !177, file: !178, line: 300, baseType: !293, size: 96, offset: 1280)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !178, line: 149, size: 96, elements: !294)
!294 = !{!295, !296, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !293, file: !178, line: 153, baseType: !22, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !293, file: !178, line: 162, baseType: !297, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !298, line: 214, baseType: !32)
!298 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !293, file: !178, line: 168, baseType: !297, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !177, file: !178, line: 325, baseType: !301, size: 32, offset: 1376)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !303, line: 5073, size: 192, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !314, !315}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !302, file: !303, line: 5074, baseType: !306, size: 96)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !307, line: 56, size: 96, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 57, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !307, line: 57, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !306, file: !307, line: 58, baseType: !133, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !306, file: !307, line: 59, baseType: !297, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !302, file: !303, line: 5075, baseType: !213, size: 64, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !302, file: !303, line: 5076, baseType: !316, size: 32, offset: 160)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !317, line: 43, size: 32, elements: !318)
!317 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !316, file: !317, line: 52, baseType: !22, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !177, file: !178, line: 343, baseType: !321, size: 64, offset: 1408)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !253, line: 60, size: 64, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !321, file: !253, line: 63, baseType: !134, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !321, file: !253, line: 66, baseType: !134, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "poll_signal", scope: !166, file: !31, line: 173, baseType: !326, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !303, line: 5397, size: 128, elements: !328)
!328 = !{!329, !330, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !327, file: !303, line: 5399, baseType: !218, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !327, file: !303, line: 5405, baseType: !32, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !327, file: !303, line: 5408, baseType: !120, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !166, file: !31, line: 174, baseType: !333, size: 32, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_event", file: !303, line: 5421, size: 160, elements: !335)
!335 = !{!336, !337, !339, !340, !341, !342, !343, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !334, file: !303, line: 5423, baseType: !187, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !334, file: !303, line: 5426, baseType: !338, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !334, file: !303, line: 5429, baseType: !134, size: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !303, line: 5432, baseType: !134, size: 6, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !334, file: !303, line: 5435, baseType: !134, size: 7, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !334, file: !303, line: 5438, baseType: !134, size: 1, offset: 117, flags: DIFlagBitField, extraData: i64 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !334, file: !303, line: 5441, baseType: !134, size: 10, offset: 118, flags: DIFlagBitField, extraData: i64 96)
!344 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !303, line: 5444, baseType: !345, size: 32, offset: 128)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !303, line: 5444, size: 32, elements: !346)
!346 = !{!347, !348, !349, !357, !380, !382}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !345, file: !303, line: 5445, baseType: !133, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !345, file: !303, line: 5446, baseType: !326, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !345, file: !303, line: 5447, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !303, line: 2909, size: 192, elements: !352)
!352 = !{!353, !354, !355, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !351, file: !303, line: 2910, baseType: !213, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !351, file: !303, line: 2911, baseType: !32, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !351, file: !303, line: 2912, baseType: !32, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !351, file: !303, line: 2914, baseType: !218, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !345, file: !303, line: 5448, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !303, line: 2208, size: 224, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !359, file: !303, line: 2209, baseType: !362, size: 224)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !303, line: 1709, size: 224, elements: !363)
!363 = !{!364, !377, !378, !379}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !362, file: !303, line: 1710, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !366, line: 46, baseType: !367)
!366 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !366, line: 41, size: 64, elements: !368)
!368 = !{!369, !376}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !367, file: !366, line: 42, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !366, line: 39, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !366, line: 35, size: 32, elements: !373)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !372, file: !366, line: 36, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !366, line: 32, baseType: !134)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !367, file: !366, line: 43, baseType: !370, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !362, file: !303, line: 1711, baseType: !316, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !362, file: !303, line: 1712, baseType: !213, size: 64, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !362, file: !303, line: 1714, baseType: !218, size: 64, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !345, file: !303, line: 5449, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !345, file: !303, line: 5450, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !303, line: 4204, size: 416, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !392, !393, !394, !395, !396, !397}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !384, file: !303, line: 4206, baseType: !213, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !384, file: !303, line: 4208, baseType: !316, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !384, file: !303, line: 4210, baseType: !297, size: 32, offset: 96)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !384, file: !303, line: 4212, baseType: !134, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !384, file: !303, line: 4214, baseType: !391, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !384, file: !303, line: 4216, baseType: !391, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !384, file: !303, line: 4218, baseType: !391, size: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !384, file: !303, line: 4220, baseType: !391, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !384, file: !303, line: 4222, baseType: !134, size: 32, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !384, file: !303, line: 4224, baseType: !218, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !384, file: !303, line: 4227, baseType: !220, size: 8, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "signal_results", scope: !166, file: !31, line: 175, baseType: !399, size: 32, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !120)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "status_mask", scope: !166, file: !31, line: 177, baseType: !133, size: 32, offset: 288)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "stacks_philosopher", scope: !27, file: !156, line: 177, type: !403, isLocal: true, isDefinition: true, align: 512)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 52224, elements: !408)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !405, line: 47, size: 8, elements: !406)
!405 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !405, line: 48, baseType: !287, size: 8)
!408 = !{!162, !409}
!409 = !DISubrange(count: 1088)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "cm_thread_philosopher", scope: !27, file: !156, line: 177, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 8832, elements: !161)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "wait_signal_philosopher", scope: !27, file: !156, line: 177, type: !327, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "wait_events_philosopher", scope: !27, file: !156, line: 177, type: !334, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "bitarray_philosopher", scope: !27, file: !156, line: 177, type: !419, isLocal: true, isDefinition: true)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_bitarray_t", file: !420, line: 33, baseType: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/sys/bitarray.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_bitarray", file: !420, line: 19, size: 128, elements: !422)
!422 = !{!423, !424, !425, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !421, file: !420, line: 21, baseType: !134, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "num_bundles", scope: !421, file: !420, line: 24, baseType: !134, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bundles", scope: !421, file: !420, line: 27, baseType: !426, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !421, file: !420, line: 30, baseType: !316, size: 32, offset: 96)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "_sys_bitarray_bundles_bitarray_philosopher", scope: !27, file: !156, line: 177, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 1)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "_char_out", scope: !435, file: !440, line: 54, type: !441, isLocal: false, isDefinition: true)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !438, globals: !439, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!437 = !{!49}
!438 = !{!133, !120}
!439 = !{!433}
!440 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{!120, !120}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !446, file: !463, line: 56, type: !464, isLocal: true, isDefinition: true, align: 32)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !448, globals: !462, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !451, line: 379, baseType: !452)
!451 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f412cx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 370, size: 224, elements: !453)
!453 = !{!454, !456, !457, !458, !459, !460, !461}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !452, file: !451, line: 372, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !134)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !452, file: !451, line: 373, baseType: !455, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !452, file: !451, line: 374, baseType: !455, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !452, file: !451, line: 375, baseType: !455, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !452, file: !451, line: 376, baseType: !455, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !452, file: !451, line: 377, baseType: !455, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !452, file: !451, line: 378, baseType: !455, size: 32, offset: 192)
!462 = !{!444}
!463 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !466, line: 51, size: 64, elements: !467)
!466 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !{!468, !495}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !465, file: !466, line: 60, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DISubroutineType(types: !471)
!471 = !{!120, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !475, line: 378, size: 192, elements: !476)
!475 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !{!477, !480, !481, !482, !488, !489}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !475, line: 380, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !474, file: !475, line: 382, baseType: !13, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !474, file: !475, line: 384, baseType: !13, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !474, file: !475, line: 386, baseType: !483, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !475, line: 351, size: 16, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !484, file: !475, line: 359, baseType: !220, size: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !484, file: !475, line: 364, baseType: !270, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !475, line: 388, baseType: !133, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !474, file: !475, line: 396, baseType: !490, size: 32, offset: 160)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !475, line: 43, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !494)
!494 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !465, file: !466, line: 65, baseType: !472, size: 32, offset: 32)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !498, file: !501, line: 71, type: !502, isLocal: true, isDefinition: true, align: 32)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !500, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!500 = !{!496}
!501 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !466, line: 51, size: 64, elements: !504)
!504 = !{!505, !524}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !503, file: !466, line: 60, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DISubroutineType(types: !508)
!508 = !{!120, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !475, line: 378, size: 192, elements: !512)
!512 = !{!513, !514, !515, !516, !522, !523}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !511, file: !475, line: 380, baseType: !478, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !511, file: !475, line: 382, baseType: !13, size: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !511, file: !475, line: 384, baseType: !13, size: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !511, file: !475, line: 386, baseType: !517, size: 32, offset: 96)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !475, line: 351, size: 16, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !518, file: !475, line: 359, baseType: !220, size: 8)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !518, file: !475, line: 364, baseType: !270, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !511, file: !475, line: 388, baseType: !133, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !511, file: !475, line: 396, baseType: !490, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !503, file: !466, line: 65, baseType: !509, size: 32, offset: 32)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "static_regions", scope: !527, file: !534, line: 62, type: !671, isLocal: true, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !529, globals: !530, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!529 = !{!297, !120, !134, !133}
!530 = !{!531, !525}
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !533, file: !534, line: 198, type: !659, isLocal: true, isDefinition: true)
!533 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !534, file: !534, line: 175, type: !535, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !527, retainedNodes: !654)
!534 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !DISubroutineType(types: !536)
!536 = !{null, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !178, line: 245, size: 1472, elements: !539)
!539 = !{!540, !598, !610, !611, !612, !617, !624, !625, !626, !627, !628, !634, !649}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !538, file: !178, line: 247, baseType: !541, size: 384)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !178, line: 57, size: 384, elements: !542)
!542 = !{!543, !567, !574, !575, !576, !585, !586, !587}
!543 = !DIDerivedType(tag: DW_TAG_member, scope: !541, file: !178, line: 60, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !541, file: !178, line: 60, size: 64, elements: !545)
!545 = !{!546, !561}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !544, file: !178, line: 61, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !188, line: 49, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !188, line: 37, size: 64, elements: !549)
!549 = !{!550, !556}
!550 = !DIDerivedType(tag: DW_TAG_member, scope: !548, file: !188, line: 38, baseType: !551, size: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !548, file: !188, line: 38, size: 32, elements: !552)
!552 = !{!553, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !551, file: !188, line: 39, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !188, line: 40, baseType: !554, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, scope: !548, file: !188, line: 42, baseType: !557, size: 32, offset: 32)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !548, file: !188, line: 42, size: 32, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !557, file: !188, line: 43, baseType: !554, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !557, file: !188, line: 44, baseType: !554, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !544, file: !178, line: 62, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !204, line: 49, size: 64, elements: !563)
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !562, file: !204, line: 50, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 64, elements: !209)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !541, file: !178, line: 68, baseType: !568, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !214, line: 233, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 231, size: 64, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !570, file: !214, line: 232, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !188, line: 48, baseType: !548)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !541, file: !178, line: 71, baseType: !220, size: 8, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !541, file: !178, line: 74, baseType: !220, size: 8, offset: 104)
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !541, file: !178, line: 90, baseType: !577, size: 16, offset: 112)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !541, file: !178, line: 90, size: 16, elements: !578)
!578 = !{!579, !584}
!579 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !178, line: 91, baseType: !580, size: 16)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !178, line: 91, size: 16, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !580, file: !178, line: 96, baseType: !230, size: 8)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !580, file: !178, line: 97, baseType: !220, size: 8, offset: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !577, file: !178, line: 100, baseType: !234, size: 16)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !541, file: !178, line: 107, baseType: !134, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !541, file: !178, line: 127, baseType: !133, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !541, file: !178, line: 131, baseType: !588, size: 192, offset: 192)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !214, line: 244, size: 192, elements: !589)
!589 = !{!590, !591, !597}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !588, file: !214, line: 245, baseType: !547, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !588, file: !214, line: 246, baseType: !592, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !214, line: 242, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !596}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !588, file: !214, line: 249, baseType: !249, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !538, file: !178, line: 250, baseType: !599, size: 288, offset: 384)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !253, line: 25, size: 288, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !599, file: !253, line: 26, baseType: !134, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !599, file: !253, line: 27, baseType: !134, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !599, file: !253, line: 28, baseType: !134, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !599, file: !253, line: 29, baseType: !134, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !599, file: !253, line: 30, baseType: !134, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !599, file: !253, line: 31, baseType: !134, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !599, file: !253, line: 32, baseType: !134, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !599, file: !253, line: 33, baseType: !134, size: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !599, file: !253, line: 34, baseType: !134, size: 32, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !538, file: !178, line: 253, baseType: !133, size: 32, offset: 672)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !538, file: !178, line: 256, baseType: !569, size: 64, offset: 704)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !538, file: !178, line: 259, baseType: !613, size: 16, offset: 768)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !178, line: 236, size: 16, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !613, file: !178, line: 237, baseType: !270, size: 8)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !613, file: !178, line: 238, baseType: !220, size: 8, offset: 8)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !538, file: !178, line: 271, baseType: !618, size: 128, offset: 800)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !178, line: 34, size: 128, elements: !619)
!619 = !{!620, !621, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !618, file: !178, line: 35, baseType: !276, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !618, file: !178, line: 36, baseType: !133, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !618, file: !178, line: 37, baseType: !133, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !618, file: !178, line: 38, baseType: !133, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !538, file: !178, line: 274, baseType: !537, size: 32, offset: 928)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !538, file: !178, line: 279, baseType: !286, size: 256, offset: 960)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !538, file: !178, line: 284, baseType: !133, size: 32, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !538, file: !178, line: 294, baseType: !120, size: 32, offset: 1248)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !538, file: !178, line: 300, baseType: !629, size: 96, offset: 1280)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !178, line: 149, size: 96, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !629, file: !178, line: 153, baseType: !22, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !629, file: !178, line: 162, baseType: !297, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !629, file: !178, line: 168, baseType: !297, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !538, file: !178, line: 325, baseType: !635, size: 32, offset: 1376)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !303, line: 5073, size: 192, elements: !637)
!637 = !{!638, !644, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !636, file: !303, line: 5074, baseType: !639, size: 96)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !307, line: 56, size: 96, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !639, file: !307, line: 57, baseType: !310, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !639, file: !307, line: 58, baseType: !133, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !639, file: !307, line: 59, baseType: !297, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !636, file: !303, line: 5075, baseType: !569, size: 64, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !636, file: !303, line: 5076, baseType: !646, size: 32, offset: 160)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !317, line: 43, size: 32, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !646, file: !317, line: 52, baseType: !22, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !538, file: !178, line: 343, baseType: !650, size: 64, offset: 1408)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !253, line: 60, size: 64, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !650, file: !253, line: 63, baseType: !134, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !650, file: !253, line: 66, baseType: !134, size: 32, offset: 32)
!654 = !{!655, !656, !657, !658}
!655 = !DILocalVariable(name: "thread", arg: 1, scope: !533, file: !534, line: 175, type: !537)
!656 = !DILocalVariable(name: "region_num", scope: !533, file: !534, line: 200, type: !220)
!657 = !DILocalVariable(name: "guard_start", scope: !533, file: !534, line: 265, type: !22)
!658 = !DILocalVariable(name: "guard_size", scope: !533, file: !534, line: 266, type: !297)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 96, elements: !431)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !661, line: 52, size: 96, elements: !662)
!661 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!662 = !{!663, !664, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !660, file: !661, line: 53, baseType: !22, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !660, file: !661, line: 54, baseType: !297, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !660, file: !661, line: 55, baseType: !666, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !667, line: 151, baseType: !668)
!667 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 149, size: 32, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !668, file: !667, line: 150, baseType: !134, size: 32)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 96, elements: !431)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !675, file: !708, line: 39, type: !220, isLocal: true, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !677, globals: !707, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!677 = !{!678, !133, !120, !695, !220}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !680, line: 1226, baseType: !681)
!680 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !680, line: 1213, size: 352, elements: !682)
!682 = !{!683, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !681, file: !680, line: 1215, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !681, file: !680, line: 1216, baseType: !455, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !681, file: !680, line: 1217, baseType: !455, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !681, file: !680, line: 1218, baseType: !455, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !681, file: !680, line: 1219, baseType: !455, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !681, file: !680, line: 1220, baseType: !455, size: 32, offset: 160)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !681, file: !680, line: 1221, baseType: !455, size: 32, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !681, file: !680, line: 1222, baseType: !455, size: 32, offset: 224)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !681, file: !680, line: 1223, baseType: !455, size: 32, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !681, file: !680, line: 1224, baseType: !455, size: 32, offset: 288)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !681, file: !680, line: 1225, baseType: !455, size: 32, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !698, line: 27, size: 96, elements: !699)
!698 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!699 = !{!700, !701, !702}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !697, file: !698, line: 29, baseType: !134, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !698, line: 31, baseType: !478, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !697, file: !698, line: 37, baseType: !703, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !667, line: 146, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !667, line: 141, size: 32, elements: !705)
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !704, file: !667, line: 143, baseType: !134, size: 32)
!707 = !{!673}
!708 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !711, file: !718, line: 21, type: !441, isLocal: true, isDefinition: true)
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !713, globals: !717, splitDebugInlining: false, nameTableKind: None)
!712 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!713 = !{!714, !120, !133}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !716, line: 22, baseType: !120)
!716 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!717 = !{!709}
!718 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !721, file: !726, line: 13, type: !743, isLocal: true, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !723, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!723 = !{!724, !719}
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "mpu_config", scope: !721, file: !726, line: 37, type: !727, isLocal: false, isDefinition: true)
!726 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !698, line: 41, size: 64, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !728, file: !698, line: 43, baseType: !134, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !728, file: !698, line: 45, baseType: !732, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !698, line: 27, size: 96, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !734, file: !698, line: 29, baseType: !134, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !698, line: 31, baseType: !478, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !734, file: !698, line: 37, baseType: !739, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !667, line: 146, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !667, line: 141, size: 32, elements: !741)
!741 = !{!742}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !740, file: !667, line: 143, baseType: !134, size: 32)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 192, elements: !209)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "cmsis_semaphore_slab", scope: !746, file: !781, line: 11, type: !785, isLocal: false, isDefinition: true, align: 32)
!746 = distinct !DICompileUnit(language: DW_LANG_C99, file: !747, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !748, retainedTypes: !749, globals: !778, splitDebugInlining: false, nameTableKind: None)
!747 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v1/cmsis_semaphore.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!748 = !{!30, !49}
!749 = !{!133, !750, !751, !158, !753, !120, !134, !135}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !752, line: 46, baseType: !249)
!752 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !303, line: 2909, size: 192, elements: !755)
!755 = !{!756, !775, !776, !777}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !754, file: !303, line: 2910, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !214, line: 233, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 231, size: 64, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !758, file: !214, line: 232, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !188, line: 48, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !188, line: 37, size: 64, elements: !763)
!763 = !{!764, !770}
!764 = !DIDerivedType(tag: DW_TAG_member, scope: !762, file: !188, line: 38, baseType: !765, size: 32)
!765 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !762, file: !188, line: 38, size: 32, elements: !766)
!766 = !{!767, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !765, file: !188, line: 39, baseType: !768, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !765, file: !188, line: 40, baseType: !768, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, scope: !762, file: !188, line: 42, baseType: !771, size: 32, offset: 32)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !762, file: !188, line: 42, size: 32, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !771, file: !188, line: 43, baseType: !768, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !771, file: !188, line: 44, baseType: !768, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !754, file: !303, line: 2911, baseType: !32, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !754, file: !303, line: 2912, baseType: !32, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !754, file: !303, line: 2914, baseType: !761, size: 64, offset: 128)
!778 = !{!744, !779}
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cmsis_semaphore_slab", scope: !746, file: !781, line: 11, type: !782, isLocal: false, isDefinition: true, align: 32)
!781 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v1/cmsis_semaphore.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 960, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 120)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !303, line: 4836, size: 256, elements: !786)
!786 = !{!787, !788, !792, !793, !794, !795, !796}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !785, file: !303, line: 4837, baseType: !757, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !785, file: !303, line: 4838, baseType: !789, size: 32, offset: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !317, line: 43, size: 32, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !789, file: !317, line: 52, baseType: !22, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !785, file: !303, line: 4839, baseType: !134, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !785, file: !303, line: 4840, baseType: !297, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !785, file: !303, line: 4841, baseType: !391, size: 32, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !785, file: !303, line: 4842, baseType: !391, size: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !785, file: !303, line: 4843, baseType: !134, size: 32, offset: 224)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !799, file: !903, line: 72, type: !986, isLocal: true, isDefinition: true)
!799 = distinct !DICompileUnit(language: DW_LANG_C99, file: !800, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !801, retainedTypes: !889, globals: !900, splitDebugInlining: false, nameTableKind: None)
!800 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!801 = !{!49, !802}
!802 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !451, line: 65, baseType: !120, size: 32, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888}
!804 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!805 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!806 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!807 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!808 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!809 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!810 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!811 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!812 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!813 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!814 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!815 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!816 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!817 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!818 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!819 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!820 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!821 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!822 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!823 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!824 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!825 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!826 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!827 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!828 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!829 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!830 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!831 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!832 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!833 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!834 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!835 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!836 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!837 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!838 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!839 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!840 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!841 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!842 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!843 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!844 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!845 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!846 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!847 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!848 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!849 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!850 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!851 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!852 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!853 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!854 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!855 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!856 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!857 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!858 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!859 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!860 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!861 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!862 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!863 = !DIEnumerator(name: "TIM6_IRQn", value: 54)
!864 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!865 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!866 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!867 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!868 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!869 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!870 = !DIEnumerator(name: "DFSDM1_FLT0_IRQn", value: 61)
!871 = !DIEnumerator(name: "DFSDM1_FLT1_IRQn", value: 62)
!872 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!873 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!874 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!875 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!876 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!877 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!878 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!879 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!880 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!881 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!882 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!883 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!884 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!885 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!886 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!887 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!888 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!889 = !{!297, !120, !133, !890}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !451, line: 364, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 356, size: 192, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !892, file: !451, line: 358, baseType: !455, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !892, file: !451, line: 359, baseType: !455, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !892, file: !451, line: 360, baseType: !455, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !892, file: !451, line: 361, baseType: !455, size: 32, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !892, file: !451, line: 362, baseType: !455, size: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !892, file: !451, line: 363, baseType: !455, size: 32, offset: 160)
!900 = !{!901, !907, !923, !934, !951, !797, !953, !966, !968, !970, !972, !974, !976, !978, !980, !982, !984}
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !799, file: !903, line: 424, type: !904, isLocal: false, isDefinition: true, align: 16)
!903 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 64, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 4)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "__device_dts_ord_35", scope: !799, file: !903, line: 424, type: !909, isLocal: false, isDefinition: true, align: 32)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !475, line: 378, size: 192, elements: !911)
!911 = !{!912, !913, !914, !915, !921, !922}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !910, file: !475, line: 380, baseType: !478, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !910, file: !475, line: 382, baseType: !13, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !910, file: !475, line: 384, baseType: !13, size: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !910, file: !475, line: 386, baseType: !916, size: 32, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !475, line: 351, size: 16, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !917, file: !475, line: 359, baseType: !220, size: 8)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !917, file: !475, line: 364, baseType: !270, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !910, file: !475, line: 388, baseType: !133, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !910, file: !475, line: 396, baseType: !490, size: 32, offset: 160)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_35", scope: !799, file: !903, line: 424, type: !925, isLocal: true, isDefinition: true, align: 32)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !466, line: 51, size: 64, elements: !927)
!927 = !{!928, !933}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !926, file: !466, line: 60, baseType: !929, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{!120, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !926, file: !466, line: 65, baseType: !932, size: 32, offset: 32)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "exti_data", scope: !799, file: !903, line: 423, type: !936, isLocal: true, isDefinition: true)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !903, line: 107, size: 1472, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !936, file: !903, line: 109, baseType: !939, size: 1472)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 1472, elements: !949)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !903, line: 101, size: 64, elements: !941)
!941 = !{!942, !948}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !940, file: !903, line: 102, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !944, line: 63, baseType: !945)
!944 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !120, !133}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !940, file: !903, line: 103, baseType: !133, size: 32, offset: 32)
!949 = !{!950}
!950 = !DISubrange(count: 23)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_35", scope: !799, file: !903, line: 424, type: !917, isLocal: true, isDefinition: true, align: 8)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !955, file: !903, line: 493, type: !960, isLocal: true, isDefinition: true, align: 32)
!955 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !903, file: !903, line: 460, type: !956, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !799, retainedNodes: !958)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !932}
!958 = !{!959}
!959 = !DILocalVariable(name: "dev", arg: 1, scope: !955, file: !903, line: 460, type: !932)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !961)
!961 = !{!962, !963, !964, !965}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !960, file: !10, line: 55, baseType: !399, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !960, file: !10, line: 57, baseType: !399, size: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !960, file: !10, line: 59, baseType: !133, size: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !960, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !955, file: !903, line: 497, type: !960, isLocal: true, isDefinition: true, align: 32)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !955, file: !903, line: 507, type: !960, isLocal: true, isDefinition: true, align: 32)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !955, file: !903, line: 512, type: !960, isLocal: true, isDefinition: true, align: 32)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !955, file: !903, line: 516, type: !960, isLocal: true, isDefinition: true, align: 32)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !955, file: !903, line: 523, type: !960, isLocal: true, isDefinition: true, align: 32)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !955, file: !903, line: 527, type: !960, isLocal: true, isDefinition: true, align: 32)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !955, file: !903, line: 581, type: !960, isLocal: true, isDefinition: true, align: 32)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !955, file: !903, line: 586, type: !960, isLocal: true, isDefinition: true, align: 32)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !955, file: !903, line: 591, type: !960, isLocal: true, isDefinition: true, align: 32)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !955, file: !903, line: 595, type: !960, isLocal: true, isDefinition: true, align: 32)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 736, elements: !949)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !451, line: 154, baseType: !802)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !991, file: !996, line: 22, type: !1018, isLocal: false, isDefinition: true, align: 16)
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !993, splitDebugInlining: false, nameTableKind: None)
!992 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!993 = !{!994, !989, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016}
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !991, file: !996, line: 17, type: !997, isLocal: false, isDefinition: true, align: 16)
!996 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/subsys/portability/cmsis_rtos_v1/philosophers")
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 192, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 12)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_79", scope: !991, file: !996, line: 29, type: !904, isLocal: false, isDefinition: true, align: 16)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_78", scope: !991, file: !996, line: 36, type: !904, isLocal: false, isDefinition: true, align: 16)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_77", scope: !991, file: !996, line: 43, type: !904, isLocal: false, isDefinition: true, align: 16)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !991, file: !996, line: 50, type: !904, isLocal: false, isDefinition: true, align: 16)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !991, file: !996, line: 57, type: !904, isLocal: false, isDefinition: true, align: 16)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !991, file: !996, line: 64, type: !904, isLocal: false, isDefinition: true, align: 16)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
