; ModuleID = 'build/96b_meerkat96/threads/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct._sfnode, %struct._wait_q_t }
%struct._sflist = type { %struct._sfnode*, %struct._sfnode* }
%struct._sfnode = type { i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.led = type { %struct.gpio_dt_spec, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct._sfnode }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct._sfnode] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "printk_fifo", scope: !27, file: !218, line: 37, type: !404, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !112, globals: !215, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/threads/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads")
!29 = !{!30, !101, !107}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !102, line: 506, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!105 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!106 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !102, line: 512, baseType: !32, size: 32, elements: !108)
!108 = !{!109, !110, !111}
!109 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!110 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!111 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!112 = !{!113, !117, !118, !119, !202, !207, !167, !107, !101, !212, !156, !213}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !114, line: 46, baseType: !115)
!114 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !116)
!116 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !102, line: 523, size: 288, elements: !122)
!122 = !{!123, !157, !163, !168, !172, !173, !174, !178, !198}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !121, file: !102, line: 524, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!118, !127, !154, !155}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !130, line: 378, size: 192, elements: !131)
!130 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!131 = !{!132, !136, !137, !138, !147, !148}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !130, line: 380, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !129, file: !130, line: 382, baseType: !13, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !129, file: !130, line: 384, baseType: !13, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !129, file: !130, line: 386, baseType: !139, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !130, line: 351, size: 16, elements: !141)
!141 = !{!142, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !140, file: !130, line: 359, baseType: !143, size: 8)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !140, file: !130, line: 364, baseType: !146, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!146 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !130, line: 388, baseType: !117, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !129, file: !130, line: 396, baseType: !149, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !130, line: 43, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !153)
!153 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !102, line: 237, baseType: !143)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !102, line: 257, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !121, file: !102, line: 530, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{!118, !127, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !102, line: 229, baseType: !156)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !121, file: !102, line: 532, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DISubroutineType(types: !166)
!166 = !{!118, !127, !167, !162}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !102, line: 216, baseType: !156)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !121, file: !102, line: 535, baseType: !169, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{!118, !127, !167}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !121, file: !102, line: 537, baseType: !169, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !121, file: !102, line: 539, baseType: !169, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !121, file: !102, line: 541, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DISubroutineType(types: !177)
!177 = !{!118, !127, !154, !101, !107}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !121, file: !102, line: 544, baseType: !179, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!118, !127, !182, !146}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !102, line: 478, size: 96, elements: !184)
!184 = !{!185, !192, !197}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !183, file: !102, line: 482, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 33, baseType: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 29, size: 32, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !187, line: 30, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !183, file: !102, line: 485, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !102, line: 464, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !127, !182, !167}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !183, file: !102, line: 493, baseType: !167, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !121, file: !102, line: 547, baseType: !199, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!156, !127}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !102, line: 428, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !204, file: !102, line: 434, baseType: !167, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !102, line: 441, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !209, file: !102, line: 447, baseType: !167, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !214)
!214 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!215 = !{!25, !216, !362, !366, !368, !370, !372, !374, !379, !381, !383, !385, !387, !389, !402}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "_k_thread_data_blink0_id", scope: !27, file: !218, line: 111, type: !219, isLocal: false, isDefinition: true, align: 32)
!218 = !DIFile(filename: "zephyr/samples/basic/threads/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !220, line: 620, size: 384, elements: !221)
!220 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !336, !344, !345, !350, !351, !352, !353, !354, !355, !357, !361}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !219, file: !220, line: 621, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !225, line: 245, size: 896, elements: !226)
!225 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !{!227, !294, !307, !308, !309, !310, !331}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !224, file: !225, line: 247, baseType: !228, size: 384)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !225, line: 57, size: 384, elements: !229)
!229 = !{!230, !258, !266, !267, !268, !281, !282, !283}
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !228, file: !225, line: 60, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !228, file: !225, line: 60, size: 64, elements: !232)
!232 = !{!233, !249}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !231, file: !225, line: 61, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !235, line: 49, baseType: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !235, line: 37, size: 64, elements: !237)
!237 = !{!238, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !235, line: 38, baseType: !239, size: 32)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !235, line: 38, size: 32, elements: !240)
!240 = !{!241, !243}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !239, file: !235, line: 39, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !235, line: 40, baseType: !242, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !235, line: 42, baseType: !245, size: 32, offset: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !235, line: 42, size: 32, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !245, file: !235, line: 43, baseType: !242, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !235, line: 44, baseType: !242, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !231, file: !225, line: 62, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !251, line: 49, size: 64, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !250, file: !251, line: 50, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, elements: !256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!256 = !{!257}
!257 = !DISubrange(count: 2)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !228, file: !225, line: 68, baseType: !259, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !261, line: 233, baseType: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 231, size: 64, elements: !263)
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !262, file: !261, line: 232, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !235, line: 48, baseType: !236)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !228, file: !225, line: 71, baseType: !143, size: 8, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !228, file: !225, line: 74, baseType: !143, size: 8, offset: 104)
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !228, file: !225, line: 90, baseType: !269, size: 16, offset: 112)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !228, file: !225, line: 90, size: 16, elements: !270)
!270 = !{!271, !278}
!271 = !DIDerivedType(tag: DW_TAG_member, scope: !269, file: !225, line: 91, baseType: !272, size: 16)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !225, line: 91, size: 16, elements: !273)
!273 = !{!274, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !272, file: !225, line: 96, baseType: !275, size: 8)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !276)
!276 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !272, file: !225, line: 97, baseType: !143, size: 8, offset: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !269, file: !225, line: 100, baseType: !279, size: 16)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !280)
!280 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !228, file: !225, line: 107, baseType: !156, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !228, file: !225, line: 127, baseType: !117, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !228, file: !225, line: 131, baseType: !284, size: 192, offset: 192)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !261, line: 244, size: 192, elements: !285)
!285 = !{!286, !287, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !284, file: !261, line: 245, baseType: !234, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !284, file: !261, line: 246, baseType: !288, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !261, line: 242, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !284, file: !261, line: 249, baseType: !115, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !224, file: !225, line: 250, baseType: !295, size: 288, offset: 384)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !296, line: 25, size: 288, elements: !297)
!296 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !295, file: !296, line: 26, baseType: !156, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !295, file: !296, line: 27, baseType: !156, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !295, file: !296, line: 28, baseType: !156, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !295, file: !296, line: 29, baseType: !156, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !295, file: !296, line: 30, baseType: !156, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !295, file: !296, line: 31, baseType: !156, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !295, file: !296, line: 32, baseType: !156, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !295, file: !296, line: 33, baseType: !156, size: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !295, file: !296, line: 34, baseType: !156, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !224, file: !225, line: 253, baseType: !117, size: 32, offset: 672)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !224, file: !225, line: 256, baseType: !260, size: 64, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !224, file: !225, line: 294, baseType: !118, size: 32, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !224, file: !225, line: 325, baseType: !311, size: 32, offset: 800)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !220, line: 5073, size: 192, elements: !313)
!313 = !{!314, !325, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !312, file: !220, line: 5074, baseType: !315, size: 96)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !316, line: 56, size: 96, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318, !321, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !315, file: !316, line: 57, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !316, line: 57, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !315, file: !316, line: 58, baseType: !117, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !315, file: !316, line: 59, baseType: !323, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !324, line: 214, baseType: !32)
!324 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !312, file: !220, line: 5075, baseType: !260, size: 64, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !312, file: !220, line: 5076, baseType: !327, size: 32, offset: 160)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !328, line: 43, size: 32, elements: !329)
!328 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !327, file: !328, line: 52, baseType: !22, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !224, file: !225, line: 343, baseType: !332, size: 64, offset: 832)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !296, line: 60, size: 64, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !332, file: !296, line: 63, baseType: !156, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !332, file: !296, line: 66, baseType: !156, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !219, file: !220, line: 622, baseType: !337, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !339, line: 44, baseType: !340)
!339 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !341, line: 47, size: 8, elements: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !340, file: !341, line: 48, baseType: !135, size: 8)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !219, file: !220, line: 623, baseType: !32, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !219, file: !220, line: 624, baseType: !346, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !339, line: 46, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !117, !117, !117}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !219, file: !220, line: 625, baseType: !117, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !219, file: !220, line: 626, baseType: !117, size: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !219, file: !220, line: 627, baseType: !117, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !219, file: !220, line: 628, baseType: !118, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !219, file: !220, line: 629, baseType: !156, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !219, file: !220, line: 630, baseType: !356, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !118)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !219, file: !220, line: 631, baseType: !358, size: 32, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DISubroutineType(types: !360)
!360 = !{null}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !219, file: !220, line: 632, baseType: !133, size: 32, offset: 352)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "blink0_id", scope: !27, file: !218, line: 111, type: !364, isLocal: false, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !225, line: 347, baseType: !223)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "_k_thread_data_blink1_id", scope: !27, file: !218, line: 113, type: !219, isLocal: false, isDefinition: true, align: 32)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "blink1_id", scope: !27, file: !218, line: 113, type: !364, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "_k_thread_data_uart_out_id", scope: !27, file: !218, line: 115, type: !219, isLocal: false, isDefinition: true, align: 32)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "uart_out_id", scope: !27, file: !218, line: 115, type: !364, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "_k_thread_stack_blink0_id", scope: !27, file: !218, line: 111, type: !376, isLocal: false, isDefinition: true, align: 64)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 8192, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 1024)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "_k_thread_obj_blink0_id", scope: !27, file: !218, line: 111, type: !224, isLocal: false, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "_k_thread_stack_blink1_id", scope: !27, file: !218, line: 113, type: !376, isLocal: false, isDefinition: true, align: 64)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "_k_thread_obj_blink1_id", scope: !27, file: !218, line: 113, type: !224, isLocal: false, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_k_thread_stack_uart_out_id", scope: !27, file: !218, line: 115, type: !376, isLocal: false, isDefinition: true, align: 64)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "_k_thread_obj_uart_out_id", scope: !27, file: !218, line: 115, type: !224, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "led0", scope: !27, file: !218, line: 44, type: !391, isLocal: true, isDefinition: true)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led", file: !218, line: 39, size: 96, elements: !393)
!393 = !{!394, !401}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !392, file: !218, line: 40, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !102, line: 271, size: 64, elements: !396)
!396 = !{!397, !398, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !395, file: !102, line: 273, baseType: !127, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !395, file: !102, line: 275, baseType: !154, size: 8, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !395, file: !102, line: 277, baseType: !400, size: 16, offset: 48)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !102, line: 249, baseType: !279)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !392, file: !218, line: 41, baseType: !143, size: 8, offset: 64)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "led1", scope: !27, file: !218, line: 49, type: !391, isLocal: true, isDefinition: true)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !220, line: 2208, size: 160, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !404, file: !220, line: 2209, baseType: !407, size: 160)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !220, line: 1709, size: 160, elements: !408)
!408 = !{!409, !422, !423}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !407, file: !220, line: 1710, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !411, line: 46, baseType: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !411, line: 41, size: 64, elements: !413)
!413 = !{!414, !421}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !412, file: !411, line: 42, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !411, line: 39, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !411, line: 35, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !417, file: !411, line: 36, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !411, line: 32, baseType: !156)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !412, file: !411, line: 43, baseType: !415, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !407, file: !220, line: 1711, baseType: !327, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !407, file: !220, line: 1712, baseType: !260, size: 64, offset: 96)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "_char_out", scope: !426, file: !431, line: 54, type: !432, isLocal: false, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !428, retainedTypes: !429, globals: !430, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads")
!428 = !{!30}
!429 = !{!117, !118}
!430 = !{!424}
!431 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = !DISubroutineType(types: !434)
!434 = !{!118, !118}
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !437, file: !851, line: 258, type: !852, isLocal: true, isDefinition: true, align: 32)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !439, retainedTypes: !722, globals: !850, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads")
!439 = !{!440, !472, !482, !531, !537, !658, !693}
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !441, line: 54, baseType: !32, size: 32, elements: !442)
!441 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!443 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!444 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!445 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!446 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!447 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!448 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!449 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!450 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!451 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!452 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!453 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!454 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!455 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!456 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!457 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!458 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!459 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!460 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!461 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!462 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!463 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!464 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!465 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!466 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!467 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!468 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!469 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!470 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!471 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !441, line: 224, baseType: !32, size: 32, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481}
!474 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!475 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!476 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!477 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!478 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!479 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!480 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!481 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !441, line: 275, baseType: !32, size: 32, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!484 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!485 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!486 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!487 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!488 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!489 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!490 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!491 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!492 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!493 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!494 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!495 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!496 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!497 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!498 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!499 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!500 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!501 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!502 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!503 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!504 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!505 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!506 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!507 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!508 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!509 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!510 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!511 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!512 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!513 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!514 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!515 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!516 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!517 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!518 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!519 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!520 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!521 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!522 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!523 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!524 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!525 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!526 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!527 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!528 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!529 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!530 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !441, line: 327, baseType: !32, size: 32, elements: !532)
!532 = !{!533, !534, !535, !536}
!533 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!534 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!535 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!536 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !538, line: 76, baseType: !32, size: 32, elements: !539)
!538 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!540 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!541 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!542 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!543 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!544 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!545 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!546 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!547 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!548 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!549 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!550 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!551 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!552 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!553 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!554 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!555 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!556 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!557 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!558 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!559 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!560 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!561 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!562 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!563 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!564 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!565 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!566 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!567 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!568 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!569 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!570 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!571 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!572 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!573 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!574 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!575 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!576 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!577 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!578 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!579 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!580 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!581 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!582 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!583 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!584 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!585 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!586 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!587 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!588 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!589 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!590 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!591 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!592 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!593 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!594 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!595 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!596 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!597 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!598 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!599 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!600 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!601 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!602 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!603 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!604 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!605 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!606 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!607 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!608 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!609 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!610 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!611 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!612 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!613 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!614 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!615 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!616 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!617 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!618 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!619 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!620 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!621 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!622 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!623 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!624 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!625 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!626 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!627 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!628 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!629 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!630 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!631 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!632 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!633 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!634 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!635 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!636 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!637 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!638 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!639 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!640 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!641 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!642 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!643 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!644 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!645 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!646 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!647 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!648 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!649 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!650 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!651 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!652 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!653 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!654 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!655 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!656 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!657 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !441, line: 237, baseType: !32, size: 32, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!660 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!661 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!662 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!663 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!664 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!665 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!666 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!667 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!668 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!669 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!670 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!671 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!672 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!673 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!674 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!675 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!676 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!677 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!678 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!679 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!680 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!681 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!682 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!683 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!684 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!685 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!686 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!687 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!688 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!689 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!690 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!691 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!692 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !538, line: 44, baseType: !32, size: 32, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!695 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!696 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!697 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!698 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!699 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!700 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!701 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!702 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!703 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!704 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!705 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!706 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!707 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!708 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!709 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!710 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!711 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!712 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!713 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!714 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!715 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!716 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!717 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!718 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!719 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!720 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!721 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!722 = !{!723, !795, !838, !849, !156}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !725, line: 4575, baseType: !726)
!725 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 4532, size: 390144, elements: !727)
!727 = !{!728, !730, !731, !732, !733, !737, !747, !751, !761, !765}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !726, file: !725, line: 4533, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !156)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !726, file: !725, line: 4534, baseType: !729, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !726, file: !725, line: 4535, baseType: !729, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !726, file: !725, line: 4536, baseType: !729, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !726, file: !725, line: 4537, baseType: !734, size: 16256, offset: 128)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 16256, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 2032)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !726, file: !725, line: 4543, baseType: !738, size: 4224, offset: 16384)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 4224, elements: !745)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !726, file: !725, line: 4538, size: 128, elements: !740)
!740 = !{!741, !742, !743, !744}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !739, file: !725, line: 4539, baseType: !729, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !739, file: !725, line: 4540, baseType: !729, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !739, file: !725, line: 4541, baseType: !729, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !739, file: !725, line: 4542, baseType: !729, size: 32, offset: 96)
!745 = !{!746}
!746 = !DISubrange(count: 33)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !726, file: !725, line: 4544, baseType: !748, size: 110464, offset: 20608)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 110464, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 13808)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !726, file: !725, line: 4550, baseType: !752, size: 24448, offset: 131072)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 24448, elements: !759)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !726, file: !725, line: 4545, size: 128, elements: !754)
!754 = !{!755, !756, !757, !758}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !753, file: !725, line: 4546, baseType: !729, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !753, file: !725, line: 4547, baseType: !729, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !753, file: !725, line: 4548, baseType: !729, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !753, file: !725, line: 4549, baseType: !729, size: 32, offset: 96)
!759 = !{!760}
!760 = !DISubrange(count: 191)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !726, file: !725, line: 4551, baseType: !762, size: 106624, offset: 155520)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 106624, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 13328)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !726, file: !725, line: 4574, baseType: !766, size: 128000, offset: 262144)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 128000, elements: !793)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !726, file: !725, line: 4552, size: 1024, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !789, !790, !791, !792}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !767, file: !725, line: 4553, baseType: !729, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !767, file: !725, line: 4554, baseType: !729, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !767, file: !725, line: 4555, baseType: !729, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !767, file: !725, line: 4556, baseType: !729, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !767, file: !725, line: 4557, baseType: !729, size: 32, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !767, file: !725, line: 4558, baseType: !729, size: 32, offset: 160)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !767, file: !725, line: 4559, baseType: !729, size: 32, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !767, file: !725, line: 4560, baseType: !729, size: 32, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !767, file: !725, line: 4561, baseType: !729, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !767, file: !725, line: 4562, baseType: !729, size: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !767, file: !725, line: 4563, baseType: !729, size: 32, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !767, file: !725, line: 4564, baseType: !729, size: 32, offset: 352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !767, file: !725, line: 4565, baseType: !729, size: 32, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !767, file: !725, line: 4566, baseType: !729, size: 32, offset: 416)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !767, file: !725, line: 4567, baseType: !729, size: 32, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !767, file: !725, line: 4568, baseType: !729, size: 32, offset: 480)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !767, file: !725, line: 4569, baseType: !786, size: 384, offset: 512)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 384, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 48)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !767, file: !725, line: 4570, baseType: !729, size: 32, offset: 896)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !767, file: !725, line: 4571, baseType: !729, size: 32, offset: 928)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !767, file: !725, line: 4572, baseType: !729, size: 32, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !767, file: !725, line: 4573, baseType: !729, size: 32, offset: 992)
!793 = !{!794}
!794 = !DISubrange(count: 125)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !725, line: 38320, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 38303, size: 23040, elements: !798)
!798 = !{!799, !801, !805, !806, !807, !808, !812, !816, !820, !824, !828}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !797, file: !725, line: 38304, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !797, file: !725, line: 38305, baseType: !802, size: 256, offset: 32)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 256, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !797, file: !725, line: 38306, baseType: !729, size: 32, offset: 288)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !797, file: !725, line: 38307, baseType: !729, size: 32, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !797, file: !725, line: 38308, baseType: !729, size: 32, offset: 352)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !797, file: !725, line: 38309, baseType: !809, size: 3712, offset: 384)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 3712, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 464)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !797, file: !725, line: 38310, baseType: !813, size: 864, offset: 4096)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 864, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 27)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !797, file: !725, line: 38311, baseType: !817, size: 3232, offset: 4960)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 3232, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 404)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !797, file: !725, line: 38312, baseType: !821, size: 3776, offset: 8192)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 3776, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 118)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !797, file: !725, line: 38313, baseType: !825, size: 4416, offset: 11968)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 4416, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 552)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !797, file: !725, line: 38319, baseType: !829, size: 6656, offset: 16384)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 6656, elements: !836)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !725, line: 38314, size: 128, elements: !831)
!831 = !{!832, !833, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !830, file: !725, line: 38315, baseType: !729, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !830, file: !725, line: 38316, baseType: !729, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !830, file: !725, line: 38317, baseType: !729, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !830, file: !725, line: 38318, baseType: !729, size: 32, offset: 96)
!836 = !{!837}
!837 = !DISubrange(count: 52)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !725, line: 43319, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 43313, size: 80, elements: !841)
!841 = !{!842, !844, !845, !847, !848}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !840, file: !725, line: 43314, baseType: !843, size: 16)
!843 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !279)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !840, file: !725, line: 43315, baseType: !843, size: 16, offset: 16)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !840, file: !725, line: 43316, baseType: !846, size: 16, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !840, file: !725, line: 43317, baseType: !843, size: 16, offset: 48)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !840, file: !725, line: 43318, baseType: !843, size: 16, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!850 = !{!435}
!851 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !854, line: 51, size: 64, elements: !855)
!854 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!855 = !{!856, !863}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !853, file: !854, line: 60, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{!118, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !854, line: 48, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !853, file: !854, line: 65, baseType: !860, size: 32, offset: 32)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !866, file: !873, line: 21, type: !432, isLocal: true, isDefinition: true)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !428, retainedTypes: !868, globals: !872, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads")
!868 = !{!869, !118, !117}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !871, line: 22, baseType: !118)
!871 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!872 = !{!864}
!873 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !876, file: !967, line: 603, type: !969, isLocal: true, isDefinition: true, align: 32)
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !428, retainedTypes: !878, globals: !964, splitDebugInlining: false, nameTableKind: None)
!877 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads")
!878 = !{!117, !118, !879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !882, line: 336, size: 608, elements: !883)
!882 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!883 = !{!884, !904, !908, !912, !925, !930, !936, !942, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !881, file: !882, line: 365, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(types: !887)
!887 = !{!118, !888, !903}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !130, line: 378, size: 192, elements: !891)
!891 = !{!892, !893, !894, !895, !901, !902}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !890, file: !130, line: 380, baseType: !133, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !890, file: !130, line: 382, baseType: !13, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !890, file: !130, line: 384, baseType: !13, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !890, file: !130, line: 386, baseType: !896, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !130, line: 351, size: 16, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !897, file: !130, line: 359, baseType: !143, size: 8)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !897, file: !130, line: 364, baseType: !146, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !890, file: !130, line: 388, baseType: !117, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !890, file: !130, line: 396, baseType: !149, size: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !881, file: !882, line: 366, baseType: !905, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !888, !144}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !881, file: !882, line: 374, baseType: !909, size: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(types: !911)
!911 = !{!118, !888}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !881, file: !882, line: 377, baseType: !913, size: 32, offset: 96)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{!118, !888, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !882, line: 122, size: 64, elements: !919)
!919 = !{!920, !921, !922, !923, !924}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !918, file: !882, line: 123, baseType: !156, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !918, file: !882, line: 124, baseType: !143, size: 8, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !918, file: !882, line: 125, baseType: !143, size: 8, offset: 40)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !918, file: !882, line: 126, baseType: !143, size: 8, offset: 48)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !918, file: !882, line: 127, baseType: !143, size: 8, offset: 56)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !881, file: !882, line: 379, baseType: !926, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{!118, !888, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !881, file: !882, line: 384, baseType: !931, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!118, !888, !934, !118}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !881, file: !882, line: 393, baseType: !937, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{!118, !888, !940, !941}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !881, file: !882, line: 402, baseType: !943, size: 32, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !888}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !881, file: !882, line: 405, baseType: !943, size: 32, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !881, file: !882, line: 408, baseType: !909, size: 32, offset: 288)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !881, file: !882, line: 411, baseType: !943, size: 32, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !881, file: !882, line: 414, baseType: !943, size: 32, offset: 352)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !881, file: !882, line: 417, baseType: !909, size: 32, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !881, file: !882, line: 420, baseType: !909, size: 32, offset: 416)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !881, file: !882, line: 423, baseType: !943, size: 32, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !881, file: !882, line: 426, baseType: !943, size: 32, offset: 480)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !881, file: !882, line: 429, baseType: !909, size: 32, offset: 512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !881, file: !882, line: 432, baseType: !909, size: 32, offset: 544)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !881, file: !882, line: 435, baseType: !957, size: 32, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !888, !960, !117}
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !882, line: 142, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !888, !117}
!964 = !{!874, !965}
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !876, file: !967, line: 38, type: !968, isLocal: true, isDefinition: true)
!967 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !854, line: 51, size: 64, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !970, file: !854, line: 60, baseType: !909, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !970, file: !854, line: 65, baseType: !888, size: 32, offset: 32)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !976, file: !1064, line: 318, type: !1140, isLocal: false, isDefinition: true)
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !977, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !978, retainedTypes: !984, globals: !1061, splitDebugInlining: false, nameTableKind: None)
!977 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/threads")
!978 = !{!101, !107, !979}
!979 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !980, line: 66, baseType: !32, size: 32, elements: !981)
!980 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!981 = !{!982, !983}
!982 = !DIEnumerator(name: "gpioPinClear", value: 0)
!983 = !DIEnumerator(name: "gpioPinSet", value: 1)
!984 = !{!985, !1049, !1054, !167, !107, !101, !1059, !117, !849, !1030, !1060}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !102, line: 523, size: 288, elements: !988)
!988 = !{!989, !1008, !1012, !1016, !1020, !1021, !1022, !1026, !1045}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !987, file: !102, line: 524, baseType: !990, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{!118, !993, !154, !155}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !130, line: 378, size: 192, elements: !996)
!996 = !{!997, !998, !999, !1000, !1006, !1007}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !130, line: 380, baseType: !133, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !995, file: !130, line: 382, baseType: !13, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !995, file: !130, line: 384, baseType: !13, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !995, file: !130, line: 386, baseType: !1001, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !130, line: 351, size: 16, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1002, file: !130, line: 359, baseType: !143, size: 8)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1002, file: !130, line: 364, baseType: !146, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !995, file: !130, line: 388, baseType: !117, size: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !995, file: !130, line: 396, baseType: !149, size: 32, offset: 160)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !987, file: !102, line: 530, baseType: !1009, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!118, !993, !161}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !987, file: !102, line: 532, baseType: !1013, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!118, !993, !167, !162}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !987, file: !102, line: 535, baseType: !1017, size: 32, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!118, !993, !167}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !987, file: !102, line: 537, baseType: !1017, size: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !987, file: !102, line: 539, baseType: !1017, size: 32, offset: 160)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !987, file: !102, line: 541, baseType: !1023, size: 32, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!118, !993, !154, !101, !107}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !987, file: !102, line: 544, baseType: !1027, size: 32, offset: 224)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!118, !993, !1030, !146}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !102, line: 478, size: 96, elements: !1032)
!1032 = !{!1033, !1039, !1044}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1031, file: !102, line: 482, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 33, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 29, size: 32, elements: !1036)
!1036 = !{!1037}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1035, file: !187, line: 30, baseType: !1038, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1031, file: !102, line: 485, baseType: !1040, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !102, line: 464, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 32)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{null, !993, !1030, !167}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1031, file: !102, line: 493, baseType: !167, size: 32, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !987, file: !102, line: 547, baseType: !1046, size: 32, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 32)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!156, !993}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !102, line: 428, size: 32, elements: !1052)
!1052 = !{!1053}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1051, file: !102, line: 434, baseType: !167, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !102, line: 441, size: 32, elements: !1057)
!1057 = !{!1058}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1056, file: !102, line: 447, baseType: !167, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!1061 = !{!974, !1062, !1068, !1070, !1080, !1092, !1094, !1125, !1127, !1138}
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !976, file: !1064, line: 318, type: !1065, isLocal: false, isDefinition: true, align: 16)
!1064 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 400, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 25)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !976, file: !1064, line: 318, type: !994, isLocal: false, isDefinition: true, align: 32)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !976, file: !1064, line: 318, type: !1072, isLocal: true, isDefinition: true, align: 32)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !854, line: 51, size: 64, elements: !1074)
!1074 = !{!1075, !1079}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1073, file: !854, line: 60, baseType: !1076, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 32)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!118, !993}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1073, file: !854, line: 65, baseType: !993, size: 32, offset: 32)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !976, file: !1064, line: 318, type: !1082, isLocal: true, isDefinition: true)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !1064, line: 33, size: 96, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1082, file: !1064, line: 35, baseType: !1056, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1082, file: !1064, line: 37, baseType: !1086, size: 64, offset: 32)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !187, line: 40, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !187, line: 35, size: 64, elements: !1088)
!1088 = !{!1089, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1087, file: !187, line: 36, baseType: !1090, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1087, file: !187, line: 37, baseType: !1090, size: 32, offset: 32)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !976, file: !1064, line: 318, type: !1002, isLocal: true, isDefinition: true, align: 8)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !976, file: !1064, line: 318, type: !1096, isLocal: true, isDefinition: true)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !1064, line: 23, size: 128, elements: !1098)
!1098 = !{!1099, !1100, !1113, !1124}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1097, file: !1064, line: 25, baseType: !1051, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1097, file: !1064, line: 26, baseType: !1101, size: 32, offset: 32)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !725, line: 19729, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 19720, size: 256, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !1103, file: !725, line: 19721, baseType: !729, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !1103, file: !725, line: 19722, baseType: !729, size: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !1103, file: !725, line: 19723, baseType: !800, size: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !1103, file: !725, line: 19724, baseType: !729, size: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !1103, file: !725, line: 19725, baseType: !729, size: 32, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !1103, file: !725, line: 19726, baseType: !729, size: 32, offset: 160)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !1103, file: !725, line: 19727, baseType: !729, size: 32, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !1103, file: !725, line: 19728, baseType: !729, size: 32, offset: 224)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !1097, file: !1064, line: 28, baseType: !1114, size: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !1117, line: 51, size: 128, elements: !1118)
!1117 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1118 = !{!1119, !1120, !1121, !1122, !1123}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !1116, file: !1117, line: 52, baseType: !156, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !1116, file: !1117, line: 53, baseType: !156, size: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !1116, file: !1117, line: 54, baseType: !156, size: 32, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !1116, file: !1117, line: 55, baseType: !143, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !1116, file: !1117, line: 56, baseType: !156, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "mux_count", scope: !1097, file: !1064, line: 29, baseType: !143, size: 8, offset: 96)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(name: "imx_gpio_driver_api", scope: !976, file: !1064, line: 249, type: !986, isLocal: true, isDefinition: true)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_0", scope: !1129, file: !1064, line: 318, type: !1132, isLocal: true, isDefinition: true, align: 32)
!1129 = distinct !DISubprogram(name: "imx_gpio_0_init", scope: !1064, file: !1064, line: 318, type: !1077, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !976, retainedNodes: !1130)
!1130 = !{!1131}
!1131 = !DILocalVariable(name: "port", arg: 1, scope: !1129, file: !1064, line: 318, type: !993)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1132, file: !10, line: 55, baseType: !356, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1132, file: !10, line: 57, baseType: !356, size: 32, offset: 32)
