; ModuleID = 'build/adafruit_feather_nrf52840/subsys/zbus/benchmark/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_bm_channel", scope: !27, file: !114, line: 16, type: !136, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !290, !292, !294, !296, !298, !300, !302, !304, !306, !339, !343, !348, !350, !357, !362}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "bm_channel", scope: !27, file: !114, line: 16, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 192, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !123, !125, !126, !134, !259}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !120, size: 16)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !124, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !13, !132}
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 214, baseType: !32)
!133 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !137, line: 2720, size: 160, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !160, !257, !258}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !136, file: !137, line: 2722, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !142, file: !141, line: 232, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !148)
!148 = !{!149, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 38, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 38, size: 32, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !150, file: !146, line: 39, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !146, line: 40, baseType: !153, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 42, baseType: !156, size: 32, offset: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 42, size: 32, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !156, file: !146, line: 43, baseType: !153, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !146, line: 44, baseType: !153, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !136, file: !137, line: 2724, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = !{!165, !212, !225, !226, !227, !228, !234, !252}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !162, file: !163, line: 247, baseType: !166, size: 384)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !167)
!167 = !{!168, !182, !184, !187, !188, !199, !200, !201}
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 60, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 60, size: 64, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !169, file: !163, line: 61, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !147)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !169, file: !163, line: 62, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !176)
!175 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !174, file: !175, line: 50, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!180 = !{!181}
!181 = !DISubrange(count: 2)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !166, file: !163, line: 68, baseType: !183, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !166, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !186)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !166, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 90, baseType: !189, size: 16, offset: 112)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 90, size: 16, elements: !190)
!190 = !{!191, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !163, line: 91, baseType: !192, size: 16)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !163, line: 91, size: 16, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !192, file: !163, line: 96, baseType: !195, size: 8)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !196)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !192, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !189, file: !163, line: 100, baseType: !121, size: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !166, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !166, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !166, file: !163, line: 131, baseType: !202, size: 192, offset: 192)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !203)
!203 = !{!204, !205, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !141, line: 245, baseType: !172, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !202, file: !141, line: 246, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !202, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !162, file: !163, line: 250, baseType: !213, size: 288, offset: 384)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !213, file: !214, line: 26, baseType: !108, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !213, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !213, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !213, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !213, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !213, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !213, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !213, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !213, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !162, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !162, file: !163, line: 256, baseType: !140, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !162, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !162, file: !163, line: 300, baseType: !229, size: 96, offset: 800)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !163, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !162, file: !163, line: 325, baseType: !235, size: 32, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !137, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !137, line: 5075, baseType: !140, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !137, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !162, file: !163, line: 343, baseType: !253, size: 64, offset: 928)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !214, line: 63, baseType: !108, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !136, file: !137, line: 2727, baseType: !108, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !136, file: !137, line: 2730, baseType: !103, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !260, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 96, elements: !265)
!265 = !{!266, !267, !284}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !264, file: !117, line: 91, baseType: !131, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !264, file: !117, line: 93, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !137, line: 4204, size: 320, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !279, !280, !281, !282, !283}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !137, line: 4206, baseType: !140, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !137, line: 4208, baseType: !249, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !270, file: !137, line: 4210, baseType: !132, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !270, file: !137, line: 4212, baseType: !108, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !270, file: !137, line: 4214, baseType: !277, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !270, file: !137, line: 4216, baseType: !277, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !270, file: !137, line: 4218, baseType: !277, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !270, file: !137, line: 4220, baseType: !277, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !270, file: !137, line: 4222, baseType: !108, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !137, line: 4227, baseType: !185, size: 8, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !264, file: !117, line: 96, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "s1", scope: !27, file: !114, line: 126, type: !264, isLocal: false, isDefinition: true, align: 32)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "s2", scope: !27, file: !114, line: 129, type: !264, isLocal: false, isDefinition: true, align: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s3", scope: !27, file: !114, line: 131, type: !264, isLocal: false, isDefinition: true, align: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "s4", scope: !27, file: !114, line: 132, type: !264, isLocal: false, isDefinition: true, align: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "s5", scope: !27, file: !114, line: 134, type: !264, isLocal: false, isDefinition: true, align: 32)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "s6", scope: !27, file: !114, line: 135, type: !264, isLocal: false, isDefinition: true, align: 32)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "s7", scope: !27, file: !114, line: 136, type: !264, isLocal: false, isDefinition: true, align: 32)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "s8", scope: !27, file: !114, line: 137, type: !264, isLocal: false, isDefinition: true, align: 32)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !27, file: !114, line: 216, type: !308, isLocal: false, isDefinition: true, align: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !137, line: 620, size: 384, elements: !309)
!309 = !{!310, !311, !319, !320, !325, !326, !327, !328, !329, !330, !332, !336}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !308, file: !137, line: 621, baseType: !161, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !308, file: !137, line: 622, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !314, line: 44, baseType: !315)
!314 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !316, line: 47, size: 8, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !316, line: 48, baseType: !278, size: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !308, file: !137, line: 623, baseType: !32, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !308, file: !137, line: 624, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !314, line: 46, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !102, !102, !102}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !308, file: !137, line: 625, baseType: !102, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !308, file: !137, line: 626, baseType: !102, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !308, file: !137, line: 627, baseType: !102, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !308, file: !137, line: 628, baseType: !103, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !308, file: !137, line: 629, baseType: !108, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !308, file: !137, line: 630, baseType: !331, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !308, file: !137, line: 631, baseType: !333, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !308, file: !137, line: 632, baseType: !337, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !27, file: !114, line: 216, type: !341, isLocal: false, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !163, line: 347, baseType: !161)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !27, file: !114, line: 216, type: !345, isLocal: false, isDefinition: true, align: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 8192, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1024)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !27, file: !114, line: 216, type: !162, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "_zbus_message_bm_channel", scope: !27, file: !114, line: 16, type: !352, isLocal: true, isDefinition: true)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !353, line: 10, size: 64, elements: !354)
!353 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !352, file: !353, line: 11, baseType: !102, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !353, line: 12, baseType: !132, size: 32, offset: 32)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "_zbus_observers_bm_channel", scope: !27, file: !114, line: 16, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 288, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 9)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 44, type: !109, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !366, file: !381, line: 18, type: !382, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !368, globals: !380, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!368 = !{!22, !102, !24, !369, !371, !373, !132, !103, !374, !375, !377, !378, !277, !379, !121, !337}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!380 = !{!364}
!381 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !384, line: 17, baseType: !337, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !383, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "_char_out", scope: !390, file: !394, line: 54, type: !395, isLocal: false, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!392 = !{!102, !103}
!393 = !{!388}
!394 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!103, !103}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !400, file: !434, line: 22, type: !464, isLocal: false, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !402, retainedTypes: !414, globals: !431, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!402 = !{!403, !30}
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !404, line: 27, baseType: !32, size: 32, elements: !405)
!404 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413}
!406 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!407 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!408 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!409 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!410 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!411 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!412 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!413 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!414 = !{!102, !104, !103, !24, !415, !277, !108, !109}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !417, line: 54, size: 96, elements: !418)
!417 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!418 = !{!419, !426, !430}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !416, file: !417, line: 55, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !421, line: 33, baseType: !422)
!421 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !421, line: 29, size: 32, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !421, line: 30, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !416, file: !417, line: 60, baseType: !427, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !403}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !416, file: !417, line: 65, baseType: !427, size: 32, offset: 64)
!431 = !{!398, !432, !440, !443, !445, !454, !456}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !400, file: !434, line: 27, type: !435, isLocal: true, isDefinition: true)
!434 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 32, elements: !438)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !437, line: 22, baseType: !376)
!437 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = !{!439}
!439 = !DISubrange(count: 1)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !400, file: !434, line: 44, type: !442, isLocal: true, isDefinition: true)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !400, file: !434, line: 49, type: !442, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !400, file: !434, line: 36, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 128, elements: !438)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !404, line: 114, size: 128, elements: !449)
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !448, file: !404, line: 115, baseType: !403, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !448, file: !404, line: 141, baseType: !185, size: 8, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !448, file: !404, line: 149, baseType: !108, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !448, file: !404, line: 156, baseType: !108, size: 32, offset: 96)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !400, file: !434, line: 40, type: !447, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !400, file: !434, line: 28, type: !458, isLocal: true, isDefinition: true)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !421, line: 40, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !421, line: 35, size: 64, elements: !460)
!460 = !{!461, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !459, file: !421, line: 36, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !459, file: !421, line: 37, baseType: !462, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !465, file: !384, line: 17, baseType: !337, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !465, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!469 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!470 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !473, file: !501, line: 50, type: !331, isLocal: true, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !402, retainedTypes: !475, globals: !498, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!475 = !{!476, !104, !132, !103, !102, !108, !109, !478, !277, !331, !489}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !477)
!477 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !480, line: 45, size: 64, elements: !481)
!480 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!481 = !{!482, !488}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !479, file: !480, line: 46, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !421, line: 33, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !421, line: 29, size: 32, elements: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !421, line: 30, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !479, file: !480, line: 48, baseType: !108, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !480, line: 38, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !490, file: !480, line: 39, baseType: !483, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !490, file: !480, line: 41, baseType: !494, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !480, line: 35, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !331}
!498 = !{!499, !503, !511, !471, !513, !523}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "latency_lock", scope: !473, file: !501, line: 44, type: !502, isLocal: true, isDefinition: true)
!501 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !473, file: !501, line: 46, type: !505, isLocal: true, isDefinition: true)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !421, line: 40, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !421, line: 35, size: 64, elements: !507)
!507 = !{!508, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !506, file: !421, line: 36, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !506, file: !421, line: 37, baseType: !509, size: 32, offset: 32)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "latency_subs", scope: !473, file: !501, line: 52, type: !505, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !473, file: !501, line: 39, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, elements: !521)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 35, size: 96, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !516, file: !501, line: 36, baseType: !403, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !516, file: !501, line: 37, baseType: !185, size: 8, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !516, file: !501, line: 38, baseType: !436, size: 32, offset: 64)
!521 = !{!522}
!522 = !DISubrange(count: 0)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !473, file: !501, line: 48, type: !331, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !527, file: !534, line: 47, type: !548, isLocal: true, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, retainedTypes: !530, globals: !531, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!529 = !{!403}
!530 = !{!132, !103}
!531 = !{!532, !525, !544}
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "cpus_states", scope: !527, file: !534, line: 50, type: !535, isLocal: true, isDefinition: true)
!534 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 32, elements: !438)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !404, line: 114, size: 128, elements: !539)
!539 = !{!540, !541, !542, !543}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !538, file: !404, line: 115, baseType: !403, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !538, file: !404, line: 141, baseType: !185, size: 8, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !538, file: !404, line: 149, baseType: !108, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !538, file: !404, line: 156, baseType: !108, size: 32, offset: 96)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !527, file: !534, line: 55, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 8, elements: !438)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, elements: !521)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !551, file: !558, line: 17, type: !680, isLocal: false, isDefinition: true)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !553, globals: !554, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!553 = !{!132, !103, !108, !102}
!554 = !{!549, !555, !676}
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !557, file: !558, line: 198, type: !664, isLocal: true, isDefinition: true)
!557 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !558, file: !558, line: 175, type: !559, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !551, retainedNodes: !661)
!558 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!559 = !DISubroutineType(types: !560)
!560 = !{null, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !563)
!563 = !{!564, !622, !634, !635, !636, !637, !643, !656}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !562, file: !163, line: 247, baseType: !565, size: 384)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !566)
!566 = !{!567, !591, !598, !599, !600, !609, !610, !611}
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !163, line: 60, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !163, line: 60, size: 64, elements: !569)
!569 = !{!570, !585}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !568, file: !163, line: 61, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !573)
!573 = !{!574, !580}
!574 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !146, line: 38, baseType: !575, size: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !572, file: !146, line: 38, size: 32, elements: !576)
!576 = !{!577, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !575, file: !146, line: 39, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !575, file: !146, line: 40, baseType: !578, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !146, line: 42, baseType: !581, size: 32, offset: 32)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !572, file: !146, line: 42, size: 32, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !581, file: !146, line: 43, baseType: !578, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !581, file: !146, line: 44, baseType: !578, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !568, file: !163, line: 62, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !587)
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !586, file: !175, line: 50, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 64, elements: !180)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !565, file: !163, line: 68, baseType: !592, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !594, file: !141, line: 232, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !572)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !565, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !565, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!600 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !163, line: 90, baseType: !601, size: 16, offset: 112)
!601 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !163, line: 90, size: 16, elements: !602)
!602 = !{!603, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, scope: !601, file: !163, line: 91, baseType: !604, size: 16)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !601, file: !163, line: 91, size: 16, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !604, file: !163, line: 96, baseType: !195, size: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !604, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !601, file: !163, line: 100, baseType: !121, size: 16)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !565, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !565, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !565, file: !163, line: 131, baseType: !612, size: 192, offset: 192)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !613)
!613 = !{!614, !615, !621}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !612, file: !141, line: 245, baseType: !571, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !612, file: !141, line: 246, baseType: !616, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !612, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !562, file: !163, line: 250, baseType: !623, size: 288, offset: 384)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !623, file: !214, line: 26, baseType: !108, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !623, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !623, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !623, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !623, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !623, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !623, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !623, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !623, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !562, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !562, file: !163, line: 256, baseType: !593, size: 64, offset: 704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !562, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !562, file: !163, line: 300, baseType: !638, size: 96, offset: 800)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !638, file: !163, line: 153, baseType: !22, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !638, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !562, file: !163, line: 325, baseType: !644, size: 32, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !646)
!646 = !{!647, !653, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !645, file: !137, line: 5074, baseType: !648, size: 96)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !648, file: !240, line: 57, baseType: !243, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !648, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !648, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !645, file: !137, line: 5075, baseType: !593, size: 64, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !645, file: !137, line: 5076, baseType: !655, offset: 160)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !562, file: !163, line: 343, baseType: !657, size: 64, offset: 928)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !657, file: !214, line: 63, baseType: !108, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !657, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!661 = !{!662, !663}
!662 = !DILocalVariable(name: "thread", arg: 1, scope: !557, file: !558, line: 175, type: !561)
!663 = !DILocalVariable(name: "region_num", scope: !557, file: !558, line: 200, type: !185)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, elements: !521)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !666, line: 52, size: 96, elements: !667)
!666 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!667 = !{!668, !669, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !665, file: !666, line: 53, baseType: !22, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !666, line: 54, baseType: !132, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !665, file: !666, line: 55, baseType: !671, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !672, line: 151, baseType: !673)
!672 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 149, size: 32, elements: !674)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !673, file: !672, line: 150, baseType: !108, size: 32)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "static_regions", scope: !551, file: !558, line: 62, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 96, elements: !438)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !384, line: 17, baseType: !337, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !681, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !687, file: !721, line: 39, type: !185, isLocal: true, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !689, globals: !720, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!689 = !{!690, !102, !103, !708, !185}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !692, line: 1226, baseType: !693)
!692 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !692, line: 1213, size: 352, elements: !694)
!694 = !{!695, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !693, file: !692, line: 1215, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !693, file: !692, line: 1216, baseType: !697, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !693, file: !692, line: 1217, baseType: !697, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !693, file: !692, line: 1218, baseType: !697, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !693, file: !692, line: 1219, baseType: !697, size: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !693, file: !692, line: 1220, baseType: !697, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !693, file: !692, line: 1221, baseType: !697, size: 32, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !693, file: !692, line: 1222, baseType: !697, size: 32, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !693, file: !692, line: 1223, baseType: !697, size: 32, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !693, file: !692, line: 1224, baseType: !697, size: 32, offset: 288)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !693, file: !692, line: 1225, baseType: !697, size: 32, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !711, line: 27, size: 96, elements: !712)
!711 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !710, file: !711, line: 29, baseType: !108, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !711, line: 31, baseType: !337, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !710, file: !711, line: 37, baseType: !716, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !672, line: 146, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !672, line: 141, size: 32, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !717, file: !672, line: 143, baseType: !108, size: 32)
!720 = !{!685}
!721 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !724, file: !731, line: 21, type: !395, isLocal: true, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !726, globals: !730, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!726 = !{!727, !103, !102}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !729, line: 22, baseType: !103)
!729 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!730 = !{!722}
!731 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !734, file: !739, line: 13, type: !756, isLocal: true, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !736, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!736 = !{!737, !732}
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "mpu_config", scope: !734, file: !739, line: 37, type: !740, isLocal: false, isDefinition: true)
!739 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !711, line: 41, size: 64, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !741, file: !711, line: 43, baseType: !108, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !741, file: !711, line: 45, baseType: !745, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !711, line: 27, size: 96, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !747, file: !711, line: 29, baseType: !108, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !747, file: !711, line: 31, baseType: !337, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !747, file: !711, line: 37, baseType: !752, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !672, line: 146, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !672, line: 141, size: 32, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !753, file: !672, line: 143, baseType: !108, size: 32)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 192, elements: !180)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !759, file: !925, line: 48, type: !941, isLocal: false, isDefinition: true)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !761, globals: !922, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!761 = !{!762, !185, !102, !103, !840, !108, !841, !877, !888}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !764, line: 1071, baseType: !765)
!764 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !764, line: 1035, size: 19584, elements: !766)
!766 = !{!767, !771, !772, !773, !777, !778, !780, !781, !782, !783, !784, !785, !789, !790, !791, !795, !796, !798, !799, !803, !804, !808, !809, !810, !811, !812, !813, !814, !818, !819, !820, !821, !825, !826, !830}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !765, file: !764, line: 1036, baseType: !768, size: 960)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 960, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 30)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !765, file: !764, line: 1037, baseType: !697, size: 32, offset: 960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !765, file: !764, line: 1038, baseType: !697, size: 32, offset: 992)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !765, file: !764, line: 1039, baseType: !774, size: 1088, offset: 1024)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 1088, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 34)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !765, file: !764, line: 1040, baseType: !697, size: 32, offset: 2112)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !765, file: !764, line: 1041, baseType: !779, size: 64, offset: 2144)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 64, elements: !180)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !765, file: !764, line: 1042, baseType: !697, size: 32, offset: 2208)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !765, file: !764, line: 1043, baseType: !697, size: 32, offset: 2240)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !765, file: !764, line: 1044, baseType: !697, size: 32, offset: 2272)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !765, file: !764, line: 1045, baseType: !697, size: 32, offset: 2304)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !765, file: !764, line: 1046, baseType: !697, size: 32, offset: 2336)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !765, file: !764, line: 1047, baseType: !786, size: 3808, offset: 2368)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 3808, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 119)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !765, file: !764, line: 1048, baseType: !697, size: 32, offset: 6176)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !765, file: !764, line: 1049, baseType: !697, size: 32, offset: 6208)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !765, file: !764, line: 1050, baseType: !792, size: 1952, offset: 6240)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 1952, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 61)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !765, file: !764, line: 1051, baseType: !697, size: 32, offset: 8192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !765, file: !764, line: 1052, baseType: !797, size: 288, offset: 8224)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 288, elements: !360)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !765, file: !764, line: 1053, baseType: !696, size: 32, offset: 8512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !765, file: !764, line: 1054, baseType: !800, size: 96, offset: 8544)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 96, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 3)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !765, file: !764, line: 1055, baseType: !696, size: 32, offset: 8640)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !765, file: !764, line: 1056, baseType: !805, size: 1568, offset: 8672)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 1568, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 49)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !765, file: !764, line: 1057, baseType: !697, size: 32, offset: 10240)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !765, file: !764, line: 1058, baseType: !800, size: 96, offset: 10272)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !765, file: !764, line: 1059, baseType: !697, size: 32, offset: 10368)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !765, file: !764, line: 1060, baseType: !779, size: 64, offset: 10400)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !765, file: !764, line: 1061, baseType: !697, size: 32, offset: 10464)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !765, file: !764, line: 1062, baseType: !697, size: 32, offset: 10496)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !765, file: !764, line: 1063, baseType: !815, size: 672, offset: 10528)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 672, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 21)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !765, file: !764, line: 1064, baseType: !697, size: 32, offset: 11200)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !765, file: !764, line: 1065, baseType: !696, size: 32, offset: 11232)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !765, file: !764, line: 1066, baseType: !697, size: 32, offset: 11264)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !765, file: !764, line: 1067, baseType: !822, size: 1504, offset: 11296)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 1504, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 47)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !765, file: !764, line: 1068, baseType: !696, size: 32, offset: 12800)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !765, file: !764, line: 1069, baseType: !827, size: 5600, offset: 12832)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 5600, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 175)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !765, file: !764, line: 1070, baseType: !831, size: 1152, offset: 18432)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 1152, elements: !360)
!832 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !764, line: 278, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !764, line: 272, size: 128, elements: !835)
!835 = !{!836, !837, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !834, file: !764, line: 273, baseType: !697, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !834, file: !764, line: 274, baseType: !697, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !834, file: !764, line: 275, baseType: !697, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !834, file: !764, line: 277, baseType: !696, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !692, line: 468, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !692, line: 445, size: 1120, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !870, !874, !876}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !843, file: !692, line: 447, baseType: !696, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !843, file: !692, line: 448, baseType: !697, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !843, file: !692, line: 449, baseType: !697, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !843, file: !692, line: 450, baseType: !697, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !843, file: !692, line: 451, baseType: !697, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !843, file: !692, line: 452, baseType: !697, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !843, file: !692, line: 453, baseType: !852, size: 96, offset: 192)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 96, elements: !854)
!853 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!854 = !{!855}
!855 = !DISubrange(count: 12)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !843, file: !692, line: 454, baseType: !697, size: 32, offset: 288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !843, file: !692, line: 455, baseType: !697, size: 32, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !843, file: !692, line: 456, baseType: !697, size: 32, offset: 352)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !843, file: !692, line: 457, baseType: !697, size: 32, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !843, file: !692, line: 458, baseType: !697, size: 32, offset: 416)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !843, file: !692, line: 459, baseType: !697, size: 32, offset: 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !843, file: !692, line: 460, baseType: !697, size: 32, offset: 480)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !843, file: !692, line: 461, baseType: !779, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !843, file: !692, line: 462, baseType: !696, size: 32, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !843, file: !692, line: 463, baseType: !696, size: 32, offset: 608)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !843, file: !692, line: 464, baseType: !867, size: 128, offset: 640)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 128, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 4)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !843, file: !692, line: 465, baseType: !871, size: 160, offset: 768)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 160, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 5)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !843, file: !692, line: 466, baseType: !875, size: 160, offset: 928)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 160, elements: !872)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !843, file: !692, line: 467, baseType: !697, size: 32, offset: 1088)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !879, file: !878, line: 167, baseType: !887)
!878 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!879 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !878, file: !878, line: 134, type: !880, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !759, retainedNodes: !882)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !108}
!882 = !{!883, !884, !886}
!883 = !DILocalVariable(name: "time_us", arg: 1, scope: !879, file: !878, line: 134, type: !108)
!884 = !DILocalVariable(name: "delay_cycles", scope: !879, file: !878, line: 168, type: !885)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!886 = !DILocalVariable(name: "cycles", scope: !879, file: !878, line: 171, type: !108)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !764, line: 2399, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !764, line: 2373, size: 10880, elements: !891)
!891 = !{!892, !896, !897, !898, !899, !903, !904, !909, !910, !911, !912, !913, !914, !918, !919, !920, !921}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !890, file: !764, line: 2374, baseType: !893, size: 8192)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 8192, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !890, file: !764, line: 2375, baseType: !696, size: 32, offset: 8192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !890, file: !764, line: 2376, baseType: !696, size: 32, offset: 8224)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !890, file: !764, line: 2377, baseType: !696, size: 32, offset: 8256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !890, file: !764, line: 2378, baseType: !900, size: 1984, offset: 8288)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 1984, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 62)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !890, file: !764, line: 2379, baseType: !697, size: 32, offset: 10272)
!904 = !DIDerivedType(tag: DW_TAG_member, scope: !890, file: !764, line: 2381, baseType: !905, size: 32, offset: 10304)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !890, file: !764, line: 2381, size: 32, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !905, file: !764, line: 2382, baseType: !697, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !905, file: !764, line: 2383, baseType: !697, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !890, file: !764, line: 2386, baseType: !697, size: 32, offset: 10336)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !890, file: !764, line: 2387, baseType: !697, size: 32, offset: 10368)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !890, file: !764, line: 2389, baseType: !697, size: 32, offset: 10400)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !890, file: !764, line: 2391, baseType: !697, size: 32, offset: 10432)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !890, file: !764, line: 2393, baseType: !697, size: 32, offset: 10464)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !890, file: !764, line: 2394, baseType: !915, size: 256, offset: 10496)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 256, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 8)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !890, file: !764, line: 2395, baseType: !697, size: 32, offset: 10752)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !890, file: !764, line: 2396, baseType: !696, size: 32, offset: 10784)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !890, file: !764, line: 2397, baseType: !697, size: 32, offset: 10816)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !890, file: !764, line: 2398, baseType: !697, size: 32, offset: 10848)
!922 = !{!757, !923, !938}
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !759, file: !925, line: 93, type: !926, isLocal: true, isDefinition: true, align: 32)
!925 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !928, line: 51, size: 64, elements: !929)
!928 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !{!930, !937}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !927, file: !928, line: 60, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!103, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !928, line: 48, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !927, file: !928, line: 65, baseType: !934, size: 32, offset: 32)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !879, file: !878, line: 161, type: !940, isLocal: true, isDefinition: true, align: 128)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 48, elements: !801)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !384, line: 17, baseType: !337, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !942, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !948, file: !952, line: 10, type: !953, isLocal: false, isDefinition: true)
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !950, globals: !951, splitDebugInlining: false, nameTableKind: None)
!949 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!950 = !{!104, !102, !103}
!951 = !{!946}
!952 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !384, line: 17, baseType: !337, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !954, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !960, file: !1194, line: 18, type: !1423, isLocal: false, isDefinition: true)
!960 = distinct !DICompileUnit(language: DW_LANG_C99, file: !961, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !962, retainedTypes: !1105, globals: !1190, splitDebugInlining: false, nameTableKind: None)
!961 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/zbus/benchmark")
!962 = !{!963, !969, !30, !974, !979, !986, !994, !1002, !1011, !1015, !1070, !1077, !1096}
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !964, line: 23, baseType: !32, size: 32, elements: !965)
!964 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!965 = !{!966, !967, !968}
!966 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!967 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!968 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !964, line: 48, baseType: !32, size: 32, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!972 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!973 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!974 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 167, baseType: !32, size: 32, elements: !976)
!975 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!976 = !{!977, !978}
!977 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!978 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!979 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 107, baseType: !32, size: 32, elements: !980)
!980 = !{!981, !982, !983, !984, !985}
!981 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!982 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!983 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!984 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!985 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!986 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 208, baseType: !32, size: 32, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !993}
!988 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!989 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!990 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!991 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!992 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!993 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!994 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 261, baseType: !32, size: 32, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001}
!996 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!997 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!998 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!999 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!1000 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!1001 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 237, baseType: !32, size: 32, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010}
!1004 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!1005 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
