; ModuleID = 'build/arduino_due/subsys/zbus/hello_world/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.version_msg = type { i8, i8, i16 }
%struct.zbus_observer = type { i8*, i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !114, line: 25, type: !141, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !295, !297, !299, !301, !303, !305, !307, !309, !340, !344, !349, !354, !356, !358, !365, !370, !377, !382, !384}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !114, line: 25, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 224, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !124, !128, !130, !131, !139, !264}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 32, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !125, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !129, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !132, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !13, !137}
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 214, baseType: !32)
!138 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !142, line: 2720, size: 160, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !165, !262, !263}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !141, file: !142, line: 2722, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !147, file: !146, line: 232, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !153)
!153 = !{!154, !160}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 38, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 38, size: 32, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !151, line: 39, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !151, line: 40, baseType: !158, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 42, baseType: !161, size: 32, offset: 32)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 42, size: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !161, file: !151, line: 43, baseType: !158, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !151, line: 44, baseType: !158, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !141, file: !142, line: 2724, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1024, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170, !217, !230, !231, !232, !233, !239, !257}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !168, line: 247, baseType: !171, size: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !172)
!172 = !{!173, !187, !189, !192, !193, !204, !205, !206}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 60, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 60, size: 64, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !174, file: !168, line: 61, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !174, file: !168, line: 62, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !179, file: !180, line: 50, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !171, file: !168, line: 68, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !171, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !191)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !171, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!193 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 90, baseType: !194, size: 16, offset: 112)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 90, size: 16, elements: !195)
!195 = !{!196, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !168, line: 91, baseType: !197, size: 16)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !168, line: 91, size: 16, elements: !198)
!198 = !{!199, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !197, file: !168, line: 96, baseType: !200, size: 8)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !201)
!201 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !197, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !194, file: !168, line: 100, baseType: !126, size: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !171, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !171, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !171, file: !168, line: 131, baseType: !207, size: 192, offset: 192)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !208)
!208 = !{!209, !210, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !146, line: 245, baseType: !177, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !207, file: !146, line: 246, baseType: !211, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !207, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !167, file: !168, line: 250, baseType: !218, size: 288, offset: 384)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !218, file: !219, line: 26, baseType: !108, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !218, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !218, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !218, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !218, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !218, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !218, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !218, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !218, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !167, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !167, file: !168, line: 256, baseType: !145, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !167, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !167, file: !168, line: 300, baseType: !234, size: 96, offset: 800)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !235)
!235 = !{!236, !237, !238}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !234, file: !168, line: 153, baseType: !22, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !234, file: !168, line: 162, baseType: !137, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !234, file: !168, line: 168, baseType: !137, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !167, file: !168, line: 325, baseType: !240, size: 32, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !242)
!242 = !{!243, !252, !253}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !241, file: !142, line: 5074, baseType: !244, size: 96)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !245, line: 56, size: 96, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247, !250, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !244, file: !245, line: 57, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !245, line: 57, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !244, file: !245, line: 58, baseType: !106, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !244, file: !245, line: 59, baseType: !137, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !241, file: !142, line: 5075, baseType: !145, size: 64, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !241, file: !142, line: 5076, baseType: !254, offset: 160)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !255, line: 43, elements: !256)
!255 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !{}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !167, file: !168, line: 343, baseType: !258, size: 64, offset: 928)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !258, file: !219, line: 63, baseType: !108, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !258, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !141, file: !142, line: 2727, baseType: !108, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !141, file: !142, line: 2730, baseType: !107, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !265, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 128, elements: !270)
!270 = !{!271, !272, !273, !289}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !117, line: 88, baseType: !120, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !269, file: !117, line: 91, baseType: !136, size: 8, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !269, file: !117, line: 93, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !142, line: 4204, size: 320, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !284, !285, !286, !287, !288}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !276, file: !142, line: 4206, baseType: !145, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !276, file: !142, line: 4208, baseType: !254, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !276, file: !142, line: 4210, baseType: !137, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !276, file: !142, line: 4212, baseType: !108, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !276, file: !142, line: 4214, baseType: !283, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !276, file: !142, line: 4216, baseType: !283, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !276, file: !142, line: 4218, baseType: !283, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !276, file: !142, line: 4220, baseType: !283, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !276, file: !142, line: 4222, baseType: !108, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !142, line: 4227, baseType: !190, size: 8, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !269, file: !117, line: 96, baseType: !290, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_zbus_mutex_acc_data_chan", scope: !27, file: !114, line: 35, type: !141, isLocal: true, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "acc_data_chan", scope: !27, file: !114, line: 35, type: !115, isLocal: false, isDefinition: true, align: 32)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_zbus_mutex_simple_chan", scope: !27, file: !114, line: 57, type: !141, isLocal: true, isDefinition: true, align: 32)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "simple_chan", scope: !27, file: !114, line: 57, type: !115, isLocal: false, isDefinition: true, align: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "foo_lis", scope: !27, file: !114, line: 73, type: !269, isLocal: false, isDefinition: true, align: 32)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !276, isLocal: false, isDefinition: true, align: 32)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "bar_sub", scope: !27, file: !114, line: 75, type: !269, isLocal: false, isDefinition: true, align: 32)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "_k_thread_data_subscriber_task_id", scope: !27, file: !114, line: 92, type: !311, isLocal: false, isDefinition: true, align: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !142, line: 620, size: 384, elements: !312)
!312 = !{!313, !314, !322, !323, !328, !329, !330, !331, !332, !333, !335, !339}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !311, file: !142, line: 621, baseType: !166, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !311, file: !142, line: 622, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !317, line: 44, baseType: !318)
!317 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !319, line: 47, size: 8, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !319, line: 48, baseType: !123, size: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !311, file: !142, line: 623, baseType: !32, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !311, file: !142, line: 624, baseType: !324, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !317, line: 46, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !106, !106, !106}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !311, file: !142, line: 625, baseType: !106, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !311, file: !142, line: 626, baseType: !106, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !311, file: !142, line: 627, baseType: !106, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !311, file: !142, line: 628, baseType: !107, size: 32, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !311, file: !142, line: 629, baseType: !108, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !311, file: !142, line: 630, baseType: !334, size: 32, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !311, file: !142, line: 631, baseType: !336, size: 32, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DISubroutineType(types: !338)
!338 = !{null}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !311, file: !142, line: 632, baseType: !121, size: 32, offset: 352)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "subscriber_task_id", scope: !27, file: !114, line: 92, type: !342, isLocal: false, isDefinition: true)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !168, line: 347, baseType: !166)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !346, isLocal: true, isDefinition: true, align: 32)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 16)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "_k_thread_stack_subscriber_task_id", scope: !27, file: !114, line: 92, type: !351, isLocal: false, isDefinition: true, align: 512)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 4608, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 576)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "_k_thread_obj_subscriber_task_id", scope: !27, file: !114, line: 92, type: !167, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 95, type: !107, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !114, line: 25, type: !360, isLocal: true, isDefinition: true)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !114, line: 13, size: 32, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !360, file: !114, line: 14, baseType: !190, size: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !360, file: !114, line: 15, baseType: !190, size: 8, offset: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !360, file: !114, line: 16, baseType: !126, size: 16, offset: 16)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !114, line: 25, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 32, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 1)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "_zbus_message_acc_data_chan", scope: !27, file: !114, line: 35, type: !372, isLocal: true, isDefinition: true)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acc_msg", file: !114, line: 19, size: 96, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !372, file: !114, line: 20, baseType: !107, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !372, file: !114, line: 21, baseType: !107, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !372, file: !114, line: 22, baseType: !107, size: 32, offset: 64)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "_zbus_observers_acc_data_chan", scope: !27, file: !114, line: 35, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 96, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 3)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "_zbus_message_simple_chan", scope: !27, file: !114, line: 57, type: !107, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "_zbus_observers_simple_chan", scope: !27, file: !114, line: 57, type: !367, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !388, file: !403, line: 18, type: !404, isLocal: false, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, globals: !402, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!390 = !{!22, !106, !24, !391, !393, !395, !137, !107, !396, !397, !399, !400, !283, !401, !126, !121}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!402 = !{!386}
!403 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !407)
!406 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !406, line: 17, baseType: !121, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !405, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "_char_out", scope: !412, file: !416, line: 54, type: !417, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !414, globals: !415, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!414 = !{!106, !107}
!415 = !{!410}
!416 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{!107, !107}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !422, file: !483, line: 235, type: !484, isLocal: true, isDefinition: true, align: 32)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !424, globals: !482, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!424 = !{!106, !107, !425, !436}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !427, line: 46, baseType: !428)
!427 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 41, size: 128, elements: !429)
!429 = !{!430, !432, !433, !435}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !428, file: !427, line: 42, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !428, file: !427, line: 43, baseType: !431, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !428, file: !427, line: 44, baseType: !434, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !428, file: !427, line: 45, baseType: !434, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !438, line: 75, baseType: !439)
!438 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 41, size: 2176, elements: !440)
!440 = !{!441, !442, !443, !444, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !460, !464, !465, !466, !467, !468, !469, !470, !471, !475, !476, !477, !478, !479, !480, !481}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !439, file: !438, line: 42, baseType: !431, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !439, file: !438, line: 43, baseType: !431, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !439, file: !438, line: 44, baseType: !434, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !439, file: !438, line: 45, baseType: !445, size: 32, offset: 96)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 32, elements: !368)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !439, file: !438, line: 46, baseType: !431, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !439, file: !438, line: 47, baseType: !431, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !439, file: !438, line: 48, baseType: !434, size: 32, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !439, file: !438, line: 49, baseType: !431, size: 32, offset: 224)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !439, file: !438, line: 50, baseType: !431, size: 32, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !439, file: !438, line: 51, baseType: !434, size: 32, offset: 288)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !439, file: !438, line: 52, baseType: !431, size: 32, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !439, file: !438, line: 53, baseType: !445, size: 32, offset: 352)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !439, file: !438, line: 54, baseType: !431, size: 32, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !439, file: !438, line: 55, baseType: !445, size: 32, offset: 416)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !439, file: !438, line: 56, baseType: !431, size: 32, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !439, file: !438, line: 57, baseType: !445, size: 32, offset: 480)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !439, file: !438, line: 58, baseType: !459, size: 96, offset: 512)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 96, elements: !380)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !439, file: !438, line: 59, baseType: !461, size: 160, offset: 608)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 160, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 5)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !439, file: !438, line: 60, baseType: !431, size: 32, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !439, file: !438, line: 61, baseType: !431, size: 32, offset: 800)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !439, file: !438, line: 62, baseType: !434, size: 32, offset: 832)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !439, file: !438, line: 63, baseType: !434, size: 32, offset: 864)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !439, file: !438, line: 64, baseType: !431, size: 32, offset: 896)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !439, file: !438, line: 65, baseType: !431, size: 32, offset: 928)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !439, file: !438, line: 66, baseType: !431, size: 32, offset: 960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !439, file: !438, line: 67, baseType: !472, size: 832, offset: 992)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 832, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 26)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !439, file: !438, line: 68, baseType: !431, size: 32, offset: 1824)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !439, file: !438, line: 69, baseType: !434, size: 32, offset: 1856)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !439, file: !438, line: 70, baseType: !461, size: 160, offset: 1888)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !439, file: !438, line: 71, baseType: !431, size: 32, offset: 2048)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !439, file: !438, line: 72, baseType: !431, size: 32, offset: 2080)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !439, file: !438, line: 73, baseType: !434, size: 32, offset: 2112)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !439, file: !438, line: 74, baseType: !431, size: 32, offset: 2144)
!482 = !{!420}
!483 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !486, line: 51, size: 64, elements: !487)
!486 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!487 = !{!488, !513}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !485, file: !486, line: 60, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = !DISubroutineType(types: !491)
!491 = !{!107, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !495, line: 378, size: 192, elements: !496)
!495 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !{!497, !498, !499, !500, !506, !507}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !495, line: 380, baseType: !121, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !494, file: !495, line: 382, baseType: !13, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !494, file: !495, line: 384, baseType: !13, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !494, file: !495, line: 386, baseType: !501, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !495, line: 351, size: 16, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !502, file: !495, line: 359, baseType: !190, size: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !502, file: !495, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !494, file: !495, line: 388, baseType: !106, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !494, file: !495, line: 396, baseType: !508, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !495, line: 43, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !512)
!512 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !485, file: !486, line: 65, baseType: !492, size: 32, offset: 32)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !516, file: !523, line: 17, type: !647, isLocal: false, isDefinition: true)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !518, globals: !519, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!518 = !{!137, !107, !108, !106}
!519 = !{!514, !520, !643}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !522, file: !523, line: 198, type: !631, isLocal: true, isDefinition: true)
!522 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !523, file: !523, line: 175, type: !524, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !516, retainedNodes: !626)
!523 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1024, elements: !528)
!528 = !{!529, !587, !599, !600, !601, !602, !608, !621}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !527, file: !168, line: 247, baseType: !530, size: 384)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !531)
!531 = !{!532, !556, !563, !564, !565, !574, !575, !576}
!532 = !DIDerivedType(tag: DW_TAG_member, scope: !530, file: !168, line: 60, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !530, file: !168, line: 60, size: 64, elements: !534)
!534 = !{!535, !550}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !533, file: !168, line: 61, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !538)
!538 = !{!539, !545}
!539 = !DIDerivedType(tag: DW_TAG_member, scope: !537, file: !151, line: 38, baseType: !540, size: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !537, file: !151, line: 38, size: 32, elements: !541)
!541 = !{!542, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !540, file: !151, line: 39, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !151, line: 40, baseType: !543, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !537, file: !151, line: 42, baseType: !546, size: 32, offset: 32)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !537, file: !151, line: 42, size: 32, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !546, file: !151, line: 43, baseType: !543, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !546, file: !151, line: 44, baseType: !543, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !533, file: !168, line: 62, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !552)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !551, file: !180, line: 50, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 64, elements: !185)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !530, file: !168, line: 68, baseType: !557, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !559, file: !146, line: 232, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !537)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !530, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !530, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!565 = !DIDerivedType(tag: DW_TAG_member, scope: !530, file: !168, line: 90, baseType: !566, size: 16, offset: 112)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !530, file: !168, line: 90, size: 16, elements: !567)
!567 = !{!568, !573}
!568 = !DIDerivedType(tag: DW_TAG_member, scope: !566, file: !168, line: 91, baseType: !569, size: 16)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !566, file: !168, line: 91, size: 16, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !569, file: !168, line: 96, baseType: !200, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !569, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !566, file: !168, line: 100, baseType: !126, size: 16)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !530, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !530, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !530, file: !168, line: 131, baseType: !577, size: 192, offset: 192)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !578)
!578 = !{!579, !580, !586}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !577, file: !146, line: 245, baseType: !536, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !577, file: !146, line: 246, baseType: !581, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !577, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !527, file: !168, line: 250, baseType: !588, size: 288, offset: 384)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !588, file: !219, line: 26, baseType: !108, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !588, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !588, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !588, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !588, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !588, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !588, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !588, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !588, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !527, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !527, file: !168, line: 256, baseType: !558, size: 64, offset: 704)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !527, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !527, file: !168, line: 300, baseType: !603, size: 96, offset: 800)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !603, file: !168, line: 153, baseType: !22, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !603, file: !168, line: 162, baseType: !137, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !603, file: !168, line: 168, baseType: !137, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !527, file: !168, line: 325, baseType: !609, size: 32, offset: 896)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !611)
!611 = !{!612, !618, !619}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !610, file: !142, line: 5074, baseType: !613, size: 96)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !245, line: 56, size: 96, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !613, file: !245, line: 57, baseType: !248, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !613, file: !245, line: 58, baseType: !106, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !613, file: !245, line: 59, baseType: !137, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !610, file: !142, line: 5075, baseType: !558, size: 64, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !610, file: !142, line: 5076, baseType: !620, offset: 160)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !255, line: 43, elements: !256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !527, file: !168, line: 343, baseType: !622, size: 64, offset: 928)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !622, file: !219, line: 63, baseType: !108, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !622, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!626 = !{!627, !628, !629, !630}
!627 = !DILocalVariable(name: "thread", arg: 1, scope: !522, file: !523, line: 175, type: !526)
!628 = !DILocalVariable(name: "region_num", scope: !522, file: !523, line: 200, type: !190)
!629 = !DILocalVariable(name: "guard_start", scope: !522, file: !523, line: 265, type: !22)
!630 = !DILocalVariable(name: "guard_size", scope: !522, file: !523, line: 266, type: !137)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 96, elements: !368)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !633, line: 52, size: 96, elements: !634)
!633 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!634 = !{!635, !636, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !632, file: !633, line: 53, baseType: !22, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !632, file: !633, line: 54, baseType: !137, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !632, file: !633, line: 55, baseType: !638, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !639, line: 151, baseType: !640)
!639 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 149, size: 32, elements: !641)
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !640, file: !639, line: 150, baseType: !108, size: 32)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "static_regions", scope: !516, file: !523, line: 62, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 96, elements: !368)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !648, file: !406, line: 17, baseType: !121, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !648, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !654, file: !686, line: 39, type: !190, isLocal: true, isDefinition: true)
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !656, globals: !685, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!656 = !{!657, !106, !107, !673, !190}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !659, line: 1168, baseType: !660)
!659 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !659, line: 1155, size: 352, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !660, file: !659, line: 1157, baseType: !434, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !660, file: !659, line: 1158, baseType: !431, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !660, file: !659, line: 1159, baseType: !431, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !660, file: !659, line: 1160, baseType: !431, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !660, file: !659, line: 1161, baseType: !431, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !660, file: !659, line: 1162, baseType: !431, size: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !660, file: !659, line: 1163, baseType: !431, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !660, file: !659, line: 1164, baseType: !431, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !660, file: !659, line: 1165, baseType: !431, size: 32, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !660, file: !659, line: 1166, baseType: !431, size: 32, offset: 288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !660, file: !659, line: 1167, baseType: !431, size: 32, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !676, line: 27, size: 96, elements: !677)
!676 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!677 = !{!678, !679, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !675, file: !676, line: 29, baseType: !108, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !676, line: 31, baseType: !121, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !675, file: !676, line: 37, baseType: !681, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !639, line: 146, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !639, line: 141, size: 32, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !682, file: !639, line: 143, baseType: !108, size: 32)
!685 = !{!652}
!686 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !689, file: !696, line: 21, type: !417, isLocal: true, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !691, globals: !695, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!691 = !{!692, !107, !106}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !694, line: 22, baseType: !107)
!694 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!695 = !{!687}
!696 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !699, file: !704, line: 13, type: !721, isLocal: true, isDefinition: true)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !701, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!701 = !{!702, !697}
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "mpu_config", scope: !699, file: !704, line: 37, type: !705, isLocal: false, isDefinition: true)
!704 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !676, line: 41, size: 64, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !706, file: !676, line: 43, baseType: !108, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !706, file: !676, line: 45, baseType: !710, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !676, line: 27, size: 96, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !712, file: !676, line: 29, baseType: !108, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !676, line: 31, baseType: !121, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !712, file: !676, line: 37, baseType: !717, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !639, line: 146, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !639, line: 141, size: 32, elements: !719)
!719 = !{!720}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !718, file: !639, line: 143, baseType: !108, size: 32)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 192, elements: !185)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !724, file: !728, line: 10, type: !729, isLocal: false, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !726, globals: !727, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!726 = !{!102, !106, !107}
!727 = !{!722}
!728 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !730, file: !406, line: 17, baseType: !121, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !730, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !736, file: !793, line: 603, type: !795, isLocal: true, isDefinition: true, align: 32)
!736 = distinct !DICompileUnit(language: DW_LANG_C99, file: !737, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !738, globals: !790, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!738 = !{!106, !107, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !742, line: 336, size: 160, elements: !743)
!742 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!743 = !{!744, !764, !768, !772, !785}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !741, file: !742, line: 365, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DISubroutineType(types: !747)
!747 = !{!107, !748, !763}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !495, line: 378, size: 192, elements: !751)
!751 = !{!752, !753, !754, !755, !761, !762}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !750, file: !495, line: 380, baseType: !121, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !750, file: !495, line: 382, baseType: !13, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !750, file: !495, line: 384, baseType: !13, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !750, file: !495, line: 386, baseType: !756, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !495, line: 351, size: 16, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !757, file: !495, line: 359, baseType: !190, size: 8)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !757, file: !495, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !750, file: !495, line: 388, baseType: !106, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !750, file: !495, line: 396, baseType: !508, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !741, file: !742, line: 366, baseType: !765, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !748, !191}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !741, file: !742, line: 374, baseType: !769, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DISubroutineType(types: !771)
!771 = !{!107, !748}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !741, file: !742, line: 377, baseType: !773, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DISubroutineType(types: !775)
!775 = !{!107, !748, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !742, line: 122, size: 64, elements: !779)
!779 = !{!780, !781, !782, !783, !784}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !778, file: !742, line: 123, baseType: !108, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !778, file: !742, line: 124, baseType: !190, size: 8, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !778, file: !742, line: 125, baseType: !190, size: 8, offset: 40)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !778, file: !742, line: 126, baseType: !190, size: 8, offset: 48)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !778, file: !742, line: 127, baseType: !190, size: 8, offset: 56)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !741, file: !742, line: 379, baseType: !786, size: 32, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DISubroutineType(types: !788)
!788 = !{!107, !748, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!790 = !{!734, !791}
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !736, file: !793, line: 38, type: !794, isLocal: true, isDefinition: true)
!793 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !486, line: 51, size: 64, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !796, file: !486, line: 60, baseType: !769, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !796, file: !486, line: 65, baseType: !748, size: 32, offset: 32)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "log_const_wdt_sam", scope: !802, file: !863, line: 28, type: !909, isLocal: false, isDefinition: true)
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !804, globals: !860, splitDebugInlining: false, nameTableKind: None)
!803 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!804 = !{!805, !108}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !808, line: 134, size: 128, elements: !809)
!808 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !{!810, !830, !835, !855}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !807, file: !808, line: 135, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !808, line: 113, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{!107, !815, !190}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !495, line: 378, size: 192, elements: !818)
!818 = !{!819, !820, !821, !822, !828, !829}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !495, line: 380, baseType: !121, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !817, file: !495, line: 382, baseType: !13, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !817, file: !495, line: 384, baseType: !13, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !817, file: !495, line: 386, baseType: !823, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !495, line: 351, size: 16, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !824, file: !495, line: 359, baseType: !190, size: 8)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !824, file: !495, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !817, file: !495, line: 388, baseType: !106, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !817, file: !495, line: 396, baseType: !508, size: 32, offset: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !807, file: !808, line: 136, baseType: !831, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !808, line: 119, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DISubroutineType(types: !834)
!834 = !{!107, !815}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !807, file: !808, line: 137, baseType: !836, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !808, line: 125, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DISubroutineType(types: !839)
!839 = !{!107, !815, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !808, line: 88, size: 128, elements: !843)
!843 = !{!844, !849, !854}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !842, file: !808, line: 90, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !808, line: 72, size: 64, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !845, file: !808, line: 74, baseType: !108, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !845, file: !808, line: 76, baseType: !108, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !842, file: !808, line: 92, baseType: !850, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !808, line: 85, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !815, !107}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !842, file: !808, line: 104, baseType: !190, size: 8, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !807, file: !808, line: 138, baseType: !856, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !808, line: 132, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{!107, !815, !107}
!860 = !{!800, !861, !865, !867, !874, !876, !890, !892, !900}
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !802, file: !863, line: 256, type: !864, isLocal: false, isDefinition: true, align: 16)
!863 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 80, elements: !462)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !802, file: !863, line: 256, type: !816, isLocal: false, isDefinition: true, align: 32)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !802, file: !863, line: 256, type: !869, isLocal: true, isDefinition: true, align: 32)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !486, line: 51, size: 64, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !870, file: !486, line: 60, baseType: !832, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !870, file: !486, line: 65, baseType: !815, size: 32, offset: 32)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !802, file: !863, line: 256, type: !824, isLocal: true, isDefinition: true, align: 8)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !802, file: !863, line: 234, type: !878, isLocal: true, isDefinition: true)
!878 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !863, line: 34, size: 32, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !879, file: !863, line: 35, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !884, line: 45, baseType: !885)
!884 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !884, line: 41, size: 96, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !885, file: !884, line: 42, baseType: !431, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !885, file: !884, line: 43, baseType: !431, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !885, file: !884, line: 44, baseType: !434, size: 32, offset: 64)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !802, file: !863, line: 227, type: !806, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !802, file: !863, line: 45, type: !894, isLocal: true, isDefinition: true)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !863, line: 38, size: 96, elements: !895)
!895 = !{!896, !897, !898, !899}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !894, file: !863, line: 39, baseType: !850, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !894, file: !863, line: 40, baseType: !108, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !894, file: !863, line: 41, baseType: !136, size: 8, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !894, file: !863, line: 42, baseType: !136, size: 8, offset: 72)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !902, file: !863, line: 240, type: !903, isLocal: true, isDefinition: true, align: 32)
!902 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !863, file: !863, line: 238, type: !337, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !802, retainedNodes: !256)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !903, file: !10, line: 55, baseType: !334, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !10, line: 57, baseType: !334, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !903, file: !10, line: 59, baseType: !106, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !903, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !910, file: !406, line: 17, baseType: !121, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !910, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !916, file: !921, line: 7, type: !922, isLocal: false, isDefinition: true, align: 16)
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !918, splitDebugInlining: false, nameTableKind: None)
!917 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!918 = !{!914, !919}
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !916, file: !921, line: 12, type: !922, isLocal: false, isDefinition: true, align: 16)
!921 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 48, elements: !380)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !925, file: !1013, line: 494, type: !1060, isLocal: true, isDefinition: true)
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !927, retainedTypes: !960, globals: !1010, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/hello_world")
!927 = !{!928, !935, !941, !948, !953}
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !742, line: 47, baseType: !32, size: 32, elements: !929)
!929 = !{!930, !931, !932, !933, !934}
!930 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!931 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!932 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!933 = !DIEnumerator(name: "UART_BREAK", value: 8)
!934 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !742, line: 84, baseType: !32, size: 32, elements: !936)
!936 = !{!937, !938, !939, !940}
!937 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!938 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!939 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!940 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!941 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !742, line: 92, baseType: !32, size: 32, elements: !942)
!942 = !{!943, !944, !945, !946, !947}
!943 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!944 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!945 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!946 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!947 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !742, line: 107, baseType: !32, size: 32, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!951 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!952 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !742, line: 75, baseType: !32, size: 32, elements: !954)
!954 = !{!955, !956, !957, !958, !959}
!955 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!956 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!957 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!958 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!959 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!960 = !{!961, !106, !191, !108}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !742, line: 336, size: 160, elements: !964)
!964 = !{!965, !984, !988, !992, !1005}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !963, file: !742, line: 365, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DISubroutineType(types: !968)
!968 = !{!107, !969, !763}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !495, line: 378, size: 192, elements: !972)
!972 = !{!973, !974, !975, !976, !982, !983}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !971, file: !495, line: 380, baseType: !121, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !971, file: !495, line: 382, baseType: !13, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !971, file: !495, line: 384, baseType: !13, size: 32, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !971, file: !495, line: 386, baseType: !977, size: 32, offset: 96)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !495, line: 351, size: 16, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !978, file: !495, line: 359, baseType: !190, size: 8)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !978, file: !495, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !971, file: !495, line: 388, baseType: !106, size: 32, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !971, file: !495, line: 396, baseType: !508, size: 32, offset: 160)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !963, file: !742, line: 366, baseType: !985, size: 32, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !969, !191}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !963, file: !742, line: 374, baseType: !989, size: 32, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DISubroutineType(types: !991)
!991 = !{!107, !969}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !963, file: !742, line: 377, baseType: !993, size: 32, offset: 96)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DISubroutineType(types: !995)
!995 = !{!107, !969, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !742, line: 122, size: 64, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !998, file: !742, line: 123, baseType: !108, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !998, file: !742, line: 124, baseType: !190, size: 8, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !998, file: !742, line: 125, baseType: !190, size: 8, offset: 40)
