; ModuleID = './build/irtx_send_pwd_data.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct._IOT_IRTX_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!57 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!58 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!59 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!60 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!61 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!62 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!63 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!64 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!65 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!66 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!67 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!68 = !{!27, !31, !69, !71, !20, !73, !17}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !18, line: 113, baseType: !72)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !20)
!75 = !{!40}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !78, file: !79, line: 51, type: !160, isLocal: false, isDefinition: true)
!78 = distinct !DICompileUnit(language: DW_LANG_C99, file: !79, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !80, retainedTypes: !128, globals: !159, splitDebugInlining: false, nameTableKind: None)
!79 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!80 = !{!81, !93, !112, !119}
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 163, baseType: !83, size: 32, elements: !84)
!82 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92}
!85 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!86 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!87 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!88 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!89 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!90 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!91 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!92 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 186, baseType: !7, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!95 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!96 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!97 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!98 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!99 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!100 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!101 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!102 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!103 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!104 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!105 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!106 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!107 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!108 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!109 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!110 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!111 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 176, baseType: !7, size: 32, elements: !113)
!113 = !{!114, !115, !116, !117, !118}
!114 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!115 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!116 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!117 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!118 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 99, baseType: !7, size: 32, elements: !121)
!120 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!121 = !{!122, !123, !124, !125, !126, !127}
!122 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!123 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!124 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!125 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!126 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!127 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!128 = !{!129, !158}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !131, line: 72, baseType: !132)
!131 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 56, size: 525312, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !148, !149, !153, !157}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !132, file: !131, line: 57, baseType: !30, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !132, file: !131, line: 58, baseType: !30, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !132, file: !131, line: 59, baseType: !30, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !132, file: !131, line: 60, baseType: !30, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !132, file: !131, line: 61, baseType: !30, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !132, file: !131, line: 62, baseType: !30, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !132, file: !131, line: 63, baseType: !30, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !132, file: !131, line: 64, baseType: !30, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !132, file: !131, line: 65, baseType: !30, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !132, file: !131, line: 66, baseType: !30, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !132, file: !131, line: 67, baseType: !145, size: 32, offset: 320)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 1)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !132, file: !131, line: 68, baseType: !30, size: 32, offset: 352)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !132, file: !131, line: 69, baseType: !150, size: 523904, offset: 384)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 523904, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 16372)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !132, file: !131, line: 70, baseType: !154, size: 512, offset: 524288)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !132, file: !131, line: 71, baseType: !154, size: 512, offset: 524800)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!159 = !{!76}
!160 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!161 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !164, file: !165, line: 53, type: !301, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !220, globals: !300, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!166 = !{!167, !175}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 152, baseType: !83, size: 32, elements: !169)
!168 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!169 = !{!170, !171, !172, !173, !174}
!170 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!171 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!172 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!173 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!174 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !176, line: 47, baseType: !83, size: 32, elements: !177)
!176 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!178 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!179 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!180 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!181 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!182 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!183 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!184 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!185 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!186 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!187 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!188 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!189 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!190 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!191 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!192 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!193 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!194 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!195 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!196 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!197 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!198 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!199 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!200 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!201 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!202 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!203 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!204 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!205 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!206 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!207 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!208 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!209 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!210 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!211 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!212 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!213 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!214 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!215 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!216 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!217 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!218 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!219 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!220 = !{!221, !158, !31, !223, !225, !261}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !176, line: 97, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !176, line: 95, baseType: !175)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !32, line: 44, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !34, line: 77, baseType: !83)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !227, line: 378, baseType: !228)
!227 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 363, size: 28704, elements: !229)
!229 = !{!230, !234, !238, !239, !240, !241, !242, !243, !244, !245, !249, !256, !260}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !228, file: !227, line: 365, baseType: !231, size: 256)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 256, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !228, file: !227, line: 366, baseType: !235, size: 768, offset: 256)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 768, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 24)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !228, file: !227, line: 367, baseType: !231, size: 256, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !228, file: !227, line: 368, baseType: !235, size: 768, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !228, file: !227, line: 369, baseType: !231, size: 256, offset: 2048)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !228, file: !227, line: 370, baseType: !235, size: 768, offset: 2304)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !228, file: !227, line: 371, baseType: !231, size: 256, offset: 3072)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !228, file: !227, line: 372, baseType: !235, size: 768, offset: 3328)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !228, file: !227, line: 373, baseType: !231, size: 256, offset: 4096)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !228, file: !227, line: 374, baseType: !246, size: 1792, offset: 4352)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1792, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 56)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !228, file: !227, line: 375, baseType: !250, size: 1920, offset: 6144)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 1920, elements: !254)
!251 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 43, baseType: !21)
!254 = !{!255}
!255 = !DISubrange(count: 240)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !228, file: !227, line: 376, baseType: !257, size: 20608, offset: 8064)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 20608, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 644)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !228, file: !227, line: 377, baseType: !30, size: 32, offset: 28672)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !227, line: 418, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 395, size: 1120, elements: !264)
!264 = !{!265, !267, !268, !269, !270, !271, !272, !276, !277, !278, !279, !280, !281, !282, !283, !287, !288, !289, !293, !297, !299}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !263, file: !227, line: 397, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !263, file: !227, line: 398, baseType: !30, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !263, file: !227, line: 399, baseType: !30, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !263, file: !227, line: 400, baseType: !30, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !263, file: !227, line: 401, baseType: !30, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !263, file: !227, line: 402, baseType: !30, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !263, file: !227, line: 403, baseType: !273, size: 96, offset: 192)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 96, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 12)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !263, file: !227, line: 404, baseType: !30, size: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !263, file: !227, line: 405, baseType: !30, size: 32, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !263, file: !227, line: 406, baseType: !30, size: 32, offset: 352)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !263, file: !227, line: 407, baseType: !30, size: 32, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !263, file: !227, line: 408, baseType: !30, size: 32, offset: 416)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !263, file: !227, line: 409, baseType: !30, size: 32, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !263, file: !227, line: 410, baseType: !30, size: 32, offset: 480)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !263, file: !227, line: 411, baseType: !284, size: 64, offset: 512)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 64, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 2)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !263, file: !227, line: 412, baseType: !266, size: 32, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !263, file: !227, line: 413, baseType: !266, size: 32, offset: 608)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !263, file: !227, line: 414, baseType: !290, size: 128, offset: 640)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 128, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 4)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !263, file: !227, line: 415, baseType: !294, size: 160, offset: 768)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 160, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 5)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !263, file: !227, line: 416, baseType: !298, size: 160, offset: 928)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !263, file: !227, line: 417, baseType: !30, size: 32, offset: 1088)
!300 = !{!162}
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 6144, elements: !310)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !165, line: 50, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 47, size: 64, elements: !304)
!304 = !{!305, !309}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !303, file: !165, line: 48, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !221}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !303, file: !165, line: 49, baseType: !31, size: 32, offset: 32)
!310 = !{!311}
!311 = !DISubrange(count: 96)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "g_callback_user_data", scope: !314, file: !315, line: 54, type: !158, isLocal: false, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !316, retainedTypes: !334, globals: !337, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_irtx.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!316 = !{!317, !322, !326, !175, !330}
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !318, line: 198, baseType: !83, size: 32, elements: !319)
!318 = !DIFile(filename: "../../../../../driver/chip/inc/hal_irtx.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!319 = !{!320, !321}
!320 = !DIEnumerator(name: "HAL_IRTX_STATUS_ERROR", value: -1)
!321 = !DIEnumerator(name: "HAL_IRTX_STATUS_OK", value: 0)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !318, line: 191, baseType: !7, size: 32, elements: !323)
!323 = !{!324, !325}
!324 = !DIEnumerator(name: "HAL_IRTX_REPEAT_ENABLE", value: 0)
!325 = !DIEnumerator(name: "HAL_IRTX_REPEAT_DISABLE", value: 1)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !318, line: 205, baseType: !83, size: 32, elements: !327)
!327 = !{!328, !329}
!328 = !DIEnumerator(name: "HAL_IRTX_EVENT_TRANSACTION_ERROR", value: -1)
!329 = !DIEnumerator(name: "HAL_IRTX_EVENT_TRANSACTION_SUCCESS", value: 0)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !318, line: 212, baseType: !7, size: 32, elements: !331)
!331 = !{!332, !333}
!332 = !DIEnumerator(name: "HAL_IRTX_IDLE", value: 0)
!333 = !DIEnumerator(name: "HAL_IRTX_BUSY", value: 1)
!334 = !{!335, !252, !222, !158}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !32, line: 36, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !34, line: 57, baseType: !72)
!337 = !{!312, !338, !340}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "irtx_status", scope: !314, file: !315, line: 55, type: !161, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "g_pulse_data_callback", scope: !314, file: !315, line: 53, type: !342, isLocal: true, isDefinition: true)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_irtx_pulse_data_callback_t", file: !318, line: 237, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346, !158}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_irtx_event_t", file: !318, line: 208, baseType: !326)
!347 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !350, file: !351, line: 77, type: !420, isLocal: true, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !403, globals: !405, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!352 = !{!353, !361, !367, !383, !389, !393, !45, !51, !398}
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 345, baseType: !83, size: 32, elements: !355)
!354 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!355 = !{!356, !357, !358, !359, !360}
!356 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!357 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!358 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!359 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!360 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !362, line: 109, baseType: !7, size: 32, elements: !363)
!362 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!363 = !{!364, !365, !366}
!364 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!365 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!366 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 302, baseType: !7, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!369 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!370 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!371 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!372 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!373 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!374 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!375 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!376 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!377 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!378 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!379 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!380 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!381 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!382 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 321, baseType: !7, size: 32, elements: !384)
!384 = !{!385, !386, !387, !388}
!385 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!386 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!387 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!388 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 330, baseType: !7, size: 32, elements: !390)
!390 = !{!391, !392}
!391 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!392 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 337, baseType: !7, size: 32, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!396 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!397 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!398 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 355, baseType: !83, size: 32, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!401 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!402 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!403 = !{!7, !158, !21, !404, !252}
!404 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!405 = !{!348, !406}
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "func_tbl", scope: !408, file: !351, line: 536, type: !418, isLocal: true, isDefinition: true)
!408 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !351, file: !351, line: 534, type: !409, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !416)
!409 = !DISubroutineType(types: !410)
!410 = !{!411, !415}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !52, line: 197, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DISubroutineType(types: !414)
!414 = !{null}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !362, line: 113, baseType: !361)
!416 = !{!417}
!417 = !DILocalVariable(name: "uart_port", arg: 1, scope: !408, file: !351, line: 534, type: !415)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 64, elements: !285)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 1024, elements: !285)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !351, line: 75, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 68, size: 512, elements: !423)
!423 = !{!424, !425, !437, !438, !449, !450}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !422, file: !351, line: 69, baseType: !161, size: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !422, file: !351, line: 70, baseType: !426, size: 128, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !354, line: 378, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 373, size: 128, elements: !428)
!428 = !{!429, !431, !433, !435}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !427, file: !354, line: 374, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !354, line: 317, baseType: !367)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !427, file: !354, line: 375, baseType: !432, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !354, line: 326, baseType: !383)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !427, file: !354, line: 376, baseType: !434, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !354, line: 333, baseType: !389)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !427, file: !354, line: 377, baseType: !436, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !354, line: 341, baseType: !393)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !422, file: !351, line: 71, baseType: !161, size: 8, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !422, file: !351, line: 72, baseType: !439, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !351, line: 66, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 63, size: 64, elements: !441)
!441 = !{!442, !448}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !440, file: !351, line: 64, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !354, line: 410, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !447, !158}
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !354, line: 359, baseType: !398)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !440, file: !351, line: 65, baseType: !158, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !422, file: !351, line: 73, baseType: !161, size: 8, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !422, file: !351, line: 74, baseType: !451, size: 224, offset: 288)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !354, line: 390, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 382, size: 224, elements: !453)
!453 = !{!454, !456, !457, !458, !459, !460, !461}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !452, file: !354, line: 383, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !452, file: !354, line: 384, baseType: !31, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !452, file: !354, line: 385, baseType: !31, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !452, file: !354, line: 386, baseType: !455, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !452, file: !354, line: 387, baseType: !31, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !452, file: !354, line: 388, baseType: !31, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !452, file: !354, line: 389, baseType: !31, size: 32, offset: 192)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !464, file: !465, line: 59, type: !31, isLocal: false, isDefinition: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C99, file: !465, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !466, globals: !519, splitDebugInlining: false, nameTableKind: None)
!465 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/irtx_send_pwd_data/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!466 = !{!467, !475, !500}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !227, line: 656, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 650, size: 128, elements: !470)
!470 = !{!471, !472, !473, !474}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !469, file: !227, line: 652, baseType: !30, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !469, file: !227, line: 653, baseType: !30, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !469, file: !227, line: 654, baseType: !30, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !469, file: !227, line: 655, baseType: !266, size: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !227, line: 418, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 395, size: 1120, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !477, file: !227, line: 397, baseType: !266, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !477, file: !227, line: 398, baseType: !30, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !477, file: !227, line: 399, baseType: !30, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !477, file: !227, line: 400, baseType: !30, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !477, file: !227, line: 401, baseType: !30, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !477, file: !227, line: 402, baseType: !30, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !477, file: !227, line: 403, baseType: !273, size: 96, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !477, file: !227, line: 404, baseType: !30, size: 32, offset: 288)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !477, file: !227, line: 405, baseType: !30, size: 32, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !477, file: !227, line: 406, baseType: !30, size: 32, offset: 352)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !477, file: !227, line: 407, baseType: !30, size: 32, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !477, file: !227, line: 408, baseType: !30, size: 32, offset: 416)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !477, file: !227, line: 409, baseType: !30, size: 32, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !477, file: !227, line: 410, baseType: !30, size: 32, offset: 480)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !477, file: !227, line: 411, baseType: !284, size: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !477, file: !227, line: 412, baseType: !266, size: 32, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !477, file: !227, line: 413, baseType: !266, size: 32, offset: 608)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !477, file: !227, line: 414, baseType: !290, size: 128, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !477, file: !227, line: 415, baseType: !294, size: 160, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !477, file: !227, line: 416, baseType: !298, size: 160, offset: 928)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !477, file: !227, line: 417, baseType: !30, size: 32, offset: 1088)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !131, line: 72, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 56, size: 525312, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !502, file: !131, line: 57, baseType: !30, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !502, file: !131, line: 58, baseType: !30, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !502, file: !131, line: 59, baseType: !30, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !502, file: !131, line: 60, baseType: !30, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !502, file: !131, line: 61, baseType: !30, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !502, file: !131, line: 62, baseType: !30, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !502, file: !131, line: 63, baseType: !30, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !502, file: !131, line: 64, baseType: !30, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !502, file: !131, line: 65, baseType: !30, size: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !502, file: !131, line: 66, baseType: !30, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !502, file: !131, line: 67, baseType: !145, size: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !502, file: !131, line: 68, baseType: !30, size: 32, offset: 352)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !502, file: !131, line: 69, baseType: !150, size: 523904, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !502, file: !131, line: 70, baseType: !154, size: 512, offset: 524288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !502, file: !131, line: 71, baseType: !154, size: 512, offset: 524800)
!519 = !{!462, !520}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !464, file: !465, line: 61, type: !30, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "heap_end", scope: !524, file: !525, line: 66, type: !530, isLocal: true, isDefinition: true)
!524 = distinct !DISubprogram(name: "_sbrk_r", scope: !525, file: !525, line: 63, type: !526, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !722, retainedNodes: !726)
!525 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !531, !721}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !529, line: 123, baseType: !530)
!529 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !533, line: 377, size: 1920, elements: !534)
!533 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!534 = !{!535, !536, !610, !611, !612, !613, !614, !615, !616, !619, !640, !644, !645, !646, !647, !657, !670, !671, !676, !695, !696, !703, !704, !720}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !532, file: !533, line: 381, baseType: !83, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !532, file: !533, line: 386, baseType: !537, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !533, line: 292, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !533, line: 186, size: 832, elements: !540)
!540 = !{!541, !543, !544, !545, !547, !548, !553, !554, !555, !556, !560, !566, !573, !577, !578, !579, !580, !584, !586, !587, !588, !590, !596, !609}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !539, file: !533, line: 187, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !539, file: !533, line: 188, baseType: !83, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !539, file: !533, line: 189, baseType: !83, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !539, file: !533, line: 190, baseType: !546, size: 16, offset: 96)
!546 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !539, file: !533, line: 191, baseType: !546, size: 16, offset: 112)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !539, file: !533, line: 192, baseType: !549, size: 64, offset: 128)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !533, line: 122, size: 64, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !549, file: !533, line: 123, baseType: !542, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !549, file: !533, line: 124, baseType: !83, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !539, file: !533, line: 193, baseType: !83, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !539, file: !533, line: 196, baseType: !531, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !539, file: !533, line: 200, baseType: !158, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !539, file: !533, line: 202, baseType: !557, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DISubroutineType(types: !559)
!559 = !{!83, !531, !158, !530, !83}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !539, file: !533, line: 204, baseType: !561, size: 32, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DISubroutineType(types: !563)
!563 = !{!83, !531, !158, !564, !83}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !539, file: !533, line: 207, baseType: !567, size: 32, offset: 352)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{!570, !531, !158, !570, !83}
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !571, line: 116, baseType: !572)
!571 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!572 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !539, file: !533, line: 208, baseType: !574, size: 32, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DISubroutineType(types: !576)
!576 = !{!83, !531, !158}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !539, file: !533, line: 211, baseType: !549, size: 64, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !539, file: !533, line: 212, baseType: !542, size: 32, offset: 480)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !539, file: !533, line: 213, baseType: !83, size: 32, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !539, file: !533, line: 216, baseType: !581, size: 24, offset: 544)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 24, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 3)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !539, file: !533, line: 217, baseType: !585, size: 8, offset: 568)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !146)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !539, file: !533, line: 220, baseType: !549, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !539, file: !533, line: 223, baseType: !83, size: 32, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !539, file: !533, line: 224, baseType: !589, size: 32, offset: 672)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !571, line: 46, baseType: !572)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !539, file: !533, line: 231, baseType: !591, size: 32, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !533, line: 35, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !593, line: 34, baseType: !594)
!593 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !593, line: 33, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !539, file: !533, line: 233, baseType: !597, size: 64, offset: 736)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !571, line: 170, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 162, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !598, file: !571, line: 164, baseType: !83, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !598, file: !571, line: 169, baseType: !602, size: 32, offset: 32)
!602 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !598, file: !571, line: 165, size: 32, elements: !603)
!603 = !{!604, !607}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !602, file: !571, line: 167, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !606, line: 116, baseType: !83)
!606 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !602, file: !571, line: 168, baseType: !608, size: 32)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32, elements: !291)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !539, file: !533, line: 234, baseType: !83, size: 32, offset: 800)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !532, file: !533, line: 386, baseType: !537, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !532, file: !533, line: 386, baseType: !537, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !532, file: !533, line: 388, baseType: !83, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !532, file: !533, line: 390, baseType: !530, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !532, file: !533, line: 392, baseType: !83, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !532, file: !533, line: 394, baseType: !83, size: 32, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !532, file: !533, line: 395, baseType: !617, size: 32, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !533, line: 45, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !532, file: !533, line: 397, baseType: !620, size: 32, offset: 288)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !533, line: 349, size: 128, elements: !622)
!622 = !{!623, !636, !637, !638}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !621, file: !533, line: 352, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !533, line: 52, size: 192, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !625, file: !533, line: 54, baseType: !624, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !625, file: !533, line: 55, baseType: !83, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !625, file: !533, line: 55, baseType: !83, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !625, file: !533, line: 55, baseType: !83, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !625, file: !533, line: 55, baseType: !83, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !625, file: !533, line: 56, baseType: !633, size: 32, offset: 160)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 32, elements: !146)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !533, line: 22, baseType: !635)
!635 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !621, file: !533, line: 353, baseType: !83, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !621, file: !533, line: 354, baseType: !624, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !621, file: !533, line: 355, baseType: !639, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !532, file: !533, line: 399, baseType: !641, size: 32, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !531}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !532, file: !533, line: 401, baseType: !83, size: 32, offset: 352)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !532, file: !533, line: 404, baseType: !83, size: 32, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !532, file: !533, line: 405, baseType: !530, size: 32, offset: 416)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !532, file: !533, line: 407, baseType: !648, size: 32, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !533, line: 324, size: 192, elements: !650)
!650 = !{!651, !653, !654, !655}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !649, file: !533, line: 325, baseType: !652, size: 48)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 48, elements: !582)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !649, file: !533, line: 326, baseType: !652, size: 48, offset: 48)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !649, file: !533, line: 327, baseType: !72, size: 16, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !649, file: !533, line: 330, baseType: !656, size: 64, offset: 128)
!656 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !532, file: !533, line: 408, baseType: !658, size: 32, offset: 480)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !533, line: 60, size: 288, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !659, file: !533, line: 62, baseType: !83, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !659, file: !533, line: 63, baseType: !83, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !659, file: !533, line: 64, baseType: !83, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !659, file: !533, line: 65, baseType: !83, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !659, file: !533, line: 66, baseType: !83, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !659, file: !533, line: 67, baseType: !83, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !659, file: !533, line: 68, baseType: !83, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !659, file: !533, line: 69, baseType: !83, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !659, file: !533, line: 70, baseType: !83, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !532, file: !533, line: 409, baseType: !530, size: 32, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !532, file: !533, line: 412, baseType: !672, size: 32, offset: 544)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !83}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !532, file: !533, line: 416, baseType: !677, size: 32, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !533, line: 90, size: 1120, elements: !679)
!679 = !{!680, !681, !682, !686}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !678, file: !533, line: 91, baseType: !677, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !678, file: !533, line: 92, baseType: !83, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !678, file: !533, line: 93, baseType: !683, size: 1024, offset: 64)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 1024, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !678, file: !533, line: 94, baseType: !687, size: 32, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !533, line: 79, size: 2112, elements: !689)
!689 = !{!690, !692, !693, !694}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !688, file: !533, line: 80, baseType: !691, size: 1024)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 1024, elements: !684)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !688, file: !533, line: 81, baseType: !691, size: 1024, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !688, file: !533, line: 83, baseType: !634, size: 32, offset: 2048)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !688, file: !533, line: 86, baseType: !634, size: 32, offset: 2080)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !532, file: !533, line: 417, baseType: !678, size: 1120, offset: 608)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !532, file: !533, line: 420, baseType: !697, size: 96, offset: 1728)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !533, line: 296, size: 96, elements: !698)
!698 = !{!699, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !697, file: !533, line: 298, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !697, file: !533, line: 299, baseType: !83, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !697, file: !533, line: 300, baseType: !537, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !532, file: !533, line: 421, baseType: !537, size: 32, offset: 1824)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !532, file: !533, line: 422, baseType: !705, size: 32, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !533, line: 359, size: 640, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !714, !715, !716, !717, !718, !719}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !706, file: !533, line: 362, baseType: !530, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !706, file: !533, line: 363, baseType: !597, size: 64, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !706, file: !533, line: 364, baseType: !597, size: 64, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !706, file: !533, line: 365, baseType: !597, size: 64, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !706, file: !533, line: 366, baseType: !713, size: 64, offset: 224)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 64, elements: !232)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !706, file: !533, line: 367, baseType: !83, size: 32, offset: 288)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !706, file: !533, line: 368, baseType: !597, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !706, file: !533, line: 369, baseType: !597, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !706, file: !533, line: 370, baseType: !597, size: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !706, file: !533, line: 371, baseType: !597, size: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !706, file: !533, line: 372, baseType: !597, size: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !532, file: !533, line: 423, baseType: !530, size: 32, offset: 1888)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !606, line: 46, baseType: !7)
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !724, globals: !725, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!724 = !{!530, !528}
!725 = !{!522}
!726 = !{!727, !728, !729, !730}
!727 = !DILocalVariable(name: "r", arg: 1, scope: !524, file: !525, line: 63, type: !531)
!728 = !DILocalVariable(name: "nbytes", arg: 2, scope: !524, file: !525, line: 63, type: !721)
!729 = !DILocalVariable(name: "prev_heap_end", scope: !524, file: !525, line: 67, type: !530)
!730 = !DILocalVariable(name: "stack", scope: !524, file: !525, line: 68, type: !530)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !733, file: !738, line: 4, type: !744, isLocal: false, isDefinition: true)
!733 = distinct !DICompileUnit(language: DW_LANG_C99, file: !734, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !735, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!735 = !{!731, !736, !742}
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !733, file: !738, line: 5, type: !739, isLocal: false, isDefinition: true)
!738 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 88, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 11)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !733, file: !738, line: 6, type: !739, isLocal: false, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 248, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 31)
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !749, retainedTypes: !755, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_irtx.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!749 = !{!750, !5}
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_HAL_RET_T", file: !751, line: 365, baseType: !21, size: 8, elements: !752)
!751 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687_cm4_hw_memmap.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!752 = !{!753, !754}
!753 = !DIEnumerator(name: "HAL_RET_SUCCESS", value: 0)
!754 = !DIEnumerator(name: "HAL_RET_FAIL", value: 1)
!755 = !{!756, !17, !16, !790, !27}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "P_IOT_IRTX_TypeDef", file: !751, line: 455, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_IRTX_TypeDef", file: !751, line: 424, size: 960, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "IRTXCFG", scope: !758, file: !751, line: 425, baseType: !36, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "IRTXD0", scope: !758, file: !751, line: 426, baseType: !36, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "IRTXD1", scope: !758, file: !751, line: 427, baseType: !36, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "IRTXD2", scope: !758, file: !751, line: 428, baseType: !36, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_L0H", scope: !758, file: !751, line: 429, baseType: !36, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_L0L", scope: !758, file: !751, line: 430, baseType: !36, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_L1H", scope: !758, file: !751, line: 431, baseType: !36, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_L1L", scope: !758, file: !751, line: 432, baseType: !36, size: 32, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "IRTXSYNCH", scope: !758, file: !751, line: 433, baseType: !36, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "IRTXSYNCL", scope: !758, file: !751, line: 434, baseType: !36, size: 32, offset: 288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "IRTXMT", scope: !758, file: !751, line: 435, baseType: !36, size: 32, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_INT_CLR", scope: !758, file: !751, line: 436, baseType: !36, size: 32, offset: 352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_BP", scope: !758, file: !751, line: 437, baseType: !36, size: 32, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW0", scope: !758, file: !751, line: 438, baseType: !36, size: 32, offset: 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW1", scope: !758, file: !751, line: 439, baseType: !36, size: 32, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW2", scope: !758, file: !751, line: 440, baseType: !36, size: 32, offset: 480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW3", scope: !758, file: !751, line: 441, baseType: !36, size: 32, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW4", scope: !758, file: !751, line: 442, baseType: !36, size: 32, offset: 544)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW5", scope: !758, file: !751, line: 443, baseType: !36, size: 32, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW6", scope: !758, file: !751, line: 444, baseType: !36, size: 32, offset: 608)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW7", scope: !758, file: !751, line: 445, baseType: !36, size: 32, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW8", scope: !758, file: !751, line: 446, baseType: !36, size: 32, offset: 672)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW9", scope: !758, file: !751, line: 447, baseType: !36, size: 32, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW10", scope: !758, file: !751, line: 448, baseType: !36, size: 32, offset: 736)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW11", scope: !758, file: !751, line: 449, baseType: !36, size: 32, offset: 768)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW12", scope: !758, file: !751, line: 450, baseType: !36, size: 32, offset: 800)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW13", scope: !758, file: !751, line: 451, baseType: !36, size: 32, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW14", scope: !758, file: !751, line: 452, baseType: !36, size: 32, offset: 864)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW15", scope: !758, file: !751, line: 453, baseType: !36, size: 32, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "IRTX_SWM_PW16", scope: !758, file: !751, line: 454, baseType: !36, size: 32, offset: 928)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "PUINT32", file: !18, line: 86, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!792 = distinct !DICompileUnit(language: DW_LANG_C99, file: !793, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !794, retainedTypes: !800, splitDebugInlining: false, nameTableKind: None)
!793 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!794 = !{!795}
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !796, line: 1209, baseType: !7, size: 32, elements: !797)
!796 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!797 = !{!798, !799}
!798 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!799 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!800 = !{!801, !803}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !18, line: 116, baseType: !7)
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !806, retainedTypes: !884, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!806 = !{!807}
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 150, baseType: !7, size: 32, elements: !809)
!808 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!810 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!811 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!812 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!813 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!814 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!815 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!816 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!817 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!818 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!819 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!820 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!821 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!822 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!823 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!824 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!825 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!826 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!827 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!828 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!829 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!830 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!831 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!832 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!833 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!834 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!835 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!836 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!837 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!838 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!839 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!840 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!841 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!842 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!843 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!844 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!845 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!846 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!847 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!848 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!849 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!850 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!851 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!852 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!853 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!854 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!855 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!856 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!857 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!858 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!859 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!860 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!861 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!862 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!863 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!864 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!865 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!866 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!867 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!868 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!869 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!870 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!871 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!872 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!873 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!874 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!875 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!876 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!877 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!878 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!879 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!880 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!881 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!882 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!883 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!884 = !{!801, !17}
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !887, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!887 = !{!888, !913}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !227, line: 418, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 395, size: 1120, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !890, file: !227, line: 397, baseType: !266, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !890, file: !227, line: 398, baseType: !30, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !890, file: !227, line: 399, baseType: !30, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !890, file: !227, line: 400, baseType: !30, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !890, file: !227, line: 401, baseType: !30, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !890, file: !227, line: 402, baseType: !30, size: 32, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !890, file: !227, line: 403, baseType: !273, size: 96, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !890, file: !227, line: 404, baseType: !30, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !890, file: !227, line: 405, baseType: !30, size: 32, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !890, file: !227, line: 406, baseType: !30, size: 32, offset: 352)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !890, file: !227, line: 407, baseType: !30, size: 32, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !890, file: !227, line: 408, baseType: !30, size: 32, offset: 416)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !890, file: !227, line: 409, baseType: !30, size: 32, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !890, file: !227, line: 410, baseType: !30, size: 32, offset: 480)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !890, file: !227, line: 411, baseType: !284, size: 64, offset: 512)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !890, file: !227, line: 412, baseType: !266, size: 32, offset: 576)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !890, file: !227, line: 413, baseType: !266, size: 32, offset: 608)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !890, file: !227, line: 414, baseType: !290, size: 128, offset: 640)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !890, file: !227, line: 415, baseType: !294, size: 160, offset: 768)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !890, file: !227, line: 416, baseType: !298, size: 160, offset: 928)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !890, file: !227, line: 417, baseType: !30, size: 32, offset: 1088)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !227, line: 378, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 363, size: 28704, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !915, file: !227, line: 365, baseType: !231, size: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !915, file: !227, line: 366, baseType: !235, size: 768, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !915, file: !227, line: 367, baseType: !231, size: 256, offset: 1024)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !915, file: !227, line: 368, baseType: !235, size: 768, offset: 1280)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !915, file: !227, line: 369, baseType: !231, size: 256, offset: 2048)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !915, file: !227, line: 370, baseType: !235, size: 768, offset: 2304)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !915, file: !227, line: 371, baseType: !231, size: 256, offset: 3072)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !915, file: !227, line: 372, baseType: !235, size: 768, offset: 3328)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !915, file: !227, line: 373, baseType: !231, size: 256, offset: 4096)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !915, file: !227, line: 374, baseType: !246, size: 1792, offset: 4352)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !915, file: !227, line: 375, baseType: !250, size: 1920, offset: 6144)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !915, file: !227, line: 376, baseType: !257, size: 20608, offset: 8064)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !915, file: !227, line: 377, baseType: !30, size: 32, offset: 28672)
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !932, splitDebugInlining: false, nameTableKind: None)
!931 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!932 = !{!933, !807}
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !934, line: 55, baseType: !7, size: 32, elements: !935)
!934 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!936 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!937 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!938 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!939 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!940 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!941 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!942 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!943 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!944 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!945 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!946 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!947 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!948 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!949 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!950 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!951 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!952 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!953 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!954 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!955 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!956 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!957 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!958 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!959 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!960 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!961 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!962 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!963 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!965 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !968, retainedTypes: !1032, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!968 = !{!969, !976, !933, !1007, !1013, !1017, !1021, !1027}
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 233, baseType: !83, size: 32, elements: !971)
!970 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!971 = !{!972, !973, !974, !975}
!972 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!973 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!974 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!975 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!976 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !362, line: 249, baseType: !7, size: 32, elements: !977)
!977 = !{!978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!978 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!979 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!980 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!981 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!982 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!983 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!984 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!985 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!986 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!987 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!988 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!989 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!990 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!991 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!992 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!993 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!994 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!995 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!996 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!997 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!998 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!999 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!1000 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!1001 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!1002 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!1003 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!1004 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!1005 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!1006 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 224, baseType: !83, size: 32, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012}
!1009 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!1010 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!1011 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!1012 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!1013 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 217, baseType: !7, size: 32, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!1016 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!1017 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 210, baseType: !7, size: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!1020 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!1021 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 242, baseType: !7, size: 32, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026}
!1023 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!1024 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!1025 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!1026 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!1027 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1028, line: 57, baseType: !7, size: 32, elements: !1029)
!1028 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!1029 = !{!1030, !1031}
!1030 = !DIEnumerator(name: "eDirection_IN", value: 0)
!1031 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!1032 = !{!1033, !158, !1034, !252, !1035, !1036}
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !934, line: 87, baseType: !933)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !970, line: 220, baseType: !1013)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !970, line: 247, baseType: !1021)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !1028, line: 60, baseType: !1027)
!1037 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1038, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1039, retainedTypes: !1040, splitDebugInlining: false, nameTableKind: None)
!1038 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/irtx_send_pwd_data/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/irtx_send_pwd_data/GCC")
!1039 = !{!361, !367, !383, !389, !393, !976, !326}
!1040 = !{!342, !158}
!1041 = !{!"Ubuntu clang version 14.0.6"}
!1042 = !{i32 7, !"Dwarf Version", i32 2}
!1043 = !{i32 2, !"Debug Info Version", i32 3}
!1044 = !{i32 1, !"wchar_size", i32 4}
!1045 = !{i32 1, !"min_enum_size", i32 4}
!1046 = !{i32 1, !"branch-target-enforcement", i32 0}
!1047 = !{i32 1, !"sign-return-address", i32 0}
!1048 = !{i32 1, !"sign-return-address-all", i32 0}
!1049 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!1050 = !{i32 7, !"frame-pointer", i32 2}
!1051 = distinct !DISubprogram(name: "halIrTxRound", scope: !748, file: !748, line: 101, type: !1052, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !747, retainedNodes: !1054)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!20, !17, !17, !17}
!1054 = !{!1055, !1056, !1057}
!1055 = !DILocalVariable(name: "x", arg: 1, scope: !1051, file: !748, line: 101, type: !17)
!1056 = !DILocalVariable(name: "y", arg: 2, scope: !1051, file: !748, line: 101, type: !17)
!1057 = !DILocalVariable(name: "z", arg: 3, scope: !1051, file: !748, line: 101, type: !17)
!1058 = !DILocation(line: 0, scope: !1051)
!1059 = !DILocation(line: 110, column: 18, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1051, file: !748, line: 110, column: 9)
!1061 = !DILocation(line: 110, column: 13, scope: !1060)
!1062 = !DILocation(line: 110, column: 24, scope: !1060)
!1063 = !DILocation(line: 110, column: 29, scope: !1060)
!1064 = !DILocation(line: 115, column: 1, scope: !1051)
!1065 = distinct !DISubprogram(name: "halIrTxInit", scope: !748, file: !748, line: 131, type: !1066, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !747, retainedNodes: !1069)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1068, !20, !20, !20}
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_HAL_RET_T", file: !751, line: 368, baseType: !750)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075}
!1070 = !DILocalVariable(name: "ucOutputSel", arg: 1, scope: !1065, file: !748, line: 131, type: !20)
!1071 = !DILocalVariable(name: "ucRegOrder", arg: 2, scope: !1065, file: !748, line: 131, type: !20)
!1072 = !DILocalVariable(name: "ucBitOrder", arg: 3, scope: !1065, file: !748, line: 131, type: !20)
!1073 = !DILocalVariable(name: "ret", scope: !1065, file: !748, line: 133, type: !1068)
!1074 = !DILocalVariable(name: "pIRTXTypeDef", scope: !1065, file: !748, line: 134, type: !756)
!1075 = !DILocalVariable(name: "u4Val", scope: !1065, file: !748, line: 135, type: !17)
!1076 = !DILocation(line: 0, scope: !1065)
!1077 = !DILocation(line: 137, column: 27, scope: !1065)
!1078 = !DILocation(line: 142, column: 11, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1065, file: !748, line: 142, column: 9)
!1080 = !DILocation(line: 142, column: 9, scope: !1065)
!1081 = !DILocation(line: 151, column: 11, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1065, file: !748, line: 151, column: 9)
!1083 = !DILocation(line: 151, column: 9, scope: !1065)
!1084 = !DILocation(line: 160, column: 11, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1065, file: !748, line: 160, column: 9)
!1086 = !DILocation(line: 160, column: 9, scope: !1065)
!1087 = !DILocation(line: 166, column: 27, scope: !1065)
!1088 = !DILocation(line: 168, column: 5, scope: !1065)
!1089 = distinct !DISubprogram(name: "halIrTxConfig", scope: !748, file: !748, line: 190, type: !1090, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !747, retainedNodes: !1093)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!1068, !16, !20, !20, !17, !17, !17, !17, !1092, !20}
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !18, line: 60, baseType: !72)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112}
!1094 = !DILocalVariable(name: "eIrProtocol", arg: 1, scope: !1089, file: !748, line: 190, type: !16)
!1095 = !DILocalVariable(name: "ucDataInvert", arg: 2, scope: !1089, file: !748, line: 190, type: !20)
!1096 = !DILocalVariable(name: "ucOutputInvert", arg: 3, scope: !1089, file: !748, line: 190, type: !20)
!1097 = !DILocalVariable(name: "u4L0High", arg: 4, scope: !1089, file: !748, line: 191, type: !17)
!1098 = !DILocalVariable(name: "u4L0Low", arg: 5, scope: !1089, file: !748, line: 191, type: !17)
!1099 = !DILocalVariable(name: "u4L1High", arg: 6, scope: !1089, file: !748, line: 191, type: !17)
!1100 = !DILocalVariable(name: "u4L1Low", arg: 7, scope: !1089, file: !748, line: 191, type: !17)
!1101 = !DILocalVariable(name: "u2Freq", arg: 8, scope: !1089, file: !748, line: 192, type: !1092)
!1102 = !DILocalVariable(name: "ucDutyCycle", arg: 9, scope: !1089, file: !748, line: 192, type: !20)
!1103 = !DILocalVariable(name: "ret", scope: !1089, file: !748, line: 194, type: !1068)
!1104 = !DILocalVariable(name: "pIRTXTypeDef", scope: !1089, file: !748, line: 195, type: !756)
!1105 = !DILocalVariable(name: "u4Val", scope: !1089, file: !748, line: 196, type: !17)
!1106 = !DILocalVariable(name: "u2CarrierPeriod", scope: !1089, file: !748, line: 197, type: !1092)
!1107 = !DILocalVariable(name: "u2DutyTime", scope: !1089, file: !748, line: 198, type: !1092)
!1108 = !DILocalVariable(name: "u4Period", scope: !1089, file: !748, line: 199, type: !17)
!1109 = !DILocalVariable(name: "u4Logic0HighPeriod", scope: !1089, file: !748, line: 200, type: !17)
!1110 = !DILocalVariable(name: "u4Logic0LowPeriod", scope: !1089, file: !748, line: 201, type: !17)
!1111 = !DILocalVariable(name: "u4Logic1HighPeriod", scope: !1089, file: !748, line: 202, type: !17)
!1112 = !DILocalVariable(name: "u4Logic1LowPeriod", scope: !1089, file: !748, line: 203, type: !17)
