; ModuleID = 'build/96b_carbon_nrf51/gdbstub/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread.16 = type { %struct._thread_base.9, %struct._callee_saved.10, i8*, %union.anon.5, i32, %struct.k_heap.14*, %struct._thread_arch.15 }
%struct._thread_base.9 = type { %union.anon.5, %union.anon.5*, i8, i8, %union.anon.2.7, i32, i8*, %struct._timeout.8 }
%union.anon.2.7 = type { i16 }
%struct._timeout.8 = type { %struct._dnode.4, void (%struct._timeout.8*)*, i64 }
%struct._dnode.4 = type { %union.anon.0.2, %union.anon.0.2 }
%union.anon.0.2 = type { %struct._dnode.4* }
%struct._callee_saved.10 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon.5 = type { %struct._dnode.4 }
%struct.k_heap.14 = type { %struct.sys_heap.12, %union.anon.5, %struct.k_spinlock.13 }
%struct.sys_heap.12 = type { %struct.z_heap.11*, i8*, i32 }
%struct.z_heap.11 = type opaque
%struct.k_spinlock.13 = type {}
%struct._thread_arch.15 = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread.16*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct._snode = type { %struct._snode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread", scope: !27, file: !107, line: 36, type: !113, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/debug/gdbstub/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !258, !262, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "_k_thread_data_thread", scope: !27, file: !107, line: 36, type: !108, isLocal: false, isDefinition: true, align: 32)
!107 = !DIFile(filename: "zephyr/samples/subsys/debug/gdbstub/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !109, line: 620, size: 384, elements: !110)
!109 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!110 = !{!111, !229, !238, !239, !244, !245, !246, !247, !248, !249, !251, !255}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !108, file: !109, line: 621, baseType: !112, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !114, line: 245, size: 896, elements: !115)
!114 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !188, !201, !202, !203, !204, !224}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !113, file: !114, line: 247, baseType: !117, size: 384)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !114, line: 57, size: 384, elements: !118)
!118 = !{!119, !147, !155, !158, !159, !172, !174, !175}
!119 = !DIDerivedType(tag: DW_TAG_member, scope: !117, file: !114, line: 60, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !117, file: !114, line: 60, size: 64, elements: !121)
!121 = !{!122, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !120, file: !114, line: 61, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !124, line: 49, baseType: !125)
!124 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !124, line: 37, size: 64, elements: !126)
!126 = !{!127, !133}
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !124, line: 38, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !124, line: 38, size: 32, elements: !129)
!129 = !{!130, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !128, file: !124, line: 39, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !128, file: !124, line: 40, baseType: !131, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !124, line: 42, baseType: !134, size: 32, offset: 32)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !124, line: 42, size: 32, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !134, file: !124, line: 43, baseType: !131, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !124, line: 44, baseType: !131, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !120, file: !114, line: 62, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !140, line: 49, size: 64, elements: !141)
!140 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !139, file: !140, line: 50, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !145)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!145 = !{!146}
!146 = !DISubrange(count: 2)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !117, file: !114, line: 68, baseType: !148, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !150, line: 233, baseType: !151)
!150 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 231, size: 64, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !151, file: !150, line: 232, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !124, line: 48, baseType: !125)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !117, file: !114, line: 71, baseType: !156, size: 8, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !157)
!157 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !117, file: !114, line: 74, baseType: !156, size: 8, offset: 104)
!159 = !DIDerivedType(tag: DW_TAG_member, scope: !117, file: !114, line: 90, baseType: !160, size: 16, offset: 112)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !117, file: !114, line: 90, size: 16, elements: !161)
!161 = !{!162, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !114, line: 91, baseType: !163, size: 16)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !160, file: !114, line: 91, size: 16, elements: !164)
!164 = !{!165, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !163, file: !114, line: 96, baseType: !166, size: 8)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !167)
!167 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !163, file: !114, line: 97, baseType: !156, size: 8, offset: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !160, file: !114, line: 100, baseType: !170, size: 16)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !171)
!171 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !117, file: !114, line: 107, baseType: !173, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !117, file: !114, line: 127, baseType: !102, size: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !117, file: !114, line: 131, baseType: !176, size: 192, offset: 192)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !150, line: 244, size: 192, elements: !177)
!177 = !{!178, !179, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !176, file: !150, line: 245, baseType: !123, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !176, file: !150, line: 246, baseType: !180, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !150, line: 242, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !176, file: !150, line: 249, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !187)
!187 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !113, file: !114, line: 250, baseType: !189, size: 288, offset: 384)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !190, line: 25, size: 288, elements: !191)
!190 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !189, file: !190, line: 26, baseType: !173, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !189, file: !190, line: 27, baseType: !173, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !189, file: !190, line: 28, baseType: !173, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !189, file: !190, line: 29, baseType: !173, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !189, file: !190, line: 30, baseType: !173, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !189, file: !190, line: 31, baseType: !173, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !189, file: !190, line: 32, baseType: !173, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !189, file: !190, line: 33, baseType: !173, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !189, file: !190, line: 34, baseType: !173, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !113, file: !114, line: 253, baseType: !102, size: 32, offset: 672)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !113, file: !114, line: 256, baseType: !149, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !113, file: !114, line: 294, baseType: !103, size: 32, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !113, file: !114, line: 325, baseType: !205, size: 32, offset: 800)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !109, line: 5073, size: 160, elements: !207)
!207 = !{!208, !219, !220}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !206, file: !109, line: 5074, baseType: !209, size: 96)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !210, line: 56, size: 96, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !215, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !209, file: !210, line: 57, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !210, line: 57, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !209, file: !210, line: 58, baseType: !102, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !209, file: !210, line: 59, baseType: !217, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !218, line: 214, baseType: !32)
!218 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !206, file: !109, line: 5075, baseType: !149, size: 64, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !206, file: !109, line: 5076, baseType: !221, offset: 160)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !222, line: 43, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !113, file: !114, line: 343, baseType: !225, size: 64, offset: 832)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !190, line: 60, size: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !225, file: !190, line: 63, baseType: !173, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !225, file: !190, line: 66, baseType: !173, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !108, file: !109, line: 622, baseType: !230, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !232, line: 44, baseType: !233)
!232 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !234, line: 47, size: 8, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !234, line: 48, baseType: !237, size: 8)
!237 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !108, file: !109, line: 623, baseType: !32, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !108, file: !109, line: 624, baseType: !240, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !232, line: 46, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !102, !102, !102}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !108, file: !109, line: 625, baseType: !102, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !108, file: !109, line: 626, baseType: !102, size: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !108, file: !109, line: 627, baseType: !102, size: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !108, file: !109, line: 628, baseType: !103, size: 32, offset: 224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !108, file: !109, line: 629, baseType: !173, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !108, file: !109, line: 630, baseType: !250, size: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !108, file: !109, line: 631, baseType: !252, size: 32, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DISubroutineType(types: !254)
!254 = !{null}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !108, file: !109, line: 632, baseType: !256, size: 32, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "thread", scope: !27, file: !107, line: 36, type: !260, isLocal: false, isDefinition: true)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !114, line: 347, baseType: !112)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread", scope: !27, file: !107, line: 36, type: !264, isLocal: false, isDefinition: true, align: 64)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 4096, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 512)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "_char_out", scope: !269, file: !272, line: 54, type: !273, isLocal: false, isDefinition: true)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !271, splitDebugInlining: false, nameTableKind: None)
!270 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!271 = !{!267}
!272 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DISubroutineType(types: !275)
!275 = !{!103, !103}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !278, file: !317, line: 27, type: !342, isLocal: true, isDefinition: true)
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !280, retainedTypes: !292, globals: !314, splitDebugInlining: false, nameTableKind: None)
!279 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!280 = !{!281, !30}
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !282, line: 27, baseType: !32, size: 32, elements: !283)
!282 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291}
!284 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!285 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!286 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!287 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!288 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!289 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!290 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!291 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!292 = !{!102, !293, !103, !24, !295, !311, !173, !312}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !294, line: 46, baseType: !186)
!294 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !297, line: 54, size: 96, elements: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = !{!299, !306, !310}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !296, file: !297, line: 55, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !301, line: 33, baseType: !302)
!301 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !301, line: 29, size: 32, elements: !303)
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !301, line: 30, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !296, file: !297, line: 60, baseType: !307, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !281}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !296, file: !297, line: 65, baseType: !307, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !313)
!313 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!314 = !{!276, !315, !319, !321, !332, !334}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !278, file: !317, line: 44, type: !318, isLocal: true, isDefinition: true)
!317 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !222, line: 43, elements: !223)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !278, file: !317, line: 49, type: !318, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !278, file: !317, line: 36, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 128, elements: !330)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !282, line: 114, size: 128, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !324, file: !282, line: 115, baseType: !281, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !324, file: !282, line: 141, baseType: !156, size: 8, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !324, file: !282, line: 149, baseType: !173, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !324, file: !282, line: 156, baseType: !173, size: 32, offset: 96)
!330 = !{!331}
!331 = !DISubrange(count: 1)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !278, file: !317, line: 40, type: !323, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !278, file: !317, line: 28, type: !336, isLocal: true, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !301, line: 40, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !301, line: 35, size: 64, elements: !338)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !337, file: !301, line: 36, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !337, file: !301, line: 37, baseType: !340, size: 32, offset: 32)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 32, elements: !330)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !344, line: 22, baseType: !345)
!344 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !348, file: !376, line: 50, type: !250, isLocal: true, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !280, retainedTypes: !350, globals: !373, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!350 = !{!351, !293, !217, !103, !102, !173, !312, !353, !311, !250, !364}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !352)
!352 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !355, line: 45, size: 64, elements: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !363}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !354, file: !355, line: 46, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !301, line: 33, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !301, line: 29, size: 32, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !359, file: !301, line: 30, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !354, file: !355, line: 48, baseType: !173, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !355, line: 38, size: 64, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !365, file: !355, line: 39, baseType: !358, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !365, file: !355, line: 41, baseType: !369, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !355, line: 35, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !250}
!373 = !{!374, !378, !386, !346, !388, !398}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "latency_lock", scope: !348, file: !376, line: 44, type: !377, isLocal: true, isDefinition: true)
!376 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !222, line: 43, elements: !223)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !348, file: !376, line: 46, type: !380, isLocal: true, isDefinition: true)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !301, line: 40, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !301, line: 35, size: 64, elements: !382)
!382 = !{!383, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !381, file: !301, line: 36, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !381, file: !301, line: 37, baseType: !384, size: 32, offset: 32)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "latency_subs", scope: !348, file: !376, line: 52, type: !380, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !348, file: !376, line: 39, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, elements: !396)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 35, size: 96, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !391, file: !376, line: 36, baseType: !281, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !391, file: !376, line: 37, baseType: !156, size: 8, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !391, file: !376, line: 38, baseType: !343, size: 32, offset: 64)
!396 = !{!397}
!397 = !DISubrange(count: 0)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !348, file: !376, line: 48, type: !250, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "cpus_states", scope: !402, file: !409, line: 50, type: !422, isLocal: true, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !404, retainedTypes: !405, globals: !406, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!404 = !{!281}
!405 = !{!217, !103}
!406 = !{!400, !407, !418}
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !402, file: !409, line: 47, type: !410, isLocal: true, isDefinition: true)
!409 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, elements: !396)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !282, line: 114, size: 128, elements: !413)
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !412, file: !282, line: 115, baseType: !281, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !412, file: !282, line: 141, baseType: !156, size: 8, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !412, file: !282, line: 149, baseType: !173, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !412, file: !282, line: 156, baseType: !173, size: 32, offset: 96)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !402, file: !409, line: 55, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 8, elements: !330)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 32, elements: !330)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !426, file: !433, line: 21, type: !273, isLocal: true, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !428, globals: !432, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!428 = !{!429, !103, !102}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !431, line: 22, baseType: !103)
!431 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!432 = !{!424}
!433 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !436, file: !532, line: 71, type: !533, isLocal: true, isDefinition: true, align: 32)
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !438, globals: !527, splitDebugInlining: false, nameTableKind: None)
!437 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!438 = !{!439, !156, !102, !103, !505, !506, !521, !173}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !441, line: 247, baseType: !442)
!441 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 216, size: 20576, elements: !443)
!443 = !{!444, !450, !451, !452, !456, !457, !461, !462, !463, !467, !468, !472, !473, !477, !478, !482, !483, !485, !486, !487, !488, !492, !493, !494, !495, !499, !500, !504}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !442, file: !441, line: 217, baseType: !445, size: 960)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 960, elements: !448)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !173)
!448 = !{!449}
!449 = !DISubrange(count: 30)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !442, file: !441, line: 218, baseType: !447, size: 32, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !442, file: !441, line: 219, baseType: !447, size: 32, offset: 992)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !442, file: !441, line: 220, baseType: !453, size: 1088, offset: 1024)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 1088, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 34)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !442, file: !441, line: 221, baseType: !447, size: 32, offset: 2112)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !442, file: !441, line: 222, baseType: !458, size: 4032, offset: 2144)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 4032, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 126)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !442, file: !441, line: 223, baseType: !447, size: 32, offset: 6176)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !442, file: !441, line: 224, baseType: !447, size: 32, offset: 6208)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !442, file: !441, line: 225, baseType: !464, size: 1952, offset: 6240)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 1952, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 61)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !442, file: !441, line: 226, baseType: !447, size: 32, offset: 8192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !442, file: !441, line: 227, baseType: !469, size: 288, offset: 8224)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 288, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 9)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !442, file: !441, line: 228, baseType: !446, size: 32, offset: 8512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !442, file: !441, line: 229, baseType: !474, size: 1696, offset: 8544)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 1696, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 53)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !442, file: !441, line: 230, baseType: !447, size: 32, offset: 10240)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !442, file: !441, line: 231, baseType: !479, size: 96, offset: 10272)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 96, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 3)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !442, file: !441, line: 232, baseType: !447, size: 32, offset: 10368)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !442, file: !441, line: 233, baseType: !484, size: 64, offset: 10400)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 64, elements: !145)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !442, file: !441, line: 234, baseType: !447, size: 32, offset: 10464)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !442, file: !441, line: 236, baseType: !446, size: 32, offset: 10496)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !442, file: !441, line: 237, baseType: !447, size: 32, offset: 10528)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !442, file: !441, line: 238, baseType: !489, size: 224, offset: 10560)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 224, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 7)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !442, file: !441, line: 239, baseType: !447, size: 32, offset: 10784)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !442, file: !441, line: 241, baseType: !479, size: 96, offset: 10816)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !442, file: !441, line: 242, baseType: !447, size: 32, offset: 10912)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !442, file: !441, line: 243, baseType: !496, size: 256, offset: 10944)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 256, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !442, file: !441, line: 244, baseType: !447, size: 32, offset: 11200)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !442, file: !441, line: 245, baseType: !501, size: 9312, offset: 11232)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 9312, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 291)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !442, file: !441, line: 246, baseType: !447, size: 32, offset: 20544)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !508, line: 352, baseType: !509)
!508 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 341, size: 320, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !520}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !509, file: !508, line: 343, baseType: !446, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !509, file: !508, line: 344, baseType: !447, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !509, file: !508, line: 345, baseType: !173, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !509, file: !508, line: 346, baseType: !447, size: 32, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !509, file: !508, line: 347, baseType: !447, size: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !509, file: !508, line: 348, baseType: !447, size: 32, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !509, file: !508, line: 349, baseType: !173, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !509, file: !508, line: 350, baseType: !519, size: 64, offset: 224)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 64, elements: !145)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !509, file: !508, line: 351, baseType: !447, size: 32, offset: 288)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !523, file: !522, line: 167, baseType: !526)
!522 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !522, file: !522, line: 134, type: !524, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !436, retainedNodes: !223)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !173}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!527 = !{!434, !528}
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !523, file: !522, line: 161, type: !530, isLocal: true, isDefinition: true, align: 128)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 48, elements: !480)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!532 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !535, line: 51, size: 64, elements: !536)
!535 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!536 = !{!537, !544}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !534, file: !535, line: 60, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DISubroutineType(types: !540)
!540 = !{!103, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !535, line: 48, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !534, file: !535, line: 65, baseType: !541, size: 32, offset: 32)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !547, file: !746, line: 733, type: !812, isLocal: false, isDefinition: true, align: 32)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !549, retainedTypes: !664, globals: !742, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!549 = !{!550, !556, !30, !561, !566, !571, !577, !583, !592, !596, !629, !636, !655}
!550 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !551, line: 23, baseType: !32, size: 32, elements: !552)
!551 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = !{!553, !554, !555}
!553 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!554 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!555 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !551, line: 48, baseType: !32, size: 32, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!559 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!560 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 167, baseType: !32, size: 32, elements: !563)
!562 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!563 = !{!564, !565}
!564 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!565 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 107, baseType: !32, size: 32, elements: !567)
!567 = !{!568, !569, !570}
!568 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!569 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!570 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!571 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 208, baseType: !32, size: 32, elements: !572)
!572 = !{!573, !574, !575, !576}
!573 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!574 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!575 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!576 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 261, baseType: !32, size: 32, elements: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!580 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!581 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!582 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 237, baseType: !32, size: 32, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591}
!585 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!586 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!587 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!588 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!589 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!590 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!591 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 152, baseType: !32, size: 32, elements: !593)
!593 = !{!594, !595}
!594 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!595 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !441, line: 71, baseType: !103, size: 32, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!598 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!599 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!600 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!601 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!602 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!603 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!604 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!605 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!606 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!607 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!608 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!609 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!610 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!611 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!612 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!613 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!614 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!615 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!616 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!617 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!618 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!619 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!620 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!621 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!622 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!623 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!624 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!625 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!626 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!627 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!628 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !630, line: 44, baseType: !32, size: 32, elements: !631)
!630 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!631 = !{!632, !633, !634, !635}
!632 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!633 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!634 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!635 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !637, line: 54, baseType: !32, size: 32, elements: !638)
!637 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!639 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!640 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!641 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!642 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!643 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!644 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!645 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!646 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!647 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!648 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!649 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!650 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!651 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!652 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!653 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!654 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !656, line: 53, baseType: !32, size: 32, elements: !657)
!656 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = !{!658, !659, !660, !661, !662, !663}
!658 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!659 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!660 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!661 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!662 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!663 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!664 = !{!550, !102, !103, !665, !713, !714, !715, !716, !293, !173, !312, !717, !505, !718, !250, !719, !741, !217}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !441, line: 291, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 260, size: 10912, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !680, !681, !682, !683, !684, !685, !689, !690, !691, !695, !696, !697, !698, !699, !700, !701, !705, !706, !707, !708, !712}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !667, file: !441, line: 261, baseType: !447, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !667, file: !441, line: 262, baseType: !447, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !667, file: !441, line: 263, baseType: !447, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !667, file: !441, line: 264, baseType: !447, size: 32, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !667, file: !441, line: 265, baseType: !447, size: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !667, file: !441, line: 266, baseType: !447, size: 32, offset: 160)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !667, file: !441, line: 267, baseType: !447, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !667, file: !441, line: 268, baseType: !677, size: 1824, offset: 224)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 1824, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 57)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !667, file: !441, line: 269, baseType: !447, size: 32, offset: 2048)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !667, file: !441, line: 270, baseType: !447, size: 32, offset: 2080)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !667, file: !441, line: 271, baseType: !446, size: 32, offset: 2112)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !667, file: !441, line: 272, baseType: !447, size: 32, offset: 2144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !667, file: !441, line: 273, baseType: !447, size: 32, offset: 2176)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !667, file: !441, line: 274, baseType: !686, size: 3968, offset: 2208)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 3968, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 124)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !667, file: !441, line: 275, baseType: !447, size: 32, offset: 6176)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !667, file: !441, line: 276, baseType: !447, size: 32, offset: 6208)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !667, file: !441, line: 277, baseType: !692, size: 2016, offset: 6240)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 2016, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 63)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !667, file: !441, line: 278, baseType: !446, size: 32, offset: 8256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !667, file: !441, line: 279, baseType: !446, size: 32, offset: 8288)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !667, file: !441, line: 280, baseType: !446, size: 32, offset: 8320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !667, file: !441, line: 281, baseType: !446, size: 32, offset: 8352)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !667, file: !441, line: 282, baseType: !446, size: 32, offset: 8384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !667, file: !441, line: 283, baseType: !446, size: 32, offset: 8416)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !667, file: !441, line: 285, baseType: !702, size: 1984, offset: 8448)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 1984, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 62)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !667, file: !441, line: 286, baseType: !447, size: 32, offset: 10432)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !667, file: !441, line: 287, baseType: !489, size: 224, offset: 10464)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !667, file: !441, line: 288, baseType: !447, size: 32, offset: 10688)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !667, file: !441, line: 289, baseType: !709, size: 160, offset: 10720)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 160, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 5)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !667, file: !441, line: 290, baseType: !447, size: 32, offset: 10880)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !562, line: 146, baseType: !566)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !562, line: 164, baseType: !592)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!717 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !508, line: 326, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 314, size: 6400, elements: !722)
!722 = !{!723, !725, !729, !730, !731, !732, !733, !734, !735, !739}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !721, file: !508, line: 316, baseType: !724, size: 32)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 32, elements: !330)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !721, file: !508, line: 317, baseType: !726, size: 992, offset: 32)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 992, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 31)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !721, file: !508, line: 318, baseType: !724, size: 32, offset: 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !721, file: !508, line: 319, baseType: !726, size: 992, offset: 1056)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !721, file: !508, line: 320, baseType: !724, size: 32, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !721, file: !508, line: 321, baseType: !726, size: 992, offset: 2080)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !721, file: !508, line: 322, baseType: !724, size: 32, offset: 3072)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !721, file: !508, line: 323, baseType: !726, size: 992, offset: 3104)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !721, file: !508, line: 324, baseType: !736, size: 2048, offset: 4096)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 2048, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !721, file: !508, line: 325, baseType: !740, size: 256, offset: 6144)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 256, elements: !497)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !630, line: 56, baseType: !102)
!742 = !{!743, !749, !796, !545, !802, !828, !830, !879, !881, !886, !889, !901, !939, !942}
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "on", scope: !745, file: !746, line: 549, type: !343, isLocal: true, isDefinition: true)
!745 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !746, file: !746, line: 547, type: !747, scopeLine: 548, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !547, retainedNodes: !223)
!746 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!747 = !DISubroutineType(types: !748)
!748 = !{null, !556}
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "cli", scope: !745, file: !746, line: 550, type: !751, isLocal: true, isDefinition: true)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !752, line: 273, size: 128, elements: !753)
!752 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!753 = !{!754, !760}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !751, file: !752, line: 280, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !301, line: 33, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !301, line: 29, size: 32, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !301, line: 30, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !751, file: !752, line: 283, baseType: !761, size: 96, offset: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !762, line: 138, size: 96, elements: !763)
!762 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!763 = !{!764, !793, !794}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !761, file: !762, line: 149, baseType: !765, size: 32)
!765 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !762, line: 139, size: 32, elements: !766)
!766 = !{!767, !788}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !765, file: !762, line: 145, baseType: !768, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !109, line: 5397, size: 128, elements: !770)
!770 = !{!771, !786, !787}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !769, file: !109, line: 5399, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !124, line: 48, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !124, line: 37, size: 64, elements: !774)
!774 = !{!775, !781}
!775 = !DIDerivedType(tag: DW_TAG_member, scope: !773, file: !124, line: 38, baseType: !776, size: 32)
!776 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !773, file: !124, line: 38, size: 32, elements: !777)
!777 = !{!778, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !776, file: !124, line: 39, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !124, line: 40, baseType: !779, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, scope: !773, file: !124, line: 42, baseType: !782, size: 32, offset: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !773, file: !124, line: 42, size: 32, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !782, file: !124, line: 43, baseType: !779, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !782, file: !124, line: 44, baseType: !779, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !769, file: !109, line: 5405, baseType: !32, size: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !769, file: !109, line: 5408, baseType: !103, size: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !765, file: !762, line: 148, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !762, line: 98, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DISubroutineType(types: !792)
!792 = !{null, null}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !761, file: !762, line: 165, baseType: !447, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !761, file: !762, line: 174, baseType: !795, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !547, file: !746, line: 733, type: !798, isLocal: false, isDefinition: true, align: 16)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 80, elements: !710)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !801, line: 43, baseType: !351)
!801 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !547, file: !746, line: 733, type: !804, isLocal: true, isDefinition: true, align: 32)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !535, line: 51, size: 64, elements: !806)
!806 = !{!807, !827}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !805, file: !535, line: 60, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!103, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !801, line: 378, size: 192, elements: !814)
!814 = !{!815, !816, !817, !818, !824, !825}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !813, file: !801, line: 380, baseType: !256, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !813, file: !801, line: 382, baseType: !13, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !813, file: !801, line: 384, baseType: !13, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !813, file: !801, line: 386, baseType: !819, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !801, line: 351, size: 16, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !820, file: !801, line: 359, baseType: !156, size: 8)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !820, file: !801, line: 364, baseType: !717, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !813, file: !801, line: 388, baseType: !102, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !813, file: !801, line: 396, baseType: !826, size: 32, offset: 160)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !805, file: !535, line: 65, baseType: !811, size: 32, offset: 32)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !547, file: !746, line: 79, type: !343, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "data", scope: !547, file: !746, line: 702, type: !832, isLocal: true, isDefinition: true)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !746, line: 69, size: 640, elements: !833)
!833 = !{!834, !868}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !832, file: !746, line: 70, baseType: !835, size: 448)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 448, elements: !145)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !752, line: 154, size: 224, elements: !837)
!837 = !{!838, !845, !846, !863, !865, !866, !867}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !836, file: !752, line: 158, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !301, line: 40, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !301, line: 35, size: 64, elements: !841)
!841 = !{!842, !844}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !840, file: !301, line: 36, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !840, file: !301, line: 37, baseType: !843, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !836, file: !752, line: 163, baseType: !839, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !836, file: !752, line: 166, baseType: !847, size: 32, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !752, line: 133, size: 96, elements: !850)
!850 = !{!851, !861, !862}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !849, file: !752, line: 135, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !752, line: 129, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !856, !857}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !752, line: 101, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !856, !103}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !849, file: !752, line: 138, baseType: !852, size: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !849, file: !752, line: 143, baseType: !852, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !836, file: !752, line: 169, baseType: !864, offset: 160)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !222, line: 43, elements: !223)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !836, file: !752, line: 172, baseType: !103, size: 32, offset: 160)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !836, file: !752, line: 175, baseType: !170, size: 16, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !836, file: !752, line: 178, baseType: !170, size: 16, offset: 208)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !832, file: !746, line: 71, baseType: !869, size: 192, offset: 448)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 192, elements: !145)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !746, line: 52, size: 96, elements: !871)
!871 = !{!872, !877, !878}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !870, file: !746, line: 53, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !630, line: 72, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !811, !741, !102}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !870, file: !746, line: 54, baseType: !102, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !870, file: !746, line: 55, baseType: !173, size: 32, offset: 64)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !547, file: !746, line: 733, type: !820, isLocal: true, isDefinition: true, align: 8)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "d", scope: !883, file: !746, line: 476, type: !884, isLocal: true, isDefinition: true)
!883 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !746, file: !746, line: 474, type: !747, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !547, retainedNodes: !223)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !562, line: 177, baseType: !561)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "target_type", scope: !883, file: !746, line: 477, type: !888, isLocal: true, isDefinition: true)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "config", scope: !547, file: !746, line: 704, type: !891, isLocal: true, isDefinition: true)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !746, line: 74, size: 128, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !892, file: !746, line: 76, baseType: !895, size: 128)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 128, elements: !145)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !746, line: 61, size: 64, elements: !897)
!897 = !{!898, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !896, file: !746, line: 62, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !746, line: 58, baseType: !252)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !896, file: !746, line: 63, baseType: !899, size: 32, offset: 32)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !547, file: !746, line: 695, type: !903, isLocal: true, isDefinition: true)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !630, line: 100, size: 224, elements: !905)
!905 = !{!906, !911, !912, !917, !923, !928, !934}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !904, file: !630, line: 101, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !630, line: 76, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{!103, !811, !741}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !904, file: !630, line: 102, baseType: !907, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !904, file: !630, line: 103, baseType: !913, size: 32, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !630, line: 83, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(types: !916)
!916 = !{!103, !811, !741, !873, !102}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !904, file: !630, line: 104, baseType: !918, size: 32, offset: 96)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !630, line: 79, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DISubroutineType(types: !921)
!921 = !{!103, !811, !741, !922}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !904, file: !630, line: 105, baseType: !924, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !630, line: 88, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DISubroutineType(types: !927)
!927 = !{!629, !811, !741}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !904, file: !630, line: 106, baseType: !929, size: 32, offset: 160)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !630, line: 92, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DISubroutineType(types: !932)
!932 = !{!103, !811, !741, !933}
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !630, line: 64, baseType: !102)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !904, file: !630, line: 107, baseType: !935, size: 32, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !630, line: 96, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!103, !811, !741, !102}
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "transitions", scope: !941, file: !746, line: 655, type: !848, isLocal: true, isDefinition: true)
!941 = distinct !DISubprogram(name: "clk_init", scope: !746, file: !746, line: 651, type: !809, scopeLine: 652, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !547, retainedNodes: !223)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !941, file: !746, line: 660, type: !944, isLocal: true, isDefinition: true, align: 32)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !945)
!945 = !{!946, !947, !948, !949}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !944, file: !10, line: 55, baseType: !250, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !944, file: !10, line: 57, baseType: !250, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !944, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !944, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !952, file: !957, line: 7, type: !958, isLocal: false, isDefinition: true, align: 16)
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !954, splitDebugInlining: false, nameTableKind: None)
!953 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!954 = !{!950, !955, !959}
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !952, file: !957, line: 12, type: !958, isLocal: false, isDefinition: true, align: 16)
!957 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 48, elements: !480)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !952, file: !957, line: 17, type: !958, isLocal: false, isDefinition: true, align: 16)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !963, file: !1020, line: 603, type: !1022, isLocal: true, isDefinition: true, align: 32)
!963 = distinct !DICompileUnit(language: DW_LANG_C99, file: !964, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !965, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!964 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!965 = !{!102, !103, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !969, line: 336, size: 160, elements: !970)
!969 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!970 = !{!971, !991, !995, !999, !1012}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !968, file: !969, line: 365, baseType: !972, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{!103, !975, !990}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !801, line: 378, size: 192, elements: !978)
!978 = !{!979, !980, !981, !982, !988, !989}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !801, line: 380, baseType: !256, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !977, file: !801, line: 382, baseType: !13, size: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !977, file: !801, line: 384, baseType: !13, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !977, file: !801, line: 386, baseType: !983, size: 32, offset: 96)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !801, line: 351, size: 16, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !984, file: !801, line: 359, baseType: !156, size: 8)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !984, file: !801, line: 364, baseType: !717, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !977, file: !801, line: 388, baseType: !102, size: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !977, file: !801, line: 396, baseType: !826, size: 32, offset: 160)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !968, file: !969, line: 366, baseType: !992, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{null, !975, !157}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !968, file: !969, line: 374, baseType: !996, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DISubroutineType(types: !998)
!998 = !{!103, !975}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !968, file: !969, line: 377, baseType: !1000, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!103, !975, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !969, line: 122, size: 64, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1005, file: !969, line: 123, baseType: !173, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1005, file: !969, line: 124, baseType: !156, size: 8, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1005, file: !969, line: 125, baseType: !156, size: 8, offset: 40)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1005, file: !969, line: 126, baseType: !156, size: 8, offset: 48)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1005, file: !969, line: 127, baseType: !156, size: 8, offset: 56)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !968, file: !969, line: 379, baseType: !1013, size: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!103, !975, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1017 = !{!961, !1018}
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !963, file: !1020, line: 38, type: !1021, isLocal: true, isDefinition: true)
!1020 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !535, line: 51, size: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1023, file: !535, line: 60, baseType: !996, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1023, file: !535, line: 65, baseType: !975, size: 32, offset: 32)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "gpio_nrfx_p0_cfg", scope: !1029, file: !1185, line: 424, type: !1223, isLocal: true, isDefinition: true)
!1029 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1030, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1031, retainedTypes: !1077, globals: !1182, splitDebugInlining: false, nameTableKind: None)
!1030 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_nrfx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/gdbstub")
!1031 = !{!1032, !1038, !636, !1043, !1053, !1064, !1068, !1073}
!1032 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !1033, line: 506, baseType: !32, size: 32, elements: !1034)
!1033 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1034 = !{!1035, !1036, !1037}
!1035 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!1036 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!1037 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!1038 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !1033, line: 512, baseType: !32, size: 32, elements: !1039)
!1039 = !{!1040, !1041, !1042}
!1040 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!1041 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!1042 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!1043 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1044, line: 56, baseType: !32, size: 32, elements: !1045)
!1044 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_gpiote.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051, !1052}
!1046 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_NONE", value: 0)
!1047 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_LOTOHI", value: 1)
!1048 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_HITOLO", value: 2)
!1049 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_TOGGLE", value: 3)
!1050 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_LOW", value: 4)
!1051 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_HIGH", value: 5)
!1052 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_MAX", value: 6)
!1053 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1054, line: 110, baseType: !32, size: 32, elements: !1055)
!1054 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1056 = !DIEnumerator(name: "NRF_GPIO_PIN_S0S1", value: 0)
!1057 = !DIEnumerator(name: "NRF_GPIO_PIN_H0S1", value: 1)
!1058 = !DIEnumerator(name: "NRF_GPIO_PIN_S0H1", value: 2)
!1059 = !DIEnumerator(name: "NRF_GPIO_PIN_H0H1", value: 3)
!1060 = !DIEnumerator(name: "NRF_GPIO_PIN_D0S1", value: 4)
!1061 = !DIEnumerator(name: "NRF_GPIO_PIN_D0H1", value: 5)
!1062 = !DIEnumerator(name: "NRF_GPIO_PIN_S0D1", value: 6)
!1063 = !DIEnumerator(name: "NRF_GPIO_PIN_H0D1", value: 7)
!1064 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1054, line: 92, baseType: !32, size: 32, elements: !1065)
!1065 = !{!1066, !1067}
