; ModuleID = 'build/96b_carbon_nrf51/tmp112/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !154, line: 27, type: !184, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !125, globals: !151, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!113 = !{!114, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !{!102, !126, !103, !24, !130, !146, !148, !149}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !129)
!129 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !132, line: 54, size: 96, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !141, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !131, file: !132, line: 55, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 30, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !131, file: !132, line: 60, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !114}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !131, file: !132, line: 65, baseType: !142, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !150)
!150 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!151 = !{!109, !152, !159, !161, !174, !176}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !154, line: 44, type: !155, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !155, file: !156, line: 52, baseType: !22, size: 32)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !154, line: 49, type: !155, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !154, line: 36, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !172)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !165)
!165 = !{!166, !167, !170, !171}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !115, line: 115, baseType: !114, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !164, file: !115, line: 141, baseType: !168, size: 8, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !169)
!169 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !164, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !164, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !154, line: 40, type: !163, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !154, line: 28, type: !178, isLocal: true, isDefinition: true)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !180)
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !179, file: !136, line: 36, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !136, line: 37, baseType: !182, size: 32, offset: 32)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32, elements: !172)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !186, line: 22, baseType: !187)
!186 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!188 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!189 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !192, file: !223, line: 50, type: !210, isLocal: true, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !194, globals: !220, splitDebugInlining: false, nameTableKind: None)
!193 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!194 = !{!195, !126, !197, !103, !102, !148, !149, !199, !146, !210, !211}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !196)
!196 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !198, line: 214, baseType: !32)
!198 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !201, line: 45, size: 64, elements: !202)
!201 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !209}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !200, file: !201, line: 46, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !136, line: 30, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !200, file: !201, line: 48, baseType: !148, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !201, line: 38, size: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !212, file: !201, line: 39, baseType: !204, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !212, file: !201, line: 41, baseType: !216, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !201, line: 35, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !210}
!220 = !{!221, !227, !235, !190, !237, !247}
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "latency_lock", scope: !192, file: !223, line: 44, type: !224, isLocal: true, isDefinition: true)
!223 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !224, file: !156, line: 52, baseType: !22, size: 32)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !192, file: !223, line: 46, type: !229, isLocal: true, isDefinition: true)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !231)
!231 = !{!232, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !230, file: !136, line: 36, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !230, file: !136, line: 37, baseType: !233, size: 32, offset: 32)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "latency_subs", scope: !192, file: !223, line: 52, type: !229, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !192, file: !223, line: 39, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, elements: !245)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 35, size: 96, elements: !241)
!241 = !{!242, !243, !244}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !240, file: !223, line: 36, baseType: !114, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !240, file: !223, line: 37, baseType: !168, size: 8, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !240, file: !223, line: 38, baseType: !185, size: 32, offset: 64)
!245 = !{!246}
!246 = !DISubrange(count: 0)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !192, file: !223, line: 48, type: !210, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !251, file: !258, line: 47, type: !272, isLocal: true, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !253, retainedTypes: !254, globals: !255, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!253 = !{!114}
!254 = !{!197, !103}
!255 = !{!256, !249, !268}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "cpus_states", scope: !251, file: !258, line: 50, type: !259, isLocal: true, isDefinition: true)
!258 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !172)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !115, line: 115, baseType: !114, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !262, file: !115, line: 141, baseType: !168, size: 8, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !262, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !262, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !251, file: !258, line: 55, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 8, elements: !172)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, elements: !245)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !275, file: !282, line: 21, type: !106, isLocal: true, isDefinition: true)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !277, globals: !281, splitDebugInlining: false, nameTableKind: None)
!276 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!277 = !{!278, !103, !102}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !280, line: 22, baseType: !103)
!280 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!281 = !{!273}
!282 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !285, file: !390, line: 71, type: !391, isLocal: true, isDefinition: true, align: 32)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !287, globals: !383, splitDebugInlining: false, nameTableKind: None)
!286 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!287 = !{!288, !168, !102, !103, !356, !357, !372, !148}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !290, line: 247, baseType: !291)
!290 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 216, size: 20576, elements: !292)
!292 = !{!293, !299, !300, !301, !305, !306, !310, !311, !312, !316, !317, !321, !322, !326, !327, !331, !332, !336, !337, !338, !339, !343, !344, !345, !346, !350, !351, !355}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !291, file: !290, line: 217, baseType: !294, size: 960)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 960, elements: !297)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!297 = !{!298}
!298 = !DISubrange(count: 30)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !291, file: !290, line: 218, baseType: !296, size: 32, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !291, file: !290, line: 219, baseType: !296, size: 32, offset: 992)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !291, file: !290, line: 220, baseType: !302, size: 1088, offset: 1024)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1088, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 34)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !291, file: !290, line: 221, baseType: !296, size: 32, offset: 2112)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !291, file: !290, line: 222, baseType: !307, size: 4032, offset: 2144)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 4032, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 126)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !291, file: !290, line: 223, baseType: !296, size: 32, offset: 6176)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !291, file: !290, line: 224, baseType: !296, size: 32, offset: 6208)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !291, file: !290, line: 225, baseType: !313, size: 1952, offset: 6240)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1952, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 61)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !291, file: !290, line: 226, baseType: !296, size: 32, offset: 8192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !291, file: !290, line: 227, baseType: !318, size: 288, offset: 8224)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 288, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 9)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !291, file: !290, line: 228, baseType: !295, size: 32, offset: 8512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !291, file: !290, line: 229, baseType: !323, size: 1696, offset: 8544)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1696, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 53)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !291, file: !290, line: 230, baseType: !296, size: 32, offset: 10240)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !291, file: !290, line: 231, baseType: !328, size: 96, offset: 10272)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 96, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 3)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !291, file: !290, line: 232, baseType: !296, size: 32, offset: 10368)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !291, file: !290, line: 233, baseType: !333, size: 64, offset: 10400)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 64, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 2)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !291, file: !290, line: 234, baseType: !296, size: 32, offset: 10464)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !291, file: !290, line: 236, baseType: !295, size: 32, offset: 10496)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !291, file: !290, line: 237, baseType: !296, size: 32, offset: 10528)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !291, file: !290, line: 238, baseType: !340, size: 224, offset: 10560)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 224, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 7)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !291, file: !290, line: 239, baseType: !296, size: 32, offset: 10784)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !291, file: !290, line: 241, baseType: !328, size: 96, offset: 10816)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !291, file: !290, line: 242, baseType: !296, size: 32, offset: 10912)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !291, file: !290, line: 243, baseType: !347, size: 256, offset: 10944)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 256, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !291, file: !290, line: 244, baseType: !296, size: 32, offset: 11200)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !291, file: !290, line: 245, baseType: !352, size: 9312, offset: 11232)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 9312, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 291)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !291, file: !290, line: 246, baseType: !296, size: 32, offset: 20544)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !359, line: 352, baseType: !360)
!359 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 341, size: 320, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !371}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !360, file: !359, line: 343, baseType: !295, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !360, file: !359, line: 344, baseType: !296, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !360, file: !359, line: 345, baseType: !148, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !360, file: !359, line: 346, baseType: !296, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !360, file: !359, line: 347, baseType: !296, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !360, file: !359, line: 348, baseType: !296, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !360, file: !359, line: 349, baseType: !148, size: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !360, file: !359, line: 350, baseType: !370, size: 64, offset: 224)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 64, elements: !334)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !360, file: !359, line: 351, baseType: !296, size: 32, offset: 288)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !374, file: !373, line: 167, baseType: !382)
!373 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !373, file: !373, line: 134, type: !375, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !285, retainedNodes: !377)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !148}
!377 = !{!378, !379, !381}
!378 = !DILocalVariable(name: "time_us", arg: 1, scope: !374, file: !373, line: 134, type: !148)
!379 = !DILocalVariable(name: "delay_cycles", scope: !374, file: !373, line: 168, type: !380)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!381 = !DILocalVariable(name: "cycles", scope: !374, file: !373, line: 171, type: !148)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!383 = !{!283, !384}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !374, file: !373, line: 161, type: !386, isLocal: true, isDefinition: true, align: 128)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 48, elements: !329)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !389)
!389 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!390 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !393, line: 51, size: 64, elements: !394)
!393 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !{!395, !402}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !392, file: !393, line: 60, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = !DISubroutineType(types: !398)
!398 = !{!103, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !393, line: 48, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !392, file: !393, line: 65, baseType: !399, size: 32, offset: 32)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !405, file: !604, line: 733, type: !712, isLocal: false, isDefinition: true, align: 32)
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !407, retainedTypes: !522, globals: !600, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!407 = !{!408, !414, !30, !419, !424, !429, !435, !441, !450, !454, !487, !494, !513}
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !409, line: 23, baseType: !32, size: 32, elements: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !{!411, !412, !413}
!411 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!412 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!413 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !409, line: 48, baseType: !32, size: 32, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!417 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!418 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 167, baseType: !32, size: 32, elements: !421)
!420 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !{!422, !423}
!422 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!423 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 107, baseType: !32, size: 32, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!427 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!428 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 208, baseType: !32, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!432 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!433 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!434 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 261, baseType: !32, size: 32, elements: !436)
!436 = !{!437, !438, !439, !440}
!437 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!438 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!439 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!440 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!441 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 237, baseType: !32, size: 32, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449}
!443 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!444 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!445 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!446 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!447 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!448 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!449 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 152, baseType: !32, size: 32, elements: !451)
!451 = !{!452, !453}
!452 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!453 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 71, baseType: !103, size: 32, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!456 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!457 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!458 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!459 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!460 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!461 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!462 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!463 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!464 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!465 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!466 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!467 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!468 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!469 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!470 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!471 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!472 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!473 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!474 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!475 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!476 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!477 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!478 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!479 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!480 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!481 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!482 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!483 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!484 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!485 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!486 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!487 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !488, line: 44, baseType: !32, size: 32, elements: !489)
!488 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!489 = !{!490, !491, !492, !493}
!490 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!491 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!492 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!493 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !495, line: 54, baseType: !32, size: 32, elements: !496)
!495 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!497 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!498 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!499 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!500 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!501 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!502 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!503 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!504 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!505 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!506 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!507 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!508 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!509 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!510 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!511 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!512 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !514, line: 53, baseType: !32, size: 32, elements: !515)
!514 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = !{!516, !517, !518, !519, !520, !521}
!516 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!517 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!518 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!519 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!520 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!521 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!522 = !{!408, !102, !103, !523, !571, !572, !573, !574, !126, !148, !149, !575, !356, !576, !210, !577, !599, !197}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !290, line: 291, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 260, size: 10912, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !538, !539, !540, !541, !542, !543, !547, !548, !549, !553, !554, !555, !556, !557, !558, !559, !563, !564, !565, !566, !570}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !525, file: !290, line: 261, baseType: !296, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !525, file: !290, line: 262, baseType: !296, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !525, file: !290, line: 263, baseType: !296, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !525, file: !290, line: 264, baseType: !296, size: 32, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !525, file: !290, line: 265, baseType: !296, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !525, file: !290, line: 266, baseType: !296, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !525, file: !290, line: 267, baseType: !296, size: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !525, file: !290, line: 268, baseType: !535, size: 1824, offset: 224)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1824, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 57)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !525, file: !290, line: 269, baseType: !296, size: 32, offset: 2048)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !525, file: !290, line: 270, baseType: !296, size: 32, offset: 2080)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !525, file: !290, line: 271, baseType: !295, size: 32, offset: 2112)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !525, file: !290, line: 272, baseType: !296, size: 32, offset: 2144)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !525, file: !290, line: 273, baseType: !296, size: 32, offset: 2176)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !525, file: !290, line: 274, baseType: !544, size: 3968, offset: 2208)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 3968, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 124)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !525, file: !290, line: 275, baseType: !296, size: 32, offset: 6176)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !525, file: !290, line: 276, baseType: !296, size: 32, offset: 6208)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !525, file: !290, line: 277, baseType: !550, size: 2016, offset: 6240)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 2016, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 63)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !525, file: !290, line: 278, baseType: !295, size: 32, offset: 8256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !525, file: !290, line: 279, baseType: !295, size: 32, offset: 8288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !525, file: !290, line: 280, baseType: !295, size: 32, offset: 8320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !525, file: !290, line: 281, baseType: !295, size: 32, offset: 8352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !525, file: !290, line: 282, baseType: !295, size: 32, offset: 8384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !525, file: !290, line: 283, baseType: !295, size: 32, offset: 8416)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !525, file: !290, line: 285, baseType: !560, size: 1984, offset: 8448)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1984, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 62)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !525, file: !290, line: 286, baseType: !296, size: 32, offset: 10432)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !525, file: !290, line: 287, baseType: !340, size: 224, offset: 10464)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !525, file: !290, line: 288, baseType: !296, size: 32, offset: 10688)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !525, file: !290, line: 289, baseType: !567, size: 160, offset: 10720)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 160, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 5)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !525, file: !290, line: 290, baseType: !296, size: 32, offset: 10880)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !420, line: 146, baseType: !424)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !420, line: 164, baseType: !450)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!575 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !359, line: 326, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 314, size: 6400, elements: !580)
!580 = !{!581, !583, !587, !588, !589, !590, !591, !592, !593, !597}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !579, file: !359, line: 316, baseType: !582, size: 32)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 32, elements: !172)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !579, file: !359, line: 317, baseType: !584, size: 992, offset: 32)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 992, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 31)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !579, file: !359, line: 318, baseType: !582, size: 32, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !579, file: !359, line: 319, baseType: !584, size: 992, offset: 1056)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !579, file: !359, line: 320, baseType: !582, size: 32, offset: 2048)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !579, file: !359, line: 321, baseType: !584, size: 992, offset: 2080)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !579, file: !359, line: 322, baseType: !582, size: 32, offset: 3072)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !579, file: !359, line: 323, baseType: !584, size: 992, offset: 3104)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !579, file: !359, line: 324, baseType: !594, size: 2048, offset: 4096)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 2048, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !579, file: !359, line: 325, baseType: !598, size: 256, offset: 6144)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 256, elements: !348)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !488, line: 56, baseType: !102)
!600 = !{!601, !653, !696, !403, !702, !730, !732, !749, !751, !761, !764, !779, !817, !831}
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "on", scope: !603, file: !604, line: 549, type: !185, isLocal: true, isDefinition: true)
!603 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !604, file: !604, line: 547, type: !605, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !607)
!604 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!605 = !DISubroutineType(types: !606)
!606 = !{null, !414}
!607 = !{!608, !609, !612}
!608 = !DILocalVariable(name: "start_mode", arg: 1, scope: !603, file: !604, line: 547, type: !414)
!609 = !DILocalVariable(name: "err", scope: !610, file: !604, line: 553, type: !103)
!610 = distinct !DILexicalBlock(scope: !611, file: !604, line: 552, column: 31)
!611 = distinct !DILexicalBlock(scope: !603, file: !604, line: 552, column: 6)
!612 = !DILocalVariable(name: "mgr", scope: !610, file: !604, line: 554, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !615, line: 154, size: 256, elements: !616)
!615 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !{!617, !629, !630, !646, !650, !651, !652}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !614, file: !615, line: 158, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !620)
!620 = !{!621, !628}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !619, file: !136, line: 36, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !625)
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !624, file: !136, line: 30, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !619, file: !136, line: 37, baseType: !622, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !614, file: !615, line: 163, baseType: !618, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !614, file: !615, line: 166, baseType: !631, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !615, line: 133, size: 96, elements: !634)
!634 = !{!635, !644, !645}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !633, file: !615, line: 135, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !615, line: 129, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !613, !640}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !615, line: 101, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !613, !103}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !633, file: !615, line: 138, baseType: !636, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !633, file: !615, line: 143, baseType: !636, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !614, file: !615, line: 169, baseType: !647, size: 32, offset: 160)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !647, file: !156, line: 52, baseType: !22, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !614, file: !615, line: 172, baseType: !103, size: 32, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !614, file: !615, line: 175, baseType: !388, size: 16, offset: 224)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !614, file: !615, line: 178, baseType: !388, size: 16, offset: 240)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "cli", scope: !603, file: !604, line: 550, type: !655, isLocal: true, isDefinition: true)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !615, line: 273, size: 128, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !655, file: !615, line: 280, baseType: !623, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !655, file: !615, line: 283, baseType: !659, size: 96, offset: 32)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !660, line: 138, size: 96, elements: !661)
!660 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!661 = !{!662, !693, !694}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !659, file: !660, line: 149, baseType: !663, size: 32)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !660, line: 139, size: 32, elements: !664)
!664 = !{!665, !688}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !663, file: !660, line: 145, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !668, line: 5397, size: 128, elements: !669)
!668 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = !{!670, !686, !687}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !667, file: !668, line: 5399, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !672, line: 48, baseType: !673)
!672 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !672, line: 37, size: 64, elements: !674)
!674 = !{!675, !681}
!675 = !DIDerivedType(tag: DW_TAG_member, scope: !673, file: !672, line: 38, baseType: !676, size: 32)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !673, file: !672, line: 38, size: 32, elements: !677)
!677 = !{!678, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !676, file: !672, line: 39, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !672, line: 40, baseType: !679, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, scope: !673, file: !672, line: 42, baseType: !682, size: 32, offset: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !673, file: !672, line: 42, size: 32, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !682, file: !672, line: 43, baseType: !679, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !682, file: !672, line: 44, baseType: !679, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !667, file: !668, line: 5405, baseType: !32, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !667, file: !668, line: 5408, baseType: !103, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !663, file: !660, line: 148, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !660, line: 98, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{null, null}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !659, file: !660, line: 165, baseType: !296, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !659, file: !660, line: 174, baseType: !695, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !405, file: !604, line: 733, type: !698, isLocal: false, isDefinition: true, align: 16)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 80, elements: !568)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !701, line: 43, baseType: !195)
!701 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !405, file: !604, line: 733, type: !704, isLocal: true, isDefinition: true, align: 32)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !393, line: 51, size: 64, elements: !706)
!706 = !{!707, !729}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !705, file: !393, line: 60, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DISubroutineType(types: !710)
!710 = !{!103, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !701, line: 378, size: 192, elements: !714)
!714 = !{!715, !718, !719, !720, !726, !727}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !701, line: 380, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !713, file: !701, line: 382, baseType: !13, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !713, file: !701, line: 384, baseType: !13, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !713, file: !701, line: 386, baseType: !721, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !701, line: 351, size: 16, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !722, file: !701, line: 359, baseType: !168, size: 8)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !722, file: !701, line: 364, baseType: !575, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !713, file: !701, line: 388, baseType: !102, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !713, file: !701, line: 396, baseType: !728, size: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !705, file: !393, line: 65, baseType: !711, size: 32, offset: 32)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !405, file: !604, line: 79, type: !185, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "data", scope: !405, file: !604, line: 702, type: !734, isLocal: true, isDefinition: true)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !604, line: 69, size: 704, elements: !735)
!735 = !{!736, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !734, file: !604, line: 70, baseType: !737, size: 512)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 512, elements: !334)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !734, file: !604, line: 71, baseType: !739, size: 192, offset: 512)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 192, elements: !334)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !604, line: 52, size: 96, elements: !741)
!741 = !{!742, !747, !748}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !740, file: !604, line: 53, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !488, line: 72, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !711, !599, !102}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !740, file: !604, line: 54, baseType: !102, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !740, file: !604, line: 55, baseType: !148, size: 32, offset: 64)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !405, file: !604, line: 733, type: !722, isLocal: true, isDefinition: true, align: 8)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "d", scope: !753, file: !604, line: 476, type: !759, isLocal: true, isDefinition: true)
!753 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !604, file: !604, line: 474, type: !605, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !754)
!754 = !{!755, !756, !757, !758}
!755 = !DILocalVariable(name: "mode", arg: 1, scope: !753, file: !604, line: 474, type: !414)
!756 = !DILocalVariable(name: "type", scope: !753, file: !604, line: 486, type: !571)
!757 = !DILocalVariable(name: "isr_mode", scope: !753, file: !604, line: 500, type: !575)
!758 = !DILocalVariable(name: "key", scope: !753, file: !604, line: 501, type: !103)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !420, line: 177, baseType: !419)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "target_type", scope: !753, file: !604, line: 477, type: !763, isLocal: true, isDefinition: true)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "config", scope: !405, file: !604, line: 704, type: !766, isLocal: true, isDefinition: true)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !604, line: 74, size: 128, elements: !768)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !767, file: !604, line: 76, baseType: !770, size: 128)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 128, elements: !334)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !604, line: 61, size: 64, elements: !772)
!772 = !{!773, !778}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !771, file: !604, line: 62, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !604, line: 58, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DISubroutineType(types: !777)
!777 = !{null}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !771, file: !604, line: 63, baseType: !774, size: 32, offset: 32)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !405, file: !604, line: 695, type: !781, isLocal: true, isDefinition: true)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !488, line: 100, size: 224, elements: !783)
!783 = !{!784, !789, !790, !795, !801, !806, !812}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !782, file: !488, line: 101, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !488, line: 76, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DISubroutineType(types: !788)
!788 = !{!103, !711, !599}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !782, file: !488, line: 102, baseType: !785, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !782, file: !488, line: 103, baseType: !791, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !488, line: 83, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DISubroutineType(types: !794)
!794 = !{!103, !711, !599, !743, !102}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !782, file: !488, line: 104, baseType: !796, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !488, line: 79, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{!103, !711, !599, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !782, file: !488, line: 105, baseType: !802, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !488, line: 88, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{!487, !711, !599}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !782, file: !488, line: 106, baseType: !807, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !488, line: 92, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!103, !711, !599, !811}
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !488, line: 64, baseType: !102)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !782, file: !488, line: 107, baseType: !813, size: 32, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !488, line: 96, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!103, !711, !599, !102}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "transitions", scope: !819, file: !604, line: 655, type: !632, isLocal: true, isDefinition: true)
!819 = distinct !DISubprogram(name: "clk_init", scope: !604, file: !604, line: 651, type: !709, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !820)
!820 = !{!821, !822, !824, !825, !827}
!821 = !DILocalVariable(name: "dev", arg: 1, scope: !819, file: !604, line: 651, type: !711)
!822 = !DILocalVariable(name: "nrfx_err", scope: !819, file: !604, line: 653, type: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !495, line: 72, baseType: !494)
!824 = !DILocalVariable(name: "err", scope: !819, file: !604, line: 654, type: !103)
!825 = !DILocalVariable(name: "i", scope: !826, file: !604, line: 678, type: !408)
!826 = distinct !DILexicalBlock(scope: !819, file: !604, line: 678, column: 2)
!827 = !DILocalVariable(name: "subdata", scope: !828, file: !604, line: 680, type: !830)
!828 = distinct !DILexicalBlock(scope: !829, file: !604, line: 679, column: 42)
!829 = distinct !DILexicalBlock(scope: !826, file: !604, line: 678, column: 2)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !819, file: !604, line: 660, type: !833, isLocal: true, isDefinition: true, align: 32)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !834)
!834 = !{!835, !836, !837, !838}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !833, file: !10, line: 55, baseType: !210, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !833, file: !10, line: 57, baseType: !210, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !833, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !833, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !841, file: !846, line: 7, type: !847, isLocal: false, isDefinition: true, align: 16)
!841 = distinct !DICompileUnit(language: DW_LANG_C99, file: !842, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !843, splitDebugInlining: false, nameTableKind: None)
!842 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!843 = !{!839, !844, !848, !850, !852}
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !841, file: !846, line: 12, type: !847, isLocal: false, isDefinition: true, align: 16)
!846 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 48, elements: !329)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !841, file: !846, line: 17, type: !847, isLocal: false, isDefinition: true, align: 16)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_28", scope: !841, file: !846, line: 22, type: !847, isLocal: false, isDefinition: true, align: 16)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_46", scope: !841, file: !846, line: 27, type: !847, isLocal: false, isDefinition: true, align: 16)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !856, file: !913, line: 603, type: !915, isLocal: true, isDefinition: true, align: 32)
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !858, globals: !910, splitDebugInlining: false, nameTableKind: None)
!857 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!858 = !{!102, !103, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !862, line: 336, size: 160, elements: !863)
!862 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!863 = !{!864, !884, !888, !892, !905}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !861, file: !862, line: 365, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DISubroutineType(types: !867)
!867 = !{!103, !868, !883}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !701, line: 378, size: 192, elements: !871)
!871 = !{!872, !873, !874, !875, !881, !882}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !701, line: 380, baseType: !716, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !870, file: !701, line: 382, baseType: !13, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !870, file: !701, line: 384, baseType: !13, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !870, file: !701, line: 386, baseType: !876, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !701, line: 351, size: 16, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !877, file: !701, line: 359, baseType: !168, size: 8)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !877, file: !701, line: 364, baseType: !575, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !870, file: !701, line: 388, baseType: !102, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !870, file: !701, line: 396, baseType: !728, size: 32, offset: 160)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !861, file: !862, line: 366, baseType: !885, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !868, !169}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !861, file: !862, line: 374, baseType: !889, size: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DISubroutineType(types: !891)
!891 = !{!103, !868}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !861, file: !862, line: 377, baseType: !893, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DISubroutineType(types: !895)
!895 = !{!103, !868, !896}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !862, line: 122, size: 64, elements: !899)
!899 = !{!900, !901, !902, !903, !904}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !898, file: !862, line: 123, baseType: !148, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !898, file: !862, line: 124, baseType: !168, size: 8, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !898, file: !862, line: 125, baseType: !168, size: 8, offset: 40)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !898, file: !862, line: 126, baseType: !168, size: 8, offset: 48)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !898, file: !862, line: 127, baseType: !168, size: 8, offset: 56)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !861, file: !862, line: 379, baseType: !906, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{!103, !868, !909}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!910 = !{!854, !911}
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !856, file: !913, line: 38, type: !914, isLocal: true, isDefinition: true)
!913 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !868)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !393, line: 51, size: 64, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !916, file: !393, line: 60, baseType: !889, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !916, file: !393, line: 65, baseType: !868, size: 32, offset: 32)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "gpio_nrfx_p0_cfg", scope: !922, file: !1089, line: 424, type: !1130, isLocal: true, isDefinition: true)
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !924, retainedTypes: !981, globals: !1086, splitDebugInlining: false, nameTableKind: None)
!923 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_nrfx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/tmp112")
!924 = !{!925, !931, !494, !936, !946, !952, !962, !966, !973, !977}
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !926, line: 506, baseType: !32, size: 32, elements: !927)
!926 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!927 = !{!928, !929, !930}
!928 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!929 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!930 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !926, line: 512, baseType: !32, size: 32, elements: !932)
!932 = !{!933, !934, !935}
!933 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!934 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!935 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!936 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !937, line: 56, baseType: !32, size: 32, elements: !938)
!937 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_gpiote.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!938 = !{!939, !940, !941, !942, !943, !944, !945}
!939 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_NONE", value: 0)
!940 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_LOTOHI", value: 1)
!941 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_HITOLO", value: 2)
!942 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_TOGGLE", value: 3)
!943 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_LOW", value: 4)
!944 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_HIGH", value: 5)
!945 = !DIEnumerator(name: "NRFX_GPIOTE_TRIGGER_MAX", value: 6)
!946 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 102, baseType: !32, size: 32, elements: !948)
!947 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!948 = !{!949, !950, !951}
!949 = !DIEnumerator(name: "NRF_GPIO_PIN_NOPULL", value: 0)
!950 = !DIEnumerator(name: "NRF_GPIO_PIN_PULLDOWN", value: 1)
!951 = !DIEnumerator(name: "NRF_GPIO_PIN_PULLUP", value: 3)
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 110, baseType: !32, size: 32, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961}
!954 = !DIEnumerator(name: "NRF_GPIO_PIN_S0S1", value: 0)
!955 = !DIEnumerator(name: "NRF_GPIO_PIN_H0S1", value: 1)
!956 = !DIEnumerator(name: "NRF_GPIO_PIN_S0H1", value: 2)
!957 = !DIEnumerator(name: "NRF_GPIO_PIN_H0H1", value: 3)
!958 = !DIEnumerator(name: "NRF_GPIO_PIN_D0S1", value: 4)
!959 = !DIEnumerator(name: "NRF_GPIO_PIN_D0H1", value: 5)
!960 = !DIEnumerator(name: "NRF_GPIO_PIN_S0D1", value: 6)
!961 = !DIEnumerator(name: "NRF_GPIO_PIN_H0D1", value: 7)
!962 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 92, baseType: !32, size: 32, elements: !963)
!963 = !{!964, !965}
!964 = !DIEnumerator(name: "NRF_GPIO_PIN_INPUT_CONNECT", value: 0)
!965 = !DIEnumerator(name: "NRF_GPIO_PIN_INPUT_DISCONNECT", value: 1)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !967, line: 65, baseType: !32, size: 32, elements: !968)
!967 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_gpiote.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!968 = !{!969, !970, !971, !972}
!969 = !DIEnumerator(name: "NRF_GPIOTE_POLARITY_NONE", value: 0)
!970 = !DIEnumerator(name: "NRF_GPIOTE_POLARITY_LOTOHI", value: 1)
!971 = !DIEnumerator(name: "NRF_GPIOTE_POLARITY_HITOLO", value: 2)
!972 = !DIEnumerator(name: "NRF_GPIOTE_POLARITY_TOGGLE", value: 3)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !967, line: 74, baseType: !32, size: 32, elements: !974)
!974 = !{!975, !976}
!975 = !DIEnumerator(name: "NRF_GPIOTE_INITIAL_VALUE_LOW", value: 0)
!976 = !DIEnumerator(name: "NRF_GPIOTE_INITIAL_VALUE_HIGH", value: 1)
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 85, baseType: !32, size: 32, elements: !978)
!978 = !{!979, !980}
!979 = !DIEnumerator(name: "NRF_GPIO_PIN_DIR_INPUT", value: 0)
!980 = !DIEnumerator(name: "NRF_GPIO_PIN_DIR_OUTPUT", value: 1)
!981 = !{!982, !1051, !1056, !1017, !931, !925, !1061, !102, !1062, !1063, !1032, !146}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !926, line: 523, size: 288, elements: !985)
!985 = !{!986, !1007, !1013, !1018, !1022, !1023, !1024, !1028, !1047}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !984, file: !926, line: 524, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DISubroutineType(types: !989)
!989 = !{!103, !990, !1005, !1006}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !701, line: 378, size: 192, elements: !993)
!993 = !{!994, !995, !996, !997, !1003, !1004}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !701, line: 380, baseType: !716, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !992, file: !701, line: 382, baseType: !13, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !992, file: !701, line: 384, baseType: !13, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !992, file: !701, line: 386, baseType: !998, size: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !701, line: 351, size: 16, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !999, file: !701, line: 359, baseType: !168, size: 8)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !999, file: !701, line: 364, baseType: !575, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !992, file: !701, line: 388, baseType: !102, size: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !992, file: !701, line: 396, baseType: !728, size: 32, offset: 160)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !926, line: 237, baseType: !168)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !926, line: 257, baseType: !148)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !984, file: !926, line: 530, baseType: !1008, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!103, !990, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !926, line: 229, baseType: !148)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !984, file: !926, line: 532, baseType: !1014, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!103, !990, !1017, !1012}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !926, line: 216, baseType: !148)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !984, file: !926, line: 535, baseType: !1019, size: 32, offset: 96)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!103, !990, !1017}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !984, file: !926, line: 537, baseType: !1019, size: 32, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !984, file: !926, line: 539, baseType: !1019, size: 32, offset: 160)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !984, file: !926, line: 541, baseType: !1025, size: 32, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!103, !990, !1005, !925, !931}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !984, file: !926, line: 544, baseType: !1029, size: 32, offset: 224)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!103, !990, !1032, !575}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !926, line: 478, size: 96, elements: !1034)
!1034 = !{!1035, !1041, !1046}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1033, file: !926, line: 482, baseType: !1036, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !1038)
!1038 = !{!1039}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !136, line: 30, baseType: !1040, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1033, file: !926, line: 485, baseType: !1042, size: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !926, line: 464, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{null, !990, !1032, !1017}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1033, file: !926, line: 493, baseType: !1017, size: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !984, file: !926, line: 547, baseType: !1048, size: 32, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!148, !990}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !926, line: 428, size: 32, elements: !1054)
!1054 = !{!1055}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1053, file: !926, line: 434, baseType: !1017, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !926, line: 441, size: 32, elements: !1059)
!1059 = !{!1060}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1058, file: !926, line: 447, baseType: !1017, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_gpio_pin_dir_t", file: !947, line: 89, baseType: !977)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_GPIO_Type", file: !290, line: 1186, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 1175, size: 15360, elements: !1066)
!1066 = !{!1067, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1082}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1065, file: !290, line: 1176, baseType: !1068, size: 10272)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 10272, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 321)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "OUT", scope: !1065, file: !290, line: 1177, baseType: !296, size: 32, offset: 10272)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "OUTSET", scope: !1065, file: !290, line: 1178, baseType: !296, size: 32, offset: 10304)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "OUTCLR", scope: !1065, file: !290, line: 1179, baseType: !296, size: 32, offset: 10336)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "IN", scope: !1065, file: !290, line: 1180, baseType: !295, size: 32, offset: 10368)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "DIR", scope: !1065, file: !290, line: 1181, baseType: !296, size: 32, offset: 10400)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "DIRSET", scope: !1065, file: !290, line: 1182, baseType: !296, size: 32, offset: 10432)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "DIRCLR", scope: !1065, file: !290, line: 1183, baseType: !296, size: 32, offset: 10464)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1065, file: !290, line: 1184, baseType: !1079, size: 3840, offset: 10496)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 3840, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 120)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "PIN_CNF", scope: !1065, file: !290, line: 1185, baseType: !1083, size: 1024, offset: 14336)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 1024, elements: !1084)
!1084 = !{!1085}
!1085 = !DISubrange(count: 32)
!1086 = !{!1087, !1090, !1092, !1102, !1114, !920, !1116, !1118}
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !922, file: !1089, line: 424, type: !698, isLocal: false, isDefinition: true, align: 16)
!1089 = !DIFile(filename: "zephyr/drivers/gpio/gpio_nrfx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(name: "__device_dts_ord_54", scope: !922, file: !1089, line: 424, type: !991, isLocal: false, isDefinition: true, align: 32)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_54", scope: !922, file: !1089, line: 424, type: !1094, isLocal: true, isDefinition: true, align: 32)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !393, line: 51, size: 64, elements: !1096)
!1096 = !{!1097, !1101}
