; ModuleID = 'build/96b_carbon_nrf51/simple/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "mutex", scope: !27, file: !116, line: 18, type: !256, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !152, !254}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "condvar", scope: !27, file: !116, line: 19, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 14, type: !143, isLocal: false, isDefinition: true, align: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 163840, elements: !149)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !145, line: 47, size: 8, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !145, line: 48, baseType: !148, size: 8)
!148 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = !{!150, !151}
!150 = !DISubrange(count: 20)
!151 = !DISubrange(count: 1024)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 16, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 23040, elements: !253)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1152, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !207, !220, !221, !222, !226, !227, !248}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 384)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 384, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !107, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !197, size: 192, offset: 192)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !198)
!198 = !{!199, !200, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !197, file: !122, line: 245, baseType: !165, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !197, file: !122, line: 246, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !197, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !208, size: 288, offset: 384)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !208, file: !209, line: 26, baseType: !110, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !208, file: !209, line: 27, baseType: !110, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !208, file: !209, line: 28, baseType: !110, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !208, file: !209, line: 29, baseType: !110, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !208, file: !209, line: 30, baseType: !110, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !208, file: !209, line: 31, baseType: !110, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !208, file: !209, line: 32, baseType: !110, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !208, file: !209, line: 33, baseType: !110, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !208, file: !209, line: 34, baseType: !110, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !107, size: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !223, size: 256, offset: 768)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 256, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !228, size: 32, offset: 1056)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !230)
!230 = !{!231, !242, !243}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !229, file: !118, line: 5074, baseType: !232, size: 96)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !233, line: 56, size: 96, elements: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !{!235, !238, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !232, file: !233, line: 57, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !233, line: 57, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !232, file: !233, line: 58, baseType: !107, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !232, file: !233, line: 59, baseType: !240, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !241, line: 214, baseType: !32)
!241 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !229, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !229, file: !118, line: 5076, baseType: !244, size: 32, offset: 160)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, size: 32, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !244, file: !245, line: 52, baseType: !22, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !249, size: 64, offset: 1088)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !249, file: !209, line: 63, baseType: !110, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !249, file: !209, line: 66, baseType: !110, size: 32, offset: 32)
!253 = !{!150}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "done", scope: !27, file: !116, line: 21, type: !109, isLocal: true, isDefinition: true)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !257)
!257 = !{!258, !259, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !256, file: !118, line: 2722, baseType: !121, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !256, file: !118, line: 2724, baseType: !260, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !256, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !256, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !265, file: !282, line: 18, type: !283, isLocal: false, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !267, globals: !281, splitDebugInlining: false, nameTableKind: None)
!266 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!267 = !{!22, !107, !24, !268, !270, !272, !240, !109, !275, !276, !277, !278, !279, !280, !192, !273}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!281 = !{!263}
!282 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !286)
!285 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !285, line: 17, baseType: !273, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !284, file: !285, line: 18, baseType: !178, size: 8, offset: 32)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_char_out", scope: !291, file: !295, line: 54, type: !296, isLocal: false, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !293, globals: !294, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!293 = !{!107, !109}
!294 = !{!289}
!295 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{!109, !109}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !301, file: !335, line: 22, type: !367, isLocal: false, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !315, globals: !332, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!303 = !{!304, !30}
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !305, line: 27, baseType: !32, size: 32, elements: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314}
!307 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!308 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!309 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!310 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!311 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!312 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!313 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!314 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!315 = !{!107, !103, !109, !24, !316, !279, !110, !111}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !318, line: 54, size: 96, elements: !319)
!318 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = !{!320, !327, !331}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !317, file: !318, line: 55, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !322, line: 33, baseType: !323)
!322 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !322, line: 29, size: 32, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !322, line: 30, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !317, file: !318, line: 60, baseType: !328, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !304}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !317, file: !318, line: 65, baseType: !328, size: 32, offset: 64)
!332 = !{!299, !333, !341, !346, !348, !357, !359}
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !301, file: !335, line: 27, type: !336, isLocal: true, isDefinition: true)
!335 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 32, elements: !339)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !338, line: 22, baseType: !102)
!338 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = !{!340}
!340 = !DISubrange(count: 1)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !301, file: !335, line: 44, type: !343, isLocal: true, isDefinition: true)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, size: 32, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !343, file: !245, line: 52, baseType: !22, size: 32)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !301, file: !335, line: 49, type: !343, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !301, file: !335, line: 36, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 128, elements: !339)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !305, line: 114, size: 128, elements: !352)
!352 = !{!353, !354, !355, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !351, file: !305, line: 115, baseType: !304, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !351, file: !305, line: 141, baseType: !178, size: 8, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !351, file: !305, line: 149, baseType: !110, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !351, file: !305, line: 156, baseType: !110, size: 32, offset: 96)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !301, file: !335, line: 40, type: !350, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !301, file: !335, line: 28, type: !361, isLocal: true, isDefinition: true)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !322, line: 40, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !322, line: 35, size: 64, elements: !363)
!363 = !{!364, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !362, file: !322, line: 36, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !362, file: !322, line: 37, baseType: !365, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !368, file: !285, line: 17, baseType: !273, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !368, file: !285, line: 18, baseType: !178, size: 8, offset: 32)
!372 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!373 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !376, file: !405, line: 50, type: !392, isLocal: true, isDefinition: true)
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !378, globals: !402, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!378 = !{!379, !103, !240, !109, !107, !110, !111, !381, !279, !392, !393}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !380)
!380 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !383, line: 45, size: 64, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{!385, !391}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !382, file: !383, line: 46, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !322, line: 33, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !322, line: 29, size: 32, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !322, line: 30, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !382, file: !383, line: 48, baseType: !110, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !383, line: 38, size: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !394, file: !383, line: 39, baseType: !386, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !394, file: !383, line: 41, baseType: !398, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !383, line: 35, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !392}
!402 = !{!403, !409, !417, !374, !419, !429}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "latency_lock", scope: !376, file: !405, line: 44, type: !406, isLocal: true, isDefinition: true)
!405 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, size: 32, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !406, file: !245, line: 52, baseType: !22, size: 32)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !376, file: !405, line: 46, type: !411, isLocal: true, isDefinition: true)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !322, line: 40, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !322, line: 35, size: 64, elements: !413)
!413 = !{!414, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !412, file: !322, line: 36, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !412, file: !322, line: 37, baseType: !415, size: 32, offset: 32)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "latency_subs", scope: !376, file: !405, line: 52, type: !411, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !376, file: !405, line: 39, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, elements: !427)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 35, size: 96, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !422, file: !405, line: 36, baseType: !304, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !422, file: !405, line: 37, baseType: !178, size: 8, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !422, file: !405, line: 38, baseType: !337, size: 32, offset: 64)
!427 = !{!428}
!428 = !DISubrange(count: 0)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !376, file: !405, line: 48, type: !392, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !433, file: !440, line: 47, type: !454, isLocal: true, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, retainedTypes: !436, globals: !437, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!435 = !{!304}
!436 = !{!240, !109}
!437 = !{!438, !431, !450}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "cpus_states", scope: !433, file: !440, line: 50, type: !441, isLocal: true, isDefinition: true)
!440 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 32, elements: !339)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !305, line: 114, size: 128, elements: !445)
!445 = !{!446, !447, !448, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !444, file: !305, line: 115, baseType: !304, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !444, file: !305, line: 141, baseType: !178, size: 8, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !444, file: !305, line: 149, baseType: !110, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !444, file: !305, line: 156, baseType: !110, size: 32, offset: 96)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !433, file: !440, line: 55, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 8, elements: !339)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, elements: !427)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !457, file: !464, line: 21, type: !296, isLocal: true, isDefinition: true)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !459, globals: !463, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!459 = !{!460, !109, !107}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !462, line: 22, baseType: !109)
!462 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{!455}
!464 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !467, file: !566, line: 31, type: !583, isLocal: false, isDefinition: true)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !469, globals: !563, splitDebugInlining: false, nameTableKind: None)
!468 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!469 = !{!470, !178, !107, !109, !536, !537, !552, !110}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !472, line: 247, baseType: !473)
!472 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 216, size: 20576, elements: !474)
!474 = !{!475, !481, !482, !483, !487, !488, !492, !493, !494, !498, !499, !503, !504, !508, !509, !513, !514, !516, !517, !518, !519, !523, !524, !525, !526, !530, !531, !535}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !473, file: !472, line: 217, baseType: !476, size: 960)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 960, elements: !479)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!479 = !{!480}
!480 = !DISubrange(count: 30)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !473, file: !472, line: 218, baseType: !478, size: 32, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !473, file: !472, line: 219, baseType: !478, size: 32, offset: 992)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !473, file: !472, line: 220, baseType: !484, size: 1088, offset: 1024)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1088, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 34)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !473, file: !472, line: 221, baseType: !478, size: 32, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !473, file: !472, line: 222, baseType: !489, size: 4032, offset: 2144)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 4032, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 126)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !473, file: !472, line: 223, baseType: !478, size: 32, offset: 6176)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !473, file: !472, line: 224, baseType: !478, size: 32, offset: 6208)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !473, file: !472, line: 225, baseType: !495, size: 1952, offset: 6240)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1952, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 61)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !473, file: !472, line: 226, baseType: !478, size: 32, offset: 8192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !473, file: !472, line: 227, baseType: !500, size: 288, offset: 8224)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 288, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 9)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !473, file: !472, line: 228, baseType: !477, size: 32, offset: 8512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !473, file: !472, line: 229, baseType: !505, size: 1696, offset: 8544)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1696, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 53)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !473, file: !472, line: 230, baseType: !478, size: 32, offset: 10240)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !473, file: !472, line: 231, baseType: !510, size: 96, offset: 10272)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 96, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 3)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !473, file: !472, line: 232, baseType: !478, size: 32, offset: 10368)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !473, file: !472, line: 233, baseType: !515, size: 64, offset: 10400)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 64, elements: !173)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !473, file: !472, line: 234, baseType: !478, size: 32, offset: 10464)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !473, file: !472, line: 236, baseType: !477, size: 32, offset: 10496)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !473, file: !472, line: 237, baseType: !478, size: 32, offset: 10528)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !473, file: !472, line: 238, baseType: !520, size: 224, offset: 10560)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 224, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 7)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !473, file: !472, line: 239, baseType: !478, size: 32, offset: 10784)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !473, file: !472, line: 241, baseType: !510, size: 96, offset: 10816)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !473, file: !472, line: 242, baseType: !478, size: 32, offset: 10912)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !473, file: !472, line: 243, baseType: !527, size: 256, offset: 10944)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 256, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !473, file: !472, line: 244, baseType: !478, size: 32, offset: 11200)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !473, file: !472, line: 245, baseType: !532, size: 9312, offset: 11232)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 9312, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 291)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !473, file: !472, line: 246, baseType: !478, size: 32, offset: 20544)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !539, line: 352, baseType: !540)
!539 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 341, size: 320, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !551}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !540, file: !539, line: 343, baseType: !477, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !540, file: !539, line: 344, baseType: !478, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !540, file: !539, line: 345, baseType: !110, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !540, file: !539, line: 346, baseType: !478, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !540, file: !539, line: 347, baseType: !478, size: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !540, file: !539, line: 348, baseType: !478, size: 32, offset: 160)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !540, file: !539, line: 349, baseType: !110, size: 32, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !540, file: !539, line: 350, baseType: !550, size: 64, offset: 224)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 64, elements: !173)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !540, file: !539, line: 351, baseType: !478, size: 32, offset: 288)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !554, file: !553, line: 167, baseType: !562)
!553 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !553, file: !553, line: 134, type: !555, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !467, retainedNodes: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !110}
!557 = !{!558, !559, !561}
!558 = !DILocalVariable(name: "time_us", arg: 1, scope: !554, file: !553, line: 134, type: !110)
!559 = !DILocalVariable(name: "delay_cycles", scope: !554, file: !553, line: 168, type: !560)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!561 = !DILocalVariable(name: "cycles", scope: !554, file: !553, line: 171, type: !110)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!563 = !{!465, !564, !579}
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !467, file: !566, line: 71, type: !567, isLocal: true, isDefinition: true, align: 32)
!566 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !569, line: 51, size: 64, elements: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !{!571, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !568, file: !569, line: 60, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DISubroutineType(types: !574)
!574 = !{!109, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !569, line: 48, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !568, file: !569, line: 65, baseType: !575, size: 32, offset: 32)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !554, file: !553, line: 161, type: !581, isLocal: true, isDefinition: true, align: 128)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 48, elements: !511)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !584, file: !285, line: 17, baseType: !273, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !584, file: !285, line: 18, baseType: !178, size: 8, offset: 32)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !590, file: !788, line: 18, type: !1022, isLocal: false, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !592, retainedTypes: !707, globals: !784, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!592 = !{!593, !599, !30, !604, !609, !614, !620, !626, !635, !639, !672, !679, !698}
!593 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !594, line: 23, baseType: !32, size: 32, elements: !595)
!594 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!595 = !{!596, !597, !598}
!596 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!597 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!598 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !594, line: 48, baseType: !32, size: 32, elements: !600)
!600 = !{!601, !602, !603}
!601 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!602 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!603 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !605, line: 167, baseType: !32, size: 32, elements: !606)
!605 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!606 = !{!607, !608}
!607 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!608 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!609 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !605, line: 107, baseType: !32, size: 32, elements: !610)
!610 = !{!611, !612, !613}
!611 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!612 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!613 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !605, line: 208, baseType: !32, size: 32, elements: !615)
!615 = !{!616, !617, !618, !619}
!616 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!617 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!618 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!619 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !605, line: 261, baseType: !32, size: 32, elements: !621)
!621 = !{!622, !623, !624, !625}
!622 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!623 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!624 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!625 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!626 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !605, line: 237, baseType: !32, size: 32, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634}
!628 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!629 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!630 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!631 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!632 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!633 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!634 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !605, line: 152, baseType: !32, size: 32, elements: !636)
!636 = !{!637, !638}
!637 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!638 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!639 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !472, line: 71, baseType: !109, size: 32, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!641 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!642 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!643 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!644 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!645 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!646 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!647 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!648 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!649 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!650 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!651 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!652 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!653 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!654 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!655 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!656 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!657 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!658 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!659 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!660 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!661 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!662 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!663 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!664 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!665 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!666 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!667 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!668 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!669 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!670 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!671 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !673, line: 44, baseType: !32, size: 32, elements: !674)
!673 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!674 = !{!675, !676, !677, !678}
!675 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!676 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!677 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!678 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !680, line: 54, baseType: !32, size: 32, elements: !681)
!680 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!682 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!683 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!684 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!685 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!686 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!687 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!688 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!689 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!690 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!691 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!692 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!693 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!694 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!695 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!696 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!697 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !699, line: 53, baseType: !32, size: 32, elements: !700)
!699 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!700 = !{!701, !702, !703, !704, !705, !706}
!701 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!702 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!703 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!704 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!705 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!706 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!707 = !{!593, !107, !109, !708, !756, !757, !758, !759, !103, !110, !111, !760, !536, !280, !392, !761, !783, !240}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !472, line: 291, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 260, size: 10912, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !723, !724, !725, !726, !727, !728, !732, !733, !734, !738, !739, !740, !741, !742, !743, !744, !748, !749, !750, !751, !755}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !710, file: !472, line: 261, baseType: !478, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !710, file: !472, line: 262, baseType: !478, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !710, file: !472, line: 263, baseType: !478, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !710, file: !472, line: 264, baseType: !478, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !710, file: !472, line: 265, baseType: !478, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !710, file: !472, line: 266, baseType: !478, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !710, file: !472, line: 267, baseType: !478, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !710, file: !472, line: 268, baseType: !720, size: 1824, offset: 224)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1824, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 57)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !710, file: !472, line: 269, baseType: !478, size: 32, offset: 2048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !710, file: !472, line: 270, baseType: !478, size: 32, offset: 2080)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !710, file: !472, line: 271, baseType: !477, size: 32, offset: 2112)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !710, file: !472, line: 272, baseType: !478, size: 32, offset: 2144)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !710, file: !472, line: 273, baseType: !478, size: 32, offset: 2176)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !710, file: !472, line: 274, baseType: !729, size: 3968, offset: 2208)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 3968, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 124)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !710, file: !472, line: 275, baseType: !478, size: 32, offset: 6176)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !710, file: !472, line: 276, baseType: !478, size: 32, offset: 6208)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !710, file: !472, line: 277, baseType: !735, size: 2016, offset: 6240)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 2016, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 63)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !710, file: !472, line: 278, baseType: !477, size: 32, offset: 8256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !710, file: !472, line: 279, baseType: !477, size: 32, offset: 8288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !710, file: !472, line: 280, baseType: !477, size: 32, offset: 8320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !710, file: !472, line: 281, baseType: !477, size: 32, offset: 8352)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !710, file: !472, line: 282, baseType: !477, size: 32, offset: 8384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !710, file: !472, line: 283, baseType: !477, size: 32, offset: 8416)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !710, file: !472, line: 285, baseType: !745, size: 1984, offset: 8448)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1984, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 62)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !710, file: !472, line: 286, baseType: !478, size: 32, offset: 10432)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !710, file: !472, line: 287, baseType: !520, size: 224, offset: 10464)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !710, file: !472, line: 288, baseType: !478, size: 32, offset: 10688)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !710, file: !472, line: 289, baseType: !752, size: 160, offset: 10720)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 160, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 5)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !710, file: !472, line: 290, baseType: !478, size: 32, offset: 10880)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !605, line: 146, baseType: !609)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !605, line: 164, baseType: !635)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!760 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !539, line: 326, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 314, size: 6400, elements: !764)
!764 = !{!765, !767, !771, !772, !773, !774, !775, !776, !777, !781}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !763, file: !539, line: 316, baseType: !766, size: 32)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 32, elements: !339)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !763, file: !539, line: 317, baseType: !768, size: 992, offset: 32)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 992, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 31)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !763, file: !539, line: 318, baseType: !766, size: 32, offset: 1024)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !763, file: !539, line: 319, baseType: !768, size: 992, offset: 1056)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !763, file: !539, line: 320, baseType: !766, size: 32, offset: 2048)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !763, file: !539, line: 321, baseType: !768, size: 992, offset: 2080)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !763, file: !539, line: 322, baseType: !766, size: 32, offset: 3072)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !763, file: !539, line: 323, baseType: !768, size: 992, offset: 3104)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !763, file: !539, line: 324, baseType: !778, size: 2048, offset: 4096)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 2048, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !763, file: !539, line: 325, baseType: !782, size: 256, offset: 6144)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 256, elements: !528)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !673, line: 56, baseType: !107)
!784 = !{!588, !785, !837, !878, !884, !901, !912, !914, !931, !933, !943, !946, !962, !1000, !1014}
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "on", scope: !787, file: !788, line: 549, type: !337, isLocal: true, isDefinition: true)
!787 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !788, file: !788, line: 547, type: !789, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !590, retainedNodes: !791)
!788 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!789 = !DISubroutineType(types: !790)
!790 = !{null, !599}
!791 = !{!792, !793, !796}
!792 = !DILocalVariable(name: "start_mode", arg: 1, scope: !787, file: !788, line: 547, type: !599)
!793 = !DILocalVariable(name: "err", scope: !794, file: !788, line: 553, type: !109)
!794 = distinct !DILexicalBlock(scope: !795, file: !788, line: 552, column: 31)
!795 = distinct !DILexicalBlock(scope: !787, file: !788, line: 552, column: 6)
!796 = !DILocalVariable(name: "mgr", scope: !794, file: !788, line: 554, type: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !799, line: 154, size: 256, elements: !800)
!799 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!800 = !{!801, !813, !814, !830, !834, !835, !836}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !798, file: !799, line: 158, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !322, line: 40, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !322, line: 35, size: 64, elements: !804)
!804 = !{!805, !812}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !803, file: !322, line: 36, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !322, line: 33, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !322, line: 29, size: 32, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !808, file: !322, line: 30, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !803, file: !322, line: 37, baseType: !806, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !798, file: !799, line: 163, baseType: !802, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !798, file: !799, line: 166, baseType: !815, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !799, line: 133, size: 96, elements: !818)
!818 = !{!819, !828, !829}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !817, file: !799, line: 135, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !799, line: 129, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !797, !824}
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !799, line: 101, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !797, !109}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !817, file: !799, line: 138, baseType: !820, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !817, file: !799, line: 143, baseType: !820, size: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !798, file: !799, line: 169, baseType: !831, size: 32, offset: 160)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !245, line: 43, size: 32, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !831, file: !245, line: 52, baseType: !22, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !798, file: !799, line: 172, baseType: !109, size: 32, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !798, file: !799, line: 175, baseType: !192, size: 16, offset: 224)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !798, file: !799, line: 178, baseType: !192, size: 16, offset: 240)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "cli", scope: !787, file: !788, line: 550, type: !839, isLocal: true, isDefinition: true)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !799, line: 273, size: 128, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !839, file: !799, line: 280, baseType: !807, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !839, file: !799, line: 283, baseType: !843, size: 96, offset: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !844, line: 138, size: 96, elements: !845)
!844 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!845 = !{!846, !875, !876}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !843, file: !844, line: 149, baseType: !847, size: 32)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !844, line: 139, size: 32, elements: !848)
!848 = !{!849, !870}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !847, file: !844, line: 145, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !118, line: 5397, size: 128, elements: !852)
!852 = !{!853, !868, !869}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !851, file: !118, line: 5399, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !856)
!856 = !{!857, !863}
!857 = !DIDerivedType(tag: DW_TAG_member, scope: !855, file: !127, line: 38, baseType: !858, size: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !127, line: 38, size: 32, elements: !859)
!859 = !{!860, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !858, file: !127, line: 39, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !127, line: 40, baseType: !861, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, scope: !855, file: !127, line: 42, baseType: !864, size: 32, offset: 32)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !127, line: 42, size: 32, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !864, file: !127, line: 43, baseType: !861, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !864, file: !127, line: 44, baseType: !861, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !851, file: !118, line: 5405, baseType: !32, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !851, file: !118, line: 5408, baseType: !109, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !847, file: !844, line: 148, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !844, line: 98, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DISubroutineType(types: !874)
!874 = !{null, null}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !843, file: !844, line: 165, baseType: !478, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !843, file: !844, line: 174, baseType: !877, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !109)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !590, file: !788, line: 733, type: !880, isLocal: false, isDefinition: true, align: 16)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 80, elements: !753)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !883, line: 43, baseType: !379)
!883 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !590, file: !788, line: 733, type: !886, isLocal: false, isDefinition: true, align: 32)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !883, line: 378, size: 192, elements: !888)
!888 = !{!889, !890, !891, !892, !898, !899}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !887, file: !883, line: 380, baseType: !273, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !887, file: !883, line: 382, baseType: !13, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !887, file: !883, line: 384, baseType: !13, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !887, file: !883, line: 386, baseType: !893, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !883, line: 351, size: 16, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !894, file: !883, line: 359, baseType: !178, size: 8)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !894, file: !883, line: 364, baseType: !760, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !887, file: !883, line: 388, baseType: !107, size: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !887, file: !883, line: 396, baseType: !900, size: 32, offset: 160)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !590, file: !788, line: 733, type: !903, isLocal: true, isDefinition: true, align: 32)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !569, line: 51, size: 64, elements: !905)
!905 = !{!906, !911}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !904, file: !569, line: 60, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{!109, !910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !904, file: !569, line: 65, baseType: !910, size: 32, offset: 32)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !590, file: !788, line: 79, type: !337, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "data", scope: !590, file: !788, line: 702, type: !916, isLocal: true, isDefinition: true)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !788, line: 69, size: 704, elements: !917)
!917 = !{!918, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !916, file: !788, line: 70, baseType: !919, size: 512)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 512, elements: !173)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !916, file: !788, line: 71, baseType: !921, size: 192, offset: 512)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 192, elements: !173)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !788, line: 52, size: 96, elements: !923)
!923 = !{!924, !929, !930}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !922, file: !788, line: 53, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !673, line: 72, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !910, !783, !107}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !922, file: !788, line: 54, baseType: !107, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !922, file: !788, line: 55, baseType: !110, size: 32, offset: 64)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !590, file: !788, line: 733, type: !894, isLocal: true, isDefinition: true, align: 8)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "d", scope: !935, file: !788, line: 476, type: !941, isLocal: true, isDefinition: true)
!935 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !788, file: !788, line: 474, type: !789, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !590, retainedNodes: !936)
!936 = !{!937, !938, !939, !940}
!937 = !DILocalVariable(name: "mode", arg: 1, scope: !935, file: !788, line: 474, type: !599)
!938 = !DILocalVariable(name: "type", scope: !935, file: !788, line: 486, type: !756)
!939 = !DILocalVariable(name: "isr_mode", scope: !935, file: !788, line: 500, type: !760)
!940 = !DILocalVariable(name: "key", scope: !935, file: !788, line: 501, type: !109)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !605, line: 177, baseType: !604)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "target_type", scope: !935, file: !788, line: 477, type: !945, isLocal: true, isDefinition: true)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "config", scope: !590, file: !788, line: 704, type: !948, isLocal: true, isDefinition: true)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !788, line: 74, size: 192, elements: !950)
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !949, file: !788, line: 76, baseType: !952, size: 192)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 192, elements: !173)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !788, line: 61, size: 96, elements: !954)
!954 = !{!955, !960, !961}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !953, file: !788, line: 62, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !788, line: 58, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{null}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !953, file: !788, line: 63, baseType: !956, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !788, line: 65, baseType: !273, size: 32, offset: 64)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !590, file: !788, line: 695, type: !964, isLocal: true, isDefinition: true)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !673, line: 100, size: 224, elements: !966)
!966 = !{!967, !972, !973, !978, !984, !989, !995}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !965, file: !673, line: 101, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !673, line: 76, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!109, !910, !783}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !965, file: !673, line: 102, baseType: !968, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !965, file: !673, line: 103, baseType: !974, size: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !673, line: 83, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!109, !910, !783, !925, !107}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !965, file: !673, line: 104, baseType: !979, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !673, line: 79, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!109, !910, !783, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !965, file: !673, line: 105, baseType: !985, size: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !673, line: 88, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{!672, !910, !783}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !965, file: !673, line: 106, baseType: !990, size: 32, offset: 160)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !673, line: 92, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{!109, !910, !783, !994}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !673, line: 64, baseType: !107)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !965, file: !673, line: 107, baseType: !996, size: 32, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !673, line: 96, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DISubroutineType(types: !999)
!999 = !{!109, !910, !783, !107}
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "transitions", scope: !1002, file: !788, line: 655, type: !816, isLocal: true, isDefinition: true)
!1002 = distinct !DISubprogram(name: "clk_init", scope: !788, file: !788, line: 651, type: !908, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !590, retainedNodes: !1003)
!1003 = !{!1004, !1005, !1007, !1008, !1010}
!1004 = !DILocalVariable(name: "dev", arg: 1, scope: !1002, file: !788, line: 651, type: !910)
!1005 = !DILocalVariable(name: "nrfx_err", scope: !1002, file: !788, line: 653, type: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !680, line: 72, baseType: !679)
!1007 = !DILocalVariable(name: "err", scope: !1002, file: !788, line: 654, type: !109)
!1008 = !DILocalVariable(name: "i", scope: !1009, file: !788, line: 678, type: !593)
!1009 = distinct !DILexicalBlock(scope: !1002, file: !788, line: 678, column: 2)
!1010 = !DILocalVariable(name: "subdata", scope: !1011, file: !788, line: 680, type: !1013)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !788, line: 679, column: 42)
!1012 = distinct !DILexicalBlock(scope: !1009, file: !788, line: 678, column: 2)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !1002, file: !788, line: 660, type: !1016, isLocal: true, isDefinition: true, align: 32)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1016, file: !10, line: 55, baseType: !392, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1016, file: !10, line: 57, baseType: !392, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1016, file: !10, line: 59, baseType: !107, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1016, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !285, line: 17, baseType: !273, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1023, file: !285, line: 18, baseType: !178, size: 8, offset: 32)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !1029, file: !1034, line: 7, type: !1035, isLocal: false, isDefinition: true, align: 16)
!1029 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1030, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1031, splitDebugInlining: false, nameTableKind: None)
!1030 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!1031 = !{!1027, !1032, !1036}
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !1029, file: !1034, line: 12, type: !1035, isLocal: false, isDefinition: true, align: 16)
!1034 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 48, elements: !511)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !1029, file: !1034, line: 17, type: !1035, isLocal: false, isDefinition: true, align: 16)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !1040, file: !1097, line: 603, type: !1099, isLocal: true, isDefinition: true, align: 32)
!1040 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1041, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !1042, globals: !1094, splitDebugInlining: false, nameTableKind: None)
!1041 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/simple")
!1042 = !{!107, !109, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !1046, line: 336, size: 160, elements: !1047)
!1046 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1047 = !{!1048, !1068, !1072, !1076, !1089}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1045, file: !1046, line: 365, baseType: !1049, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 32)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!109, !1052, !1067}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !883, line: 378, size: 192, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1065, !1066}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1054, file: !883, line: 380, baseType: !273, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1054, file: !883, line: 382, baseType: !13, size: 32, offset: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1054, file: !883, line: 384, baseType: !13, size: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1054, file: !883, line: 386, baseType: !1060, size: 32, offset: 96)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 32)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !883, line: 351, size: 16, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1061, file: !883, line: 359, baseType: !178, size: 8)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1061, file: !883, line: 364, baseType: !760, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
