; ModuleID = 'build/arduino_nano_33_ble_sense/basic/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !167, file: !206, line: 27, type: !234, isLocal: true, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !181, globals: !203, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!169 = !{!170, !30}
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !171, line: 27, baseType: !32, size: 32, elements: !172)
!171 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180}
!173 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!174 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!175 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!176 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!177 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!178 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!179 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!180 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!181 = !{!102, !182, !103, !24, !186, !202, !137, !163}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !183, line: 46, baseType: !184)
!183 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !185)
!185 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !188, line: 54, size: 96, elements: !189)
!188 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = !{!190, !197, !201}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !187, file: !188, line: 55, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !192, line: 30, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !187, file: !188, line: 60, baseType: !198, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !170}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !187, file: !188, line: 65, baseType: !198, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!203 = !{!165, !204, !209, !211, !224, !226}
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !167, file: !206, line: 44, type: !207, isLocal: true, isDefinition: true)
!206 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!208 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !167, file: !206, line: 49, type: !207, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !167, file: !206, line: 36, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !222)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !171, line: 114, size: 128, elements: !215)
!215 = !{!216, !217, !220, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !214, file: !171, line: 115, baseType: !170, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !214, file: !171, line: 141, baseType: !218, size: 8, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !219)
!219 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !214, file: !171, line: 149, baseType: !137, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !214, file: !171, line: 156, baseType: !137, size: 32, offset: 96)
!222 = !{!223}
!223 = !DISubrange(count: 1)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !167, file: !206, line: 40, type: !213, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !167, file: !206, line: 28, type: !228, isLocal: true, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !192, line: 40, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !192, line: 35, size: 64, elements: !230)
!230 = !{!231, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !229, file: !192, line: 36, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !229, file: !192, line: 37, baseType: !232, size: 32, offset: 32)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 32, elements: !222)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !236, line: 22, baseType: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!238 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!239 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !242, file: !271, line: 50, type: !258, isLocal: true, isDefinition: true)
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !244, globals: !268, splitDebugInlining: false, nameTableKind: None)
!243 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!244 = !{!245, !182, !120, !103, !102, !137, !163, !247, !202, !258, !259}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !246)
!246 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !249, line: 45, size: 64, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251, !257}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !248, file: !249, line: 46, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !192, line: 30, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !248, file: !249, line: 48, baseType: !137, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !249, line: 38, size: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !260, file: !249, line: 39, baseType: !252, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !260, file: !249, line: 41, baseType: !264, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !249, line: 35, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !258}
!268 = !{!269, !273, !281, !240, !283, !293}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "latency_lock", scope: !242, file: !271, line: 44, type: !272, isLocal: true, isDefinition: true)
!271 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !242, file: !271, line: 46, type: !275, isLocal: true, isDefinition: true)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !192, line: 40, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !192, line: 35, size: 64, elements: !277)
!277 = !{!278, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !276, file: !192, line: 36, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !276, file: !192, line: 37, baseType: !279, size: 32, offset: 32)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "latency_subs", scope: !242, file: !271, line: 52, type: !275, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !242, file: !271, line: 39, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, elements: !291)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !271, line: 35, size: 96, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !286, file: !271, line: 36, baseType: !170, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !286, file: !271, line: 37, baseType: !218, size: 8, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !286, file: !271, line: 38, baseType: !235, size: 32, offset: 64)
!291 = !{!292}
!292 = !DISubrange(count: 0)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !242, file: !271, line: 48, type: !258, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !297, file: !304, line: 47, type: !318, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !299, retainedTypes: !300, globals: !301, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!299 = !{!170}
!300 = !{!120, !103}
!301 = !{!302, !295, !314}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "cpus_states", scope: !297, file: !304, line: 50, type: !305, isLocal: true, isDefinition: true)
!304 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 32, elements: !222)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !171, line: 114, size: 128, elements: !309)
!309 = !{!310, !311, !312, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !171, line: 115, baseType: !170, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !308, file: !171, line: 141, baseType: !218, size: 8, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !308, file: !171, line: 149, baseType: !137, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !308, file: !171, line: 156, baseType: !137, size: 32, offset: 96)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !297, file: !304, line: 55, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 8, elements: !222)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, elements: !291)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "static_regions", scope: !321, file: !328, line: 62, type: !458, isLocal: true, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !323, globals: !324, splitDebugInlining: false, nameTableKind: None)
!322 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!323 = !{!120, !103, !137, !102}
!324 = !{!325, !319}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !327, file: !328, line: 198, type: !446, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !328, file: !328, line: 175, type: !329, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !321, retainedNodes: !441)
!328 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = !DISubroutineType(types: !330)
!330 = !{null, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !333, line: 245, size: 1024, elements: !334)
!333 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!334 = !{!335, !400, !413, !414, !415, !416, !422, !436}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !332, file: !333, line: 247, baseType: !336, size: 384)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !333, line: 57, size: 384, elements: !337)
!337 = !{!338, !366, !374, !375, !376, !387, !388, !389}
!338 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !333, line: 60, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !333, line: 60, size: 64, elements: !340)
!340 = !{!341, !357}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !339, file: !333, line: 61, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !343, line: 49, baseType: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !343, line: 37, size: 64, elements: !345)
!345 = !{!346, !352}
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !343, line: 38, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !343, line: 38, size: 32, elements: !348)
!348 = !{!349, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !347, file: !343, line: 39, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !343, line: 40, baseType: !350, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !343, line: 42, baseType: !353, size: 32, offset: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !343, line: 42, size: 32, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !353, file: !343, line: 43, baseType: !350, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !343, line: 44, baseType: !350, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !339, file: !333, line: 62, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !359, line: 49, size: 64, elements: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !358, file: !359, line: 50, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 64, elements: !364)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!364 = !{!365}
!365 = !DISubrange(count: 2)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !336, file: !333, line: 68, baseType: !367, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !369, line: 233, baseType: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 231, size: 64, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !370, file: !369, line: 232, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !343, line: 48, baseType: !344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !336, file: !333, line: 71, baseType: !218, size: 8, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !336, file: !333, line: 74, baseType: !218, size: 8, offset: 104)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !333, line: 90, baseType: !377, size: 16, offset: 112)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !333, line: 90, size: 16, elements: !378)
!378 = !{!379, !386}
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !333, line: 91, baseType: !380, size: 16)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !333, line: 91, size: 16, elements: !381)
!381 = !{!382, !385}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !380, file: !333, line: 96, baseType: !383, size: 8)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !384)
!384 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !380, file: !333, line: 97, baseType: !218, size: 8, offset: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !377, file: !333, line: 100, baseType: !151, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !336, file: !333, line: 107, baseType: !137, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !336, file: !333, line: 127, baseType: !102, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !336, file: !333, line: 131, baseType: !390, size: 192, offset: 192)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !369, line: 244, size: 192, elements: !391)
!391 = !{!392, !393, !399}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !390, file: !369, line: 245, baseType: !342, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !390, file: !369, line: 246, baseType: !394, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !369, line: 242, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !390, file: !369, line: 249, baseType: !184, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !332, file: !333, line: 250, baseType: !401, size: 288, offset: 384)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !402, line: 25, size: 288, elements: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !401, file: !402, line: 26, baseType: !137, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !401, file: !402, line: 27, baseType: !137, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !401, file: !402, line: 28, baseType: !137, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !401, file: !402, line: 29, baseType: !137, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !401, file: !402, line: 30, baseType: !137, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !401, file: !402, line: 31, baseType: !137, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !401, file: !402, line: 32, baseType: !137, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !401, file: !402, line: 33, baseType: !137, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !401, file: !402, line: 34, baseType: !137, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !332, file: !333, line: 253, baseType: !102, size: 32, offset: 672)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !332, file: !333, line: 256, baseType: !368, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !332, file: !333, line: 294, baseType: !103, size: 32, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !332, file: !333, line: 300, baseType: !417, size: 96, offset: 800)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !333, line: 149, size: 96, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !417, file: !333, line: 153, baseType: !22, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !417, file: !333, line: 162, baseType: !120, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !417, file: !333, line: 168, baseType: !120, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !332, file: !333, line: 325, baseType: !423, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !425, line: 5073, size: 160, elements: !426)
!425 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !{!427, !433, !434}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !424, file: !425, line: 5074, baseType: !428, size: 96)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !428, file: !113, line: 57, baseType: !116, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !428, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !428, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !424, file: !425, line: 5075, baseType: !368, size: 64, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !424, file: !425, line: 5076, baseType: !435, offset: 160)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !332, file: !333, line: 343, baseType: !437, size: 64, offset: 928)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !402, line: 60, size: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !437, file: !402, line: 63, baseType: !137, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !437, file: !402, line: 66, baseType: !137, size: 32, offset: 32)
!441 = !{!442, !443, !444, !445}
!442 = !DILocalVariable(name: "thread", arg: 1, scope: !327, file: !328, line: 175, type: !331)
!443 = !DILocalVariable(name: "region_num", scope: !327, file: !328, line: 200, type: !218)
!444 = !DILocalVariable(name: "guard_start", scope: !327, file: !328, line: 265, type: !22)
!445 = !DILocalVariable(name: "guard_size", scope: !327, file: !328, line: 266, type: !120)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 96, elements: !222)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !448, line: 52, size: 96, elements: !449)
!448 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !447, file: !448, line: 53, baseType: !22, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !448, line: 54, baseType: !120, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !447, file: !448, line: 55, baseType: !453, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !454, line: 151, baseType: !455)
!454 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 149, size: 32, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !455, file: !454, line: 150, baseType: !137, size: 32)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 96, elements: !222)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !462, file: !498, line: 39, type: !218, isLocal: true, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !464, globals: !497, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!464 = !{!465, !102, !103, !483, !218}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !467, line: 1226, baseType: !468)
!467 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 1213, size: 352, elements: !469)
!469 = !{!470, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !468, file: !467, line: 1215, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !468, file: !467, line: 1216, baseType: !472, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !468, file: !467, line: 1217, baseType: !472, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !468, file: !467, line: 1218, baseType: !472, size: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !468, file: !467, line: 1219, baseType: !472, size: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !468, file: !467, line: 1220, baseType: !472, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !468, file: !467, line: 1221, baseType: !472, size: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !468, file: !467, line: 1222, baseType: !472, size: 32, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !468, file: !467, line: 1223, baseType: !472, size: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !468, file: !467, line: 1224, baseType: !472, size: 32, offset: 288)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !468, file: !467, line: 1225, baseType: !472, size: 32, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !486, line: 27, size: 96, elements: !487)
!486 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!487 = !{!488, !489, !492}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !485, file: !486, line: 29, baseType: !137, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !486, line: 31, baseType: !490, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !485, file: !486, line: 37, baseType: !493, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !454, line: 146, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !454, line: 141, size: 32, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !494, file: !454, line: 143, baseType: !137, size: 32)
!497 = !{!460}
!498 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !501, file: !508, line: 21, type: !128, isLocal: true, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !503, globals: !507, splitDebugInlining: false, nameTableKind: None)
!502 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!503 = !{!504, !103, !102}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !506, line: 22, baseType: !103)
!506 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = !{!499}
!508 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !511, file: !516, line: 13, type: !533, isLocal: true, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !513, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!513 = !{!514, !509}
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "mpu_config", scope: !511, file: !516, line: 37, type: !517, isLocal: false, isDefinition: true)
!516 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !486, line: 41, size: 64, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !518, file: !486, line: 43, baseType: !137, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !518, file: !486, line: 45, baseType: !522, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !486, line: 27, size: 96, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !524, file: !486, line: 29, baseType: !137, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !486, line: 31, baseType: !490, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !524, file: !486, line: 37, baseType: !529, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !454, line: 146, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !454, line: 141, size: 32, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !530, file: !454, line: 143, baseType: !137, size: 32)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 192, elements: !364)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !536, file: !702, line: 93, type: !703, isLocal: true, isDefinition: true, align: 32)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !538, globals: !697, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!538 = !{!539, !218, !102, !103, !619, !137, !620, !656, !667}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !541, line: 1071, baseType: !542)
!541 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 1035, size: 19584, elements: !543)
!543 = !{!544, !548, !549, !550, !554, !555, !557, !558, !559, !560, !561, !562, !566, !567, !568, !572, !573, !577, !578, !582, !583, !587, !588, !589, !590, !591, !592, !593, !597, !598, !599, !600, !604, !605, !609}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !542, file: !541, line: 1036, baseType: !545, size: 960)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 960, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 30)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !542, file: !541, line: 1037, baseType: !472, size: 32, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !542, file: !541, line: 1038, baseType: !472, size: 32, offset: 992)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !542, file: !541, line: 1039, baseType: !551, size: 1088, offset: 1024)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1088, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 34)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !542, file: !541, line: 1040, baseType: !472, size: 32, offset: 2112)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !542, file: !541, line: 1041, baseType: !556, size: 64, offset: 2144)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 64, elements: !364)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !542, file: !541, line: 1042, baseType: !472, size: 32, offset: 2208)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !542, file: !541, line: 1043, baseType: !472, size: 32, offset: 2240)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !542, file: !541, line: 1044, baseType: !472, size: 32, offset: 2272)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !542, file: !541, line: 1045, baseType: !472, size: 32, offset: 2304)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !542, file: !541, line: 1046, baseType: !472, size: 32, offset: 2336)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !542, file: !541, line: 1047, baseType: !563, size: 3808, offset: 2368)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 3808, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 119)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !542, file: !541, line: 1048, baseType: !472, size: 32, offset: 6176)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !542, file: !541, line: 1049, baseType: !472, size: 32, offset: 6208)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !542, file: !541, line: 1050, baseType: !569, size: 1952, offset: 6240)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1952, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 61)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !542, file: !541, line: 1051, baseType: !472, size: 32, offset: 8192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !542, file: !541, line: 1052, baseType: !574, size: 288, offset: 8224)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 288, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 9)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !542, file: !541, line: 1053, baseType: !471, size: 32, offset: 8512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !542, file: !541, line: 1054, baseType: !579, size: 96, offset: 8544)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 96, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 3)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !542, file: !541, line: 1055, baseType: !471, size: 32, offset: 8640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !542, file: !541, line: 1056, baseType: !584, size: 1568, offset: 8672)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1568, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 49)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !542, file: !541, line: 1057, baseType: !472, size: 32, offset: 10240)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !542, file: !541, line: 1058, baseType: !579, size: 96, offset: 10272)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !542, file: !541, line: 1059, baseType: !472, size: 32, offset: 10368)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !542, file: !541, line: 1060, baseType: !556, size: 64, offset: 10400)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !542, file: !541, line: 1061, baseType: !472, size: 32, offset: 10464)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !542, file: !541, line: 1062, baseType: !472, size: 32, offset: 10496)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !542, file: !541, line: 1063, baseType: !594, size: 672, offset: 10528)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 672, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 21)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !542, file: !541, line: 1064, baseType: !472, size: 32, offset: 11200)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !542, file: !541, line: 1065, baseType: !471, size: 32, offset: 11232)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !542, file: !541, line: 1066, baseType: !472, size: 32, offset: 11264)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !542, file: !541, line: 1067, baseType: !601, size: 1504, offset: 11296)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1504, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 47)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !542, file: !541, line: 1068, baseType: !471, size: 32, offset: 12800)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !542, file: !541, line: 1069, baseType: !606, size: 5600, offset: 12832)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 5600, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 175)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !542, file: !541, line: 1070, baseType: !610, size: 1152, offset: 18432)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 1152, elements: !575)
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !541, line: 278, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 272, size: 128, elements: !614)
!614 = !{!615, !616, !617, !618}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !613, file: !541, line: 273, baseType: !472, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !613, file: !541, line: 274, baseType: !472, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !613, file: !541, line: 275, baseType: !472, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !613, file: !541, line: 277, baseType: !471, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !467, line: 468, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 445, size: 1120, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !649, !653, !655}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !622, file: !467, line: 447, baseType: !471, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !622, file: !467, line: 448, baseType: !472, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !622, file: !467, line: 449, baseType: !472, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !622, file: !467, line: 450, baseType: !472, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !622, file: !467, line: 451, baseType: !472, size: 32, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !622, file: !467, line: 452, baseType: !472, size: 32, offset: 160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !622, file: !467, line: 453, baseType: !631, size: 96, offset: 192)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 96, elements: !633)
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !218)
!633 = !{!634}
!634 = !DISubrange(count: 12)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !622, file: !467, line: 454, baseType: !472, size: 32, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !622, file: !467, line: 455, baseType: !472, size: 32, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !622, file: !467, line: 456, baseType: !472, size: 32, offset: 352)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !622, file: !467, line: 457, baseType: !472, size: 32, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !622, file: !467, line: 458, baseType: !472, size: 32, offset: 416)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !622, file: !467, line: 459, baseType: !472, size: 32, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !622, file: !467, line: 460, baseType: !472, size: 32, offset: 480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !622, file: !467, line: 461, baseType: !556, size: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !622, file: !467, line: 462, baseType: !471, size: 32, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !622, file: !467, line: 463, baseType: !471, size: 32, offset: 608)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !622, file: !467, line: 464, baseType: !646, size: 128, offset: 640)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 128, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 4)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !622, file: !467, line: 465, baseType: !650, size: 160, offset: 768)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 160, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 5)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !622, file: !467, line: 466, baseType: !654, size: 160, offset: 928)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !651)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !622, file: !467, line: 467, baseType: !472, size: 32, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !658, file: !657, line: 167, baseType: !666)
!657 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !657, file: !657, line: 134, type: !659, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !536, retainedNodes: !661)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !137}
!661 = !{!662, !663, !665}
!662 = !DILocalVariable(name: "time_us", arg: 1, scope: !658, file: !657, line: 134, type: !137)
!663 = !DILocalVariable(name: "delay_cycles", scope: !658, file: !657, line: 168, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!665 = !DILocalVariable(name: "cycles", scope: !658, file: !657, line: 171, type: !137)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !541, line: 2399, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 2373, size: 10880, elements: !670)
!670 = !{!671, !673, !674, !675, !676, !680, !681, !686, !687, !688, !689, !690, !691, !693, !694, !695, !696}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !669, file: !541, line: 2374, baseType: !672, size: 8192)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 8192, elements: !110)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !669, file: !541, line: 2375, baseType: !471, size: 32, offset: 8192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !669, file: !541, line: 2376, baseType: !471, size: 32, offset: 8224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !669, file: !541, line: 2377, baseType: !471, size: 32, offset: 8256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !669, file: !541, line: 2378, baseType: !677, size: 1984, offset: 8288)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1984, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 62)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !669, file: !541, line: 2379, baseType: !472, size: 32, offset: 10272)
!681 = !DIDerivedType(tag: DW_TAG_member, scope: !669, file: !541, line: 2381, baseType: !682, size: 32, offset: 10304)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !669, file: !541, line: 2381, size: 32, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !682, file: !541, line: 2382, baseType: !472, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !682, file: !541, line: 2383, baseType: !472, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !669, file: !541, line: 2386, baseType: !472, size: 32, offset: 10336)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !669, file: !541, line: 2387, baseType: !472, size: 32, offset: 10368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !669, file: !541, line: 2389, baseType: !472, size: 32, offset: 10400)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !669, file: !541, line: 2391, baseType: !472, size: 32, offset: 10432)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !669, file: !541, line: 2393, baseType: !472, size: 32, offset: 10464)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !669, file: !541, line: 2394, baseType: !692, size: 256, offset: 10496)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 256, elements: !159)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !669, file: !541, line: 2395, baseType: !472, size: 32, offset: 10752)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !669, file: !541, line: 2396, baseType: !471, size: 32, offset: 10784)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !669, file: !541, line: 2397, baseType: !472, size: 32, offset: 10816)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !669, file: !541, line: 2398, baseType: !472, size: 32, offset: 10848)
!697 = !{!534, !698}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !658, file: !657, line: 161, type: !700, isLocal: true, isDefinition: true, align: 128)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 48, elements: !580)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!702 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !705, line: 51, size: 64, elements: !706)
!705 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!706 = !{!707, !714}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !704, file: !705, line: 60, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DISubroutineType(types: !710)
!710 = !{!103, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !705, line: 48, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !704, file: !705, line: 65, baseType: !711, size: 32, offset: 32)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !717, file: !821, line: 36, type: !836, isLocal: true, isDefinition: true, align: 32)
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !731, globals: !817, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!719 = !{!720, !726}
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !721, line: 506, baseType: !32, size: 32, elements: !722)
!721 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!722 = !{!723, !724, !725}
!723 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!724 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!725 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !721, line: 512, baseType: !32, size: 32, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!729 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!730 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!731 = !{!732, !806, !811, !772, !726, !720, !816, !102}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !721, line: 523, size: 288, elements: !735)
!735 = !{!736, !762, !768, !773, !777, !778, !779, !783, !802}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !734, file: !721, line: 524, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DISubroutineType(types: !739)
!739 = !{!103, !740, !760, !761}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !743, line: 378, size: 192, elements: !744)
!743 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!744 = !{!745, !746, !747, !748, !755, !756}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !742, file: !743, line: 380, baseType: !490, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !742, file: !743, line: 382, baseType: !13, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !742, file: !743, line: 384, baseType: !13, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !742, file: !743, line: 386, baseType: !749, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !743, line: 351, size: 16, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !750, file: !743, line: 359, baseType: !218, size: 8)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !750, file: !743, line: 364, baseType: !754, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!754 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !742, file: !743, line: 388, baseType: !102, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !742, file: !743, line: 396, baseType: !757, size: 32, offset: 160)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !743, line: 43, baseType: !245)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !721, line: 237, baseType: !218)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !721, line: 257, baseType: !137)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !734, file: !721, line: 530, baseType: !763, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DISubroutineType(types: !765)
!765 = !{!103, !740, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !721, line: 229, baseType: !137)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !734, file: !721, line: 532, baseType: !769, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DISubroutineType(types: !771)
!771 = !{!103, !740, !772, !767}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !721, line: 216, baseType: !137)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !734, file: !721, line: 535, baseType: !774, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DISubroutineType(types: !776)
!776 = !{!103, !740, !772}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !734, file: !721, line: 537, baseType: !774, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !734, file: !721, line: 539, baseType: !774, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !734, file: !721, line: 541, baseType: !780, size: 32, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{!103, !740, !760, !720, !726}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !734, file: !721, line: 544, baseType: !784, size: 32, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DISubroutineType(types: !786)
!786 = !{!103, !740, !787, !754}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !721, line: 478, size: 96, elements: !789)
!789 = !{!790, !796, !801}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !788, file: !721, line: 482, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !793)
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !792, file: !192, line: 30, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !788, file: !721, line: 485, baseType: !797, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !721, line: 464, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !740, !787, !772}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !788, file: !721, line: 493, baseType: !772, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !734, file: !721, line: 547, baseType: !803, size: 32, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{!137, !740}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !721, line: 428, size: 32, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !808, file: !721, line: 434, baseType: !772, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !721, line: 441, size: 32, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !813, file: !721, line: 447, baseType: !772, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!817 = !{!715, !818, !834}
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "pull_up", scope: !820, file: !821, line: 15, type: !827, isLocal: true, isDefinition: true)
!820 = distinct !DISubprogram(name: "board_init", scope: !821, file: !821, line: 10, type: !822, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !717, retainedNodes: !824)
!821 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !DISubroutineType(types: !823)
!823 = !{!103, !740}
!824 = !{!825, !826}
!825 = !DILocalVariable(name: "dev", arg: 1, scope: !820, file: !821, line: 10, type: !740)
!826 = !DILocalVariable(name: "res", scope: !820, file: !821, line: 14, type: !103)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !721, line: 271, size: 64, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !828, file: !721, line: 273, baseType: !740, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !828, file: !721, line: 275, baseType: !760, size: 8, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !828, file: !721, line: 277, baseType: !833, size: 16, offset: 48)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !721, line: 249, baseType: !151)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "user_led", scope: !820, file: !821, line: 17, type: !827, isLocal: true, isDefinition: true)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !705, line: 51, size: 64, elements: !838)
!838 = !{!839, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !837, file: !705, line: 60, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !837, file: !705, line: 65, baseType: !740, size: 32, offset: 32)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__device_dts_ord_69", scope: !844, file: !1079, line: 733, type: !1180, isLocal: false, isDefinition: true, align: 32)
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !846, retainedTypes: !989, globals: !1075, splitDebugInlining: false, nameTableKind: None)
!845 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/basic/sys_heap")
!846 = !{!847, !853, !30, !858, !863, !870, !878, !886, !895, !899, !954, !961, !980}
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !848, line: 23, baseType: !32, size: 32, elements: !849)
!848 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!849 = !{!850, !851, !852}
!850 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!851 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!852 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!853 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !848, line: 48, baseType: !32, size: 32, elements: !854)
!854 = !{!855, !856, !857}
!855 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!856 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!857 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 167, baseType: !32, size: 32, elements: !860)
!859 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!860 = !{!861, !862}
!861 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!862 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 107, baseType: !32, size: 32, elements: !864)
!864 = !{!865, !866, !867, !868, !869}
!865 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!866 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!867 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!868 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!869 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 208, baseType: !32, size: 32, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877}
!872 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!873 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!874 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!875 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!876 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!877 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 261, baseType: !32, size: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885}
!880 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!881 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!882 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!883 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!884 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!885 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 237, baseType: !32, size: 32, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894}
!888 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!889 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!890 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!891 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!892 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!893 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!894 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 152, baseType: !32, size: 32, elements: !896)
!896 = !{!897, !898}
!897 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!898 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !541, line: 71, baseType: !103, size: 32, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!901 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!902 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!903 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!904 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!905 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!906 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!907 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!908 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!909 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!910 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!911 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!912 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!913 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!914 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!915 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!916 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!917 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!918 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!919 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!920 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!921 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!922 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!923 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!924 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!925 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!926 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!927 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!928 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!929 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!930 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!931 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!932 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!933 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!934 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!935 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!936 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!937 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!938 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!939 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!940 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!941 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!942 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!943 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!944 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!945 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!946 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!947 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!948 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!949 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!950 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!951 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!952 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!953 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!954 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !955, line: 44, baseType: !32, size: 32, elements: !956)
!955 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!956 = !{!957, !958, !959, !960}
!957 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!958 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!959 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!960 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !962, line: 54, baseType: !32, size: 32, elements: !963)
!962 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979}
!964 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!965 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!966 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!967 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!968 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!969 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!970 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!971 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!972 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!973 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!974 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!975 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!976 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!977 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!978 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!979 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !981, line: 53, baseType: !32, size: 32, elements: !982)
!981 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!982 = !{!983, !984, !985, !986, !987, !988}
!983 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!984 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!985 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!986 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!987 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!988 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!989 = !{!847, !102, !103, !990, !1039, !1040, !1041, !1042, !182, !137, !163, !754, !619, !1043, !258, !1044, !1074, !120}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !541, line: 1022, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 979, size: 11712, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1017, !1018, !1019, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !992, file: !541, line: 980, baseType: !472, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !992, file: !541, line: 981, baseType: !472, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !992, file: !541, line: 982, baseType: !472, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !992, file: !541, line: 983, baseType: !472, size: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !992, file: !541, line: 984, baseType: !472, size: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !992, file: !541, line: 985, baseType: !472, size: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !992, file: !541, line: 986, baseType: !472, size: 32, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !992, file: !541, line: 987, baseType: !1002, size: 1824, offset: 224)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1824, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 57)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !992, file: !541, line: 988, baseType: !472, size: 32, offset: 2048)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !992, file: !541, line: 989, baseType: !472, size: 32, offset: 2080)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !992, file: !541, line: 990, baseType: !471, size: 32, offset: 2112)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !992, file: !541, line: 991, baseType: !472, size: 32, offset: 2144)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !992, file: !541, line: 992, baseType: !472, size: 32, offset: 2176)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !992, file: !541, line: 993, baseType: !650, size: 160, offset: 2208)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !992, file: !541, line: 994, baseType: !472, size: 32, offset: 2368)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !992, file: !541, line: 996, baseType: !472, size: 32, offset: 2400)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !992, file: !541, line: 998, baseType: !1014, size: 3744, offset: 2432)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 3744, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 117)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !992, file: !541, line: 999, baseType: !472, size: 32, offset: 6176)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !992, file: !541, line: 1000, baseType: !472, size: 32, offset: 6208)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !992, file: !541, line: 1001, baseType: !1020, size: 2016, offset: 6240)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 2016, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 63)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !992, file: !541, line: 1002, baseType: !471, size: 32, offset: 8256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !992, file: !541, line: 1004, baseType: !471, size: 32, offset: 8288)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !992, file: !541, line: 1005, baseType: !471, size: 32, offset: 8320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !992, file: !541, line: 1006, baseType: !471, size: 32, offset: 8352)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !992, file: !541, line: 1008, baseType: !471, size: 32, offset: 8384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !992, file: !541, line: 1009, baseType: !471, size: 32, offset: 8416)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !992, file: !541, line: 1011, baseType: !677, size: 1984, offset: 8448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !992, file: !541, line: 1012, baseType: !472, size: 32, offset: 10432)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !992, file: !541, line: 1013, baseType: !579, size: 96, offset: 10464)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !992, file: !541, line: 1014, baseType: !472, size: 32, offset: 10560)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !992, file: !541, line: 1016, baseType: !579, size: 96, offset: 10592)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !992, file: !541, line: 1017, baseType: !472, size: 32, offset: 10688)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !992, file: !541, line: 1018, baseType: !692, size: 256, offset: 10720)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !992, file: !541, line: 1019, baseType: !472, size: 32, offset: 10976)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !992, file: !541, line: 1020, baseType: !594, size: 672, offset: 11008)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !992, file: !541, line: 1021, baseType: !472, size: 32, offset: 11680)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !859, line: 146, baseType: !863)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !859, line: 164, baseType: !895)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !467, line: 426, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 411, size: 28704, elements: !1047)
!1047 = !{!1048, !1050, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1065, !1069, !1073}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1046, file: !467, line: 413, baseType: !1049, size: 256)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 256, elements: !159)
