; ModuleID = 'build/actinius_icarus/backup_sram/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "backup_value", scope: !27, file: !105, line: 11, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "_char_out", scope: !109, file: !112, line: 54, type: !113, isLocal: false, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !110, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!110 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!111 = !{!107}
!112 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DISubroutineType(types: !115)
!115 = !{!103, !103}
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !118, file: !179, line: 65, type: !180, isLocal: true, isDefinition: true, align: 32)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !120, globals: !172, splitDebugInlining: false, nameTableKind: None)
!119 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!120 = !{!102, !103, !121, !106, !132}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !123, file: !122, line: 167, baseType: !131)
!122 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !122, file: !122, line: 134, type: !124, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !118, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !106}
!126 = !{!127, !128, !130}
!127 = !DILocalVariable(name: "time_us", arg: 1, scope: !123, file: !122, line: 134, type: !106)
!128 = !DILocalVariable(name: "delay_cycles", scope: !123, file: !122, line: 168, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!130 = !DILocalVariable(name: "cycles", scope: !123, file: !122, line: 171, type: !106)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !134, line: 1928, baseType: !135)
!134 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 1909, size: 11360, elements: !136)
!136 = !{!137, !143, !144, !145, !146, !150, !151, !152, !153, !157, !158, !162, !163, !164, !165, !166, !170, !171}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !135, file: !134, line: 1910, baseType: !138, size: 8192)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8192, elements: !141)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !106)
!141 = !{!142}
!142 = !DISubrange(count: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !135, file: !134, line: 1911, baseType: !139, size: 32, offset: 8192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !135, file: !134, line: 1912, baseType: !139, size: 32, offset: 8224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !135, file: !134, line: 1913, baseType: !139, size: 32, offset: 8256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !135, file: !134, line: 1914, baseType: !147, size: 1984, offset: 8288)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 1984, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 62)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !135, file: !134, line: 1915, baseType: !140, size: 32, offset: 10272)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !135, file: !134, line: 1916, baseType: !139, size: 32, offset: 10304)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !135, file: !134, line: 1917, baseType: !140, size: 32, offset: 10336)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !135, file: !134, line: 1918, baseType: !154, size: 96, offset: 10368)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 96, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 3)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !135, file: !134, line: 1919, baseType: !140, size: 32, offset: 10464)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !135, file: !134, line: 1920, baseType: !159, size: 256, offset: 10496)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 8)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !135, file: !134, line: 1921, baseType: !140, size: 32, offset: 10752)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !135, file: !134, line: 1922, baseType: !139, size: 32, offset: 10784)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !135, file: !134, line: 1923, baseType: !140, size: 32, offset: 10816)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !135, file: !134, line: 1924, baseType: !140, size: 32, offset: 10848)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !135, file: !134, line: 1925, baseType: !167, size: 416, offset: 10880)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 416, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 13)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !135, file: !134, line: 1926, baseType: !140, size: 32, offset: 11296)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !135, file: !134, line: 1927, baseType: !140, size: 32, offset: 11328)
!172 = !{!116, !173}
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !123, file: !122, line: 161, type: !175, isLocal: true, isDefinition: true, align: 128)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 48, elements: !155)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !178)
!178 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!179 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !182, line: 51, size: 64, elements: !183)
!182 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !181, file: !182, line: 60, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{!103, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !182, line: 48, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !181, file: !182, line: 65, baseType: !188, size: 32, offset: 32)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !194, file: !236, line: 27, type: !265, isLocal: true, isDefinition: true)
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !196, retainedTypes: !208, globals: !233, splitDebugInlining: false, nameTableKind: None)
!195 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!196 = !{!197, !30}
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !198, line: 27, baseType: !32, size: 32, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207}
!200 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!201 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!202 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!203 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!204 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!205 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!206 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!207 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!208 = !{!102, !209, !103, !24, !213, !229, !106, !231}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !210, line: 46, baseType: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !212)
!212 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !215, line: 54, size: 96, elements: !216)
!215 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!216 = !{!217, !224, !228}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !214, file: !215, line: 55, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !219, line: 33, baseType: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !219, line: 29, size: 32, elements: !221)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !219, line: 30, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !214, file: !215, line: 60, baseType: !225, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !197}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !214, file: !215, line: 65, baseType: !225, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !232)
!232 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!233 = !{!192, !234, !240, !242, !255, !257}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !194, file: !236, line: 44, type: !237, isLocal: true, isDefinition: true)
!236 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !238, line: 43, elements: !239)
!238 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!239 = !{}
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !194, file: !236, line: 49, type: !237, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !194, file: !236, line: 36, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 128, elements: !253)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !198, line: 114, size: 128, elements: !246)
!246 = !{!247, !248, !251, !252}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !245, file: !198, line: 115, baseType: !197, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !245, file: !198, line: 141, baseType: !249, size: 8, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !250)
!250 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !245, file: !198, line: 149, baseType: !106, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !245, file: !198, line: 156, baseType: !106, size: 32, offset: 96)
!253 = !{!254}
!254 = !DISubrange(count: 1)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !194, file: !236, line: 40, type: !244, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !194, file: !236, line: 28, type: !259, isLocal: true, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !219, line: 40, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !219, line: 35, size: 64, elements: !261)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !260, file: !219, line: 36, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !260, file: !219, line: 37, baseType: !263, size: 32, offset: 32)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 32, elements: !253)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !267, line: 22, baseType: !268)
!267 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!269 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!270 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !273, file: !304, line: 50, type: !291, isLocal: true, isDefinition: true)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !196, retainedTypes: !275, globals: !301, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!275 = !{!276, !209, !278, !103, !102, !106, !231, !280, !229, !291, !292}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !277)
!277 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !279, line: 214, baseType: !32)
!279 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !282, line: 45, size: 64, elements: !283)
!282 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !{!284, !290}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !281, file: !282, line: 46, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !219, line: 33, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !219, line: 29, size: 32, elements: !287)
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !219, line: 30, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !281, file: !282, line: 48, baseType: !106, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !282, line: 38, size: 64, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !293, file: !282, line: 39, baseType: !285, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !293, file: !282, line: 41, baseType: !297, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !282, line: 35, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !291}
!301 = !{!302, !306, !314, !271, !316, !326}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "latency_lock", scope: !273, file: !304, line: 44, type: !305, isLocal: true, isDefinition: true)
!304 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !238, line: 43, elements: !239)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !273, file: !304, line: 46, type: !308, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !219, line: 40, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !219, line: 35, size: 64, elements: !310)
!310 = !{!311, !313}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !309, file: !219, line: 36, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !309, file: !219, line: 37, baseType: !312, size: 32, offset: 32)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "latency_subs", scope: !273, file: !304, line: 52, type: !308, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !273, file: !304, line: 39, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, elements: !324)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 35, size: 96, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !319, file: !304, line: 36, baseType: !197, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !319, file: !304, line: 37, baseType: !249, size: 8, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !319, file: !304, line: 38, baseType: !266, size: 32, offset: 64)
!324 = !{!325}
!325 = !DISubrange(count: 0)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !273, file: !304, line: 48, type: !291, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !330, file: !337, line: 47, type: !351, isLocal: true, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !332, retainedTypes: !333, globals: !334, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!332 = !{!197}
!333 = !{!278, !103}
!334 = !{!335, !328, !347}
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "cpus_states", scope: !330, file: !337, line: 50, type: !338, isLocal: true, isDefinition: true)
!337 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 32, elements: !253)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !198, line: 114, size: 128, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !341, file: !198, line: 115, baseType: !197, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !341, file: !198, line: 141, baseType: !249, size: 8, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !341, file: !198, line: 149, baseType: !106, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !341, file: !198, line: 156, baseType: !106, size: 32, offset: 96)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !330, file: !337, line: 55, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 8, elements: !253)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, elements: !324)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "static_regions", scope: !354, file: !361, line: 62, type: !493, isLocal: true, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !356, globals: !357, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!356 = !{!278, !103, !106, !102}
!357 = !{!358, !352}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !360, file: !361, line: 198, type: !480, isLocal: true, isDefinition: true)
!360 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !361, file: !361, line: 175, type: !362, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !354, retainedNodes: !477)
!361 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!362 = !DISubroutineType(types: !363)
!363 = !{null, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !366, line: 245, size: 1024, elements: !367)
!366 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!367 = !{!368, !433, !446, !447, !448, !449, !455, !472}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !365, file: !366, line: 247, baseType: !369, size: 384)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !366, line: 57, size: 384, elements: !370)
!370 = !{!371, !399, !407, !408, !409, !420, !421, !422}
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !366, line: 60, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !366, line: 60, size: 64, elements: !373)
!373 = !{!374, !390}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !372, file: !366, line: 61, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !376, line: 49, baseType: !377)
!376 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !376, line: 37, size: 64, elements: !378)
!378 = !{!379, !385}
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !376, line: 38, baseType: !380, size: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !377, file: !376, line: 38, size: 32, elements: !381)
!381 = !{!382, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !380, file: !376, line: 39, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !376, line: 40, baseType: !383, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !376, line: 42, baseType: !386, size: 32, offset: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !377, file: !376, line: 42, size: 32, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !386, file: !376, line: 43, baseType: !383, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !386, file: !376, line: 44, baseType: !383, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !372, file: !366, line: 62, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !392, line: 49, size: 64, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !391, file: !392, line: 50, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 64, elements: !397)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!397 = !{!398}
!398 = !DISubrange(count: 2)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !369, file: !366, line: 68, baseType: !400, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !402, line: 233, baseType: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 231, size: 64, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !403, file: !402, line: 232, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !376, line: 48, baseType: !377)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !369, file: !366, line: 71, baseType: !249, size: 8, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !369, file: !366, line: 74, baseType: !249, size: 8, offset: 104)
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !366, line: 90, baseType: !410, size: 16, offset: 112)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !366, line: 90, size: 16, elements: !411)
!411 = !{!412, !419}
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !410, file: !366, line: 91, baseType: !413, size: 16)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !366, line: 91, size: 16, elements: !414)
!414 = !{!415, !418}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !413, file: !366, line: 96, baseType: !416, size: 8)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !417)
!417 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !413, file: !366, line: 97, baseType: !249, size: 8, offset: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !410, file: !366, line: 100, baseType: !177, size: 16)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !369, file: !366, line: 107, baseType: !106, size: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !369, file: !366, line: 127, baseType: !102, size: 32, offset: 160)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !369, file: !366, line: 131, baseType: !423, size: 192, offset: 192)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !402, line: 244, size: 192, elements: !424)
!424 = !{!425, !426, !432}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !423, file: !402, line: 245, baseType: !375, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !423, file: !402, line: 246, baseType: !427, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !402, line: 242, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !423, file: !402, line: 249, baseType: !211, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !365, file: !366, line: 250, baseType: !434, size: 288, offset: 384)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !435, line: 25, size: 288, elements: !436)
!435 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !434, file: !435, line: 26, baseType: !106, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !434, file: !435, line: 27, baseType: !106, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !434, file: !435, line: 28, baseType: !106, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !434, file: !435, line: 29, baseType: !106, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !434, file: !435, line: 30, baseType: !106, size: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !434, file: !435, line: 31, baseType: !106, size: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !434, file: !435, line: 32, baseType: !106, size: 32, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !434, file: !435, line: 33, baseType: !106, size: 32, offset: 224)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !434, file: !435, line: 34, baseType: !106, size: 32, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !365, file: !366, line: 253, baseType: !102, size: 32, offset: 672)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !365, file: !366, line: 256, baseType: !401, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !365, file: !366, line: 294, baseType: !103, size: 32, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !365, file: !366, line: 300, baseType: !450, size: 96, offset: 800)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !366, line: 149, size: 96, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !450, file: !366, line: 153, baseType: !22, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !450, file: !366, line: 162, baseType: !278, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !450, file: !366, line: 168, baseType: !278, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !365, file: !366, line: 325, baseType: !456, size: 32, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !458, line: 5073, size: 160, elements: !459)
!458 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!459 = !{!460, !469, !470}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !457, file: !458, line: 5074, baseType: !461, size: 96)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !462, line: 56, size: 96, elements: !463)
!462 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{!464, !467, !468}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !461, file: !462, line: 57, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !462, line: 57, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !461, file: !462, line: 58, baseType: !102, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !461, file: !462, line: 59, baseType: !278, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !457, file: !458, line: 5075, baseType: !401, size: 64, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !457, file: !458, line: 5076, baseType: !471, offset: 160)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !238, line: 43, elements: !239)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !365, file: !366, line: 343, baseType: !473, size: 64, offset: 928)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !435, line: 60, size: 64, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !473, file: !435, line: 63, baseType: !106, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !473, file: !435, line: 66, baseType: !106, size: 32, offset: 32)
!477 = !{!478, !479}
!478 = !DILocalVariable(name: "thread", arg: 1, scope: !360, file: !361, line: 175, type: !364)
!479 = !DILocalVariable(name: "region_num", scope: !360, file: !361, line: 200, type: !249)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, elements: !324)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !482, line: 52, size: 96, elements: !483)
!482 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !481, file: !482, line: 53, baseType: !22, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !481, file: !482, line: 54, baseType: !278, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !481, file: !482, line: 55, baseType: !487, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !488, line: 304, baseType: !489)
!488 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 301, size: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !489, file: !488, line: 302, baseType: !177, size: 16)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !489, file: !488, line: 303, baseType: !177, size: 16, offset: 16)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 96, elements: !253)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !497, file: !553, line: 39, type: !249, isLocal: true, isDefinition: true)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !499, globals: !544, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!499 = !{!500, !102, !103, !528}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !502, line: 1495, baseType: !503)
!502 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !502, line: 1474, size: 448, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !518}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !503, file: !502, line: 1476, baseType: !139, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !503, file: !502, line: 1477, baseType: !140, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !503, file: !502, line: 1478, baseType: !140, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !503, file: !502, line: 1479, baseType: !140, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !503, file: !502, line: 1480, baseType: !140, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !503, file: !502, line: 1481, baseType: !140, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !503, file: !502, line: 1482, baseType: !140, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !503, file: !502, line: 1483, baseType: !140, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !503, file: !502, line: 1484, baseType: !140, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !503, file: !502, line: 1485, baseType: !140, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !503, file: !502, line: 1486, baseType: !140, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !503, file: !502, line: 1487, baseType: !517, size: 32, offset: 352)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !253)
!518 = !DIDerivedType(tag: DW_TAG_member, scope: !503, file: !502, line: 1488, baseType: !519, size: 64, offset: 384)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !503, file: !502, line: 1488, size: 64, elements: !520)
!520 = !{!521, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !519, file: !502, line: 1489, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !397)
!523 = !DIDerivedType(tag: DW_TAG_member, scope: !519, file: !502, line: 1490, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !502, line: 1490, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !524, file: !502, line: 1491, baseType: !140, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !524, file: !502, line: 1492, baseType: !140, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !531, line: 27, size: 128, elements: !532)
!531 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!532 = !{!533, !534, !537}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !530, file: !531, line: 29, baseType: !106, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !531, line: 31, baseType: !535, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !530, file: !531, line: 37, baseType: !538, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !488, line: 298, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !488, line: 289, size: 64, elements: !540)
!540 = !{!541, !542, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !539, file: !488, line: 291, baseType: !249, size: 5, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !539, file: !488, line: 293, baseType: !249, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !539, file: !488, line: 295, baseType: !106, size: 32, offset: 32)
!544 = !{!495, !545}
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !497, file: !547, line: 31, type: !548, isLocal: true, isDefinition: true)
!547 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 160, elements: !253)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !547, line: 21, size: 160, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !549, file: !547, line: 22, baseType: !103, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !549, file: !547, line: 23, baseType: !530, size: 128, offset: 32)
!553 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !556, file: !563, line: 21, type: !113, isLocal: true, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !558, globals: !562, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!558 = !{!559, !103, !102}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !561, line: 22, baseType: !103)
!561 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!562 = !{!554}
!563 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !566, file: !571, line: 13, type: !590, isLocal: true, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !568, splitDebugInlining: false, nameTableKind: None)
!567 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!568 = !{!569, !564}
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "mpu_config", scope: !566, file: !571, line: 37, type: !572, isLocal: false, isDefinition: true)
!571 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !531, line: 41, size: 64, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !573, file: !531, line: 43, baseType: !106, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !573, file: !531, line: 45, baseType: !577, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !531, line: 27, size: 128, elements: !580)
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !579, file: !531, line: 29, baseType: !106, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !531, line: 31, baseType: !535, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !579, file: !531, line: 37, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !488, line: 298, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !488, line: 289, size: 64, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !585, file: !488, line: 291, baseType: !249, size: 5, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !585, file: !488, line: 293, baseType: !249, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !585, file: !488, line: 295, baseType: !106, size: 32, offset: 32)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 256, elements: !397)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "__device_dts_ord_65", scope: !593, file: !798, line: 733, type: !904, isLocal: false, isDefinition: true, align: 32)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !595, retainedTypes: !713, globals: !794, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!595 = !{!596, !602, !30, !607, !612, !616, !620, !624, !630, !634, !678, !685, !704}
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !597, line: 23, baseType: !32, size: 32, elements: !598)
!597 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = !{!599, !600, !601}
!599 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!600 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!601 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !597, line: 48, baseType: !32, size: 32, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!605 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!606 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!607 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 167, baseType: !32, size: 32, elements: !609)
!608 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!609 = !{!610, !611}
!610 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!611 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 107, baseType: !32, size: 32, elements: !613)
!613 = !{!614, !615}
!614 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!615 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!616 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 208, baseType: !32, size: 32, elements: !617)
!617 = !{!618, !619}
!618 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!619 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 261, baseType: !32, size: 32, elements: !621)
!621 = !{!622, !623}
!622 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!623 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 237, baseType: !32, size: 32, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!627 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!628 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!629 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 152, baseType: !32, size: 32, elements: !631)
!631 = !{!632, !633}
!632 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!633 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!634 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 71, baseType: !103, size: 32, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!636 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!637 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!638 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!639 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!640 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!641 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!642 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!643 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!644 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!645 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!646 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!647 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!648 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!649 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!650 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!651 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!652 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!653 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!654 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!655 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!656 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!657 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!658 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!659 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!660 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!661 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!662 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!663 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!664 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!665 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!666 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!667 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!668 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!669 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!670 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!671 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!672 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!673 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!674 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!675 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!676 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!677 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !679, line: 44, baseType: !32, size: 32, elements: !680)
!679 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!680 = !{!681, !682, !683, !684}
!681 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!682 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!683 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!684 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !686, line: 54, baseType: !32, size: 32, elements: !687)
!686 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!688 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!689 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!690 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!691 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!692 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!693 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!694 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!695 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!696 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!697 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!698 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!699 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!700 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!701 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!702 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!703 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !705, line: 53, baseType: !32, size: 32, elements: !706)
!705 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!706 = !{!707, !708, !709, !710, !711, !712}
!707 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!708 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!709 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!710 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!711 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!712 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!713 = !{!596, !102, !103, !714, !756, !757, !758, !759, !209, !106, !231, !760, !761, !762, !291, !763, !793, !278}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !134, line: 923, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 883, size: 10464, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !726, !727, !728, !729, !730, !731, !732, !733, !737, !738, !739, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !716, file: !134, line: 884, baseType: !140, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !716, file: !134, line: 885, baseType: !140, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !716, file: !134, line: 886, baseType: !140, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !716, file: !134, line: 887, baseType: !140, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !716, file: !134, line: 888, baseType: !723, size: 896, offset: 128)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 896, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 28)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !716, file: !134, line: 889, baseType: !140, size: 32, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !716, file: !134, line: 890, baseType: !140, size: 32, offset: 1056)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !716, file: !134, line: 891, baseType: !140, size: 32, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !716, file: !134, line: 892, baseType: !140, size: 32, offset: 1120)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !716, file: !134, line: 893, baseType: !723, size: 896, offset: 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !716, file: !134, line: 894, baseType: !140, size: 32, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !716, file: !134, line: 895, baseType: !140, size: 32, offset: 2080)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !716, file: !134, line: 896, baseType: !734, size: 960, offset: 2112)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 960, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 30)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !716, file: !134, line: 897, baseType: !140, size: 32, offset: 3072)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !716, file: !134, line: 898, baseType: !140, size: 32, offset: 3104)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !716, file: !134, line: 899, baseType: !740, size: 3008, offset: 3136)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 3008, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 94)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !716, file: !134, line: 900, baseType: !140, size: 32, offset: 6144)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !716, file: !134, line: 901, baseType: !140, size: 32, offset: 6176)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !716, file: !134, line: 902, baseType: !140, size: 32, offset: 6208)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !716, file: !134, line: 903, baseType: !139, size: 32, offset: 6240)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !716, file: !134, line: 904, baseType: !147, size: 1984, offset: 6272)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !716, file: !134, line: 905, baseType: !139, size: 32, offset: 8256)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !716, file: !134, line: 907, baseType: !139, size: 32, offset: 8288)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !716, file: !134, line: 910, baseType: !139, size: 32, offset: 8320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !716, file: !134, line: 911, baseType: !139, size: 32, offset: 8352)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !716, file: !134, line: 913, baseType: !139, size: 32, offset: 8384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !716, file: !134, line: 917, baseType: !139, size: 32, offset: 8416)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !716, file: !134, line: 919, baseType: !147, size: 1984, offset: 8448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !716, file: !134, line: 920, baseType: !140, size: 32, offset: 10432)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !608, line: 146, baseType: !612)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !608, line: 164, baseType: !630)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!760 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !502, line: 485, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !502, line: 468, size: 28704, elements: !766)
!766 = !{!767, !771, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !788, !792}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !765, file: !502, line: 470, baseType: !768, size: 512)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 512, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 16)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !765, file: !502, line: 471, baseType: !772, size: 512, offset: 512)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 512, elements: !769)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !765, file: !502, line: 472, baseType: !768, size: 512, offset: 1024)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !765, file: !502, line: 473, baseType: !772, size: 512, offset: 1536)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !765, file: !502, line: 474, baseType: !768, size: 512, offset: 2048)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !765, file: !502, line: 475, baseType: !772, size: 512, offset: 2560)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !765, file: !502, line: 476, baseType: !768, size: 512, offset: 3072)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !765, file: !502, line: 477, baseType: !772, size: 512, offset: 3584)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !765, file: !502, line: 478, baseType: !768, size: 512, offset: 4096)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !765, file: !502, line: 479, baseType: !772, size: 512, offset: 4608)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !765, file: !502, line: 480, baseType: !768, size: 512, offset: 5120)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !765, file: !502, line: 481, baseType: !772, size: 512, offset: 5632)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !765, file: !502, line: 482, baseType: !784, size: 3968, offset: 6144)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 3968, elements: !786)
!785 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !249)
!786 = !{!787}
!787 = !DISubrange(count: 496)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !765, file: !502, line: 483, baseType: !789, size: 18560, offset: 10112)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 18560, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 580)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !765, file: !502, line: 484, baseType: !140, size: 32, offset: 28672)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !679, line: 56, baseType: !102)
!794 = !{!795, !845, !886, !591, !894, !920, !922, !939, !941, !951, !954, !969, !1007, !1021}
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "on", scope: !797, file: !798, line: 549, type: !266, isLocal: true, isDefinition: true)
!797 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !798, file: !798, line: 547, type: !799, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !593, retainedNodes: !801)
!798 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = !DISubroutineType(types: !800)
!800 = !{null, !602}
!801 = !{!802, !803, !806}
!802 = !DILocalVariable(name: "start_mode", arg: 1, scope: !797, file: !798, line: 547, type: !602)
!803 = !DILocalVariable(name: "err", scope: !804, file: !798, line: 553, type: !103)
!804 = distinct !DILexicalBlock(scope: !805, file: !798, line: 552, column: 31)
!805 = distinct !DILexicalBlock(scope: !797, file: !798, line: 552, column: 6)
!806 = !DILocalVariable(name: "mgr", scope: !804, file: !798, line: 554, type: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !809, line: 154, size: 224, elements: !810)
!809 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!810 = !{!811, !823, !824, !840, !842, !843, !844}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !808, file: !809, line: 158, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !219, line: 40, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !219, line: 35, size: 64, elements: !814)
!814 = !{!815, !822}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !813, file: !219, line: 36, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !219, line: 33, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !219, line: 29, size: 32, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !219, line: 30, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !813, file: !219, line: 37, baseType: !816, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !808, file: !809, line: 163, baseType: !812, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !808, file: !809, line: 166, baseType: !825, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !809, line: 133, size: 96, elements: !828)
!828 = !{!829, !838, !839}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !827, file: !809, line: 135, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !809, line: 129, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !807, !834}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !809, line: 101, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !807, !103}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !827, file: !809, line: 138, baseType: !830, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !827, file: !809, line: 143, baseType: !830, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !808, file: !809, line: 169, baseType: !841, offset: 160)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !238, line: 43, elements: !239)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !808, file: !809, line: 172, baseType: !103, size: 32, offset: 160)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !808, file: !809, line: 175, baseType: !177, size: 16, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !808, file: !809, line: 178, baseType: !177, size: 16, offset: 208)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "cli", scope: !797, file: !798, line: 550, type: !847, isLocal: true, isDefinition: true)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !809, line: 273, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !847, file: !809, line: 280, baseType: !817, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !847, file: !809, line: 283, baseType: !851, size: 96, offset: 32)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !852, line: 138, size: 96, elements: !853)
!852 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !{!854, !883, !884}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !851, file: !852, line: 149, baseType: !855, size: 32)
!855 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !852, line: 139, size: 32, elements: !856)
!856 = !{!857, !878}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !855, file: !852, line: 145, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !458, line: 5397, size: 128, elements: !860)
!860 = !{!861, !876, !877}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !859, file: !458, line: 5399, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !376, line: 48, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !376, line: 37, size: 64, elements: !864)
!864 = !{!865, !871}
!865 = !DIDerivedType(tag: DW_TAG_member, scope: !863, file: !376, line: 38, baseType: !866, size: 32)
!866 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !863, file: !376, line: 38, size: 32, elements: !867)
!867 = !{!868, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !866, file: !376, line: 39, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !866, file: !376, line: 40, baseType: !869, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, scope: !863, file: !376, line: 42, baseType: !872, size: 32, offset: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !863, file: !376, line: 42, size: 32, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !872, file: !376, line: 43, baseType: !869, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !872, file: !376, line: 44, baseType: !869, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !859, file: !458, line: 5405, baseType: !32, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !859, file: !458, line: 5408, baseType: !103, size: 32, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !855, file: !852, line: 148, baseType: !879, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !852, line: 98, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DISubroutineType(types: !882)
!882 = !{null, null}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !851, file: !852, line: 165, baseType: !140, size: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !851, file: !852, line: 174, baseType: !885, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !593, file: !798, line: 733, type: !888, isLocal: false, isDefinition: true, align: 16)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 80, elements: !892)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !891, line: 43, baseType: !276)
!891 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!892 = !{!893}
!893 = !DISubrange(count: 5)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_65", scope: !593, file: !798, line: 733, type: !896, isLocal: true, isDefinition: true, align: 32)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !182, line: 51, size: 64, elements: !898)
!898 = !{!899, !919}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !897, file: !182, line: 60, baseType: !900, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DISubroutineType(types: !902)
!902 = !{!103, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !891, line: 378, size: 192, elements: !906)
!906 = !{!907, !908, !909, !910, !916, !917}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !905, file: !891, line: 380, baseType: !535, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !905, file: !891, line: 382, baseType: !13, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !905, file: !891, line: 384, baseType: !13, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !905, file: !891, line: 386, baseType: !911, size: 32, offset: 96)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !891, line: 351, size: 16, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !912, file: !891, line: 359, baseType: !249, size: 8)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !912, file: !891, line: 364, baseType: !760, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !905, file: !891, line: 388, baseType: !102, size: 32, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !905, file: !891, line: 396, baseType: !918, size: 32, offset: 160)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !897, file: !182, line: 65, baseType: !903, size: 32, offset: 32)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !593, file: !798, line: 79, type: !266, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "data", scope: !593, file: !798, line: 702, type: !924, isLocal: true, isDefinition: true)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !798, line: 69, size: 640, elements: !925)
!925 = !{!926, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !924, file: !798, line: 70, baseType: !927, size: 448)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 448, elements: !397)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !924, file: !798, line: 71, baseType: !929, size: 192, offset: 448)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 192, elements: !397)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !798, line: 52, size: 96, elements: !931)
!931 = !{!932, !937, !938}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !930, file: !798, line: 53, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !679, line: 72, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !903, !793, !102}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !930, file: !798, line: 54, baseType: !102, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !930, file: !798, line: 55, baseType: !106, size: 32, offset: 64)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_65", scope: !593, file: !798, line: 733, type: !912, isLocal: true, isDefinition: true, align: 8)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "d", scope: !943, file: !798, line: 476, type: !949, isLocal: true, isDefinition: true)
!943 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !798, file: !798, line: 474, type: !799, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !593, retainedNodes: !944)
!944 = !{!945, !946, !947, !948}
!945 = !DILocalVariable(name: "mode", arg: 1, scope: !943, file: !798, line: 474, type: !602)
!946 = !DILocalVariable(name: "type", scope: !943, file: !798, line: 486, type: !756)
!947 = !DILocalVariable(name: "isr_mode", scope: !943, file: !798, line: 500, type: !760)
!948 = !DILocalVariable(name: "key", scope: !943, file: !798, line: 501, type: !103)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !608, line: 177, baseType: !607)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "target_type", scope: !943, file: !798, line: 477, type: !953, isLocal: true, isDefinition: true)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "config", scope: !593, file: !798, line: 704, type: !956, isLocal: true, isDefinition: true)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !798, line: 74, size: 128, elements: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !957, file: !798, line: 76, baseType: !960, size: 128)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 128, elements: !397)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !798, line: 61, size: 64, elements: !962)
!962 = !{!963, !968}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !961, file: !798, line: 62, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !798, line: 58, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{null}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !961, file: !798, line: 63, baseType: !964, size: 32, offset: 32)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !593, file: !798, line: 695, type: !971, isLocal: true, isDefinition: true)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !679, line: 100, size: 224, elements: !973)
!973 = !{!974, !979, !980, !985, !991, !996, !1002}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !972, file: !679, line: 101, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !679, line: 76, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DISubroutineType(types: !978)
!978 = !{!103, !903, !793}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !972, file: !679, line: 102, baseType: !975, size: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !972, file: !679, line: 103, baseType: !981, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !679, line: 83, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{!103, !903, !793, !933, !102}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !972, file: !679, line: 104, baseType: !986, size: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !679, line: 79, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DISubroutineType(types: !989)
!989 = !{!103, !903, !793, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !972, file: !679, line: 105, baseType: !992, size: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !679, line: 88, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DISubroutineType(types: !995)
!995 = !{!678, !903, !793}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !972, file: !679, line: 106, baseType: !997, size: 32, offset: 160)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !679, line: 92, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!103, !903, !793, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !679, line: 64, baseType: !102)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !972, file: !679, line: 107, baseType: !1003, size: 32, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !679, line: 96, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!103, !903, !793, !102}
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "transitions", scope: !1009, file: !798, line: 655, type: !826, isLocal: true, isDefinition: true)
!1009 = distinct !DISubprogram(name: "clk_init", scope: !798, file: !798, line: 651, type: !901, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !593, retainedNodes: !1010)
!1010 = !{!1011, !1012, !1014, !1015, !1017}
!1011 = !DILocalVariable(name: "dev", arg: 1, scope: !1009, file: !798, line: 651, type: !903)
!1012 = !DILocalVariable(name: "nrfx_err", scope: !1009, file: !798, line: 653, type: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !686, line: 72, baseType: !685)
!1014 = !DILocalVariable(name: "err", scope: !1009, file: !798, line: 654, type: !103)
!1015 = !DILocalVariable(name: "i", scope: !1016, file: !798, line: 678, type: !596)
!1016 = distinct !DILexicalBlock(scope: !1009, file: !798, line: 678, column: 2)
!1017 = !DILocalVariable(name: "subdata", scope: !1018, file: !798, line: 680, type: !1020)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !798, line: 679, column: 42)
!1019 = distinct !DILexicalBlock(scope: !1016, file: !798, line: 678, column: 2)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !1009, file: !798, line: 660, type: !1023, isLocal: true, isDefinition: true, align: 32)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1023, file: !10, line: 55, baseType: !291, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !10, line: 57, baseType: !291, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1023, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1023, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !1031, file: !1036, line: 7, type: !1037, isLocal: false, isDefinition: true, align: 16)
!1031 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1032, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1033, splitDebugInlining: false, nameTableKind: None)
!1032 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!1033 = !{!1029, !1034, !1038, !1040}
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_4", scope: !1031, file: !1036, line: 12, type: !1037, isLocal: false, isDefinition: true, align: 16)
!1036 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/backup_sram")
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 48, elements: !155)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_94", scope: !1031, file: !1036, line: 17, type: !1037, isLocal: false, isDefinition: true, align: 16)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_93", scope: !1031, file: !1036, line: 22, type: !1037, isLocal: false, isDefinition: true, align: 16)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !1044, file: !1101, line: 603, type: !1103, isLocal: true, isDefinition: true, align: 32)
