; ModuleID = './build/pwm_generate_waveform.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !2, file: !3, line: 51, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !53, globals: !89, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!4 = !{!5, !17, !37, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!10 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!11 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!12 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!13 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!14 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!15 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!16 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 186, baseType: !18, size: 32, elements: !19)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!20 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!21 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!22 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!23 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!24 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!25 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!26 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!27 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!28 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!29 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!30 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!31 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!32 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!33 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!34 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!35 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!36 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 176, baseType: !18, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!40 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!41 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!42 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!43 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 98, baseType: !18, size: 32, elements: !46)
!45 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!48 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!49 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!50 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!51 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!52 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!53 = !{!54, !88}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !56, line: 276, baseType: !57)
!56 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 260, size: 525312, elements: !58)
!58 = !{!59, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !79, !83, !87}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !57, file: !56, line: 261, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 79, baseType: !18)
!64 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !57, file: !56, line: 262, baseType: !60, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !57, file: !56, line: 263, baseType: !60, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !57, file: !56, line: 264, baseType: !60, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !57, file: !56, line: 265, baseType: !60, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !57, file: !56, line: 266, baseType: !60, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !57, file: !56, line: 267, baseType: !60, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !57, file: !56, line: 268, baseType: !60, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !57, file: !56, line: 269, baseType: !60, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !57, file: !56, line: 270, baseType: !60, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !57, file: !56, line: 271, baseType: !75, size: 32, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !57, file: !56, line: 272, baseType: !60, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !57, file: !56, line: 273, baseType: !80, size: 523904, offset: 384)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 16372)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !57, file: !56, line: 274, baseType: !84, size: 512, offset: 524288)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !57, file: !56, line: 275, baseType: !84, size: 512, offset: 524800)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!89 = !{!0}
!90 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !94, file: !95, line: 48, type: !341, isLocal: false, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !96, retainedTypes: !263, globals: !278, splitDebugInlining: false, nameTableKind: None)
!95 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!96 = !{!97, !157, !162, !168, !245, !254, !259}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 1170, baseType: !18, size: 32, elements: !99)
!98 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!100 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!101 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!102 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!103 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!104 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!105 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!106 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!107 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!108 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!109 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!110 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!111 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!112 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!113 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!114 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!115 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!116 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!117 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!118 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!119 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!120 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!121 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!122 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!123 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!124 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!125 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!126 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!127 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!128 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!129 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!130 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!131 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!132 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!133 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!134 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!135 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!136 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!137 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!138 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!139 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!140 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!141 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!142 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!143 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!144 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!145 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!146 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!147 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!148 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!149 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!150 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!151 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!152 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!153 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!154 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!155 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!156 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 82, baseType: !18, size: 32, elements: !159)
!158 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!159 = !{!160, !161}
!160 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!161 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 75, baseType: !18, size: 32, elements: !163)
!163 = !{!164, !165, !166, !167}
!164 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!165 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!166 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!167 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !56, line: 44, baseType: !7, size: 32, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!170 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!171 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!172 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!173 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!174 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!175 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!176 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!177 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!178 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!179 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!180 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!181 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!182 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!183 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!184 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!185 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!186 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!187 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!188 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!189 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!190 = !DIEnumerator(name: "KP_IRQn", value: 10)
!191 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!192 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!193 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!194 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!195 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!196 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!197 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!198 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!199 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!200 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!201 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!202 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!203 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!204 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!205 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!206 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!207 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!208 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!209 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!210 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!211 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!212 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!213 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!214 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!215 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!216 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!217 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!218 = !DIEnumerator(name: "SF_IRQn", value: 38)
!219 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!220 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!221 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!222 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!223 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!224 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!225 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!226 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!227 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!228 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!229 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!230 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!231 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!232 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!233 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!234 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!235 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!236 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!237 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!238 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!239 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!240 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!241 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!242 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!243 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!244 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 846, baseType: !18, size: 32, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253}
!247 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!248 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!249 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!250 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!251 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!252 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!253 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 380, baseType: !18, size: 32, elements: !256)
!255 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!256 = !{!257, !258}
!257 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!258 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 397, baseType: !18, size: 32, elements: !260)
!260 = !{!261, !262}
!261 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!262 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!263 = !{!61, !264, !88}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !56, line: 1272, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1262, size: 288, elements: !267)
!267 = !{!268, !269, !270, !271, !273, !274, !275, !276, !277}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !266, file: !56, line: 1263, baseType: !60, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !266, file: !56, line: 1264, baseType: !60, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !266, file: !56, line: 1265, baseType: !60, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !266, file: !56, line: 1266, baseType: !272, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !266, file: !56, line: 1267, baseType: !60, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !266, file: !56, line: 1268, baseType: !60, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !266, file: !56, line: 1269, baseType: !60, size: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !266, file: !56, line: 1270, baseType: !60, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !266, file: !56, line: 1271, baseType: !60, size: 32, offset: 256)
!278 = !{!92, !279, !288, !294, !316, !339}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !94, file: !95, line: 49, type: !281, isLocal: false, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !56, line: 1260, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1256, size: 96, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !283, file: !56, line: 1257, baseType: !272, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !283, file: !56, line: 1258, baseType: !60, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !283, file: !56, line: 1259, baseType: !60, size: 32, offset: 64)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "flag", scope: !290, file: !95, line: 88, type: !91, isLocal: true, isDefinition: true)
!290 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !95, file: !95, line: 86, type: !291, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{null}
!293 = !{}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !94, file: !95, line: 51, type: !296, isLocal: false, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 768, elements: !314)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !158, line: 116, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 111, size: 128, elements: !299)
!299 = !{!300, !302, !312, !313}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !298, file: !158, line: 112, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !255, line: 400, baseType: !259)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !298, file: !158, line: 113, baseType: !303, size: 64, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !158, line: 109, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 106, size: 64, elements: !305)
!305 = !{!306, !311}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !304, file: !158, line: 107, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !255, line: 371, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !88}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !304, file: !158, line: 108, baseType: !88, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !298, file: !158, line: 114, baseType: !91, size: 8, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !298, file: !158, line: 115, baseType: !91, size: 8, offset: 104)
!314 = !{!315}
!315 = !DISubrange(count: 6)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !94, file: !95, line: 52, type: !318, isLocal: false, isDefinition: true)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !158, line: 134, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 125, size: 4256, elements: !320)
!320 = !{!321, !332, !333, !334, !335, !336, !337, !338}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !319, file: !158, line: 126, baseType: !322, size: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 4096, elements: !330)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !158, line: 123, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 118, size: 128, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !324, file: !158, line: 119, baseType: !303, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !324, file: !158, line: 120, baseType: !61, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !324, file: !158, line: 121, baseType: !91, size: 8, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !324, file: !158, line: 122, baseType: !91, size: 8, offset: 104)
!330 = !{!331}
!331 = !DISubrange(count: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !319, file: !158, line: 127, baseType: !61, size: 32, offset: 4096)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !319, file: !158, line: 128, baseType: !61, size: 32, offset: 4128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !319, file: !158, line: 129, baseType: !61, size: 32, offset: 4160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !319, file: !158, line: 130, baseType: !61, size: 32, offset: 4192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !319, file: !158, line: 131, baseType: !91, size: 8, offset: 4224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !319, file: !158, line: 132, baseType: !91, size: 8, offset: 4232)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !319, file: !158, line: 133, baseType: !91, size: 8, offset: 4240)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !94, file: !95, line: 53, type: !61, isLocal: false, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 192, elements: !314)
!342 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "pwm", scope: !345, file: !346, line: 43, type: !401, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !347, globals: !385, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_pwm.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!347 = !{!97, !348, !356, !365, !369, !376, !380}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 226, baseType: !7, size: 32, elements: !350)
!349 = !DIFile(filename: "../../../../../driver/chip/inc/hal_pwm.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!350 = !{!351, !352, !353, !354, !355}
!351 = !DIEnumerator(name: "HAL_PWM_STATUS_ERROR", value: -4)
!352 = !DIEnumerator(name: "HAL_PWM_STATUS_ERROR_CHANNEL", value: -3)
!353 = !DIEnumerator(name: "HAL_PWM_STATUS_INVALID_PARAMETER", value: -2)
!354 = !DIEnumerator(name: "HAL_PWM_STATUS_INVALID_FREQUENCY", value: -1)
!355 = !DIEnumerator(name: "HAL_PWM_STATUS_OK", value: 0)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 944, baseType: !18, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364}
!358 = !DIEnumerator(name: "HAL_PWM_0", value: 0)
!359 = !DIEnumerator(name: "HAL_PWM_1", value: 1)
!360 = !DIEnumerator(name: "HAL_PWM_2", value: 2)
!361 = !DIEnumerator(name: "HAL_PWM_3", value: 3)
!362 = !DIEnumerator(name: "HAL_PWM_4", value: 4)
!363 = !DIEnumerator(name: "HAL_PWM_5", value: 5)
!364 = !DIEnumerator(name: "HAL_PWM_MAX_CHANNEL", value: 6)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 956, baseType: !18, size: 32, elements: !366)
!366 = !{!367, !368}
!367 = !DIEnumerator(name: "HAL_PWM_CLOCK_13MHZ", value: 0)
!368 = !DIEnumerator(name: "HAL_PWM_CLOCK_32KHZ", value: 1)
!369 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 101, baseType: !7, size: 32, elements: !371)
!370 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!371 = !{!372, !373, !374, !375}
!372 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!373 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!374 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!375 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 237, baseType: !18, size: 32, elements: !377)
!377 = !{!378, !379}
!378 = !DIEnumerator(name: "HAL_PWM_IDLE", value: 0)
!379 = !DIEnumerator(name: "HAL_PWM_BUSY", value: 1)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 253, baseType: !18, size: 32, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIEnumerator(name: "HAL_PWM_CLOCK_DIVISION_2", value: 1)
!383 = !DIEnumerator(name: "HAL_PWM_CLOCK_DIVISION_4", value: 2)
!384 = !DIEnumerator(name: "HAL_PWM_CLOCK_DIVISION_8", value: 3)
!385 = !{!343, !386, !391, !398}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "pwm_pdn", scope: !345, file: !346, line: 47, type: !388, isLocal: false, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 192, elements: !314)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !98, line: 1237, baseType: !97)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "pwm_init_status", scope: !345, file: !346, line: 49, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 48, elements: !314)
!394 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 43, baseType: !397)
!397 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "pwm_run_status", scope: !345, file: !346, line: 45, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 48, elements: !314)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 192, elements: !314)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWM_REGISTER_T", file: !56, line: 1173, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1169, size: 96, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CTRL", scope: !404, file: !56, line: 1170, baseType: !60, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_COUNT", scope: !404, file: !56, line: 1171, baseType: !60, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_THRESH", scope: !404, file: !56, line: 1172, baseType: !60, size: 32, offset: 64)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !411, file: !412, line: 64, type: !512, isLocal: false, isDefinition: true)
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !413, retainedTypes: !507, globals: !511, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!413 = !{!414, !466, !473, !477, !483, !487, !496, !501}
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 339, baseType: !18, size: 32, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!416 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!417 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!418 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!419 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!420 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!421 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!422 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!423 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!424 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!425 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!426 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!427 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!428 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!429 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!430 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!431 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!432 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!433 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!434 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!435 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!436 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!437 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!438 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!439 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!440 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!441 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!442 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!443 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!444 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!445 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!446 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!447 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!448 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!449 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!450 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!451 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!452 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!453 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!454 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!455 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!456 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!457 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!458 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!459 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!460 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!461 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!462 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!463 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!464 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!465 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 224, baseType: !7, size: 32, elements: !468)
!467 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!468 = !{!469, !470, !471, !472}
!469 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!470 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!471 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!472 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 210, baseType: !18, size: 32, elements: !474)
!474 = !{!475, !476}
!475 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!476 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 233, baseType: !7, size: 32, elements: !478)
!478 = !{!479, !480, !481, !482}
!479 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!480 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!481 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!482 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!483 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 217, baseType: !18, size: 32, elements: !484)
!484 = !{!485, !486}
!485 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!486 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!487 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 415, baseType: !18, size: 32, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495}
!489 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!490 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!491 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!492 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!493 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!494 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!495 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!496 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 427, baseType: !18, size: 32, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!499 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!500 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!501 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 242, baseType: !18, size: 32, elements: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!504 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!505 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!506 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!507 = !{!88, !508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !467, line: 213, baseType: !473)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !467, line: 220, baseType: !483)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !467, line: 247, baseType: !501)
!511 = !{!409}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !56, line: 1554, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1522, size: 29440, elements: !515)
!515 = !{!516, !530, !534, !543, !544, !553, !554, !563, !564, !574, !575, !584, !585, !594, !595, !604, !605, !614, !618, !627, !628, !637, !638, !647, !656, !657, !668, !672, !681, !682}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !514, file: !56, line: 1523, baseType: !517, size: 256)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 256, elements: !528)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !56, line: 1400, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1395, size: 128, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !519, file: !56, line: 1396, baseType: !60, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !519, file: !56, line: 1397, baseType: !60, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !519, file: !56, line: 1398, baseType: !60, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !519, file: !56, line: 1399, baseType: !525, size: 32, offset: 96)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 32, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 4)
!528 = !{!529}
!529 = !DISubrange(count: 2)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !514, file: !56, line: 1524, baseType: !531, size: 1792, offset: 256)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 1792, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !514, file: !56, line: 1525, baseType: !535, size: 256, offset: 2048)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 256, elements: !528)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !56, line: 1409, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1404, size: 128, elements: !538)
!538 = !{!539, !540, !541, !542}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !537, file: !56, line: 1405, baseType: !60, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !537, file: !56, line: 1406, baseType: !60, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !537, file: !56, line: 1407, baseType: !60, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !537, file: !56, line: 1408, baseType: !525, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !514, file: !56, line: 1526, baseType: !531, size: 1792, offset: 2304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !514, file: !56, line: 1527, baseType: !545, size: 256, offset: 4096)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 256, elements: !528)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !56, line: 1417, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1412, size: 128, elements: !548)
!548 = !{!549, !550, !551, !552}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !547, file: !56, line: 1413, baseType: !60, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !547, file: !56, line: 1414, baseType: !60, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !547, file: !56, line: 1415, baseType: !60, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !547, file: !56, line: 1416, baseType: !525, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !514, file: !56, line: 1528, baseType: !531, size: 1792, offset: 4352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !514, file: !56, line: 1529, baseType: !555, size: 256, offset: 6144)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 256, elements: !528)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !56, line: 1426, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1421, size: 128, elements: !558)
!558 = !{!559, !560, !561, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !557, file: !56, line: 1422, baseType: !60, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !557, file: !56, line: 1423, baseType: !60, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !557, file: !56, line: 1424, baseType: !60, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !557, file: !56, line: 1425, baseType: !525, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !514, file: !56, line: 1530, baseType: !531, size: 1792, offset: 6400)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !514, file: !56, line: 1531, baseType: !565, size: 256, offset: 8192)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 256, elements: !528)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !56, line: 1432, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1429, size: 128, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !567, file: !56, line: 1430, baseType: !60, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !567, file: !56, line: 1431, baseType: !571, size: 96, offset: 32)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 96, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 12)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !514, file: !56, line: 1532, baseType: !531, size: 1792, offset: 8448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !514, file: !56, line: 1533, baseType: !576, size: 256, offset: 10240)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 256, elements: !528)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !56, line: 1440, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1435, size: 128, elements: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !578, file: !56, line: 1436, baseType: !60, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !578, file: !56, line: 1437, baseType: !60, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !578, file: !56, line: 1438, baseType: !60, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !578, file: !56, line: 1439, baseType: !525, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !514, file: !56, line: 1534, baseType: !531, size: 1792, offset: 10496)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !514, file: !56, line: 1535, baseType: !586, size: 256, offset: 12288)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 256, elements: !528)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !56, line: 1448, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1443, size: 128, elements: !589)
!589 = !{!590, !591, !592, !593}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !588, file: !56, line: 1444, baseType: !60, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !588, file: !56, line: 1445, baseType: !60, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !588, file: !56, line: 1446, baseType: !60, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !588, file: !56, line: 1447, baseType: !525, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !514, file: !56, line: 1536, baseType: !531, size: 1792, offset: 12544)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !514, file: !56, line: 1537, baseType: !596, size: 256, offset: 14336)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 256, elements: !528)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !56, line: 1455, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1450, size: 128, elements: !599)
!599 = !{!600, !601, !602, !603}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !598, file: !56, line: 1451, baseType: !60, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !598, file: !56, line: 1452, baseType: !60, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !598, file: !56, line: 1453, baseType: !60, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !598, file: !56, line: 1454, baseType: !525, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !514, file: !56, line: 1538, baseType: !531, size: 1792, offset: 14592)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !514, file: !56, line: 1539, baseType: !606, size: 512, offset: 16384)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 512, elements: !526)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !56, line: 1463, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1458, size: 128, elements: !609)
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !608, file: !56, line: 1459, baseType: !60, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !608, file: !56, line: 1460, baseType: !60, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !608, file: !56, line: 1461, baseType: !60, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !608, file: !56, line: 1462, baseType: !525, size: 32, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !514, file: !56, line: 1540, baseType: !615, size: 1536, offset: 16896)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 1536, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !514, file: !56, line: 1541, baseType: !619, size: 256, offset: 18432)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 256, elements: !528)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !56, line: 1471, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1466, size: 128, elements: !622)
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !621, file: !56, line: 1467, baseType: !60, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !621, file: !56, line: 1468, baseType: !60, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !621, file: !56, line: 1469, baseType: !60, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !621, file: !56, line: 1470, baseType: !525, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !514, file: !56, line: 1542, baseType: !531, size: 1792, offset: 18688)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !514, file: !56, line: 1543, baseType: !629, size: 256, offset: 20480)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 256, elements: !528)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !56, line: 1480, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1475, size: 128, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !631, file: !56, line: 1476, baseType: !60, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !631, file: !56, line: 1477, baseType: !60, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !631, file: !56, line: 1478, baseType: !60, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !631, file: !56, line: 1479, baseType: !525, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !514, file: !56, line: 1544, baseType: !531, size: 1792, offset: 20736)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !514, file: !56, line: 1545, baseType: !639, size: 256, offset: 22528)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 256, elements: !528)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !56, line: 1489, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1484, size: 128, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !641, file: !56, line: 1485, baseType: !60, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !641, file: !56, line: 1486, baseType: !60, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !641, file: !56, line: 1487, baseType: !60, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !641, file: !56, line: 1488, baseType: !525, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !514, file: !56, line: 1546, baseType: !648, size: 256, offset: 22784)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 256, elements: !528)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !56, line: 1497, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1492, size: 128, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !650, file: !56, line: 1493, baseType: !60, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !650, file: !56, line: 1494, baseType: !60, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !650, file: !56, line: 1495, baseType: !60, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !650, file: !56, line: 1496, baseType: !525, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !514, file: !56, line: 1547, baseType: !615, size: 1536, offset: 23040)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !514, file: !56, line: 1548, baseType: !658, size: 896, offset: 24576)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 896, elements: !666)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !56, line: 1505, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1500, size: 128, elements: !661)
!661 = !{!662, !663, !664, !665}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !660, file: !56, line: 1501, baseType: !60, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !660, file: !56, line: 1502, baseType: !60, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !660, file: !56, line: 1503, baseType: !60, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !660, file: !56, line: 1504, baseType: !525, size: 32, offset: 96)
!666 = !{!667}
!667 = !DISubrange(count: 7)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !514, file: !56, line: 1549, baseType: !669, size: 1152, offset: 25472)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 1152, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 144)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !514, file: !56, line: 1550, baseType: !673, size: 512, offset: 26624)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 512, elements: !526)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !56, line: 1513, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1508, size: 128, elements: !676)
!676 = !{!677, !678, !679, !680}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !675, file: !56, line: 1509, baseType: !60, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !675, file: !56, line: 1510, baseType: !60, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !675, file: !56, line: 1511, baseType: !60, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !675, file: !56, line: 1512, baseType: !525, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !514, file: !56, line: 1551, baseType: !615, size: 1536, offset: 27136)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !514, file: !56, line: 1552, baseType: !683, size: 768, offset: 28672)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 768, elements: !314)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !56, line: 1519, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1516, size: 128, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !685, file: !56, line: 1517, baseType: !60, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !685, file: !56, line: 1518, baseType: !571, size: 96, offset: 32)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !691, file: !692, line: 101, type: !833, isLocal: true, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !693, retainedTypes: !783, globals: !792, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!693 = !{!694, !701, !716, !722, !728, !733, !740, !756, !762, !766, !369, !771, !779}
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 180, baseType: !18, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699, !700}
!696 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!697 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!698 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!699 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!700 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!701 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !702, line: 189, baseType: !18, size: 32, elements: !703)
!702 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715}
!704 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!705 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!706 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!707 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!708 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!709 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!710 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!711 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!712 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!713 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!714 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!715 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !717, line: 355, baseType: !7, size: 32, elements: !718)
!717 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!718 = !{!719, !720, !721}
!719 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!720 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!721 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !702, line: 206, baseType: !7, size: 32, elements: !723)
!723 = !{!724, !725, !726, !727}
!724 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!725 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!726 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!727 = !DIEnumerator(name: "VDMA_OK", value: 0)
!728 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !692, line: 65, baseType: !18, size: 32, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!731 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!732 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !717, line: 345, baseType: !7, size: 32, elements: !734)
!734 = !{!735, !736, !737, !738, !739}
!735 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!736 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!737 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!738 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!739 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!740 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !717, line: 302, baseType: !18, size: 32, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!742 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!743 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!744 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!745 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!746 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!747 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!748 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!749 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!750 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!751 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!752 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!753 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!754 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!755 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !717, line: 321, baseType: !18, size: 32, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!759 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!760 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!761 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !717, line: 330, baseType: !18, size: 32, elements: !763)
!763 = !{!764, !765}
!764 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!765 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!766 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !717, line: 337, baseType: !18, size: 32, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!769 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!770 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!771 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !772, line: 152, baseType: !7, size: 32, elements: !773)
!772 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!773 = !{!774, !775, !776, !777, !778}
!774 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!775 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!776 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!777 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!778 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !702, line: 222, baseType: !7, size: 32, elements: !780)
!780 = !{!781, !782}
!781 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!782 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!783 = !{!88, !61, !784}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !786, line: 96, baseType: !787)
!786 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !786, line: 93, size: 64, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !787, file: !786, line: 94, baseType: !91, size: 8)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !787, file: !786, line: 95, baseType: !791, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !98, line: 186, baseType: !694)
!792 = !{!689, !793, !806, !811, !825, !831}
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !691, file: !692, line: 102, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 256, elements: !526)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !692, line: 74, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !692, line: 71, size: 64, elements: !798)
!798 = !{!799, !805}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !797, file: !692, line: 72, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !717, line: 410, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !804, !88}
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !717, line: 359, baseType: !716)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !797, file: !692, line: 73, baseType: !88, size: 32, offset: 32)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !691, file: !692, line: 103, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 512, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 8)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !691, file: !692, line: 104, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 896, elements: !526)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !717, line: 390, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !717, line: 382, size: 224, elements: !816)
!816 = !{!817, !819, !820, !821, !822, !823, !824}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !815, file: !717, line: 383, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !815, file: !717, line: 384, baseType: !61, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !815, file: !717, line: 385, baseType: !61, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !815, file: !717, line: 386, baseType: !818, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !815, file: !717, line: 387, baseType: !61, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !815, file: !717, line: 388, baseType: !61, size: 32, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !815, file: !717, line: 389, baseType: !61, size: 32, offset: 192)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !691, file: !692, line: 105, type: !827, isLocal: true, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 416, elements: !829)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!829 = !{!830}
!830 = !DISubrange(count: 13)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !691, file: !692, line: 90, type: !91, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 128, elements: !526)
!834 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !692, line: 69, baseType: !728)
!836 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !839, file: !840, line: 53, type: !918, isLocal: false, isDefinition: true)
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !841, retainedTypes: !852, globals: !908, splitDebugInlining: false, nameTableKind: None)
!840 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!841 = !{!97, !168, !701, !694, !842}
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !786, line: 46, baseType: !18, size: 32, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851}
!844 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!845 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!846 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!847 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!848 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!849 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!850 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!851 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !56, line: 588, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 542, size: 800, elements: !856)
!856 = !{!857, !863, !868, !874, !875, !880, !885, !886, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !855, file: !56, line: 547, baseType: !858, size: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !56, line: 543, size: 32, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !858, file: !56, line: 544, baseType: !272, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !858, file: !56, line: 545, baseType: !60, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !858, file: !56, line: 546, baseType: !60, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !855, file: !56, line: 551, baseType: !864, size: 32, offset: 32)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !56, line: 548, size: 32, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !864, file: !56, line: 549, baseType: !60, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !864, file: !56, line: 550, baseType: !60, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !855, file: !56, line: 556, baseType: !869, size: 32, offset: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !56, line: 552, size: 32, elements: !870)
!870 = !{!871, !872, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !869, file: !56, line: 553, baseType: !272, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !869, file: !56, line: 554, baseType: !60, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !869, file: !56, line: 555, baseType: !60, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !855, file: !56, line: 557, baseType: !60, size: 32, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !855, file: !56, line: 561, baseType: !876, size: 32, offset: 128)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !56, line: 558, size: 32, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !876, file: !56, line: 559, baseType: !60, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !876, file: !56, line: 560, baseType: !60, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !855, file: !56, line: 565, baseType: !881, size: 32, offset: 160)
!881 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !56, line: 562, size: 32, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !881, file: !56, line: 563, baseType: !272, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !881, file: !56, line: 564, baseType: !60, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !855, file: !56, line: 566, baseType: !60, size: 32, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !855, file: !56, line: 570, baseType: !887, size: 32, offset: 224)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !56, line: 567, size: 32, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !887, file: !56, line: 568, baseType: !60, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !887, file: !56, line: 569, baseType: !60, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !855, file: !56, line: 571, baseType: !60, size: 32, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !855, file: !56, line: 572, baseType: !60, size: 32, offset: 288)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !855, file: !56, line: 573, baseType: !60, size: 32, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !855, file: !56, line: 574, baseType: !60, size: 32, offset: 352)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !855, file: !56, line: 575, baseType: !272, size: 32, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !855, file: !56, line: 576, baseType: !60, size: 32, offset: 416)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !855, file: !56, line: 577, baseType: !60, size: 32, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !855, file: !56, line: 578, baseType: !60, size: 32, offset: 480)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !855, file: !56, line: 579, baseType: !60, size: 32, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !855, file: !56, line: 580, baseType: !60, size: 32, offset: 544)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !855, file: !56, line: 581, baseType: !60, size: 32, offset: 576)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !855, file: !56, line: 582, baseType: !60, size: 32, offset: 608)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !855, file: !56, line: 583, baseType: !60, size: 32, offset: 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !855, file: !56, line: 584, baseType: !60, size: 32, offset: 672)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !855, file: !56, line: 585, baseType: !60, size: 32, offset: 704)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !855, file: !56, line: 586, baseType: !272, size: 32, offset: 736)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !855, file: !56, line: 587, baseType: !60, size: 32, offset: 768)
!908 = !{!837, !909, !912}
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !839, file: !840, line: 54, type: !911, isLocal: false, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 128, elements: !526)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !839, file: !840, line: 55, type: !914, isLocal: false, isDefinition: true)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 128, elements: !526)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !56, line: 125, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !56, line: 123, baseType: !168)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 128, elements: !526)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!921 = distinct !DIGlobalVariable(name: "priority_set", scope: !922, file: !923, line: 128, type: !61, isLocal: true, isDefinition: true)
!922 = distinct !DISubprogram(name: "hal_nvic_init", scope: !923, file: !923, line: 126, type: !924, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !927, retainedNodes: !1013)
!923 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!924 = !DISubroutineType(types: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_status_t", file: !772, line: 158, baseType: !771)
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !928, retainedTypes: !929, globals: !995, splitDebugInlining: false, nameTableKind: None)
!928 = !{!771, !168}
!929 = !{!916, !930, !61, !963, !993}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !932, line: 418, baseType: !933)
!932 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !932, line: 395, size: 1120, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !943, !944, !945, !946, !947, !948, !949, !950, !952, !953, !954, !956, !960, !962}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !933, file: !932, line: 397, baseType: !272, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !933, file: !932, line: 398, baseType: !60, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !933, file: !932, line: 399, baseType: !60, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !933, file: !932, line: 400, baseType: !60, size: 32, offset: 96)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !933, file: !932, line: 401, baseType: !60, size: 32, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !933, file: !932, line: 402, baseType: !60, size: 32, offset: 160)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !933, file: !932, line: 403, baseType: !942, size: 96, offset: 192)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 96, elements: !572)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !933, file: !932, line: 404, baseType: !60, size: 32, offset: 288)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !933, file: !932, line: 405, baseType: !60, size: 32, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !933, file: !932, line: 406, baseType: !60, size: 32, offset: 352)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !933, file: !932, line: 407, baseType: !60, size: 32, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !933, file: !932, line: 408, baseType: !60, size: 32, offset: 416)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !933, file: !932, line: 409, baseType: !60, size: 32, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !933, file: !932, line: 410, baseType: !60, size: 32, offset: 480)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !933, file: !932, line: 411, baseType: !951, size: 64, offset: 512)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 64, elements: !528)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !933, file: !932, line: 412, baseType: !272, size: 32, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !933, file: !932, line: 413, baseType: !272, size: 32, offset: 608)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !933, file: !932, line: 414, baseType: !955, size: 128, offset: 640)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 128, elements: !526)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !933, file: !932, line: 415, baseType: !957, size: 160, offset: 768)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 160, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 5)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !933, file: !932, line: 416, baseType: !961, size: 160, offset: 928)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !958)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !933, file: !932, line: 417, baseType: !60, size: 32, offset: 1088)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !932, line: 378, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !932, line: 363, size: 28704, elements: !966)
!966 = !{!967, !969, !973, !974, !975, !976, !977, !978, !979, !980, !984, !988, !992}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !965, file: !932, line: 365, baseType: !968, size: 256)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, elements: !809)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !965, file: !932, line: 366, baseType: !970, size: 768, offset: 256)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 24)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !965, file: !932, line: 367, baseType: !968, size: 256, offset: 1024)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !965, file: !932, line: 368, baseType: !970, size: 768, offset: 1280)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !965, file: !932, line: 369, baseType: !968, size: 256, offset: 2048)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !965, file: !932, line: 370, baseType: !970, size: 768, offset: 2304)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !965, file: !932, line: 371, baseType: !968, size: 256, offset: 3072)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !965, file: !932, line: 372, baseType: !970, size: 768, offset: 3328)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !965, file: !932, line: 373, baseType: !968, size: 256, offset: 4096)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !965, file: !932, line: 374, baseType: !981, size: 1792, offset: 4352)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1792, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 56)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !965, file: !932, line: 375, baseType: !985, size: 1920, offset: 6144)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 1920, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 240)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !965, file: !932, line: 376, baseType: !989, size: 20608, offset: 8064)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 20608, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 644)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !965, file: !932, line: 377, baseType: !60, size: 32, offset: 28672)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !62, line: 44, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !64, line: 77, baseType: !7)
!995 = !{!996, !997, !1010}
!996 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !927, file: !923, line: 119, type: !999, isLocal: false, isDefinition: true)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 4096, elements: !1008)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !923, line: 50, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !923, line: 47, size: 64, elements: !1002)
!1002 = !{!1003, !1007}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !1001, file: !923, line: 48, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !916}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !1001, file: !923, line: 49, baseType: !61, size: 32, offset: 32)
!1008 = !{!1009}
!1009 = !DISubrange(count: 64)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "defualt_irq_priority", scope: !927, file: !923, line: 52, type: !1012, isLocal: true, isDefinition: true)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 2048, elements: !1008)
!1013 = !{!1014}
!1014 = !DILocalVariable(name: "i", scope: !922, file: !923, line: 129, type: !61)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "DelayResume", scope: !1017, file: !1018, line: 55, type: !91, isLocal: false, isDefinition: true)
!1017 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1018, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1019, retainedTypes: !1054, globals: !1093, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_flash_mtd_common.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!1019 = !{!1020, !1028, !1033}
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sfi_clock_enum_t", file: !1021, line: 51, baseType: !18, size: 32, elements: !1022)
!1021 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_sfi_release.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!1022 = !{!1023, !1024, !1025, !1026, !1027}
!1023 = !DIEnumerator(name: "SFI_CLK_UNKNOWN", value: 0)
!1024 = !DIEnumerator(name: "SFI_CLK_78MHZ", value: 78)
!1025 = !DIEnumerator(name: "SFI_CLK_104MHZ", value: 104)
!1026 = !DIEnumerator(name: "SFI_CLK_130MHZ", value: 130)
!1027 = !DIEnumerator(name: "SFI_CLK_166MHZ", value: 166)
!1028 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sfi_voltage_enum_t", file: !1021, line: 62, baseType: !18, size: 32, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIEnumerator(name: "SFI_Voltage_UNKNOWN", value: 0)
!1031 = !DIEnumerator(name: "SFI_Voltage_18", value: 18)
!1032 = !DIEnumerator(name: "SFI_Voltage_30", value: 30)
!1033 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1034, line: 228, baseType: !18, size: 32, elements: !1035)
!1034 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_clock_platform_mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/pwm_generate_waveform/GCC")
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1036 = !DIEnumerator(name: "BUS_MUX_SEL", value: 0)
!1037 = !DIEnumerator(name: "CM_MUX_SEL", value: 1)
!1038 = !DIEnumerator(name: "SFC_MUX_SEL", value: 2)
!1039 = !DIEnumerator(name: "SLCD_MUX_SEL", value: 3)
!1040 = !DIEnumerator(name: "BSI_MUX_SEL", value: 4)
!1041 = !DIEnumerator(name: "DSP_MUX_SEL", value: 5)
!1042 = !DIEnumerator(name: "CAM_MUX_SEL", value: 6)
!1043 = !DIEnumerator(name: "USB_MUX_SEL", value: 7)
!1044 = !DIEnumerator(name: "DISP_PWM_MUX_SEL", value: 8)
!1045 = !DIEnumerator(name: "MSDC0_MUX_SEL", value: 9)
!1046 = !DIEnumerator(name: "MSDC1_MUX_SEL", value: 10)
!1047 = !DIEnumerator(name: "LP_CLKSQ_MUX_SEL", value: 11)
!1048 = !DIEnumerator(name: "LP_LFOSC_MUX_SEL", value: 12)
!1049 = !DIEnumerator(name: "RG_SLCD_CK_SEL", value: 13)
!1050 = !DIEnumerator(name: "GP_F26M_GFMUX_SEL", value: 14)
!1051 = !DIEnumerator(name: "LP_F26M_GFMUX_SEL", value: 15)
!1052 = !DIEnumerator(name: "NR_MUXS", value: 16)
!1053 = !DIEnumerator(name: "CLK_MUX_SEL_NONE", value: 17)
!1054 = !{!1055, !1056, !1078, !818, !61, !18, !1084, !1086, !1090, !1092}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_REGISTER_T", file: !56, line: 2777, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 2758, size: 576, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_CTL", scope: !1058, file: !56, line: 2759, baseType: !60, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL", scope: !1058, file: !56, line: 2760, baseType: !60, size: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL", scope: !1058, file: !56, line: 2761, baseType: !60, size: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL2", scope: !1058, file: !56, line: 2762, baseType: !60, size: 32, offset: 96)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_OUTL", scope: !1058, file: !56, line: 2763, baseType: !60, size: 32, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_INL", scope: !1058, file: !56, line: 2764, baseType: !60, size: 32, offset: 160)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_RESET_CTL", scope: !1058, file: !56, line: 2765, baseType: !60, size: 32, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_STA2_CTL", scope: !1058, file: !56, line: 2766, baseType: !60, size: 32, offset: 224)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL1", scope: !1058, file: !56, line: 2767, baseType: !60, size: 32, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL2", scope: !1058, file: !56, line: 2768, baseType: !60, size: 32, offset: 288)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL3", scope: !1058, file: !56, line: 2769, baseType: !60, size: 32, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY1", scope: !1058, file: !56, line: 2770, baseType: !60, size: 32, offset: 352)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL4", scope: !1058, file: !56, line: 2771, baseType: !60, size: 32, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL5", scope: !1058, file: !56, line: 2772, baseType: !60, size: 32, offset: 416)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL6", scope: !1058, file: !56, line: 2773, baseType: !60, size: 32, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY2", scope: !1058, file: !56, line: 2774, baseType: !60, size: 32, offset: 480)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL2", scope: !1058, file: !56, line: 2775, baseType: !60, size: 32, offset: 512)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL3", scope: !1058, file: !56, line: 2776, baseType: !60, size: 32, offset: 544)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 32)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_GPRAM_REGISTER_T", file: !56, line: 2801, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 2798, size: 64, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_GPRAM_DATA", scope: !1080, file: !56, line: 2799, baseType: !60, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_GPRAM_DATA_OF_4", scope: !1080, file: !56, line: 2800, baseType: !60, size: 32, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 32)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !62, line: 36, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !64, line: 57, baseType: !1089)
!1089 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 32)
!1091 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !397)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!1093 = !{!1015, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1108, !1110, !1112}
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(name: "NOR_FLASH_LeaveDPDCmd", scope: !1017, file: !1018, line: 604, type: !395, isLocal: false, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(name: "NOR_FLASH_FATStartAddr", scope: !1017, file: !1018, line: 605, type: !61, isLocal: false, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(name: "NOR_FLASH_FATStartValue", scope: !1017, file: !1018, line: 606, type: !61, isLocal: false, isDefinition: true)
!1100 = !DIGlobalVariableExpression(var: !1101, expr: !DIExpression())
!1101 = distinct !DIGlobalVariable(name: "SFI_MAC_CTL_BACKUP", scope: !1017, file: !1018, line: 607, type: !61, isLocal: false, isDefinition: true)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(name: "SFI_DIRECT_CTL_BACKUP", scope: !1017, file: !1018, line: 608, type: !61, isLocal: false, isDefinition: true)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
