; ModuleID = 'build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.rtio_executor_api = type { i32 (%struct.rtio*)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)* }
%struct.rtio = type { %struct.rtio_executor*, i32, %struct.rtio_sq*, %struct.rtio_cq* }
%struct.rtio_executor = type { %struct.rtio_executor_api* }
%struct.rtio_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_sqe] }
%struct.rtio_spsc = type { i32, i32, i32, i32, i32 }
%struct.rtio_sqe = type { i8, i8, i16, %struct.rtio_iodev*, i8*, %union.anon.3 }
%struct.rtio_iodev = type { %struct.rtio_iodev_api*, %struct.rtio_iodev_sq*, i8* }
%struct.rtio_iodev_api = type { void (%struct.rtio_sqe*, %struct.rtio*)* }
%struct.rtio_iodev_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_iodev_sqe] }
%struct.rtio_iodev_sqe = type { %struct.rtio_sqe*, %struct.rtio* }
%union.anon.3 = type { %struct.anon.4 }
%struct.anon.4 = type { i32, i8* }
%struct.rtio_cq = type { %struct.rtio_spsc, [0 x %struct.anon.4] }
%struct.rtio_simple_executor = type { %struct.rtio_executor }
%struct.rtio_spsc__sq_ez_io = type { %struct.rtio_spsc, [8 x %struct.rtio_sqe] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !119, line: 12, type: !252, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !103, globals: !116, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_RTIO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_RTIO_IODEV", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_LAST", value: 68)
!103 = !{!104, !105, !108, !109, !113, !114}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !112)
!112 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !{!25, !117, !227, !229, !235, !237, !245}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "simple_exec", scope: !27, file: !119, line: 24, type: !120, isLocal: false, isDefinition: true)
!119 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_simple_executor", file: !121, line: 57, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_executor_simple.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !120, file: !121, line: 58, baseType: !124, size: 32)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !124, file: !125, line: 211, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !131)
!131 = !{!132, !222, !226}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !130, file: !125, line: 177, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!108, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !138)
!138 = !{!139, !141, !145, !210}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !137, file: !125, line: 228, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !137, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !143, line: 22, baseType: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !137, file: !125, line: 254, baseType: !146, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !148)
!148 = !{!149, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !147, file: !125, line: 143, baseType: !150, size: 160)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_spsc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !150, file: !151, line: 60, baseType: !24, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !150, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !150, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !150, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !150, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !147, file: !125, line: 144, baseType: !160, offset: 160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, elements: !197)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !162)
!162 = !{!163, !166, !167, !170, !200, !201}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !161, file: !125, line: 110, baseType: !164, size: 8)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !165)
!165 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !161, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !161, file: !125, line: 116, baseType: !171, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !174)
!174 = !{!175, !186, !199}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !173, file: !125, line: 308, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !178, file: !125, line: 271, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !136}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !173, file: !125, line: 311, baseType: !187, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !188, file: !125, line: 299, baseType: !150, size: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !188, file: !125, line: 300, baseType: !192, offset: 160)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, elements: !197)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !193, file: !125, line: 289, baseType: !184, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !193, file: !125, line: 290, baseType: !136, size: 32, offset: 32)
!197 = !{!198}
!198 = !DISubrange(count: -1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !161, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !125, line: 127, baseType: !202, size: 64, offset: 96)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !125, line: 127, size: 64, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !125, line: 128, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !125, line: 128, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !205, file: !125, line: 129, baseType: !113, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !205, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !137, file: !125, line: 257, baseType: !211, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !212, file: !125, line: 162, baseType: !150, size: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !212, file: !125, line: 163, baseType: !216, offset: 160)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, elements: !197)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !218)
!218 = !{!219, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !217, file: !125, line: 151, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !217, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !130, file: !125, line: 182, baseType: !223, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !136, !184, !108}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !130, file: !125, line: 187, baseType: !223, size: 32, offset: 64)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "ez_io", scope: !27, file: !119, line: 25, type: !137, isLocal: false, isDefinition: true, align: 32)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "bufs", scope: !27, file: !119, line: 27, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1024, elements: !232)
!232 = !{!233, !234}
!233 = !DISubrange(count: 8)
!234 = !DISubrange(count: 16)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "z_rtio_simple_api", scope: !27, file: !121, line: 64, type: !129, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "_sq_ez_io", scope: !27, file: !119, line: 25, type: !239, isLocal: true, isDefinition: true)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__sq_ez_io", file: !119, line: 25, size: 1440, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !239, file: !119, line: 25, baseType: !150, size: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !239, file: !119, line: 25, baseType: !243, size: 1280, offset: 160)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1280, elements: !244)
!244 = !{!233}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "_cq_ez_io", scope: !27, file: !119, line: 25, type: !247, isLocal: true, isDefinition: true)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__cq_ez_io", file: !119, line: 25, size: 672, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !247, file: !119, line: 25, baseType: !150, size: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !247, file: !119, line: 25, baseType: !251, size: 512, offset: 160)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 512, elements: !244)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !254, line: 17, baseType: !105, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !253, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "log_const_vnd_sensor", scope: !260, file: !265, line: 14, type: !489, isLocal: false, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !262, globals: !450, splitDebugInlining: false, nameTableKind: None)
!261 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!262 = !{!104, !108, !263, !109, !443, !113, !114}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_data", file: !265, line: 21, size: 960, elements: !266)
!265 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !{!267, !357, !407, !430, !449}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !264, file: !265, line: 22, baseType: !268, size: 96)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !269)
!269 = !{!270, !345, !356}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !268, file: !125, line: 308, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !273, file: !125, line: 271, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !298}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !282)
!282 = !{!283, !284, !285, !286, !289, !290}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !281, file: !125, line: 110, baseType: !164, size: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !281, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !281, file: !125, line: 116, baseType: !287, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !281, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !125, line: 127, baseType: !291, size: 64, offset: 96)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !125, line: 127, size: 64, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !291, file: !125, line: 128, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !125, line: 128, size: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !294, file: !125, line: 129, baseType: !113, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !294, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !300)
!300 = !{!301, !319, !320, !334}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !299, file: !125, line: 228, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !303, file: !125, line: 211, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !309)
!309 = !{!310, !314, !318}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !308, file: !125, line: 177, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!108, !298}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !308, file: !125, line: 182, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !298, !279, !108}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !308, file: !125, line: 187, baseType: !315, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !299, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !299, file: !125, line: 254, baseType: !321, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !323)
!323 = !{!324, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !322, file: !125, line: 143, baseType: !325, size: 160)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !326)
!326 = !{!327, !328, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !325, file: !151, line: 60, baseType: !24, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !325, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !325, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !325, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !325, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !322, file: !125, line: 144, baseType: !333, offset: 160)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, elements: !197)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !299, file: !125, line: 257, baseType: !335, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !336, file: !125, line: 162, baseType: !325, size: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !336, file: !125, line: 163, baseType: !340, offset: 160)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, elements: !197)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !341, file: !125, line: 151, baseType: !220, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !341, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !268, file: !125, line: 311, baseType: !346, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !347, file: !125, line: 299, baseType: !325, size: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !347, file: !125, line: 300, baseType: !351, offset: 160)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, elements: !197)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !352, file: !125, line: 289, baseType: !279, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !352, file: !125, line: 290, baseType: !298, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !264, file: !265, line: 23, baseType: !358, size: 448, offset: 128)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !359, line: 1318, size: 448, elements: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361, !388, !394, !399, !400, !405, !406}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !358, file: !359, line: 1324, baseType: !362, size: 192)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !363, line: 244, size: 192, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !381, !387}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !362, file: !363, line: 245, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !367, line: 49, baseType: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !367, line: 37, size: 64, elements: !369)
!369 = !{!370, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 38, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 38, size: 32, elements: !372)
!372 = !{!373, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !371, file: !367, line: 39, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !367, line: 40, baseType: !374, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 42, baseType: !377, size: 32, offset: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 42, size: 32, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !377, file: !367, line: 43, baseType: !374, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !377, file: !367, line: 44, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !362, file: !363, line: 246, baseType: !382, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !363, line: 242, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !362, file: !363, line: 249, baseType: !111, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !358, file: !359, line: 1327, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !363, line: 233, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 231, size: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !390, file: !363, line: 232, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !367, line: 48, baseType: !368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !358, file: !359, line: 1330, baseType: !395, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !358, file: !359, line: 1333, baseType: !395, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !358, file: !359, line: 1336, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !110, line: 67, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 65, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !402, file: !110, line: 66, baseType: !109, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !358, file: !359, line: 1339, baseType: !113, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !358, file: !359, line: 1342, baseType: !104, size: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !264, file: !265, line: 24, baseType: !408, size: 32, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !411, line: 378, size: 192, elements: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413, !414, !415, !416, !423, !424}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !411, line: 380, baseType: !105, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !410, file: !411, line: 382, baseType: !13, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !410, file: !411, line: 384, baseType: !13, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !410, file: !411, line: 386, baseType: !417, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !411, line: 351, size: 16, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !418, file: !411, line: 359, baseType: !164, size: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !418, file: !411, line: 364, baseType: !422, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!422 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !411, line: 388, baseType: !104, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !410, file: !411, line: 396, baseType: !425, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !411, line: 43, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !429)
!429 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !264, file: !265, line: 25, baseType: !431, size: 320, offset: 608)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !359, line: 4204, size: 320, elements: !432)
!432 = !{!433, !434, !438, !441, !442, !444, !445, !446, !447, !448}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !431, file: !359, line: 4206, baseType: !389, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !431, file: !359, line: 4208, baseType: !435, offset: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !431, file: !359, line: 4210, baseType: !439, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !440, line: 214, baseType: !32)
!440 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !431, file: !359, line: 4212, baseType: !113, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !431, file: !359, line: 4214, baseType: !443, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !431, file: !359, line: 4216, baseType: !443, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !431, file: !359, line: 4218, baseType: !443, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !431, file: !359, line: 4220, baseType: !443, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !431, file: !359, line: 4222, baseType: !113, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !359, line: 4227, baseType: !164, size: 8, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_number", scope: !264, file: !265, line: 26, baseType: !113, size: 32, offset: 928)
!450 = !{!258, !451, !458, !463, !465, !476, !478, !485, !487}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_sq_0", scope: !260, file: !265, line: 152, type: !453, isLocal: false, isDefinition: true)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc_vnd_sensor_iodev_sq_0", file: !265, line: 152, size: 672, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !453, file: !265, line: 152, baseType: !325, size: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !453, file: !265, line: 152, baseType: !457, size: 512, offset: 160)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 512, elements: !244)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_6", scope: !260, file: !265, line: 152, type: !460, isLocal: false, isDefinition: true, align: 16)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 64, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 4)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "__device_dts_ord_6", scope: !260, file: !265, line: 152, type: !409, isLocal: false, isDefinition: true, align: 32)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_6", scope: !260, file: !265, line: 152, type: !467, isLocal: true, isDefinition: true, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !{!471, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !468, file: !469, line: 60, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DISubroutineType(types: !474)
!474 = !{!108, !408}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !468, file: !469, line: 65, baseType: !408, size: 32, offset: 32)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_6", scope: !260, file: !265, line: 152, type: !418, isLocal: true, isDefinition: true, align: 8)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "vnd_sensor_config_0", scope: !260, file: !265, line: 152, type: !480, isLocal: true, isDefinition: true)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_config", file: !265, line: 16, size: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sample_period", scope: !481, file: !265, line: 17, baseType: !113, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !481, file: !265, line: 18, baseType: !439, size: 32, offset: 32)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "vnd_sensor_data_0", scope: !260, file: !265, line: 152, type: !264, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_api", scope: !260, file: !265, line: 127, type: !272, isLocal: true, isDefinition: true)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !254, line: 17, baseType: !105, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !490, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_6", scope: !496, file: !501, line: 17, type: !502, isLocal: false, isDefinition: true, align: 16)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !498, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!498 = !{!499, !505, !494}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !496, file: !501, line: 7, type: !502, isLocal: false, isDefinition: true, align: 16)
!501 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 48, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 3)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !496, file: !501, line: 12, type: !502, isLocal: false, isDefinition: true, align: 16)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !509, file: !522, line: 18, type: !523, isLocal: false, isDefinition: true)
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !511, globals: !521, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!511 = !{!22, !104, !24, !512, !514, !516, !439, !108, !517, !518, !519, !520, !443, !209, !168, !105}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!521 = !{!507}
!522 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !254, line: 17, baseType: !105, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !524, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "_char_out", scope: !530, file: !534, line: 54, type: !535, isLocal: false, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !532, globals: !533, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!532 = !{!104, !108}
!533 = !{!528}
!534 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DISubroutineType(types: !537)
!537 = !{!108, !108}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !540, file: !1269, line: 202, type: !1270, isLocal: true, isDefinition: true, align: 32)
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !542, globals: !1268, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/rtio/sensor_batch_processing")
!542 = !{!104, !108, !543, !665, !1002, !1003, !1070}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !545, line: 335, baseType: !546)
!545 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 320, size: 288, elements: !547)
!547 = !{!548, !559, !567, !581, !592, !603, !605, !616, !617, !628, !629, !644, !645, !655}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !546, file: !545, line: 321, baseType: !549, size: 16)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !545, line: 50, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 43, size: 16, elements: !552)
!552 = !{!553, !558}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !551, file: !545, line: 48, baseType: !554, size: 16)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !545, line: 44, size: 16, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !554, file: !545, line: 45, baseType: !168, size: 7, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !554, file: !545, line: 47, baseType: !168, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !551, file: !545, line: 49, baseType: !168, size: 16)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !546, file: !545, line: 322, baseType: !560, size: 16, offset: 16)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 16, elements: !565)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !562, line: 52, baseType: !563)
!562 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !164)
!565 = !{!566}
!566 = !DISubrange(count: 2)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !546, file: !545, line: 323, baseType: !568, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !545, line: 107, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 94, size: 32, elements: !571)
!571 = !{!572, !580}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !570, file: !545, line: 105, baseType: !573, size: 32)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !570, file: !545, line: 95, size: 32, elements: !574)
!574 = !{!575, !576, !577, !578, !579}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !573, file: !545, line: 97, baseType: !113, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !573, file: !545, line: 99, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !573, file: !545, line: 100, baseType: !113, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !573, file: !545, line: 102, baseType: !113, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !573, file: !545, line: 103, baseType: !113, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !570, file: !545, line: 106, baseType: !113, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !546, file: !545, line: 324, baseType: !582, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !545, line: 155, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 148, size: 32, elements: !585)
!585 = !{!586, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !584, file: !545, line: 153, baseType: !587, size: 32)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !584, file: !545, line: 149, size: 32, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !587, file: !545, line: 150, baseType: !113, size: 16, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !587, file: !545, line: 151, baseType: !113, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !584, file: !545, line: 154, baseType: !113, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !546, file: !545, line: 325, baseType: !593, size: 8, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !545, line: 194, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 187, size: 8, elements: !596)
!596 = !{!597, !602}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !595, file: !545, line: 192, baseType: !598, size: 8)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !595, file: !545, line: 188, size: 8, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !598, file: !545, line: 189, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !598, file: !545, line: 190, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !595, file: !545, line: 193, baseType: !164, size: 8)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !546, file: !545, line: 326, baseType: !604, size: 24, offset: 104)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 24, elements: !503)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !546, file: !545, line: 327, baseType: !606, size: 8, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !545, line: 215, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 208, size: 8, elements: !609)
!609 = !{!610, !615}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !608, file: !545, line: 213, baseType: !611, size: 8)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !545, line: 209, size: 8, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !611, file: !545, line: 210, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !611, file: !545, line: 211, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !608, file: !545, line: 214, baseType: !164, size: 8)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !546, file: !545, line: 328, baseType: !604, size: 24, offset: 136)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !546, file: !545, line: 329, baseType: !618, size: 8, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !545, line: 236, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 229, size: 8, elements: !621)
!621 = !{!622, !627}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !620, file: !545, line: 234, baseType: !623, size: 8)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !620, file: !545, line: 230, size: 8, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !623, file: !545, line: 231, baseType: !563, size: 1, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !623, file: !545, line: 232, baseType: !563, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !620, file: !545, line: 235, baseType: !164, size: 8)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !546, file: !545, line: 330, baseType: !604, size: 24, offset: 168)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !546, file: !545, line: 331, baseType: !630, size: 16, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !545, line: 262, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 250, size: 16, elements: !633)
!633 = !{!634, !643}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !632, file: !545, line: 260, baseType: !635, size: 16)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !632, file: !545, line: 251, size: 16, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !635, file: !545, line: 252, baseType: !168, size: 1, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !635, file: !545, line: 253, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !635, file: !545, line: 254, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !635, file: !545, line: 255, baseType: !168, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !635, file: !545, line: 256, baseType: !168, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !635, file: !545, line: 258, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !632, file: !545, line: 261, baseType: !168, size: 16)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !546, file: !545, line: 332, baseType: !560, size: 16, offset: 208)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !546, file: !545, line: 333, baseType: !646, size: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !545, line: 290, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 284, size: 32, elements: !649)
!649 = !{!650, !654}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !648, file: !545, line: 288, baseType: !651, size: 32)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !648, file: !545, line: 285, size: 32, elements: !652)
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !651, file: !545, line: 286, baseType: !113, size: 22, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !648, file: !545, line: 289, baseType: !113, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !546, file: !545, line: 334, baseType: !656, size: 16, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !545, line: 308, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !545, line: 303, size: 16, elements: !659)
!659 = !{!660, !664}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !658, file: !545, line: 306, baseType: !661, size: 16)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !545, line: 304, size: 16, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !661, file: !545, line: 305, baseType: !168, size: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !658, file: !545, line: 307, baseType: !168, size: 16)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !667, line: 928, baseType: !668)
!667 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 899, size: 672, elements: !669)
!669 = !{!670, !694, !718, !744, !769, !785, !786, !804, !805, !822, !833, !834, !849, !869, !870, !882, !894, !904, !905, !922, !924, !935, !936, !948, !960, !961, !972, !988}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !668, file: !667, line: 900, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !667, line: 64, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 43, size: 32, elements: !674)
!674 = !{!675, !693}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !673, file: !667, line: 62, baseType: !676, size: 32)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !673, file: !667, line: 44, size: 32, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !676, file: !667, line: 45, baseType: !113, size: 1, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !676, file: !667, line: 46, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !676, file: !667, line: 47, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !676, file: !667, line: 48, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !676, file: !667, line: 49, baseType: !113, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !676, file: !667, line: 50, baseType: !113, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !676, file: !667, line: 51, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !676, file: !667, line: 52, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !676, file: !667, line: 53, baseType: !113, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !676, file: !667, line: 54, baseType: !113, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !676, file: !667, line: 55, baseType: !113, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !676, file: !667, line: 56, baseType: !113, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !676, file: !667, line: 58, baseType: !113, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !676, file: !667, line: 59, baseType: !113, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !676, file: !667, line: 60, baseType: !113, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !673, file: !667, line: 63, baseType: !113, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !668, file: !667, line: 901, baseType: !695, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !667, line: 125, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 104, size: 32, elements: !698)
!698 = !{!699, !717}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !697, file: !667, line: 123, baseType: !700, size: 32)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !697, file: !667, line: 105, size: 32, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !700, file: !667, line: 106, baseType: !113, size: 1, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !700, file: !667, line: 107, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !700, file: !667, line: 108, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !700, file: !667, line: 109, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !700, file: !667, line: 110, baseType: !113, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !700, file: !667, line: 111, baseType: !113, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !700, file: !667, line: 112, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !700, file: !667, line: 113, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !700, file: !667, line: 114, baseType: !113, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !700, file: !667, line: 115, baseType: !113, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !700, file: !667, line: 116, baseType: !113, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !700, file: !667, line: 117, baseType: !113, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !700, file: !667, line: 119, baseType: !113, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !700, file: !667, line: 120, baseType: !113, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !700, file: !667, line: 121, baseType: !113, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !697, file: !667, line: 124, baseType: !113, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !668, file: !667, line: 902, baseType: !719, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !667, line: 186, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 165, size: 32, elements: !722)
!722 = !{!723, !743}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !721, file: !667, line: 184, baseType: !724, size: 32)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !721, file: !667, line: 166, size: 32, elements: !725)
!725 = !{!726, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !724, file: !667, line: 167, baseType: !727, size: 1, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !724, file: !667, line: 168, baseType: !727, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !724, file: !667, line: 169, baseType: !727, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !724, file: !667, line: 170, baseType: !727, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !724, file: !667, line: 171, baseType: !727, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !724, file: !667, line: 172, baseType: !727, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !724, file: !667, line: 173, baseType: !727, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !724, file: !667, line: 174, baseType: !727, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !724, file: !667, line: 175, baseType: !727, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !724, file: !667, line: 176, baseType: !727, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !724, file: !667, line: 177, baseType: !727, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !724, file: !667, line: 178, baseType: !727, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !724, file: !667, line: 180, baseType: !727, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !724, file: !667, line: 181, baseType: !727, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !724, file: !667, line: 182, baseType: !727, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !721, file: !667, line: 185, baseType: !113, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !668, file: !667, line: 903, baseType: !745, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !667, line: 247, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 226, size: 32, elements: !749)
!749 = !{!750, !768}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !748, file: !667, line: 245, baseType: !751, size: 32)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !748, file: !667, line: 227, size: 32, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !751, file: !667, line: 228, baseType: !113, size: 1, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !751, file: !667, line: 229, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !751, file: !667, line: 230, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !751, file: !667, line: 231, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !751, file: !667, line: 232, baseType: !113, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !751, file: !667, line: 233, baseType: !113, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !751, file: !667, line: 234, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !751, file: !667, line: 235, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !751, file: !667, line: 236, baseType: !113, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !751, file: !667, line: 237, baseType: !113, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !751, file: !667, line: 238, baseType: !113, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !751, file: !667, line: 239, baseType: !113, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !751, file: !667, line: 241, baseType: !113, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !751, file: !667, line: 242, baseType: !113, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !751, file: !667, line: 243, baseType: !113, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !748, file: !667, line: 246, baseType: !113, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !668, file: !667, line: 904, baseType: !770, size: 16, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !667, line: 300, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 287, size: 16, elements: !773)
!773 = !{!774, !784}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !772, file: !667, line: 298, baseType: !775, size: 16)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !772, file: !667, line: 288, size: 16, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !775, file: !667, line: 290, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !775, file: !667, line: 291, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !775, file: !667, line: 293, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !775, file: !667, line: 294, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !775, file: !667, line: 295, baseType: !168, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !775, file: !667, line: 296, baseType: !168, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !775, file: !667, line: 297, baseType: !168, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !772, file: !667, line: 299, baseType: !168, size: 16)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !668, file: !667, line: 905, baseType: !560, size: 16, offset: 144)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !668, file: !667, line: 906, baseType: !787, size: 16, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !667, line: 352, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 336, size: 16, elements: !790)
!790 = !{!791, !803}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !789, file: !667, line: 350, baseType: !792, size: 16)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !789, file: !667, line: 337, size: 16, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801, !802}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !792, file: !667, line: 339, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !792, file: !667, line: 340, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !792, file: !667, line: 341, baseType: !168, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !792, file: !667, line: 342, baseType: !168, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !792, file: !667, line: 343, baseType: !168, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !792, file: !667, line: 344, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !792, file: !667, line: 345, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !792, file: !667, line: 346, baseType: !168, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !792, file: !667, line: 348, baseType: !168, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !789, file: !667, line: 351, baseType: !168, size: 16)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !668, file: !667, line: 907, baseType: !560, size: 16, offset: 176)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !668, file: !667, line: 908, baseType: !806, size: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !667, line: 398, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 381, size: 32, elements: !809)
!809 = !{!810, !821}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !808, file: !667, line: 396, baseType: !811, size: 32)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !808, file: !667, line: 382, size: 32, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !811, file: !667, line: 384, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !811, file: !667, line: 385, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !811, file: !667, line: 386, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !811, file: !667, line: 388, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !811, file: !667, line: 389, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !811, file: !667, line: 390, baseType: !113, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !811, file: !667, line: 392, baseType: !113, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !811, file: !667, line: 394, baseType: !113, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !808, file: !667, line: 397, baseType: !113, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !668, file: !667, line: 909, baseType: !823, size: 8, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !667, line: 433, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 426, size: 8, elements: !826)
!826 = !{!827, !832}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !825, file: !667, line: 431, baseType: !828, size: 8)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !825, file: !667, line: 427, size: 8, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !828, file: !667, line: 428, baseType: !164, size: 5, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !828, file: !667, line: 430, baseType: !164, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !825, file: !667, line: 432, baseType: !164, size: 8)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !668, file: !667, line: 910, baseType: !604, size: 24, offset: 232)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !668, file: !667, line: 911, baseType: !835, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !667, line: 462, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 448, size: 32, elements: !838)
!838 = !{!839, !848}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !837, file: !667, line: 460, baseType: !840, size: 32)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !837, file: !667, line: 449, size: 32, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !840, file: !667, line: 451, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !840, file: !667, line: 453, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !840, file: !667, line: 454, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !840, file: !667, line: 455, baseType: !113, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !840, file: !667, line: 457, baseType: !113, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !840, file: !667, line: 459, baseType: !113, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !837, file: !667, line: 461, baseType: !113, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !668, file: !667, line: 912, baseType: !850, size: 16, offset: 288)
!850 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !667, line: 520, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 503, size: 16, elements: !853)
!853 = !{!854, !868}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !852, file: !667, line: 518, baseType: !855, size: 16)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !852, file: !667, line: 504, size: 16, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !855, file: !667, line: 506, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !855, file: !667, line: 507, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !855, file: !667, line: 508, baseType: !168, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !855, file: !667, line: 509, baseType: !168, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !855, file: !667, line: 510, baseType: !168, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !855, file: !667, line: 511, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !855, file: !667, line: 512, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !855, file: !667, line: 513, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !855, file: !667, line: 514, baseType: !168, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !855, file: !667, line: 515, baseType: !168, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !855, file: !667, line: 516, baseType: !168, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !852, file: !667, line: 519, baseType: !168, size: 16)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !668, file: !667, line: 913, baseType: !560, size: 16, offset: 304)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !668, file: !667, line: 914, baseType: !871, size: 32, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !667, line: 559, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 552, size: 32, elements: !874)
!874 = !{!875, !881}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !873, file: !667, line: 557, baseType: !876, size: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !873, file: !667, line: 553, size: 32, elements: !877)
!877 = !{!878, !879, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !876, file: !667, line: 554, baseType: !113, size: 10, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !876, file: !667, line: 555, baseType: !113, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !876, file: !667, line: 556, baseType: !113, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !873, file: !667, line: 558, baseType: !113, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !668, file: !667, line: 915, baseType: !883, size: 32, offset: 352)
!883 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !667, line: 585, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 578, size: 32, elements: !886)
!886 = !{!887, !893}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !885, file: !667, line: 583, baseType: !888, size: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !885, file: !667, line: 579, size: 32, elements: !889)
!889 = !{!890, !891, !892}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !888, file: !667, line: 580, baseType: !113, size: 16, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !888, file: !667, line: 581, baseType: !113, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !888, file: !667, line: 582, baseType: !113, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !885, file: !667, line: 584, baseType: !113, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !668, file: !667, line: 916, baseType: !895, size: 8, offset: 384)
!895 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !667, line: 610, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 604, size: 8, elements: !898)
!898 = !{!899, !903}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !897, file: !667, line: 608, baseType: !900, size: 8)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !667, line: 605, size: 8, elements: !901)
!901 = !{!902}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !900, file: !667, line: 607, baseType: !164, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !897, file: !667, line: 609, baseType: !164, size: 8)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !668, file: !667, line: 917, baseType: !604, size: 24, offset: 392)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !668, file: !667, line: 918, baseType: !906, size: 32, offset: 416)
!906 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !667, line: 639, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 622, size: 32, elements: !909)
!909 = !{!910, !921}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !908, file: !667, line: 637, baseType: !911, size: 32)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !908, file: !667, line: 623, size: 32, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !911, file: !667, line: 625, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !911, file: !667, line: 626, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !911, file: !667, line: 627, baseType: !113, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !911, file: !667, line: 629, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !911, file: !667, line: 631, baseType: !113, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !911, file: !667, line: 632, baseType: !113, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !911, file: !667, line: 634, baseType: !113, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !911, file: !667, line: 635, baseType: !113, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !908, file: !667, line: 638, baseType: !113, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !668, file: !667, line: 919, baseType: !923, size: 32, offset: 448)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 32, elements: !461)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !668, file: !667, line: 920, baseType: !925, size: 16, offset: 480)
!925 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !667, line: 715, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 706, size: 16, elements: !928)
!928 = !{!929, !934}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !927, file: !667, line: 713, baseType: !930, size: 16)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !927, file: !667, line: 707, size: 16, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !930, file: !667, line: 709, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !930, file: !667, line: 711, baseType: !168, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !927, file: !667, line: 714, baseType: !168, size: 16)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !668, file: !667, line: 921, baseType: !560, size: 16, offset: 496)
