; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/fs/littlefs/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.fs_mount_t = type { %struct._dnode, i32, i8*, i8*, i8*, i32, %struct.fs_file_system_t*, i8 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.fs_file_system_t = type { {}*, i32 (%struct.fs_file_t*, i8*, i32)*, i32 (%struct.fs_file_t*, i8*, i32)*, i32 (%struct.fs_file_t*, i32, i32)*, i32 (%struct.fs_file_t*)*, i32 (%struct.fs_file_t*, i32)*, i32 (%struct.fs_file_t*)*, i32 (%struct.fs_file_t*)*, i32 (%struct.fs_dir_t*, i8*)*, i32 (%struct.fs_dir_t*, %struct.fs_dirent*)*, i32 (%struct.fs_dir_t*)*, i32 (%struct.fs_mount_t*)*, i32 (%struct.fs_mount_t*)*, i32 (%struct.fs_mount_t*, i8*)*, i32 (%struct.fs_mount_t*, i8*, i8*)*, i32 (%struct.fs_mount_t*, i8*)*, i32 (%struct.fs_mount_t*, i8*, %struct.fs_dirent*)*, i32 (%struct.fs_mount_t*, i8*, %struct.fs_statvfs*)* }
%struct.fs_file_t = type { i8*, %struct.fs_mount_t*, i8 }
%struct.fs_dir_t = type { i8*, %struct.fs_mount_t* }
%struct.fs_dirent = type { i32, [257 x i8], i32 }
%struct.fs_statvfs = type { i32, i32, i32, i32 }
%struct.fs_littlefs = type { %struct.lfs_config, i8*, i8*, [8 x i32*], %struct.lfs, i8*, %struct.k_mutex }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/fs/littlefs/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/fs/littlefs")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/fs/littlefs")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !112, line: 19, type: !406, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !106, globals: !109, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/fs/littlefs/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/fs/littlefs")
!29 = !{!30, !101}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fs_dir_entry_type", file: !102, line: 27, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/fs/fs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105}
!104 = !DIEnumerator(name: "FS_DIR_ENTRY_FILE", value: 0)
!105 = !DIEnumerator(name: "FS_DIR_ENTRY_DIR", value: 1)
!106 = !{!107, !108, !22, !32}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !{!25, !110, !149, !151, !367, !372, !374, !377, !401}
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "mp", scope: !27, file: !112, line: 276, type: !113, isLocal: false, isDefinition: true)
!112 = !DIFile(filename: "zephyr/samples/subsys/fs/littlefs/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_mount_t", file: !102, line: 91, size: 288, elements: !115)
!115 = !{!116, !132, !133, !137, !138, !139, !142, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !114, file: !102, line: 92, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !118, line: 49, baseType: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !118, line: 37, size: 64, elements: !120)
!120 = !{!121, !127}
!121 = !DIDerivedType(tag: DW_TAG_member, scope: !119, file: !118, line: 38, baseType: !122, size: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !119, file: !118, line: 38, size: 32, elements: !123)
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !118, line: 39, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !118, line: 40, baseType: !125, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !119, file: !118, line: 42, baseType: !128, size: 32, offset: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !119, file: !118, line: 42, size: 32, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !128, file: !118, line: 43, baseType: !125, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !128, file: !118, line: 44, baseType: !125, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !102, line: 93, baseType: !108, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_point", scope: !114, file: !102, line: 94, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "fs_data", scope: !114, file: !102, line: 95, baseType: !107, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "storage_dev", scope: !114, file: !102, line: 96, baseType: !107, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mountp_len", scope: !114, file: !102, line: 98, baseType: !140, size: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !141, line: 214, baseType: !32)
!141 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !114, file: !102, line: 99, baseType: !143, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_file_system_t", file: !102, line: 25, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !114, file: !102, line: 100, baseType: !147, size: 8, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "lfs_storage_mnt", scope: !27, file: !112, line: 268, type: !114, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "storage", scope: !27, file: !112, line: 267, type: !153, isLocal: true, isDefinition: true)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_littlefs", file: !154, line: 21, size: 2080, elements: !155)
!154 = !DIFile(filename: "zephyr/include/zephyr/fs/littlefs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = !{!156, !198, !200, !201, !206, !265, !266}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !153, file: !154, line: 23, baseType: !157, size: 608)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lfs_config", file: !158, line: 158, size: 608, elements: !159)
!158 = !DIFile(filename: "modules/fs/littlefs/lfs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!159 = !{!160, !161, !171, !175, !179, !183, !184, !185, !186, !187, !189, !190, !191, !192, !193, !194, !195, !196, !197}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !157, file: !158, line: 161, baseType: !107, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !157, file: !158, line: 165, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!108, !165, !167, !169, !107, !170}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "lfs_block_t", file: !158, line: 47, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "lfs_off_t", file: !158, line: 42, baseType: !168)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "lfs_size_t", file: !158, line: 41, baseType: !168)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !157, file: !158, line: 171, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DISubroutineType(types: !174)
!174 = !{!108, !165, !167, !169, !13, !170}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !157, file: !158, line: 178, baseType: !176, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!108, !165, !167}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !157, file: !158, line: 182, baseType: !180, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{!108, !165}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "read_size", scope: !157, file: !158, line: 196, baseType: !170, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "prog_size", scope: !157, file: !158, line: 200, baseType: !170, size: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !157, file: !158, line: 206, baseType: !170, size: 32, offset: 224)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !157, file: !158, line: 209, baseType: !170, size: 32, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "block_cycles", scope: !157, file: !158, line: 217, baseType: !188, size: 32, offset: 288)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !157, file: !158, line: 224, baseType: !170, size: 32, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead_size", scope: !157, file: !158, line: 230, baseType: !170, size: 32, offset: 352)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer", scope: !157, file: !158, line: 234, baseType: !107, size: 32, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prog_buffer", scope: !157, file: !158, line: 238, baseType: !107, size: 32, offset: 416)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead_buffer", scope: !157, file: !158, line: 243, baseType: !107, size: 32, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !157, file: !158, line: 249, baseType: !170, size: 32, offset: 480)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "file_max", scope: !157, file: !158, line: 254, baseType: !170, size: 32, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "attr_max", scope: !157, file: !158, line: 259, baseType: !170, size: 32, offset: 544)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_max", scope: !157, file: !158, line: 265, baseType: !170, size: 32, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer", scope: !153, file: !154, line: 26, baseType: !199, size: 32, offset: 608)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prog_buffer", scope: !153, file: !154, line: 29, baseType: !199, size: 32, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead_buffer", scope: !153, file: !154, line: 34, baseType: !202, size: 256, offset: 672)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 256, elements: !204)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!204 = !{!205}
!205 = !DISubrange(count: 8)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lfs", scope: !153, file: !154, line: 37, baseType: !207, size: 960, offset: 928)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lfs", file: !158, line: 387, size: 960, elements: !208)
!208 = !{!209, !217, !218, !222, !244, !245, !251, !252, !253, !261, !262, !263, !264}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rcache", scope: !207, file: !158, line: 388, baseType: !210, size: 128)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "lfs_cache_t", file: !158, line: 327, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lfs_cache", file: !158, line: 322, size: 128, elements: !212)
!212 = !{!213, !214, !215, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !211, file: !158, line: 323, baseType: !167, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !211, file: !158, line: 324, baseType: !169, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !211, file: !158, line: 325, baseType: !170, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !211, file: !158, line: 326, baseType: !199, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pcache", scope: !207, file: !158, line: 389, baseType: !210, size: 128, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !207, file: !158, line: 391, baseType: !219, size: 64, offset: 256)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 2)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mlist", scope: !207, file: !158, line: 397, baseType: !223, size: 32, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lfs_mlist", file: !158, line: 392, size: 320, elements: !225)
!225 = !{!226, !227, !230, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !224, file: !158, line: 393, baseType: !223, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !224, file: !158, line: 394, baseType: !228, size: 16, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !229)
!229 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !224, file: !158, line: 395, baseType: !147, size: 8, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !224, file: !158, line: 396, baseType: !232, size: 256, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "lfs_mdir_t", file: !158, line: 338, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lfs_mdir", file: !158, line: 329, size: 256, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !242, !243}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !233, file: !158, line: 330, baseType: !219, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rev", scope: !233, file: !158, line: 331, baseType: !168, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !233, file: !158, line: 332, baseType: !169, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !233, file: !158, line: 333, baseType: !168, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !233, file: !158, line: 334, baseType: !228, size: 16, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "erased", scope: !233, file: !158, line: 335, baseType: !241, size: 8, offset: 176)
!241 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !233, file: !158, line: 336, baseType: !241, size: 8, offset: 184)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !233, file: !158, line: 337, baseType: !219, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !207, file: !158, line: 398, baseType: !168, size: 32, offset: 352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "gstate", scope: !207, file: !158, line: 400, baseType: !246, size: 96, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "lfs_gstate_t", file: !158, line: 384, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lfs_gstate", file: !158, line: 381, size: 96, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !247, file: !158, line: 382, baseType: !168, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !247, file: !158, line: 383, baseType: !219, size: 64, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "gdisk", scope: !207, file: !158, line: 401, baseType: !246, size: 96, offset: 480)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "gdelta", scope: !207, file: !158, line: 402, baseType: !246, size: 96, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !207, file: !158, line: 410, baseType: !254, size: 160, offset: 672)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lfs_free", file: !158, line: 404, size: 160, elements: !255)
!255 = !{!256, !257, !258, !259, !260}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !254, file: !158, line: 405, baseType: !167, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !254, file: !158, line: 406, baseType: !167, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !254, file: !158, line: 407, baseType: !167, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !254, file: !158, line: 408, baseType: !167, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !254, file: !158, line: 409, baseType: !203, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !207, file: !158, line: 412, baseType: !165, size: 32, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !207, file: !158, line: 413, baseType: !170, size: 32, offset: 864)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "file_max", scope: !207, file: !158, line: 414, baseType: !170, size: 32, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "attr_max", scope: !207, file: !158, line: 415, baseType: !170, size: 32, offset: 928)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !153, file: !154, line: 38, baseType: !107, size: 32, offset: 1888)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !153, file: !154, line: 39, baseType: !267, size: 160, offset: 1920)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !268, line: 2720, size: 160, elements: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270, !277, !365, !366}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !267, file: !268, line: 2722, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !272, line: 233, baseType: !273)
!272 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !272, line: 231, size: 64, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !273, file: !272, line: 232, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !118, line: 48, baseType: !119)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !267, file: !268, line: 2724, baseType: !278, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !280, line: 245, size: 896, elements: !281)
!280 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!281 = !{!282, !326, !339, !340, !341, !342, !360}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !279, file: !280, line: 247, baseType: !283, size: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !280, line: 57, size: 384, elements: !284)
!284 = !{!285, !296, !298, !299, !300, !311, !312, !313}
!285 = !DIDerivedType(tag: DW_TAG_member, scope: !283, file: !280, line: 60, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !283, file: !280, line: 60, size: 64, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !286, file: !280, line: 61, baseType: !117, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !286, file: !280, line: 62, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !291, line: 49, size: 64, elements: !292)
!291 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !290, file: !291, line: 50, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 64, elements: !220)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !283, file: !280, line: 68, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !283, file: !280, line: 71, baseType: !147, size: 8, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !283, file: !280, line: 74, baseType: !147, size: 8, offset: 104)
!300 = !DIDerivedType(tag: DW_TAG_member, scope: !283, file: !280, line: 90, baseType: !301, size: 16, offset: 112)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !283, file: !280, line: 90, size: 16, elements: !302)
!302 = !{!303, !310}
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !280, line: 91, baseType: !304, size: 16)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !301, file: !280, line: 91, size: 16, elements: !305)
!305 = !{!306, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !304, file: !280, line: 96, baseType: !307, size: 8)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !308)
!308 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !304, file: !280, line: 97, baseType: !147, size: 8, offset: 8)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !301, file: !280, line: 100, baseType: !228, size: 16)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !283, file: !280, line: 107, baseType: !168, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !283, file: !280, line: 127, baseType: !107, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !283, file: !280, line: 131, baseType: !314, size: 192, offset: 192)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !272, line: 244, size: 192, elements: !315)
!315 = !{!316, !317, !323}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !314, file: !272, line: 245, baseType: !117, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !314, file: !272, line: 246, baseType: !318, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !272, line: 242, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !314, file: !272, line: 249, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !325)
!325 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !279, file: !280, line: 250, baseType: !327, size: 288, offset: 384)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !328, line: 25, size: 288, elements: !329)
!328 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !327, file: !328, line: 26, baseType: !168, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !327, file: !328, line: 27, baseType: !168, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !327, file: !328, line: 28, baseType: !168, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !327, file: !328, line: 29, baseType: !168, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !327, file: !328, line: 30, baseType: !168, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !327, file: !328, line: 31, baseType: !168, size: 32, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !327, file: !328, line: 32, baseType: !168, size: 32, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !327, file: !328, line: 33, baseType: !168, size: 32, offset: 224)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !327, file: !328, line: 34, baseType: !168, size: 32, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !279, file: !280, line: 253, baseType: !107, size: 32, offset: 672)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !279, file: !280, line: 256, baseType: !271, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !279, file: !280, line: 294, baseType: !108, size: 32, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !279, file: !280, line: 325, baseType: !343, size: 32, offset: 800)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !268, line: 5073, size: 160, elements: !345)
!345 = !{!346, !355, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !344, file: !268, line: 5074, baseType: !347, size: 96)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !348, line: 56, size: 96, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !353, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !347, file: !348, line: 57, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !348, line: 57, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !347, file: !348, line: 58, baseType: !107, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !347, file: !348, line: 59, baseType: !140, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !344, file: !268, line: 5075, baseType: !271, size: 64, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !344, file: !268, line: 5076, baseType: !357, offset: 160)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !358, line: 43, elements: !359)
!358 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !{}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !279, file: !280, line: 343, baseType: !361, size: 64, offset: 832)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !328, line: 60, size: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !361, file: !328, line: 63, baseType: !168, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !361, file: !328, line: 66, baseType: !168, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !267, file: !268, line: 2727, baseType: !168, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !267, file: !268, line: 2730, baseType: !108, size: 32, offset: 128)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "storage_read_buffer", scope: !27, file: !112, line: 267, type: !369, isLocal: true, isDefinition: true, align: 32)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 512, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 64)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "storage_prog_buffer", scope: !27, file: !112, line: 267, type: !369, isLocal: true, isDefinition: true, align: 32)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "storage_lookahead_buffer", scope: !27, file: !112, line: 267, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 256, elements: !204)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "entry", scope: !379, file: !112, line: 30, type: !393, isLocal: true, isDefinition: true)
!379 = distinct !DISubprogram(name: "lsdir", scope: !112, file: !112, line: 26, type: !380, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !382)
!380 = !DISubroutineType(types: !381)
!381 = !{!108, !134}
!382 = !{!383, !384, !385}
!383 = !DILocalVariable(name: "path", arg: 1, scope: !379, file: !112, line: 26, type: !134)
!384 = !DILocalVariable(name: "res", scope: !379, file: !112, line: 28, type: !108)
!385 = !DILocalVariable(name: "dirp", scope: !379, file: !112, line: 29, type: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_dir_t", file: !387, line: 67, size: 64, elements: !388)
!387 = !DIFile(filename: "zephyr/include/zephyr/fs/fs_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dirp", scope: !386, file: !387, line: 68, baseType: !107, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !386, file: !387, line: 69, baseType: !391, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_dirent", file: !102, line: 115, size: 2144, elements: !394)
!394 = !{!395, !396, !400}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !393, file: !102, line: 116, baseType: !101, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !393, file: !102, line: 117, baseType: !397, size: 2056, offset: 32)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2056, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 257)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !393, file: !102, line: 118, baseType: !140, size: 32, offset: 2112)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "file_test_pattern", scope: !27, file: !112, line: 25, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 4376, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 547)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !408, line: 16, size: 64, elements: !409)
!408 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !407, file: !408, line: 17, baseType: !134, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !407, file: !408, line: 18, baseType: !147, size: 8, offset: 32)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !414, file: !429, line: 18, type: !430, isLocal: false, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !416, globals: !428, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/fs/littlefs")
!416 = !{!22, !107, !24, !417, !419, !421, !140, !108, !422, !423, !425, !426, !427, !199, !228, !134}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!428 = !{!412}
!429 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !408, line: 16, size: 64, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !431, file: !408, line: 17, baseType: !134, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !431, file: !408, line: 18, baseType: !147, size: 8, offset: 32)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "_char_out", scope: !437, file: !442, line: 54, type: !443, isLocal: false, isDefinition: true)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !439, retainedTypes: !440, globals: !441, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/fs/littlefs")
!439 = !{!30}
!440 = !{!107, !108}
!441 = !{!435}
!442 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DISubroutineType(types: !445)
!445 = !{!108, !108}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !448, file: !1179, line: 202, type: !1180, isLocal: true, isDefinition: true, align: 32)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !439, retainedTypes: !450, globals: !1178, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/fs/littlefs")
!450 = !{!107, !108, !451, !573, !203, !912, !979}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !453, line: 335, baseType: !454)
!453 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 320, size: 288, elements: !455)
!455 = !{!456, !467, !473, !487, !498, !509, !513, !524, !525, !536, !537, !552, !553, !563}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !454, file: !453, line: 321, baseType: !457, size: 16)
!457 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !453, line: 50, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 43, size: 16, elements: !460)
!460 = !{!461, !466}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !459, file: !453, line: 48, baseType: !462, size: 16)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !453, line: 44, size: 16, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !462, file: !453, line: 45, baseType: !228, size: 7, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !462, file: !453, line: 47, baseType: !228, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !459, file: !453, line: 49, baseType: !228, size: 16)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !454, file: !453, line: 322, baseType: !468, size: 16, offset: 16)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 16, elements: !220)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !470, line: 52, baseType: !471)
!470 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !147)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !454, file: !453, line: 323, baseType: !474, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !453, line: 107, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 94, size: 32, elements: !477)
!477 = !{!478, !486}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !476, file: !453, line: 105, baseType: !479, size: 32)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !476, file: !453, line: 95, size: 32, elements: !480)
!480 = !{!481, !482, !483, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !479, file: !453, line: 97, baseType: !168, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !479, file: !453, line: 99, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !479, file: !453, line: 100, baseType: !168, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !479, file: !453, line: 102, baseType: !168, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !479, file: !453, line: 103, baseType: !168, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !476, file: !453, line: 106, baseType: !168, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !454, file: !453, line: 324, baseType: !488, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !453, line: 155, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 148, size: 32, elements: !491)
!491 = !{!492, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !490, file: !453, line: 153, baseType: !493, size: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !490, file: !453, line: 149, size: 32, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !493, file: !453, line: 150, baseType: !168, size: 16, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !493, file: !453, line: 151, baseType: !168, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !490, file: !453, line: 154, baseType: !168, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !454, file: !453, line: 325, baseType: !499, size: 8, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !453, line: 194, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 187, size: 8, elements: !502)
!502 = !{!503, !508}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !501, file: !453, line: 192, baseType: !504, size: 8)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !453, line: 188, size: 8, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !504, file: !453, line: 189, baseType: !147, size: 1, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !504, file: !453, line: 190, baseType: !147, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !501, file: !453, line: 193, baseType: !147, size: 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !454, file: !453, line: 326, baseType: !510, size: 24, offset: 104)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 24, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 3)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !454, file: !453, line: 327, baseType: !514, size: 8, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !453, line: 215, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 208, size: 8, elements: !517)
!517 = !{!518, !523}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !516, file: !453, line: 213, baseType: !519, size: 8)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !516, file: !453, line: 209, size: 8, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !519, file: !453, line: 210, baseType: !147, size: 1, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !519, file: !453, line: 211, baseType: !147, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !516, file: !453, line: 214, baseType: !147, size: 8)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !454, file: !453, line: 328, baseType: !510, size: 24, offset: 136)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !454, file: !453, line: 329, baseType: !526, size: 8, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !453, line: 236, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 229, size: 8, elements: !529)
!529 = !{!530, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !528, file: !453, line: 234, baseType: !531, size: 8)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !528, file: !453, line: 230, size: 8, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !531, file: !453, line: 231, baseType: !471, size: 1, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !531, file: !453, line: 232, baseType: !471, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !528, file: !453, line: 235, baseType: !147, size: 8)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !454, file: !453, line: 330, baseType: !510, size: 24, offset: 168)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !454, file: !453, line: 331, baseType: !538, size: 16, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !453, line: 262, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 250, size: 16, elements: !541)
!541 = !{!542, !551}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !540, file: !453, line: 260, baseType: !543, size: 16)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !453, line: 251, size: 16, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !543, file: !453, line: 252, baseType: !228, size: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !543, file: !453, line: 253, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !543, file: !453, line: 254, baseType: !228, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !543, file: !453, line: 255, baseType: !228, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !543, file: !453, line: 256, baseType: !228, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !543, file: !453, line: 258, baseType: !228, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !540, file: !453, line: 261, baseType: !228, size: 16)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !454, file: !453, line: 332, baseType: !468, size: 16, offset: 208)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !454, file: !453, line: 333, baseType: !554, size: 32, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !453, line: 290, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 284, size: 32, elements: !557)
!557 = !{!558, !562}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !556, file: !453, line: 288, baseType: !559, size: 32)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !556, file: !453, line: 285, size: 32, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !559, file: !453, line: 286, baseType: !168, size: 22, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !556, file: !453, line: 289, baseType: !168, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !454, file: !453, line: 334, baseType: !564, size: 16, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !453, line: 308, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 303, size: 16, elements: !567)
!567 = !{!568, !572}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !566, file: !453, line: 306, baseType: !569, size: 16)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !566, file: !453, line: 304, size: 16, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !569, file: !453, line: 305, baseType: !228, size: 16, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !566, file: !453, line: 307, baseType: !228, size: 16)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !575, line: 928, baseType: !576)
!575 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 899, size: 672, elements: !577)
!577 = !{!578, !602, !626, !652, !677, !693, !694, !712, !713, !730, !741, !742, !757, !777, !778, !790, !802, !812, !813, !830, !834, !845, !846, !858, !870, !871, !882, !898}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !576, file: !575, line: 900, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !575, line: 64, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 43, size: 32, elements: !582)
!582 = !{!583, !601}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !581, file: !575, line: 62, baseType: !584, size: 32)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !575, line: 44, size: 32, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !584, file: !575, line: 45, baseType: !168, size: 1, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !584, file: !575, line: 46, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !584, file: !575, line: 47, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !584, file: !575, line: 48, baseType: !168, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !584, file: !575, line: 49, baseType: !168, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !584, file: !575, line: 50, baseType: !168, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !584, file: !575, line: 51, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !584, file: !575, line: 52, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !584, file: !575, line: 53, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !584, file: !575, line: 54, baseType: !168, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !584, file: !575, line: 55, baseType: !168, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !584, file: !575, line: 56, baseType: !168, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !584, file: !575, line: 58, baseType: !168, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !584, file: !575, line: 59, baseType: !168, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !584, file: !575, line: 60, baseType: !168, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !581, file: !575, line: 63, baseType: !168, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !576, file: !575, line: 901, baseType: !603, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !575, line: 125, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 104, size: 32, elements: !606)
!606 = !{!607, !625}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !605, file: !575, line: 123, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !605, file: !575, line: 105, size: 32, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !608, file: !575, line: 106, baseType: !168, size: 1, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !608, file: !575, line: 107, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !608, file: !575, line: 108, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !608, file: !575, line: 109, baseType: !168, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !608, file: !575, line: 110, baseType: !168, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !608, file: !575, line: 111, baseType: !168, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !608, file: !575, line: 112, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !608, file: !575, line: 113, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !608, file: !575, line: 114, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !608, file: !575, line: 115, baseType: !168, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !608, file: !575, line: 116, baseType: !168, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !608, file: !575, line: 117, baseType: !168, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !608, file: !575, line: 119, baseType: !168, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !608, file: !575, line: 120, baseType: !168, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !608, file: !575, line: 121, baseType: !168, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !605, file: !575, line: 124, baseType: !168, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !576, file: !575, line: 902, baseType: !627, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !575, line: 186, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 165, size: 32, elements: !630)
!630 = !{!631, !651}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !629, file: !575, line: 184, baseType: !632, size: 32)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !629, file: !575, line: 166, size: 32, elements: !633)
!633 = !{!634, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !632, file: !575, line: 167, baseType: !635, size: 1, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !168)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !632, file: !575, line: 168, baseType: !635, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !632, file: !575, line: 169, baseType: !635, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !632, file: !575, line: 170, baseType: !635, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !632, file: !575, line: 171, baseType: !635, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !632, file: !575, line: 172, baseType: !635, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !632, file: !575, line: 173, baseType: !635, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !632, file: !575, line: 174, baseType: !635, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !632, file: !575, line: 175, baseType: !635, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !632, file: !575, line: 176, baseType: !635, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !632, file: !575, line: 177, baseType: !635, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !632, file: !575, line: 178, baseType: !635, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !632, file: !575, line: 180, baseType: !635, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !632, file: !575, line: 181, baseType: !635, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !632, file: !575, line: 182, baseType: !635, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !629, file: !575, line: 185, baseType: !168, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !576, file: !575, line: 903, baseType: !653, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !575, line: 247, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 226, size: 32, elements: !657)
!657 = !{!658, !676}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !656, file: !575, line: 245, baseType: !659, size: 32)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !656, file: !575, line: 227, size: 32, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !659, file: !575, line: 228, baseType: !168, size: 1, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !659, file: !575, line: 229, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !659, file: !575, line: 230, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !659, file: !575, line: 231, baseType: !168, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !659, file: !575, line: 232, baseType: !168, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !659, file: !575, line: 233, baseType: !168, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !659, file: !575, line: 234, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !659, file: !575, line: 235, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !659, file: !575, line: 236, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !659, file: !575, line: 237, baseType: !168, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !659, file: !575, line: 238, baseType: !168, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !659, file: !575, line: 239, baseType: !168, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !659, file: !575, line: 241, baseType: !168, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !659, file: !575, line: 242, baseType: !168, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !659, file: !575, line: 243, baseType: !168, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !656, file: !575, line: 246, baseType: !168, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !576, file: !575, line: 904, baseType: !678, size: 16, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !575, line: 300, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 287, size: 16, elements: !681)
!681 = !{!682, !692}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !680, file: !575, line: 298, baseType: !683, size: 16)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !680, file: !575, line: 288, size: 16, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !683, file: !575, line: 290, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !683, file: !575, line: 291, baseType: !228, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !683, file: !575, line: 293, baseType: !228, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !683, file: !575, line: 294, baseType: !228, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !683, file: !575, line: 295, baseType: !228, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !683, file: !575, line: 296, baseType: !228, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !683, file: !575, line: 297, baseType: !228, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !680, file: !575, line: 299, baseType: !228, size: 16)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !576, file: !575, line: 905, baseType: !468, size: 16, offset: 144)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !576, file: !575, line: 906, baseType: !695, size: 16, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !575, line: 352, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 336, size: 16, elements: !698)
!698 = !{!699, !711}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !697, file: !575, line: 350, baseType: !700, size: 16)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !697, file: !575, line: 337, size: 16, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !700, file: !575, line: 339, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !700, file: !575, line: 340, baseType: !228, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !700, file: !575, line: 341, baseType: !228, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !700, file: !575, line: 342, baseType: !228, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !700, file: !575, line: 343, baseType: !228, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !700, file: !575, line: 344, baseType: !228, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !700, file: !575, line: 345, baseType: !228, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !700, file: !575, line: 346, baseType: !228, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !700, file: !575, line: 348, baseType: !228, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !697, file: !575, line: 351, baseType: !228, size: 16)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !576, file: !575, line: 907, baseType: !468, size: 16, offset: 176)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !576, file: !575, line: 908, baseType: !714, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !575, line: 398, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 381, size: 32, elements: !717)
!717 = !{!718, !729}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !716, file: !575, line: 396, baseType: !719, size: 32)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !716, file: !575, line: 382, size: 32, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !719, file: !575, line: 384, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !719, file: !575, line: 385, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !719, file: !575, line: 386, baseType: !168, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !719, file: !575, line: 388, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !719, file: !575, line: 389, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !719, file: !575, line: 390, baseType: !168, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !719, file: !575, line: 392, baseType: !168, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !719, file: !575, line: 394, baseType: !168, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !716, file: !575, line: 397, baseType: !168, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !576, file: !575, line: 909, baseType: !731, size: 8, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !575, line: 433, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 426, size: 8, elements: !734)
!734 = !{!735, !740}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !733, file: !575, line: 431, baseType: !736, size: 8)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !733, file: !575, line: 427, size: 8, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !736, file: !575, line: 428, baseType: !147, size: 5, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !736, file: !575, line: 430, baseType: !147, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !733, file: !575, line: 432, baseType: !147, size: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !576, file: !575, line: 910, baseType: !510, size: 24, offset: 232)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !576, file: !575, line: 911, baseType: !743, size: 32, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !575, line: 462, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 448, size: 32, elements: !746)
!746 = !{!747, !756}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !745, file: !575, line: 460, baseType: !748, size: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !745, file: !575, line: 449, size: 32, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !748, file: !575, line: 451, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !748, file: !575, line: 453, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !748, file: !575, line: 454, baseType: !168, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !748, file: !575, line: 455, baseType: !168, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !748, file: !575, line: 457, baseType: !168, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !748, file: !575, line: 459, baseType: !168, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !745, file: !575, line: 461, baseType: !168, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !576, file: !575, line: 912, baseType: !758, size: 16, offset: 288)
!758 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !575, line: 520, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 503, size: 16, elements: !761)
!761 = !{!762, !776}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !760, file: !575, line: 518, baseType: !763, size: 16)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !760, file: !575, line: 504, size: 16, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !763, file: !575, line: 506, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !763, file: !575, line: 507, baseType: !228, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !763, file: !575, line: 508, baseType: !228, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !763, file: !575, line: 509, baseType: !228, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !763, file: !575, line: 510, baseType: !228, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !763, file: !575, line: 511, baseType: !228, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !763, file: !575, line: 512, baseType: !228, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !763, file: !575, line: 513, baseType: !228, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !763, file: !575, line: 514, baseType: !228, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !763, file: !575, line: 515, baseType: !228, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !763, file: !575, line: 516, baseType: !228, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !760, file: !575, line: 519, baseType: !228, size: 16)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !576, file: !575, line: 913, baseType: !468, size: 16, offset: 304)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !576, file: !575, line: 914, baseType: !779, size: 32, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !575, line: 559, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 552, size: 32, elements: !782)
!782 = !{!783, !789}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !781, file: !575, line: 557, baseType: !784, size: 32)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !781, file: !575, line: 553, size: 32, elements: !785)
!785 = !{!786, !787, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !784, file: !575, line: 554, baseType: !168, size: 10, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !784, file: !575, line: 555, baseType: !168, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !784, file: !575, line: 556, baseType: !168, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !781, file: !575, line: 558, baseType: !168, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !576, file: !575, line: 915, baseType: !791, size: 32, offset: 352)
!791 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !575, line: 585, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 578, size: 32, elements: !794)
!794 = !{!795, !801}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !793, file: !575, line: 583, baseType: !796, size: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !793, file: !575, line: 579, size: 32, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !796, file: !575, line: 580, baseType: !168, size: 16, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !796, file: !575, line: 581, baseType: !168, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !796, file: !575, line: 582, baseType: !168, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !793, file: !575, line: 584, baseType: !168, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !576, file: !575, line: 916, baseType: !803, size: 8, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !575, line: 610, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 604, size: 8, elements: !806)
!806 = !{!807, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !805, file: !575, line: 608, baseType: !808, size: 8)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !805, file: !575, line: 605, size: 8, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !808, file: !575, line: 607, baseType: !147, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !805, file: !575, line: 609, baseType: !147, size: 8)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !576, file: !575, line: 917, baseType: !510, size: 24, offset: 392)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !576, file: !575, line: 918, baseType: !814, size: 32, offset: 416)
!814 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !575, line: 639, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 622, size: 32, elements: !817)
!817 = !{!818, !829}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !816, file: !575, line: 637, baseType: !819, size: 32)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !575, line: 623, size: 32, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !819, file: !575, line: 625, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !819, file: !575, line: 626, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !819, file: !575, line: 627, baseType: !168, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !819, file: !575, line: 629, baseType: !168, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !819, file: !575, line: 631, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !819, file: !575, line: 632, baseType: !168, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !819, file: !575, line: 634, baseType: !168, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !819, file: !575, line: 635, baseType: !168, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !816, file: !575, line: 638, baseType: !168, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !576, file: !575, line: 919, baseType: !831, size: 32, offset: 448)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 32, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 4)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !576, file: !575, line: 920, baseType: !835, size: 16, offset: 480)
!835 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !575, line: 715, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 706, size: 16, elements: !838)
!838 = !{!839, !844}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !837, file: !575, line: 713, baseType: !840, size: 16)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !837, file: !575, line: 707, size: 16, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !840, file: !575, line: 709, baseType: !228, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !840, file: !575, line: 711, baseType: !228, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !837, file: !575, line: 714, baseType: !228, size: 16)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !576, file: !575, line: 921, baseType: !468, size: 16, offset: 496)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !576, file: !575, line: 922, baseType: !847, size: 32, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !575, line: 739, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 729, size: 32, elements: !850)
!850 = !{!851, !857}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !849, file: !575, line: 737, baseType: !852, size: 32)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !849, file: !575, line: 730, size: 32, elements: !853)
!853 = !{!854, !855, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !852, file: !575, line: 732, baseType: !168, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !852, file: !575, line: 733, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !852, file: !575, line: 735, baseType: !168, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !849, file: !575, line: 738, baseType: !168, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !576, file: !575, line: 923, baseType: !859, size: 8, offset: 544)
!859 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !575, line: 765, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 756, size: 8, elements: !862)
!862 = !{!863, !869}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !861, file: !575, line: 763, baseType: !864, size: 8)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !861, file: !575, line: 757, size: 8, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !864, file: !575, line: 759, baseType: !147, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !864, file: !575, line: 761, baseType: !147, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !864, file: !575, line: 762, baseType: !147, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !861, file: !575, line: 764, baseType: !147, size: 8)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !576, file: !575, line: 924, baseType: !510, size: 24, offset: 552)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !576, file: !575, line: 925, baseType: !872, size: 32, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !575, line: 789, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 781, size: 32, elements: !875)
!875 = !{!876, !881}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !874, file: !575, line: 787, baseType: !877, size: 32)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !874, file: !575, line: 782, size: 32, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !877, file: !575, line: 783, baseType: !168, size: 12, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !877, file: !575, line: 785, baseType: !168, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !874, file: !575, line: 788, baseType: !168, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !576, file: !575, line: 926, baseType: !883, size: 32, offset: 608)
!883 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !575, line: 820, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 805, size: 32, elements: !886)
!886 = !{!887, !897}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !885, file: !575, line: 818, baseType: !888, size: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !885, file: !575, line: 806, size: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !888, file: !575, line: 807, baseType: !168, size: 2, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !888, file: !575, line: 808, baseType: !168, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !888, file: !575, line: 809, baseType: !168, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !888, file: !575, line: 810, baseType: !168, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !888, file: !575, line: 812, baseType: !168, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !888, file: !575, line: 814, baseType: !168, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !888, file: !575, line: 816, baseType: !168, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !885, file: !575, line: 819, baseType: !168, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !576, file: !575, line: 927, baseType: !899, size: 8, offset: 640)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !575, line: 881, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 872, size: 8, elements: !903)
!903 = !{!904, !911}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !902, file: !575, line: 879, baseType: !905, size: 8)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !902, file: !575, line: 873, size: 8, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !905, file: !575, line: 874, baseType: !147, size: 1, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !905, file: !575, line: 875, baseType: !147, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
