; ModuleID = 'build/arduino_nano_33_ble_sense/drivers/counter/alarm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.counter_alarm_cfg = type { void (%struct.device*, i8, i32, i8*)*, i32, i8*, i32 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "alarm_cfg", scope: !27, file: !228, line: 16, type: !176, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !227, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/counter/alarm/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !120, !167}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_config_info", file: !112, line: 169, size: 96, elements: !113)
!112 = !DIFile(filename: "zephyr/include/zephyr/drivers/counter.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !{!114, !115, !116, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "max_top_value", scope: !111, file: !112, line: 170, baseType: !102, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !111, file: !112, line: 171, baseType: !102, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !111, file: !112, line: 172, baseType: !117, size: 8, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !111, file: !112, line: 173, baseType: !117, size: 8, offset: 72)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_driver_api", file: !112, line: 198, size: 384, elements: !122)
!122 = !{!123, !153, !155, !161, !169, !186, !191, !208, !213, !215, !220, !225}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !121, file: !112, line: 199, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_start", file: !112, line: 176, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DISubroutineType(types: !127)
!127 = !{!108, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !131, line: 378, size: 192, elements: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = !{!133, !137, !138, !139, !146, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !131, line: 380, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !130, file: !131, line: 382, baseType: !13, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !130, file: !131, line: 384, baseType: !13, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !130, file: !131, line: 386, baseType: !140, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !131, line: 351, size: 16, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !141, file: !131, line: 359, baseType: !117, size: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !141, file: !131, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !130, file: !131, line: 388, baseType: !107, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !130, file: !131, line: 396, baseType: !148, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !131, line: 43, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !121, file: !112, line: 200, baseType: !154, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_stop", file: !112, line: 177, baseType: !125)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "get_value", scope: !121, file: !112, line: 201, baseType: !156, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_value", file: !112, line: 178, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DISubroutineType(types: !159)
!159 = !{!108, !128, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "get_value_64", scope: !121, file: !112, line: 202, baseType: !162, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_value_64", file: !112, line: 180, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{!108, !128, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !168)
!168 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "set_alarm", scope: !121, file: !112, line: 203, baseType: !170, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_alarm", file: !112, line: 182, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DISubroutineType(types: !173)
!173 = !{!108, !128, !117, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_alarm_cfg", file: !112, line: 129, size: 128, elements: !177)
!177 = !{!178, !183, !184, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !176, file: !112, line: 130, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_alarm_callback_t", file: !112, line: 111, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !128, !117, !102, !107}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !176, file: !112, line: 131, baseType: !102, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !176, file: !112, line: 132, baseType: !107, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !112, line: 133, baseType: !102, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_alarm", scope: !121, file: !112, line: 204, baseType: !187, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_cancel_alarm", file: !112, line: 185, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!108, !128, !117}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "set_top_value", scope: !121, file: !112, line: 205, baseType: !192, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_top_value", file: !112, line: 187, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!108, !128, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_top_cfg", file: !112, line: 152, size: 128, elements: !199)
!199 = !{!200, !201, !206, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !198, file: !112, line: 153, baseType: !102, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !198, file: !112, line: 154, baseType: !202, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_top_callback_t", file: !112, line: 141, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !128, !107}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !198, file: !112, line: 155, baseType: !107, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !198, file: !112, line: 156, baseType: !102, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !121, file: !112, line: 206, baseType: !209, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_pending_int", file: !112, line: 189, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!102, !128}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "get_top_value", scope: !121, file: !112, line: 207, baseType: !214, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_top_value", file: !112, line: 190, baseType: !210)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "get_guard_period", scope: !121, file: !112, line: 208, baseType: !216, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_guard_period", file: !112, line: 191, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{!102, !128, !102}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "set_guard_period", scope: !121, file: !112, line: 209, baseType: !221, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_guard_period", file: !112, line: 193, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{!108, !128, !102, !102}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "get_freq", scope: !121, file: !112, line: 210, baseType: !226, size: 32, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_freq", file: !112, line: 196, baseType: !210)
!227 = !{!25}
!228 = !DIFile(filename: "zephyr/samples/drivers/counter/alarm/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "_char_out", scope: !231, file: !235, line: 54, type: !236, isLocal: false, isDefinition: true)
!231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !232, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !233, globals: !234, splitDebugInlining: false, nameTableKind: None)
!232 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!233 = !{!107, !108}
!234 = !{!229}
!235 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DISubroutineType(types: !238)
!238 = !{!108, !108}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !241, file: !276, line: 27, type: !303, isLocal: true, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !243, retainedTypes: !255, globals: !273, splitDebugInlining: false, nameTableKind: None)
!242 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!243 = !{!244, !30}
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !245, line: 27, baseType: !32, size: 32, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254}
!247 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!248 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!249 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!250 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!251 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!252 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!253 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!254 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!255 = !{!107, !103, !108, !24, !256, !272, !102, !167}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !258, line: 54, size: 96, elements: !259)
!258 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !{!260, !267, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !257, file: !258, line: 55, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !263)
!262 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !262, line: 30, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !257, file: !258, line: 60, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !244}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !257, file: !258, line: 65, baseType: !268, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!273 = !{!239, !274, !280, !282, !293, !295}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !241, file: !276, line: 44, type: !277, isLocal: true, isDefinition: true)
!276 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !241, file: !276, line: 49, type: !277, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !241, file: !276, line: 36, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 128, elements: !291)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !245, line: 114, size: 128, elements: !286)
!286 = !{!287, !288, !289, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !285, file: !245, line: 115, baseType: !244, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !285, file: !245, line: 141, baseType: !117, size: 8, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !285, file: !245, line: 149, baseType: !102, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !285, file: !245, line: 156, baseType: !102, size: 32, offset: 96)
!291 = !{!292}
!292 = !DISubrange(count: 1)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !241, file: !276, line: 40, type: !284, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !241, file: !276, line: 28, type: !297, isLocal: true, isDefinition: true)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !299)
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !298, file: !262, line: 36, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !298, file: !262, line: 37, baseType: !301, size: 32, offset: 32)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 32, elements: !291)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !305, line: 22, baseType: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!307 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!308 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !311, file: !340, line: 50, type: !327, isLocal: true, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !243, retainedTypes: !313, globals: !337, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!313 = !{!151, !103, !314, !108, !107, !102, !167, !316, !272, !327, !328}
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !315, line: 214, baseType: !32)
!315 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !318, line: 45, size: 64, elements: !319)
!318 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = !{!320, !326}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !317, file: !318, line: 46, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !262, line: 30, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !317, file: !318, line: 48, baseType: !102, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !318, line: 38, size: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !329, file: !318, line: 39, baseType: !321, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !329, file: !318, line: 41, baseType: !333, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !318, line: 35, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !327}
!337 = !{!338, !342, !350, !309, !352, !362}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "latency_lock", scope: !311, file: !340, line: 44, type: !341, isLocal: true, isDefinition: true)
!340 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !311, file: !340, line: 46, type: !344, isLocal: true, isDefinition: true)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !345, file: !262, line: 36, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !345, file: !262, line: 37, baseType: !348, size: 32, offset: 32)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "latency_subs", scope: !311, file: !340, line: 52, type: !344, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !311, file: !340, line: 39, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, elements: !360)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 35, size: 96, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !340, line: 36, baseType: !244, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !355, file: !340, line: 37, baseType: !117, size: 8, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !355, file: !340, line: 38, baseType: !304, size: 32, offset: 64)
!360 = !{!361}
!361 = !DISubrange(count: 0)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !311, file: !340, line: 48, type: !327, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !366, file: !373, line: 47, type: !387, isLocal: true, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !368, retainedTypes: !369, globals: !370, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!368 = !{!244}
!369 = !{!314, !108}
!370 = !{!371, !364, !383}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "cpus_states", scope: !366, file: !373, line: 50, type: !374, isLocal: true, isDefinition: true)
!373 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 32, elements: !291)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !245, line: 114, size: 128, elements: !378)
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !245, line: 115, baseType: !244, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !377, file: !245, line: 141, baseType: !117, size: 8, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !377, file: !245, line: 149, baseType: !102, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !377, file: !245, line: 156, baseType: !102, size: 32, offset: 96)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !366, file: !373, line: 55, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 8, elements: !291)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, elements: !360)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "static_regions", scope: !390, file: !397, line: 62, type: !532, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!392 = !{!314, !108, !102, !107}
!393 = !{!394, !388}
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !396, file: !397, line: 198, type: !520, isLocal: true, isDefinition: true)
!396 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !397, file: !397, line: 175, type: !398, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !515)
!397 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DISubroutineType(types: !399)
!399 = !{null, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !402, line: 245, size: 1024, elements: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !471, !484, !485, !486, !487, !493, !510}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !401, file: !402, line: 247, baseType: !405, size: 384)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !402, line: 57, size: 384, elements: !406)
!406 = !{!407, !435, !443, !444, !445, !458, !459, !460}
!407 = !DIDerivedType(tag: DW_TAG_member, scope: !405, file: !402, line: 60, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !405, file: !402, line: 60, size: 64, elements: !409)
!409 = !{!410, !426}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !408, file: !402, line: 61, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !412, line: 49, baseType: !413)
!412 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !412, line: 37, size: 64, elements: !414)
!414 = !{!415, !421}
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !413, file: !412, line: 38, baseType: !416, size: 32)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !412, line: 38, size: 32, elements: !417)
!417 = !{!418, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !416, file: !412, line: 39, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !416, file: !412, line: 40, baseType: !419, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, scope: !413, file: !412, line: 42, baseType: !422, size: 32, offset: 32)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !412, line: 42, size: 32, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !422, file: !412, line: 43, baseType: !419, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !422, file: !412, line: 44, baseType: !419, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !408, file: !402, line: 62, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !428, line: 49, size: 64, elements: !429)
!428 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !427, file: !428, line: 50, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 64, elements: !433)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!433 = !{!434}
!434 = !DISubrange(count: 2)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !405, file: !402, line: 68, baseType: !436, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !438, line: 233, baseType: !439)
!438 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 231, size: 64, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !439, file: !438, line: 232, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !412, line: 48, baseType: !413)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !405, file: !402, line: 71, baseType: !117, size: 8, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !405, file: !402, line: 74, baseType: !117, size: 8, offset: 104)
!445 = !DIDerivedType(tag: DW_TAG_member, scope: !405, file: !402, line: 90, baseType: !446, size: 16, offset: 112)
!446 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !405, file: !402, line: 90, size: 16, elements: !447)
!447 = !{!448, !455}
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !402, line: 91, baseType: !449, size: 16)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !402, line: 91, size: 16, elements: !450)
!450 = !{!451, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !449, file: !402, line: 96, baseType: !452, size: 8)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !453)
!453 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !449, file: !402, line: 97, baseType: !117, size: 8, offset: 8)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !446, file: !402, line: 100, baseType: !456, size: 16)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !457)
!457 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !405, file: !402, line: 107, baseType: !102, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !405, file: !402, line: 127, baseType: !107, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !405, file: !402, line: 131, baseType: !461, size: 192, offset: 192)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !438, line: 244, size: 192, elements: !462)
!462 = !{!463, !464, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !461, file: !438, line: 245, baseType: !411, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !461, file: !438, line: 246, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !438, line: 242, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !461, file: !438, line: 249, baseType: !105, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !401, file: !402, line: 250, baseType: !472, size: 288, offset: 384)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !473, line: 25, size: 288, elements: !474)
!473 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !472, file: !473, line: 26, baseType: !102, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !472, file: !473, line: 27, baseType: !102, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !472, file: !473, line: 28, baseType: !102, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !472, file: !473, line: 29, baseType: !102, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !472, file: !473, line: 30, baseType: !102, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !472, file: !473, line: 31, baseType: !102, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !472, file: !473, line: 32, baseType: !102, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !472, file: !473, line: 33, baseType: !102, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !472, file: !473, line: 34, baseType: !102, size: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !401, file: !402, line: 253, baseType: !107, size: 32, offset: 672)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !401, file: !402, line: 256, baseType: !437, size: 64, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !401, file: !402, line: 294, baseType: !108, size: 32, offset: 768)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !401, file: !402, line: 300, baseType: !488, size: 96, offset: 800)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !402, line: 149, size: 96, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !488, file: !402, line: 153, baseType: !22, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !488, file: !402, line: 162, baseType: !314, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !488, file: !402, line: 168, baseType: !314, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !401, file: !402, line: 325, baseType: !494, size: 32, offset: 896)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !496, line: 5073, size: 160, elements: !497)
!496 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !{!498, !507, !508}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !495, file: !496, line: 5074, baseType: !499, size: 96)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !500, line: 56, size: 96, elements: !501)
!500 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!501 = !{!502, !505, !506}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !499, file: !500, line: 57, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !500, line: 57, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !499, file: !500, line: 58, baseType: !107, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !499, file: !500, line: 59, baseType: !314, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !495, file: !496, line: 5075, baseType: !437, size: 64, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !495, file: !496, line: 5076, baseType: !509, offset: 160)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !401, file: !402, line: 343, baseType: !511, size: 64, offset: 928)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !473, line: 60, size: 64, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !511, file: !473, line: 63, baseType: !102, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !511, file: !473, line: 66, baseType: !102, size: 32, offset: 32)
!515 = !{!516, !517, !518, !519}
!516 = !DILocalVariable(name: "thread", arg: 1, scope: !396, file: !397, line: 175, type: !400)
!517 = !DILocalVariable(name: "region_num", scope: !396, file: !397, line: 200, type: !117)
!518 = !DILocalVariable(name: "guard_start", scope: !396, file: !397, line: 265, type: !22)
!519 = !DILocalVariable(name: "guard_size", scope: !396, file: !397, line: 266, type: !314)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 96, elements: !291)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !522, line: 52, size: 96, elements: !523)
!522 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !521, file: !522, line: 53, baseType: !22, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !521, file: !522, line: 54, baseType: !314, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !521, file: !522, line: 55, baseType: !527, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !528, line: 151, baseType: !529)
!528 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 149, size: 32, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !529, file: !528, line: 150, baseType: !102, size: 32)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 96, elements: !291)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !536, file: !570, line: 39, type: !117, isLocal: true, isDefinition: true)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !538, globals: !569, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!538 = !{!539, !107, !108, !557, !117}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !541, line: 1226, baseType: !542)
!541 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 1213, size: 352, elements: !543)
!543 = !{!544, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !542, file: !541, line: 1215, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !542, file: !541, line: 1216, baseType: !546, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !542, file: !541, line: 1217, baseType: !546, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !542, file: !541, line: 1218, baseType: !546, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !542, file: !541, line: 1219, baseType: !546, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !542, file: !541, line: 1220, baseType: !546, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !542, file: !541, line: 1221, baseType: !546, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !542, file: !541, line: 1222, baseType: !546, size: 32, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !542, file: !541, line: 1223, baseType: !546, size: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !542, file: !541, line: 1224, baseType: !546, size: 32, offset: 288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !542, file: !541, line: 1225, baseType: !546, size: 32, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !560, line: 27, size: 96, elements: !561)
!560 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !559, file: !560, line: 29, baseType: !102, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !559, file: !560, line: 31, baseType: !134, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !559, file: !560, line: 37, baseType: !565, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !528, line: 146, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !528, line: 141, size: 32, elements: !567)
!567 = !{!568}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !566, file: !528, line: 143, baseType: !102, size: 32)
!569 = !{!534}
!570 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !573, file: !580, line: 21, type: !236, isLocal: true, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !575, globals: !579, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!575 = !{!576, !108, !107}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !578, line: 22, baseType: !108)
!578 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !{!571}
!580 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !583, file: !588, line: 13, type: !605, isLocal: true, isDefinition: true)
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !585, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!585 = !{!586, !581}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "mpu_config", scope: !583, file: !588, line: 37, type: !589, isLocal: false, isDefinition: true)
!588 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !560, line: 41, size: 64, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !590, file: !560, line: 43, baseType: !102, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !590, file: !560, line: 45, baseType: !594, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !560, line: 27, size: 96, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !596, file: !560, line: 29, baseType: !102, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !560, line: 31, baseType: !134, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !596, file: !560, line: 37, baseType: !601, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !528, line: 146, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !528, line: 141, size: 32, elements: !603)
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !602, file: !528, line: 143, baseType: !102, size: 32)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 192, elements: !433)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !608, file: !778, line: 93, type: !779, isLocal: true, isDefinition: true, align: 32)
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !610, globals: !773, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!610 = !{!611, !117, !107, !108, !691, !102, !692, !728, !739}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !613, line: 1071, baseType: !614)
!613 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 1035, size: 19584, elements: !615)
!615 = !{!616, !620, !621, !622, !626, !627, !629, !630, !631, !632, !633, !634, !638, !639, !640, !644, !645, !649, !650, !654, !655, !659, !660, !661, !662, !663, !664, !665, !669, !670, !671, !672, !676, !677, !681}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !614, file: !613, line: 1036, baseType: !617, size: 960)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 960, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 30)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !614, file: !613, line: 1037, baseType: !546, size: 32, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !614, file: !613, line: 1038, baseType: !546, size: 32, offset: 992)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !614, file: !613, line: 1039, baseType: !623, size: 1088, offset: 1024)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 1088, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 34)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !614, file: !613, line: 1040, baseType: !546, size: 32, offset: 2112)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !614, file: !613, line: 1041, baseType: !628, size: 64, offset: 2144)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 64, elements: !433)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !614, file: !613, line: 1042, baseType: !546, size: 32, offset: 2208)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !614, file: !613, line: 1043, baseType: !546, size: 32, offset: 2240)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !614, file: !613, line: 1044, baseType: !546, size: 32, offset: 2272)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !614, file: !613, line: 1045, baseType: !546, size: 32, offset: 2304)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !614, file: !613, line: 1046, baseType: !546, size: 32, offset: 2336)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !614, file: !613, line: 1047, baseType: !635, size: 3808, offset: 2368)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 3808, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 119)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !614, file: !613, line: 1048, baseType: !546, size: 32, offset: 6176)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !614, file: !613, line: 1049, baseType: !546, size: 32, offset: 6208)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !614, file: !613, line: 1050, baseType: !641, size: 1952, offset: 6240)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 1952, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 61)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !614, file: !613, line: 1051, baseType: !546, size: 32, offset: 8192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !614, file: !613, line: 1052, baseType: !646, size: 288, offset: 8224)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 288, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 9)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !614, file: !613, line: 1053, baseType: !545, size: 32, offset: 8512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !614, file: !613, line: 1054, baseType: !651, size: 96, offset: 8544)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 96, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 3)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !614, file: !613, line: 1055, baseType: !545, size: 32, offset: 8640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !614, file: !613, line: 1056, baseType: !656, size: 1568, offset: 8672)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 1568, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 49)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !614, file: !613, line: 1057, baseType: !546, size: 32, offset: 10240)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !614, file: !613, line: 1058, baseType: !651, size: 96, offset: 10272)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !614, file: !613, line: 1059, baseType: !546, size: 32, offset: 10368)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !614, file: !613, line: 1060, baseType: !628, size: 64, offset: 10400)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !614, file: !613, line: 1061, baseType: !546, size: 32, offset: 10464)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !614, file: !613, line: 1062, baseType: !546, size: 32, offset: 10496)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !614, file: !613, line: 1063, baseType: !666, size: 672, offset: 10528)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 672, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 21)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !614, file: !613, line: 1064, baseType: !546, size: 32, offset: 11200)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !614, file: !613, line: 1065, baseType: !545, size: 32, offset: 11232)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !614, file: !613, line: 1066, baseType: !546, size: 32, offset: 11264)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !614, file: !613, line: 1067, baseType: !673, size: 1504, offset: 11296)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 1504, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 47)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !614, file: !613, line: 1068, baseType: !545, size: 32, offset: 12800)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !614, file: !613, line: 1069, baseType: !678, size: 5600, offset: 12832)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 5600, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 175)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !614, file: !613, line: 1070, baseType: !682, size: 1152, offset: 18432)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 1152, elements: !647)
!683 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !613, line: 278, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 272, size: 128, elements: !686)
!686 = !{!687, !688, !689, !690}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !685, file: !613, line: 273, baseType: !546, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !685, file: !613, line: 274, baseType: !546, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !685, file: !613, line: 275, baseType: !546, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !685, file: !613, line: 277, baseType: !545, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !541, line: 468, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 445, size: 1120, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !721, !725, !727}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !694, file: !541, line: 447, baseType: !545, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !694, file: !541, line: 448, baseType: !546, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !694, file: !541, line: 449, baseType: !546, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !694, file: !541, line: 450, baseType: !546, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !694, file: !541, line: 451, baseType: !546, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !694, file: !541, line: 452, baseType: !546, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !694, file: !541, line: 453, baseType: !703, size: 96, offset: 192)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 96, elements: !705)
!704 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!705 = !{!706}
!706 = !DISubrange(count: 12)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !694, file: !541, line: 454, baseType: !546, size: 32, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !694, file: !541, line: 455, baseType: !546, size: 32, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !694, file: !541, line: 456, baseType: !546, size: 32, offset: 352)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !694, file: !541, line: 457, baseType: !546, size: 32, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !694, file: !541, line: 458, baseType: !546, size: 32, offset: 416)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !694, file: !541, line: 459, baseType: !546, size: 32, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !694, file: !541, line: 460, baseType: !546, size: 32, offset: 480)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !694, file: !541, line: 461, baseType: !628, size: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !694, file: !541, line: 462, baseType: !545, size: 32, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !694, file: !541, line: 463, baseType: !545, size: 32, offset: 608)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !694, file: !541, line: 464, baseType: !718, size: 128, offset: 640)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 128, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 4)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !694, file: !541, line: 465, baseType: !722, size: 160, offset: 768)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 160, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 5)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !694, file: !541, line: 466, baseType: !726, size: 160, offset: 928)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 160, elements: !723)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !694, file: !541, line: 467, baseType: !546, size: 32, offset: 1088)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !730, file: !729, line: 167, baseType: !738)
!729 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!730 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !729, file: !729, line: 134, type: !731, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !608, retainedNodes: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !102}
!733 = !{!734, !735, !737}
!734 = !DILocalVariable(name: "time_us", arg: 1, scope: !730, file: !729, line: 134, type: !102)
!735 = !DILocalVariable(name: "delay_cycles", scope: !730, file: !729, line: 168, type: !736)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!737 = !DILocalVariable(name: "cycles", scope: !730, file: !729, line: 171, type: !102)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !613, line: 2399, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 2373, size: 10880, elements: !742)
!742 = !{!743, !747, !748, !749, !750, !754, !755, !760, !761, !762, !763, !764, !765, !769, !770, !771, !772}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !741, file: !613, line: 2374, baseType: !744, size: 8192)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 8192, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !741, file: !613, line: 2375, baseType: !545, size: 32, offset: 8192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !741, file: !613, line: 2376, baseType: !545, size: 32, offset: 8224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !741, file: !613, line: 2377, baseType: !545, size: 32, offset: 8256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !741, file: !613, line: 2378, baseType: !751, size: 1984, offset: 8288)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 1984, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 62)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !741, file: !613, line: 2379, baseType: !546, size: 32, offset: 10272)
!755 = !DIDerivedType(tag: DW_TAG_member, scope: !741, file: !613, line: 2381, baseType: !756, size: 32, offset: 10304)
!756 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !741, file: !613, line: 2381, size: 32, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !756, file: !613, line: 2382, baseType: !546, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !756, file: !613, line: 2383, baseType: !546, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !741, file: !613, line: 2386, baseType: !546, size: 32, offset: 10336)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !741, file: !613, line: 2387, baseType: !546, size: 32, offset: 10368)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !741, file: !613, line: 2389, baseType: !546, size: 32, offset: 10400)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !741, file: !613, line: 2391, baseType: !546, size: 32, offset: 10432)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !741, file: !613, line: 2393, baseType: !546, size: 32, offset: 10464)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !741, file: !613, line: 2394, baseType: !766, size: 256, offset: 10496)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 256, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 8)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !741, file: !613, line: 2395, baseType: !546, size: 32, offset: 10752)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !741, file: !613, line: 2396, baseType: !545, size: 32, offset: 10784)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !741, file: !613, line: 2397, baseType: !546, size: 32, offset: 10816)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !741, file: !613, line: 2398, baseType: !546, size: 32, offset: 10848)
!773 = !{!606, !774}
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !730, file: !729, line: 161, type: !776, isLocal: true, isDefinition: true, align: 128)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 48, elements: !652)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!778 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !781, line: 51, size: 64, elements: !782)
!781 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = !{!783, !790}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !780, file: !781, line: 60, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DISubroutineType(types: !786)
!786 = !{!108, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !781, line: 48, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !780, file: !781, line: 65, baseType: !787, size: 32, offset: 32)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !793, file: !892, line: 36, type: !907, isLocal: true, isDefinition: true, align: 32)
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !795, retainedTypes: !807, globals: !888, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!795 = !{!796, !802}
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !797, line: 506, baseType: !32, size: 32, elements: !798)
!797 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !{!799, !800, !801}
!799 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!800 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!801 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!802 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !797, line: 512, baseType: !32, size: 32, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!805 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!806 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!807 = !{!808, !877, !882, !843, !802, !796, !887, !107}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !797, line: 523, size: 288, elements: !811)
!811 = !{!812, !833, !839, !844, !848, !849, !850, !854, !873}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !810, file: !797, line: 524, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DISubroutineType(types: !815)
!815 = !{!108, !816, !831, !832}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !131, line: 378, size: 192, elements: !819)
!819 = !{!820, !821, !822, !823, !829, !830}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !131, line: 380, baseType: !134, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !818, file: !131, line: 382, baseType: !13, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !818, file: !131, line: 384, baseType: !13, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !818, file: !131, line: 386, baseType: !824, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !131, line: 351, size: 16, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !825, file: !131, line: 359, baseType: !117, size: 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !825, file: !131, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !818, file: !131, line: 388, baseType: !107, size: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !818, file: !131, line: 396, baseType: !148, size: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !797, line: 237, baseType: !117)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !797, line: 257, baseType: !102)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !810, file: !797, line: 530, baseType: !834, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{!108, !816, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !797, line: 229, baseType: !102)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !810, file: !797, line: 532, baseType: !840, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{!108, !816, !843, !838}
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !797, line: 216, baseType: !102)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !810, file: !797, line: 535, baseType: !845, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DISubroutineType(types: !847)
!847 = !{!108, !816, !843}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !810, file: !797, line: 537, baseType: !845, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !810, file: !797, line: 539, baseType: !845, size: 32, offset: 160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !810, file: !797, line: 541, baseType: !851, size: 32, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DISubroutineType(types: !853)
!853 = !{!108, !816, !831, !796, !802}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !810, file: !797, line: 544, baseType: !855, size: 32, offset: 224)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DISubroutineType(types: !857)
!857 = !{!108, !816, !858, !145}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !797, line: 478, size: 96, elements: !860)
!860 = !{!861, !867, !872}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !859, file: !797, line: 482, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !262, line: 30, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !859, file: !797, line: 485, baseType: !868, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !797, line: 464, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !816, !858, !843}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !859, file: !797, line: 493, baseType: !843, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !810, file: !797, line: 547, baseType: !874, size: 32, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DISubroutineType(types: !876)
!876 = !{!102, !816}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !797, line: 428, size: 32, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !879, file: !797, line: 434, baseType: !843, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !797, line: 441, size: 32, elements: !885)
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !884, file: !797, line: 447, baseType: !843, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!888 = !{!791, !889, !905}
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "pull_up", scope: !891, file: !892, line: 15, type: !898, isLocal: true, isDefinition: true)
!891 = distinct !DISubprogram(name: "board_init", scope: !892, file: !892, line: 10, type: !893, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !793, retainedNodes: !895)
!892 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!893 = !DISubroutineType(types: !894)
!894 = !{!108, !816}
!895 = !{!896, !897}
!896 = !DILocalVariable(name: "dev", arg: 1, scope: !891, file: !892, line: 10, type: !816)
!897 = !DILocalVariable(name: "res", scope: !891, file: !892, line: 14, type: !108)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !797, line: 271, size: 64, elements: !900)
!900 = !{!901, !902, !903}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !899, file: !797, line: 273, baseType: !816, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !899, file: !797, line: 275, baseType: !831, size: 8, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !899, file: !797, line: 277, baseType: !904, size: 16, offset: 48)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !797, line: 249, baseType: !456)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "user_led", scope: !891, file: !892, line: 17, type: !898, isLocal: true, isDefinition: true)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !781, line: 51, size: 64, elements: !909)
!909 = !{!910, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !908, file: !781, line: 60, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !908, file: !781, line: 65, baseType: !816, size: 32, offset: 32)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "__device_dts_ord_69", scope: !915, file: !1150, line: 733, type: !1251, isLocal: false, isDefinition: true, align: 32)
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !917, retainedTypes: !1060, globals: !1146, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/counter/alarm")
!917 = !{!918, !924, !30, !929, !934, !941, !949, !957, !966, !970, !1025, !1032, !1051}
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !919, line: 23, baseType: !32, size: 32, elements: !920)
!919 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!920 = !{!921, !922, !923}
!921 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!922 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!923 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !919, line: 48, baseType: !32, size: 32, elements: !925)
!925 = !{!926, !927, !928}
!926 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!927 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!928 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !930, line: 167, baseType: !32, size: 32, elements: !931)
!930 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!931 = !{!932, !933}
!932 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!933 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!934 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !930, line: 107, baseType: !32, size: 32, elements: !935)
!935 = !{!936, !937, !938, !939, !940}
!936 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!937 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!938 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!939 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!940 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!941 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !930, line: 208, baseType: !32, size: 32, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948}
!943 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!944 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!945 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!946 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!947 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!948 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !930, line: 261, baseType: !32, size: 32, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956}
!951 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!952 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!953 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!954 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!955 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!956 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !930, line: 237, baseType: !32, size: 32, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965}
!959 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!960 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!961 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!962 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!963 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!964 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!965 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !930, line: 152, baseType: !32, size: 32, elements: !967)
!967 = !{!968, !969}
!968 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!969 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!970 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 71, baseType: !108, size: 32, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024}
!972 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!973 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!974 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!975 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!976 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!977 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!978 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!979 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!980 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!981 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!982 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!983 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!984 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!985 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!986 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!987 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!988 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!989 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!990 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!991 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!992 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!993 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!994 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!995 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!996 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!997 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!998 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!999 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!1000 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!1001 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!1002 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!1003 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!1004 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!1005 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!1006 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!1007 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!1008 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!1009 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!1010 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!1011 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!1012 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!1013 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!1014 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!1015 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!1016 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!1017 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!1018 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!1019 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!1020 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!1021 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!1022 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!1023 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!1024 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!1025 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !1026, line: 44, baseType: !32, size: 32, elements: !1027)
!1026 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1027 = !{!1028, !1029, !1030, !1031}
!1028 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!1029 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!1030 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!1031 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!1032 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1033, line: 54, baseType: !32, size: 32, elements: !1034)
!1033 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050}
!1035 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!1036 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!1037 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!1038 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!1039 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!1040 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!1041 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!1042 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!1043 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!1044 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!1045 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!1046 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!1047 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!1048 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!1049 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!1050 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!1051 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1052, line: 53, baseType: !32, size: 32, elements: !1053)
!1052 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059}
!1054 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!1055 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!1056 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!1057 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!1058 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!1059 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!1060 = !{!918, !107, !108, !1061, !1110, !1111, !1112, !1113, !103, !102, !167, !145, !691, !1114, !327, !1115, !1145, !314}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !613, line: 1022, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 979, size: 11712, elements: !1064)
