; ModuleID = 'build/96b_stm32_sensor_mez/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !116, line: 149, type: !278, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !108, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !103)
!103 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!114, !25, !266, !269}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "fork_objs", scope: !27, file: !116, line: 146, type: !117, isLocal: false, isDefinition: true)
!116 = !DIFile(filename: "zephyr/samples/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 960, elements: !264)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !119, line: 2720, size: 160, elements: !120)
!119 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121, !142, !262, !263}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !118, file: !119, line: 2722, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !123, line: 233, baseType: !124)
!123 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 231, size: 64, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !124, file: !123, line: 232, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !130)
!130 = !{!131, !137}
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 38, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 38, size: 32, elements: !133)
!133 = !{!134, !136}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !128, line: 39, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !128, line: 40, baseType: !135, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 42, baseType: !138, size: 32, offset: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 42, size: 32, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !138, file: !128, line: 43, baseType: !135, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !128, line: 44, baseType: !135, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !118, file: !119, line: 2724, baseType: !143, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !145, line: 245, size: 1408, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !196, !209, !210, !211, !223, !224, !229, !230, !238, !257}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !144, file: !145, line: 247, baseType: !148, size: 384)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !145, line: 57, size: 384, elements: !149)
!149 = !{!150, !164, !166, !169, !170, !183, !184, !185}
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 60, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 60, size: 64, elements: !152)
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !151, file: !145, line: 61, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !128, line: 49, baseType: !129)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !151, file: !145, line: 62, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !156, file: !157, line: 50, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !148, file: !145, line: 68, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !148, file: !145, line: 71, baseType: !167, size: 8, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !148, file: !145, line: 74, baseType: !167, size: 8, offset: 104)
!170 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 90, baseType: !171, size: 16, offset: 112)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 90, size: 16, elements: !172)
!172 = !{!173, !180}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !145, line: 91, baseType: !174, size: 16)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !145, line: 91, size: 16, elements: !175)
!175 = !{!176, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !174, file: !145, line: 96, baseType: !177, size: 8)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !178)
!178 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !174, file: !145, line: 97, baseType: !167, size: 8, offset: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !171, file: !145, line: 100, baseType: !181, size: 16)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !148, file: !145, line: 107, baseType: !110, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !148, file: !145, line: 127, baseType: !108, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !148, file: !145, line: 131, baseType: !186, size: 192, offset: 192)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !123, line: 244, size: 192, elements: !187)
!187 = !{!188, !189, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !186, file: !123, line: 245, baseType: !154, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !186, file: !123, line: 246, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !123, line: 242, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !186, file: !123, line: 249, baseType: !106, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !144, file: !145, line: 250, baseType: !197, size: 288, offset: 384)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !198, line: 25, size: 288, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !197, file: !198, line: 26, baseType: !110, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !197, file: !198, line: 27, baseType: !110, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !197, file: !198, line: 28, baseType: !110, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !197, file: !198, line: 29, baseType: !110, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !197, file: !198, line: 30, baseType: !110, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !197, file: !198, line: 31, baseType: !110, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !197, file: !198, line: 32, baseType: !110, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !197, file: !198, line: 33, baseType: !110, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !197, file: !198, line: 34, baseType: !110, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !144, file: !145, line: 253, baseType: !108, size: 32, offset: 672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !144, file: !145, line: 256, baseType: !122, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !144, file: !145, line: 271, baseType: !212, size: 128, offset: 768)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !145, line: 34, size: 128, elements: !213)
!213 = !{!214, !220, !221, !222}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !212, file: !145, line: 35, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !216, line: 46, baseType: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !108, !108, !108}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !212, file: !145, line: 36, baseType: !108, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !212, file: !145, line: 37, baseType: !108, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !212, file: !145, line: 38, baseType: !108, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !144, file: !145, line: 274, baseType: !143, size: 32, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !145, line: 279, baseType: !225, size: 256, offset: 928)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !227)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !{!228}
!228 = !DISubrange(count: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !144, file: !145, line: 294, baseType: !109, size: 32, offset: 1184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !144, file: !145, line: 300, baseType: !231, size: 96, offset: 1216)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !145, line: 149, size: 96, elements: !232)
!232 = !{!233, !234, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !231, file: !145, line: 153, baseType: !22, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !231, file: !145, line: 162, baseType: !235, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !236, line: 214, baseType: !32)
!236 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !231, file: !145, line: 168, baseType: !235, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !144, file: !145, line: 325, baseType: !239, size: 32, offset: 1312)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !119, line: 5073, size: 192, elements: !241)
!241 = !{!242, !251, !252}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !240, file: !119, line: 5074, baseType: !243, size: 96)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !244, line: 56, size: 96, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246, !249, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !243, file: !244, line: 57, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !244, line: 57, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !243, file: !244, line: 58, baseType: !108, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !243, file: !244, line: 59, baseType: !235, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !240, file: !119, line: 5075, baseType: !122, size: 64, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !240, file: !119, line: 5076, baseType: !253, size: 32, offset: 160)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !253, file: !254, line: 52, baseType: !22, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !144, file: !145, line: 343, baseType: !258, size: 64, offset: 1344)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !198, line: 60, size: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !258, file: !198, line: 63, baseType: !110, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !258, file: !198, line: 66, baseType: !110, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !118, file: !119, line: 2727, baseType: !110, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !118, file: !119, line: 2730, baseType: !109, size: 32, offset: 128)
!264 = !{!265}
!265 = !DISubrange(count: 6)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !116, line: 160, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8448, elements: !264)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !116, line: 159, type: !271, isLocal: true, isDefinition: true, align: 512)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 101376, elements: !276)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !273, line: 47, size: 8, elements: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !273, line: 48, baseType: !226, size: 8)
!276 = !{!265, !277}
!277 = !DISubrange(count: 2112)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 192, elements: !264)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "_char_out", scope: !282, file: !286, line: 54, type: !287, isLocal: false, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !284, globals: !285, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!284 = !{!108, !109}
!285 = !{!280}
!286 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!109, !109}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !292, file: !309, line: 56, type: !310, isLocal: true, isDefinition: true, align: 32)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !294, globals: !308, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !297, line: 407, baseType: !298)
!297 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f446xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 398, size: 224, elements: !299)
!299 = !{!300, !302, !303, !304, !305, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !298, file: !297, line: 400, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !298, file: !297, line: 401, baseType: !301, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !298, file: !297, line: 402, baseType: !301, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !298, file: !297, line: 403, baseType: !301, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !298, file: !297, line: 404, baseType: !301, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !298, file: !297, line: 405, baseType: !301, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !298, file: !297, line: 406, baseType: !301, size: 32, offset: 192)
!308 = !{!290}
!309 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !312, line: 51, size: 64, elements: !313)
!312 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!313 = !{!314, !342}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !311, file: !312, line: 60, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{!109, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !321, line: 378, size: 192, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{!323, !326, !327, !328, !335, !336}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !321, line: 380, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !320, file: !321, line: 382, baseType: !13, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !320, file: !321, line: 384, baseType: !13, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !320, file: !321, line: 386, baseType: !329, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !321, line: 351, size: 16, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !330, file: !321, line: 359, baseType: !167, size: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !330, file: !321, line: 364, baseType: !334, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!334 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !320, file: !321, line: 388, baseType: !108, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !320, file: !321, line: 396, baseType: !337, size: 32, offset: 160)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !321, line: 43, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !341)
!341 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !311, file: !312, line: 65, baseType: !318, size: 32, offset: 32)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !345, file: !348, line: 71, type: !349, isLocal: true, isDefinition: true, align: 32)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !347, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!347 = !{!343}
!348 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !312, line: 51, size: 64, elements: !351)
!351 = !{!352, !371}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !350, file: !312, line: 60, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DISubroutineType(types: !355)
!355 = !{!109, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !321, line: 378, size: 192, elements: !359)
!359 = !{!360, !361, !362, !363, !369, !370}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !358, file: !321, line: 380, baseType: !324, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !358, file: !321, line: 382, baseType: !13, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !358, file: !321, line: 384, baseType: !13, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !358, file: !321, line: 386, baseType: !364, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !321, line: 351, size: 16, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !365, file: !321, line: 359, baseType: !167, size: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !365, file: !321, line: 364, baseType: !334, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !321, line: 388, baseType: !108, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !358, file: !321, line: 396, baseType: !337, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !350, file: !312, line: 65, baseType: !356, size: 32, offset: 32)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "_kernel_thread_info_offsets", scope: !374, file: !379, line: 41, type: !382, isLocal: false, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !284, globals: !376, splitDebugInlining: false, nameTableKind: None)
!375 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!376 = !{!372, !377, !380}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "_kernel_thread_info_num_offsets", scope: !374, file: !379, line: 140, type: !235, isLocal: false, isDefinition: true)
!379 = !DIFile(filename: "zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "_kernel_thread_info_size_t_size", scope: !374, file: !379, line: 145, type: !167, isLocal: false, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 448, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 14)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "static_regions", scope: !387, file: !394, line: 62, type: !527, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !389, globals: !390, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!389 = !{!235, !109, !110, !108}
!390 = !{!391, !385}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !393, file: !394, line: 198, type: !513, isLocal: true, isDefinition: true)
!393 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !394, file: !394, line: 175, type: !395, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !387, retainedNodes: !508)
!394 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DISubroutineType(types: !396)
!396 = !{null, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !145, line: 245, size: 1408, elements: !399)
!399 = !{!400, !458, !470, !471, !472, !479, !480, !481, !482, !488, !503}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !398, file: !145, line: 247, baseType: !401, size: 384)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !145, line: 57, size: 384, elements: !402)
!402 = !{!403, !427, !434, !435, !436, !445, !446, !447}
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !145, line: 60, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !145, line: 60, size: 64, elements: !405)
!405 = !{!406, !421}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !404, file: !145, line: 61, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !128, line: 49, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !409)
!409 = !{!410, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !128, line: 38, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !128, line: 38, size: 32, elements: !412)
!412 = !{!413, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !411, file: !128, line: 39, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !128, line: 40, baseType: !414, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !128, line: 42, baseType: !417, size: 32, offset: 32)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !128, line: 42, size: 32, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !417, file: !128, line: 43, baseType: !414, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !128, line: 44, baseType: !414, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !404, file: !145, line: 62, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !422, file: !157, line: 50, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 64, elements: !162)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !401, file: !145, line: 68, baseType: !428, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !123, line: 233, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 231, size: 64, elements: !431)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !430, file: !123, line: 232, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !401, file: !145, line: 71, baseType: !167, size: 8, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !401, file: !145, line: 74, baseType: !167, size: 8, offset: 104)
!436 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !145, line: 90, baseType: !437, size: 16, offset: 112)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !145, line: 90, size: 16, elements: !438)
!438 = !{!439, !444}
!439 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !145, line: 91, baseType: !440, size: 16)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !437, file: !145, line: 91, size: 16, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !440, file: !145, line: 96, baseType: !177, size: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !440, file: !145, line: 97, baseType: !167, size: 8, offset: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !437, file: !145, line: 100, baseType: !181, size: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !401, file: !145, line: 107, baseType: !110, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !401, file: !145, line: 127, baseType: !108, size: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !401, file: !145, line: 131, baseType: !448, size: 192, offset: 192)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !123, line: 244, size: 192, elements: !449)
!449 = !{!450, !451, !457}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !448, file: !123, line: 245, baseType: !407, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !448, file: !123, line: 246, baseType: !452, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !123, line: 242, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !448, file: !123, line: 249, baseType: !106, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !398, file: !145, line: 250, baseType: !459, size: 288, offset: 384)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !198, line: 25, size: 288, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !459, file: !198, line: 26, baseType: !110, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !459, file: !198, line: 27, baseType: !110, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !459, file: !198, line: 28, baseType: !110, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !459, file: !198, line: 29, baseType: !110, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !459, file: !198, line: 30, baseType: !110, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !459, file: !198, line: 31, baseType: !110, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !459, file: !198, line: 32, baseType: !110, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !459, file: !198, line: 33, baseType: !110, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !459, file: !198, line: 34, baseType: !110, size: 32, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !398, file: !145, line: 253, baseType: !108, size: 32, offset: 672)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !398, file: !145, line: 256, baseType: !429, size: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !398, file: !145, line: 271, baseType: !473, size: 128, offset: 768)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !145, line: 34, size: 128, elements: !474)
!474 = !{!475, !476, !477, !478}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !473, file: !145, line: 35, baseType: !215, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !473, file: !145, line: 36, baseType: !108, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !473, file: !145, line: 37, baseType: !108, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !473, file: !145, line: 38, baseType: !108, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !398, file: !145, line: 274, baseType: !397, size: 32, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !145, line: 279, baseType: !225, size: 256, offset: 928)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !398, file: !145, line: 294, baseType: !109, size: 32, offset: 1184)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !398, file: !145, line: 300, baseType: !483, size: 96, offset: 1216)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !145, line: 149, size: 96, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !483, file: !145, line: 153, baseType: !22, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !483, file: !145, line: 162, baseType: !235, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !483, file: !145, line: 168, baseType: !235, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !398, file: !145, line: 325, baseType: !489, size: 32, offset: 1312)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !119, line: 5073, size: 192, elements: !491)
!491 = !{!492, !498, !499}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !490, file: !119, line: 5074, baseType: !493, size: 96)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !244, line: 56, size: 96, elements: !494)
!494 = !{!495, !496, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !493, file: !244, line: 57, baseType: !247, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !493, file: !244, line: 58, baseType: !108, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !493, file: !244, line: 59, baseType: !235, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !490, file: !119, line: 5075, baseType: !429, size: 64, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !490, file: !119, line: 5076, baseType: !500, size: 32, offset: 160)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !501)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !500, file: !254, line: 52, baseType: !22, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !398, file: !145, line: 343, baseType: !504, size: 64, offset: 1344)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !198, line: 60, size: 64, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !504, file: !198, line: 63, baseType: !110, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !504, file: !198, line: 66, baseType: !110, size: 32, offset: 32)
!508 = !{!509, !510, !511, !512}
!509 = !DILocalVariable(name: "thread", arg: 1, scope: !393, file: !394, line: 175, type: !397)
!510 = !DILocalVariable(name: "region_num", scope: !393, file: !394, line: 200, type: !167)
!511 = !DILocalVariable(name: "guard_start", scope: !393, file: !394, line: 265, type: !22)
!512 = !DILocalVariable(name: "guard_size", scope: !393, file: !394, line: 266, type: !235)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 96, elements: !525)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !515, line: 52, size: 96, elements: !516)
!515 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !514, file: !515, line: 53, baseType: !22, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !515, line: 54, baseType: !235, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !514, file: !515, line: 55, baseType: !520, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !521, line: 151, baseType: !522)
!521 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !521, line: 149, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !522, file: !521, line: 150, baseType: !110, size: 32)
!525 = !{!526}
!526 = !DISubrange(count: 1)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 96, elements: !525)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !531, file: !564, line: 39, type: !167, isLocal: true, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !533, globals: !563, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!533 = !{!534, !108, !109, !551, !167}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !536, line: 1226, baseType: !537)
!536 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 1213, size: 352, elements: !538)
!538 = !{!539, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !537, file: !536, line: 1215, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !537, file: !536, line: 1216, baseType: !301, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !537, file: !536, line: 1217, baseType: !301, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !537, file: !536, line: 1218, baseType: !301, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !537, file: !536, line: 1219, baseType: !301, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !537, file: !536, line: 1220, baseType: !301, size: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !537, file: !536, line: 1221, baseType: !301, size: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !537, file: !536, line: 1222, baseType: !301, size: 32, offset: 224)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !537, file: !536, line: 1223, baseType: !301, size: 32, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !537, file: !536, line: 1224, baseType: !301, size: 32, offset: 288)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !537, file: !536, line: 1225, baseType: !301, size: 32, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !554, line: 27, size: 96, elements: !555)
!554 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !553, file: !554, line: 29, baseType: !110, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !553, file: !554, line: 31, baseType: !324, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !553, file: !554, line: 37, baseType: !559, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !521, line: 146, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !521, line: 141, size: 32, elements: !561)
!561 = !{!562}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !560, file: !521, line: 143, baseType: !110, size: 32)
!563 = !{!529}
!564 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !567, file: !572, line: 13, type: !589, isLocal: true, isDefinition: true)
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !569, splitDebugInlining: false, nameTableKind: None)
!568 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!569 = !{!570, !565}
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "mpu_config", scope: !567, file: !572, line: 37, type: !573, isLocal: false, isDefinition: true)
!572 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !554, line: 41, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !574, file: !554, line: 43, baseType: !110, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !574, file: !554, line: 45, baseType: !578, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !554, line: 27, size: 96, elements: !581)
!581 = !{!582, !583, !584}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !580, file: !554, line: 29, baseType: !110, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !580, file: !554, line: 31, baseType: !324, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !580, file: !554, line: 37, baseType: !585, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !521, line: 146, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !521, line: 141, size: 32, elements: !587)
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !586, file: !521, line: 143, baseType: !110, size: 32)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 192, elements: !162)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !592, file: !705, line: 72, type: !789, isLocal: true, isDefinition: true)
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !594, retainedTypes: !691, globals: !702, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!594 = !{!30, !595}
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 65, baseType: !109, size: 32, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!597 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!598 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!599 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!600 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!601 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!602 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!603 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!604 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!605 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!606 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!607 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!608 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!609 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!610 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!611 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!612 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!613 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!614 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!615 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!616 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!617 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!618 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!619 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!620 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!621 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!622 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!623 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!624 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!625 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!626 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!627 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!628 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!629 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!630 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!631 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!632 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!633 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!634 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!635 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!636 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!637 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!638 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!639 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!640 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!641 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!642 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!643 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!644 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!645 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!646 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!647 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!648 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!649 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!650 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!651 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!652 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!653 = !DIEnumerator(name: "FMC_IRQn", value: 48)
!654 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!655 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!656 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!657 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!658 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!659 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!660 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!661 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!662 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!663 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!664 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!665 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!666 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!667 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!668 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!669 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!670 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!671 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!672 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!673 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!674 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!675 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!676 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!677 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!678 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!679 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!680 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!681 = !DIEnumerator(name: "DCMI_IRQn", value: 78)
!682 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!683 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!684 = !DIEnumerator(name: "SAI1_IRQn", value: 87)
!685 = !DIEnumerator(name: "SAI2_IRQn", value: 91)
!686 = !DIEnumerator(name: "QUADSPI_IRQn", value: 92)
!687 = !DIEnumerator(name: "CEC_IRQn", value: 93)
!688 = !DIEnumerator(name: "SPDIF_RX_IRQn", value: 94)
!689 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!690 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!691 = !{!235, !109, !108, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !297, line: 392, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 384, size: 192, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !694, file: !297, line: 386, baseType: !301, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !694, file: !297, line: 387, baseType: !301, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !694, file: !297, line: 388, baseType: !301, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !694, file: !297, line: 389, baseType: !301, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !694, file: !297, line: 390, baseType: !301, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !694, file: !297, line: 391, baseType: !301, size: 32, offset: 160)
!702 = !{!703, !709, !725, !736, !753, !590, !755, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787}
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !592, file: !705, line: 424, type: !706, isLocal: false, isDefinition: true, align: 16)
!705 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 64, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 4)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__device_dts_ord_36", scope: !592, file: !705, line: 424, type: !711, isLocal: false, isDefinition: true, align: 32)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !321, line: 378, size: 192, elements: !713)
!713 = !{!714, !715, !716, !717, !723, !724}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !321, line: 380, baseType: !324, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !712, file: !321, line: 382, baseType: !13, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !712, file: !321, line: 384, baseType: !13, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !712, file: !321, line: 386, baseType: !718, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !321, line: 351, size: 16, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !719, file: !321, line: 359, baseType: !167, size: 8)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !719, file: !321, line: 364, baseType: !334, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !712, file: !321, line: 388, baseType: !108, size: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !712, file: !321, line: 396, baseType: !337, size: 32, offset: 160)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_36", scope: !592, file: !705, line: 424, type: !727, isLocal: true, isDefinition: true, align: 32)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !312, line: 51, size: 64, elements: !729)
!729 = !{!730, !735}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !728, file: !312, line: 60, baseType: !731, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DISubroutineType(types: !733)
!733 = !{!109, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !728, file: !312, line: 65, baseType: !734, size: 32, offset: 32)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "exti_data", scope: !592, file: !705, line: 423, type: !738, isLocal: true, isDefinition: true)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !705, line: 107, size: 1472, elements: !739)
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !738, file: !705, line: 109, baseType: !741, size: 1472)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 1472, elements: !751)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !705, line: 101, size: 64, elements: !743)
!743 = !{!744, !750}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !742, file: !705, line: 102, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !746, line: 63, baseType: !747)
!746 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !109, !108}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !742, file: !705, line: 103, baseType: !108, size: 32, offset: 32)
!751 = !{!752}
!752 = !DISubrange(count: 23)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_36", scope: !592, file: !705, line: 424, type: !719, isLocal: true, isDefinition: true, align: 8)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !757, file: !705, line: 493, type: !762, isLocal: true, isDefinition: true, align: 32)
!757 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !705, file: !705, line: 460, type: !758, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !592, retainedNodes: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !734}
!760 = !{!761}
!761 = !DILocalVariable(name: "dev", arg: 1, scope: !757, file: !705, line: 460, type: !734)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !763)
!763 = !{!764, !766, !767, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !762, file: !10, line: 55, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !762, file: !10, line: 57, baseType: !765, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !762, file: !10, line: 59, baseType: !108, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !762, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !757, file: !705, line: 497, type: !762, isLocal: true, isDefinition: true, align: 32)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !757, file: !705, line: 507, type: !762, isLocal: true, isDefinition: true, align: 32)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !757, file: !705, line: 512, type: !762, isLocal: true, isDefinition: true, align: 32)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !757, file: !705, line: 516, type: !762, isLocal: true, isDefinition: true, align: 32)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !757, file: !705, line: 523, type: !762, isLocal: true, isDefinition: true, align: 32)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !757, file: !705, line: 527, type: !762, isLocal: true, isDefinition: true, align: 32)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !757, file: !705, line: 581, type: !762, isLocal: true, isDefinition: true, align: 32)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !757, file: !705, line: 586, type: !762, isLocal: true, isDefinition: true, align: 32)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !757, file: !705, line: 591, type: !762, isLocal: true, isDefinition: true, align: 32)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !757, file: !705, line: 595, type: !762, isLocal: true, isDefinition: true, align: 32)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 736, elements: !751)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !297, line: 163, baseType: !595)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !794, file: !799, line: 25, type: !827, isLocal: false, isDefinition: true, align: 16)
!794 = distinct !DICompileUnit(language: DW_LANG_C99, file: !795, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !796, splitDebugInlining: false, nameTableKind: None)
!795 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!796 = !{!797, !792, !803, !805, !807, !809, !811, !813, !815, !817, !819, !821, !823, !825}
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !794, file: !799, line: 20, type: !800, isLocal: false, isDefinition: true, align: 16)
!799 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 240, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 15)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_96", scope: !794, file: !799, line: 32, type: !706, isLocal: false, isDefinition: true, align: 16)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_95", scope: !794, file: !799, line: 39, type: !706, isLocal: false, isDefinition: true, align: 16)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_94", scope: !794, file: !799, line: 46, type: !706, isLocal: false, isDefinition: true, align: 16)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_93", scope: !794, file: !799, line: 53, type: !706, isLocal: false, isDefinition: true, align: 16)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !794, file: !799, line: 60, type: !706, isLocal: false, isDefinition: true, align: 16)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_92", scope: !794, file: !799, line: 67, type: !706, isLocal: false, isDefinition: true, align: 16)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_91", scope: !794, file: !799, line: 74, type: !706, isLocal: false, isDefinition: true, align: 16)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_90", scope: !794, file: !799, line: 81, type: !706, isLocal: false, isDefinition: true, align: 16)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_48", scope: !794, file: !799, line: 88, type: !706, isLocal: false, isDefinition: true, align: 16)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !794, file: !799, line: 95, type: !706, isLocal: false, isDefinition: true, align: 16)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !794, file: !799, line: 102, type: !706, isLocal: false, isDefinition: true, align: 16)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_52", scope: !794, file: !799, line: 109, type: !706, isLocal: false, isDefinition: true, align: 16)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 48, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 3)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !832, file: !897, line: 398, type: !930, isLocal: true, isDefinition: true)
!832 = distinct !DICompileUnit(language: DW_LANG_C99, file: !833, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !834, retainedTypes: !847, globals: !894, splitDebugInlining: false, nameTableKind: None)
!833 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!834 = !{!835, !30, !840}
!835 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !836, line: 197, baseType: !32, size: 32, elements: !837)
!836 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!837 = !{!838, !839}
!838 = !DIEnumerator(name: "SUCCESS", value: 0)
!839 = !DIEnumerator(name: "ERROR", value: 1)
!840 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !841, line: 44, baseType: !32, size: 32, elements: !842)
!841 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!842 = !{!843, !844, !845, !846}
!843 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!844 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!845 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!846 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!847 = !{!108, !109, !110, !848, !887, !893}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !297, line: 586, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 550, size: 1216, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !850, file: !297, line: 552, baseType: !301, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !850, file: !297, line: 553, baseType: !301, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !850, file: !297, line: 554, baseType: !301, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !850, file: !297, line: 555, baseType: !301, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !850, file: !297, line: 556, baseType: !301, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !850, file: !297, line: 557, baseType: !301, size: 32, offset: 160)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !850, file: !297, line: 558, baseType: !301, size: 32, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !850, file: !297, line: 559, baseType: !110, size: 32, offset: 224)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !850, file: !297, line: 560, baseType: !301, size: 32, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !850, file: !297, line: 561, baseType: !301, size: 32, offset: 288)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !850, file: !297, line: 562, baseType: !863, size: 64, offset: 320)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !162)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !850, file: !297, line: 563, baseType: !301, size: 32, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !850, file: !297, line: 564, baseType: !301, size: 32, offset: 416)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !850, file: !297, line: 565, baseType: !301, size: 32, offset: 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !850, file: !297, line: 566, baseType: !110, size: 32, offset: 480)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !850, file: !297, line: 567, baseType: !301, size: 32, offset: 512)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !850, file: !297, line: 568, baseType: !301, size: 32, offset: 544)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !850, file: !297, line: 569, baseType: !863, size: 64, offset: 576)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !850, file: !297, line: 570, baseType: !301, size: 32, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !850, file: !297, line: 571, baseType: !301, size: 32, offset: 672)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !850, file: !297, line: 572, baseType: !301, size: 32, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !850, file: !297, line: 573, baseType: !110, size: 32, offset: 736)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !850, file: !297, line: 574, baseType: !301, size: 32, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !850, file: !297, line: 575, baseType: !301, size: 32, offset: 800)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !850, file: !297, line: 576, baseType: !863, size: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !850, file: !297, line: 577, baseType: !301, size: 32, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !850, file: !297, line: 578, baseType: !301, size: 32, offset: 928)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !850, file: !297, line: 579, baseType: !863, size: 64, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !850, file: !297, line: 580, baseType: !301, size: 32, offset: 1024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !850, file: !297, line: 581, baseType: !301, size: 32, offset: 1056)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !850, file: !297, line: 582, baseType: !301, size: 32, offset: 1088)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !850, file: !297, line: 583, baseType: !301, size: 32, offset: 1120)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "CKGATENR", scope: !850, file: !297, line: 584, baseType: !301, size: 32, offset: 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR2", scope: !850, file: !297, line: 585, baseType: !301, size: 32, offset: 1184)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !889, line: 343, size: 64, elements: !890)
!889 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !888, file: !889, line: 344, baseType: !110, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !888, file: !889, line: 345, baseType: !110, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!894 = !{!895, !901, !917, !928, !830}
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !832, file: !897, line: 752, type: !898, isLocal: false, isDefinition: true, align: 16)
!897 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 800, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 50)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !832, file: !897, line: 752, type: !903, isLocal: false, isDefinition: true, align: 32)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !321, line: 378, size: 192, elements: !905)
!905 = !{!906, !907, !908, !909, !915, !916}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !904, file: !321, line: 380, baseType: !324, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !904, file: !321, line: 382, baseType: !13, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !904, file: !321, line: 384, baseType: !13, size: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !904, file: !321, line: 386, baseType: !910, size: 32, offset: 96)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !321, line: 351, size: 16, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !911, file: !321, line: 359, baseType: !167, size: 8)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !911, file: !321, line: 364, baseType: !334, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !904, file: !321, line: 388, baseType: !108, size: 32, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !904, file: !321, line: 396, baseType: !337, size: 32, offset: 160)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !832, file: !897, line: 752, type: !919, isLocal: true, isDefinition: true, align: 32)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !312, line: 51, size: 64, elements: !921)
!921 = !{!922, !927}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !920, file: !312, line: 60, baseType: !923, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DISubroutineType(types: !925)
!925 = !{!109, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !920, file: !312, line: 65, baseType: !926, size: 32, offset: 32)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !832, file: !897, line: 752, type: !911, isLocal: true, isDefinition: true, align: 8)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !841, line: 100, size: 224, elements: !931)
!931 = !{!932, !938, !939, !948, !953, !958, !964}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !930, file: !841, line: 101, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !841, line: 76, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(types: !936)
!936 = !{!109, !926, !937}
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !841, line: 56, baseType: !108)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !930, file: !841, line: 102, baseType: !933, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !930, file: !841, line: 103, baseType: !940, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !841, line: 83, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{!109, !926, !937, !944, !108}
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !841, line: 72, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !926, !937, !108}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !930, file: !841, line: 104, baseType: !949, size: 32, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !841, line: 79, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DISubroutineType(types: !952)
!952 = !{!109, !926, !937, !893}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !930, file: !841, line: 105, baseType: !954, size: 32, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !841, line: 88, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{!840, !926, !937}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !930, file: !841, line: 106, baseType: !959, size: 32, offset: 160)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !841, line: 92, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{!109, !926, !937, !963}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !841, line: 64, baseType: !108)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !930, file: !841, line: 107, baseType: !965, size: 32, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !841, line: 96, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DISubroutineType(types: !968)
!968 = !{!109, !926, !937, !108}
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !971, file: !1028, line: 603, type: !1030, isLocal: true, isDefinition: true, align: 32)
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !973, globals: !1025, splitDebugInlining: false, nameTableKind: None)
!972 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/philosophers")
!973 = !{!108, !109, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !977, line: 336, size: 160, elements: !978)
!977 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!978 = !{!979, !999, !1003, !1007, !1020}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !976, file: !977, line: 365, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!109, !983, !998}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !321, line: 378, size: 192, elements: !986)
!986 = !{!987, !988, !989, !990, !996, !997}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !985, file: !321, line: 380, baseType: !324, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !985, file: !321, line: 382, baseType: !13, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !985, file: !321, line: 384, baseType: !13, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !985, file: !321, line: 386, baseType: !991, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !321, line: 351, size: 16, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !992, file: !321, line: 359, baseType: !167, size: 8)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !992, file: !321, line: 364, baseType: !334, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !985, file: !321, line: 388, baseType: !108, size: 32, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !985, file: !321, line: 396, baseType: !337, size: 32, offset: 160)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !976, file: !977, line: 366, baseType: !1000, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !983, !168}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !976, file: !977, line: 374, baseType: !1004, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!109, !983}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !976, file: !977, line: 377, baseType: !1008, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!109, !983, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !977, line: 122, size: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1013, file: !977, line: 123, baseType: !110, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1013, file: !977, line: 124, baseType: !167, size: 8, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1013, file: !977, line: 125, baseType: !167, size: 8, offset: 40)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1013, file: !977, line: 126, baseType: !167, size: 8, offset: 48)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1013, file: !977, line: 127, baseType: !167, size: 8, offset: 56)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !976, file: !977, line: 379, baseType: !1021, size: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!109, !983, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1025 = !{!969, !1026}
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !971, file: !1028, line: 38, type: !1029, isLocal: true, isDefinition: true)
!1028 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
