; ModuleID = 'build/arduino_nano_33_ble/basic/blinky_pwm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %struct.z_spinlock_key, i8*, i32 }
%struct.z_spinlock_key = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %struct.z_spinlock_key }
%struct.mpsc_pbuf_buffer_config = type { i32*, i32, void (%struct.mpsc_pbuf_buffer*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }
%struct.log_mpsc_pbuf = type { %struct.mpsc_pbuf_buffer }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !27, file: !65, line: 18, type: !67, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !37, globals: !62, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !{!22, !38, !24, !39, !41, !43, !47, !49, !50, !51, !53, !55, !56, !57, !60, !44}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 214, baseType: !32)
!48 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !61)
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !{!25, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !65, line: 18, type: !66, isLocal: true, isDefinition: true)
!65 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !69, line: 16, size: 64, elements: !70)
!69 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !69, line: 17, baseType: !44, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !68, file: !69, line: 18, baseType: !58, size: 8, offset: 32)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "_char_out", scope: !75, file: !150, line: 54, type: !151, isLocal: false, isDefinition: true)
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !76, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !148, globals: !149, splitDebugInlining: false, nameTableKind: None)
!76 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!77 = !{!78}
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !79, line: 27, baseType: !32, size: 32, elements: !80)
!79 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!81 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!82 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!83 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!84 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!85 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!86 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!87 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!88 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!89 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!90 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!91 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!92 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!93 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!94 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!95 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!96 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!97 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!125 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!126 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!127 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!128 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!129 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!130 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!131 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!132 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!133 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!134 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!135 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!136 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!137 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!138 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!139 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!140 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!141 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!142 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!143 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!144 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!145 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!146 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!147 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!148 = !{!38, !49}
!149 = !{!73}
!150 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DISubroutineType(types: !153)
!153 = !{!49, !49}
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "log_const_log", scope: !156, file: !233, line: 25, type: !477, isLocal: false, isDefinition: true)
!156 = distinct !DICompileUnit(language: DW_LANG_C99, file: !157, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !158, retainedTypes: !164, globals: !230, splitDebugInlining: false, nameTableKind: None)
!157 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!158 = !{!159, !30, !78}
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !160, line: 33, baseType: !32, size: 32, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162, !163}
!162 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!163 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!164 = !{!47, !49, !38, !57, !165, !22, !220, !24, !176, !221, !223, !226, !228}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !167)
!167 = !{!168, !186, !192}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !166, file: !31, line: 112, baseType: !169, size: 32)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !170, line: 49, size: 32, elements: !171)
!170 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !{!172, !179, !185}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !169, file: !170, line: 50, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !170, line: 37, size: 32, elements: !174)
!174 = !{!175, !177, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !173, file: !170, line: 38, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !173, file: !170, line: 38, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !170, line: 39, baseType: !176, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !169, file: !170, line: 51, baseType: !180, size: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !170, line: 43, size: 32, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !180, file: !170, line: 44, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !180, file: !170, line: 44, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !180, file: !170, line: 45, baseType: !176, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !169, file: !170, line: 52, baseType: !176, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !166, file: !31, line: 113, baseType: !187, size: 32)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !188)
!188 = !{!189, !190, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !187, file: !31, line: 108, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !187, file: !31, line: 108, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !187, file: !31, line: 108, baseType: !176, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !166, file: !31, line: 114, baseType: !193, size: 128)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !194)
!194 = !{!195, !212, !216}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !193, file: !31, line: 89, baseType: !196, size: 96)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !197)
!197 = !{!198, !209, !210}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !196, file: !31, line: 67, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !199, file: !31, line: 52, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !199, file: !31, line: 52, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !31, line: 52, baseType: !176, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !199, file: !31, line: 53, baseType: !176, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !199, file: !31, line: 54, baseType: !176, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !199, file: !31, line: 55, baseType: !176, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !199, file: !31, line: 56, baseType: !176, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !199, file: !31, line: 57, baseType: !176, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !196, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !196, file: !31, line: 76, baseType: !211, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !176)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !193, file: !31, line: 93, baseType: !213, size: 32, offset: 96)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 4)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !31, line: 94, baseType: !217, offset: 128)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: -1)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !222)
!222 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !224, line: 46, baseType: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !54)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!230 = !{!154, !231, !260, !274, !277, !279, !283, !285, !287, !289, !291, !297, !330, !333, !342, !434, !461, !468, !470, !474, !482, !492}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !156, file: !233, line: 93, type: !234, isLocal: false, isDefinition: true, align: 32)
!233 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !235, line: 2909, size: 128, elements: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !{!237, !258, !259}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !234, file: !235, line: 2910, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !239, line: 233, baseType: !240)
!239 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 231, size: 64, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !240, file: !239, line: 232, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !244, line: 48, baseType: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !244, line: 37, size: 64, elements: !246)
!246 = !{!247, !253}
!247 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !244, line: 38, baseType: !248, size: 32)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !245, file: !244, line: 38, size: 32, elements: !249)
!249 = !{!250, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !248, file: !244, line: 39, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !244, line: 40, baseType: !251, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !244, line: 42, baseType: !254, size: 32, offset: 32)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !245, file: !244, line: 42, size: 32, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !254, file: !244, line: 43, baseType: !251, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !254, file: !244, line: 44, baseType: !251, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !234, file: !235, line: 2911, baseType: !32, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !234, file: !235, line: 2912, baseType: !32, size: 32, offset: 96)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !156, file: !233, line: 910, type: !262, isLocal: true, isDefinition: true, align: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !264, line: 51, size: 64, elements: !265)
!264 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!265 = !{!266, !273}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !263, file: !264, line: 60, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DISubroutineType(types: !269)
!269 = !{!49, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !264, line: 48, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !263, file: !264, line: 65, baseType: !270, size: 32, offset: 32)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "panic_mode", scope: !156, file: !233, line: 96, type: !276, isLocal: true, isDefinition: true)
!276 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "backend_attached", scope: !156, file: !233, line: 97, type: !276, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !156, file: !233, line: 98, type: !281, isLocal: true, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !282, line: 22, baseType: !52)
!282 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !156, file: !233, line: 99, type: !281, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !156, file: !233, line: 105, type: !176, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !156, file: !233, line: 107, type: !211, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !156, file: !233, line: 108, type: !281, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !156, file: !233, line: 111, type: !293, isLocal: true, isDefinition: true, align: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !294, line: 29, size: 32, elements: !295)
!294 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !293, file: !294, line: 30, baseType: !165, size: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "log_buffer", scope: !156, file: !233, line: 112, type: !299, isLocal: true, isDefinition: true, align: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !300, line: 87, size: 448, elements: !301)
!300 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!301 = !{!302, !303, !304, !305, !306, !307, !311, !320, !325, !327, !328, !329}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !299, file: !300, line: 89, baseType: !176, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !299, file: !300, line: 92, baseType: !176, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !299, file: !300, line: 95, baseType: !176, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !299, file: !300, line: 98, baseType: !176, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !299, file: !300, line: 101, baseType: !176, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !299, file: !300, line: 104, baseType: !308, offset: 160)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !309, line: 43, elements: !310)
!309 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = !{}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !299, file: !300, line: 110, baseType: !312, size: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !300, line: 83, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316, !318}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !299, file: !300, line: 113, baseType: !321, size: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !300, line: 75, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{!176, !318}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !299, file: !300, line: 116, baseType: !326, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !300, line: 119, baseType: !176, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !299, file: !300, line: 122, baseType: !176, size: 32, offset: 288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !299, file: !300, line: 124, baseType: !234, size: 128, offset: 320)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !156, file: !233, line: 113, type: !332, isLocal: true, isDefinition: true)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "logging_stack", scope: !156, file: !233, line: 884, type: !335, isLocal: false, isDefinition: true, align: 512)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 576, elements: !340)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !337, line: 47, size: 8, elements: !338)
!337 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !337, line: 48, baseType: !46, size: 8)
!340 = !{!341}
!341 = !DISubrange(count: 72)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "logging_thread", scope: !156, file: !233, line: 885, type: !344, isLocal: false, isDefinition: true)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !345, line: 245, size: 1024, elements: !346)
!345 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !{!347, !392, !405, !406, !407, !408, !414, !429}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !344, file: !345, line: 247, baseType: !348, size: 384)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !345, line: 57, size: 384, elements: !349)
!349 = !{!350, !364, !366, !367, !368, !379, !380, !381}
!350 = !DIDerivedType(tag: DW_TAG_member, scope: !348, file: !345, line: 60, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !348, file: !345, line: 60, size: 64, elements: !352)
!352 = !{!353, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !351, file: !345, line: 61, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !244, line: 49, baseType: !245)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !351, file: !345, line: 62, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !357, line: 49, size: 64, elements: !358)
!357 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !356, file: !357, line: 50, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 64, elements: !362)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!362 = !{!363}
!363 = !DISubrange(count: 2)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !348, file: !345, line: 68, baseType: !365, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !348, file: !345, line: 71, baseType: !58, size: 8, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !348, file: !345, line: 74, baseType: !58, size: 8, offset: 104)
!368 = !DIDerivedType(tag: DW_TAG_member, scope: !348, file: !345, line: 90, baseType: !369, size: 16, offset: 112)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !348, file: !345, line: 90, size: 16, elements: !370)
!370 = !{!371, !378}
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !345, line: 91, baseType: !372, size: 16)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !345, line: 91, size: 16, elements: !373)
!373 = !{!374, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !372, file: !345, line: 96, baseType: !375, size: 8)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !376)
!376 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !372, file: !345, line: 97, baseType: !58, size: 8, offset: 8)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !369, file: !345, line: 100, baseType: !60, size: 16)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !348, file: !345, line: 107, baseType: !176, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !348, file: !345, line: 127, baseType: !38, size: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !348, file: !345, line: 131, baseType: !382, size: 192, offset: 192)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !239, line: 244, size: 192, elements: !383)
!383 = !{!384, !385, !391}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !382, file: !239, line: 245, baseType: !354, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !382, file: !239, line: 246, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !239, line: 242, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !382, file: !239, line: 249, baseType: !225, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !344, file: !345, line: 250, baseType: !393, size: 288, offset: 384)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !394, line: 25, size: 288, elements: !395)
!394 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !393, file: !394, line: 26, baseType: !176, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !393, file: !394, line: 27, baseType: !176, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !393, file: !394, line: 28, baseType: !176, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !393, file: !394, line: 29, baseType: !176, size: 32, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !393, file: !394, line: 30, baseType: !176, size: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !393, file: !394, line: 31, baseType: !176, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !393, file: !394, line: 32, baseType: !176, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !393, file: !394, line: 33, baseType: !176, size: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !393, file: !394, line: 34, baseType: !176, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !344, file: !345, line: 253, baseType: !38, size: 32, offset: 672)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !344, file: !345, line: 256, baseType: !238, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !344, file: !345, line: 294, baseType: !49, size: 32, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !344, file: !345, line: 300, baseType: !409, size: 96, offset: 800)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !345, line: 149, size: 96, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !409, file: !345, line: 153, baseType: !22, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !345, line: 162, baseType: !47, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !409, file: !345, line: 168, baseType: !47, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !344, file: !345, line: 325, baseType: !415, size: 32, offset: 896)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !235, line: 5073, size: 160, elements: !417)
!417 = !{!418, !427, !428}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !416, file: !235, line: 5074, baseType: !419, size: 96)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !420, line: 56, size: 96, elements: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !{!422, !425, !426}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !419, file: !420, line: 57, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !420, line: 57, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !419, file: !420, line: 58, baseType: !38, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !419, file: !420, line: 59, baseType: !47, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !416, file: !235, line: 5075, baseType: !238, size: 64, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !416, file: !235, line: 5076, baseType: !308, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !344, file: !345, line: 343, baseType: !430, size: 64, offset: 928)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !394, line: 60, size: 64, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !430, file: !394, line: 63, baseType: !176, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !430, file: !394, line: 66, baseType: !176, size: 32, offset: 32)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "format_table", scope: !156, file: !233, line: 72, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 128, elements: !214)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !439, line: 105, baseType: !440)
!439 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !443, !220, !176}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !439, line: 89, size: 128, elements: !446)
!446 = !{!447, !452, !459, !460}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !445, file: !439, line: 90, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !439, line: 79, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DISubroutineType(types: !451)
!451 = !{!49, !57, !47, !38}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !445, file: !439, line: 91, baseType: !453, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !439, line: 82, size: 96, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !454, file: !439, line: 83, baseType: !281, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !454, file: !439, line: 84, baseType: !38, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !454, file: !439, line: 85, baseType: !44, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !445, file: !439, line: 92, baseType: !57, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !445, file: !439, line: 93, baseType: !47, size: 32, offset: 96)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !156, file: !233, line: 104, type: !463, isLocal: true, isDefinition: true)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !464, line: 33, baseType: !465)
!464 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DISubroutineType(types: !467)
!467 = !{!211}
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "initialized", scope: !156, file: !233, line: 95, type: !281, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "proc_tid", scope: !156, file: !233, line: 100, type: !472, isLocal: true, isDefinition: true)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !345, line: 347, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !156, file: !233, line: 25, type: !476, isLocal: true, isDefinition: true)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !69, line: 16, size: 64, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !478, file: !69, line: 17, baseType: !44, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !478, file: !69, line: 18, baseType: !58, size: 8, offset: 32)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !156, file: !233, line: 121, type: !484, isLocal: true, isDefinition: true)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !300, line: 128, size: 160, elements: !486)
!486 = !{!487, !488, !489, !490, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !485, file: !300, line: 130, baseType: !326, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !485, file: !300, line: 133, baseType: !176, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !485, file: !300, line: 136, baseType: !312, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !485, file: !300, line: 137, baseType: !321, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !300, line: 140, baseType: !176, size: 32, offset: 128)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "buf32", scope: !156, file: !233, line: 116, type: !494, isLocal: true, isDefinition: true, align: 64)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 32, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 1)
!497 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !500, file: !509, line: 14, type: !742, isLocal: false, isDefinition: true)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !502, retainedTypes: !503, globals: !506, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!502 = !{!159, !78}
!503 = !{!38, !49, !504, !57, !44, !22}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!506 = !{!498, !507, !535, !717, !719, !733, !735, !740}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "sname_cache", scope: !500, file: !509, line: 44, type: !510, isLocal: true, isDefinition: true)
!509 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !511, line: 30, size: 256, elements: !512)
!511 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = !{!513, !526, !527, !532, !533, !534}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !510, file: !511, line: 31, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !515, line: 40, baseType: !516)
!515 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !515, line: 35, size: 64, elements: !517)
!517 = !{!518, !525}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !516, file: !515, line: 36, baseType: !519, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !515, line: 33, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !515, line: 29, size: 32, elements: !522)
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !521, file: !515, line: 30, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !516, file: !515, line: 37, baseType: !519, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !510, file: !511, line: 32, baseType: !514, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !510, file: !511, line: 33, baseType: !528, size: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !511, line: 21, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DISubroutineType(types: !531)
!531 = !{!276, !22, !22}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !510, file: !511, line: 34, baseType: !176, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !510, file: !511, line: 35, baseType: !176, size: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !510, file: !511, line: 36, baseType: !47, size: 32, offset: 224)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !537, file: !509, line: 261, type: !44, isLocal: true, isDefinition: true)
!537 = distinct !DISubprogram(name: "link_domain_name_get", scope: !509, file: !509, line: 256, type: !538, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !500, retainedNodes: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!44, !58}
!540 = !{!541, !542, !543, !544, !545, !548, !716}
!541 = !DILocalVariable(name: "domain_id", arg: 1, scope: !537, file: !509, line: 256, type: !58)
!542 = !DILocalVariable(name: "cached", scope: !537, file: !509, line: 258, type: !57)
!543 = !DILocalVariable(name: "cache_size", scope: !537, file: !509, line: 259, type: !47)
!544 = !DILocalVariable(name: "id", scope: !537, file: !509, line: 260, type: !22)
!545 = !DILocalVariable(name: "rel_domain_id", scope: !546, file: !509, line: 265, type: !58)
!546 = distinct !DILexicalBlock(scope: !547, file: !509, line: 264, column: 49)
!547 = distinct !DILexicalBlock(scope: !537, file: !509, line: 264, column: 6)
!548 = !DILocalVariable(name: "link", scope: !546, file: !509, line: 266, type: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !552, line: 61, size: 192, elements: !553)
!552 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = !{!554, !643, !644, !653, !654, !706}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !551, file: !552, line: 62, baseType: !555, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !552, line: 38, size: 192, elements: !558)
!558 = !{!559, !622, !626, !631, !635, !639}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !557, file: !552, line: 39, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DISubroutineType(types: !562)
!562 = !{!49, !549, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !552, line: 33, size: 64, elements: !565)
!565 = !{!566, !617}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !564, file: !552, line: 34, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !552, line: 27, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !549, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !573)
!573 = !{!574, !590, !596}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !572, file: !31, line: 112, baseType: !575, size: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !170, line: 49, size: 32, elements: !576)
!576 = !{!577, !583, !589}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !575, file: !170, line: 50, baseType: !578, size: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !170, line: 37, size: 32, elements: !579)
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !578, file: !170, line: 38, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !578, file: !170, line: 38, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !578, file: !170, line: 39, baseType: !176, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !575, file: !170, line: 51, baseType: !584, size: 32)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !170, line: 43, size: 32, elements: !585)
!585 = !{!586, !587, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !584, file: !170, line: 44, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !584, file: !170, line: 44, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !584, file: !170, line: 45, baseType: !176, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !575, file: !170, line: 52, baseType: !176, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !572, file: !31, line: 113, baseType: !591, size: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !591, file: !31, line: 108, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !591, file: !31, line: 108, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !591, file: !31, line: 108, baseType: !176, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !572, file: !31, line: 114, baseType: !597, size: 128)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !598)
!598 = !{!599, !615, !616}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !597, file: !31, line: 89, baseType: !600, size: 96)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !601)
!601 = !{!602, !613, !614}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !600, file: !31, line: 67, baseType: !603, size: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !603, file: !31, line: 52, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !603, file: !31, line: 52, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !603, file: !31, line: 52, baseType: !176, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !603, file: !31, line: 53, baseType: !176, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !603, file: !31, line: 54, baseType: !176, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !603, file: !31, line: 55, baseType: !176, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !603, file: !31, line: 56, baseType: !176, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !603, file: !31, line: 57, baseType: !176, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !600, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !600, file: !31, line: 76, baseType: !211, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !597, file: !31, line: 93, baseType: !213, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !597, file: !31, line: 94, baseType: !217, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !564, file: !552, line: 35, baseType: !618, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !552, line: 30, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !549, !176}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !557, file: !552, line: 40, baseType: !623, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DISubroutineType(types: !625)
!625 = !{!49, !549}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !557, file: !552, line: 41, baseType: !627, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DISubroutineType(types: !629)
!629 = !{!49, !549, !176, !56, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !557, file: !552, line: 43, baseType: !632, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DISubroutineType(types: !634)
!634 = !{!49, !549, !176, !60, !56, !630}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !557, file: !552, line: 45, baseType: !636, size: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{!49, !549, !176, !60, !57, !57}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !557, file: !552, line: 48, baseType: !640, size: 32, offset: 160)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DISubroutineType(types: !642)
!642 = !{!49, !549, !176, !60, !58}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !551, file: !552, line: 63, baseType: !44, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !551, file: !552, line: 64, baseType: !645, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !552, line: 52, size: 128, elements: !647)
!647 = !{!648, !649, !651, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !646, file: !552, line: 53, baseType: !176, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !646, file: !552, line: 54, baseType: !650, size: 16, offset: 32)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 16, elements: !495)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !646, file: !552, line: 57, baseType: !176, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !646, file: !552, line: 58, baseType: !326, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !551, file: !552, line: 65, baseType: !38, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !551, file: !552, line: 66, baseType: !655, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !300, line: 87, size: 448, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !665, !674, !679, !680, !681, !682}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !656, file: !300, line: 89, baseType: !176, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !656, file: !300, line: 92, baseType: !176, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !656, file: !300, line: 95, baseType: !176, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !656, file: !300, line: 98, baseType: !176, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !656, file: !300, line: 101, baseType: !176, size: 32, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !656, file: !300, line: 104, baseType: !664, offset: 160)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !309, line: 43, elements: !310)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !656, file: !300, line: 110, baseType: !666, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !300, line: 83, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !670, !672}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !656, file: !300, line: 113, baseType: !675, size: 32, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !300, line: 75, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DISubroutineType(types: !678)
!678 = !{!176, !672}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !656, file: !300, line: 116, baseType: !326, size: 32, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !656, file: !300, line: 119, baseType: !176, size: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !656, file: !300, line: 122, baseType: !176, size: 32, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !656, file: !300, line: 124, baseType: !683, size: 128, offset: 320)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !235, line: 2909, size: 128, elements: !684)
!684 = !{!685, !704, !705}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !683, file: !235, line: 2910, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !239, line: 233, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 231, size: 64, elements: !688)
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !687, file: !239, line: 232, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !244, line: 48, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !244, line: 37, size: 64, elements: !692)
!692 = !{!693, !699}
!693 = !DIDerivedType(tag: DW_TAG_member, scope: !691, file: !244, line: 38, baseType: !694, size: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !691, file: !244, line: 38, size: 32, elements: !695)
!695 = !{!696, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !694, file: !244, line: 39, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !694, file: !244, line: 40, baseType: !697, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, scope: !691, file: !244, line: 42, baseType: !700, size: 32, offset: 32)
!700 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !691, file: !244, line: 42, size: 32, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !700, file: !244, line: 43, baseType: !697, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !700, file: !244, line: 44, baseType: !697, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !683, file: !235, line: 2911, baseType: !32, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !683, file: !235, line: 2912, baseType: !32, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !551, file: !552, line: 67, baseType: !707, size: 32, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !300, line: 128, size: 160, elements: !710)
!710 = !{!711, !712, !713, !714, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !709, file: !300, line: 130, baseType: !326, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !709, file: !300, line: 133, baseType: !176, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !709, file: !300, line: 136, baseType: !666, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !709, file: !300, line: 137, baseType: !675, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !709, file: !300, line: 140, baseType: !176, size: 32, offset: 128)
!716 = !DILocalVariable(name: "err", scope: !546, file: !509, line: 267, type: !49)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "dname_cache", scope: !500, file: !509, line: 43, type: !510, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "dname_cache_config", scope: !721, file: !509, line: 152, type: !726, isLocal: true, isDefinition: true)
!721 = distinct !DISubprogram(name: "cache_init", scope: !509, file: !509, line: 149, type: !722, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !500, retainedNodes: !724)
!722 = !DISubroutineType(types: !723)
!723 = !{null}
!724 = !{!725}
!725 = !DILocalVariable(name: "err", scope: !721, file: !509, line: 151, type: !49)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache_config", file: !511, line: 23, size: 128, elements: !728)
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !727, file: !511, line: 24, baseType: !38, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !727, file: !511, line: 25, baseType: !47, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !727, file: !511, line: 26, baseType: !47, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !727, file: !511, line: 27, baseType: !528, size: 32, offset: 96)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "sname_cache_config", scope: !721, file: !509, line: 158, type: !726, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "dname_cache_buffer", scope: !500, file: !509, line: 40, type: !737, isLocal: true, isDefinition: true, align: 32)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 72, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 9)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "sname_cache_buffer", scope: !500, file: !509, line: 41, type: !737, isLocal: true, isDefinition: true, align: 32)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !69, line: 16, size: 64, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !743, file: !69, line: 17, baseType: !44, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !743, file: !69, line: 18, baseType: !58, size: 8, offset: 32)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "prefix", scope: !749, file: !750, line: 562, type: !795, isLocal: true, isDefinition: true)
!749 = distinct !DISubprogram(name: "log_output_dropped_process", scope: !750, file: !750, line: 558, type: !751, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !767, retainedNodes: !788)
!750 = !DIFile(filename: "zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !DISubroutineType(types: !752)
!752 = !{null, !753, !176}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !439, line: 89, size: 128, elements: !756)
!756 = !{!757, !758, !765, !766}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !755, file: !439, line: 90, baseType: !448, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !755, file: !439, line: 91, baseType: !759, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !439, line: 82, size: 96, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !760, file: !439, line: 83, baseType: !281, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !760, file: !439, line: 84, baseType: !38, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !760, file: !439, line: 85, baseType: !44, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !755, file: !439, line: 92, baseType: !57, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !755, file: !439, line: 93, baseType: !47, size: 32, offset: 96)
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !769, globals: !770, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!769 = !{!22, !38, !57, !221, !49, !176, !753, !46, !59, !32, !504}
!770 = !{!747, !771, !776, !778, !780, !786}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "postfix", scope: !749, file: !750, line: 563, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 224, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 28)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "freq", scope: !767, file: !750, line: 46, type: !176, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "timestamp_div", scope: !767, file: !750, line: 47, type: !211, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "colors", scope: !767, file: !750, line: 38, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 160, elements: !784)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!784 = !{!785}
!785 = !DISubrange(count: 5)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "severity", scope: !767, file: !750, line: 30, type: !782, isLocal: true, isDefinition: true)
!788 = !{!789, !790, !791, !793, !794}
!789 = !DILocalVariable(name: "output", arg: 1, scope: !749, file: !750, line: 558, type: !753)
!790 = !DILocalVariable(name: "cnt", arg: 2, scope: !749, file: !750, line: 558, type: !176)
!791 = !DILocalVariable(name: "buf", scope: !749, file: !750, line: 560, type: !792)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 40, elements: !784)
!793 = !DILocalVariable(name: "len", scope: !749, file: !750, line: 561, type: !49)
!794 = !DILocalVariable(name: "outf", scope: !749, file: !750, line: 565, type: !448)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 12)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "log_const_log_uart", scope: !800, file: !863, line: 16, type: !991, isLocal: false, isDefinition: true)
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !502, retainedTypes: !802, globals: !860, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!802 = !{!38, !49, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !806, line: 336, size: 160, elements: !807)
!806 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!807 = !{!808, !834, !838, !842, !855}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !805, file: !806, line: 365, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{!49, !812, !833}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !815, line: 378, size: 192, elements: !816)
!815 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !{!817, !818, !819, !820, !826, !827}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !815, line: 380, baseType: !44, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !814, file: !815, line: 382, baseType: !13, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !814, file: !815, line: 384, baseType: !13, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !814, file: !815, line: 386, baseType: !821, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !815, line: 351, size: 16, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !822, file: !815, line: 359, baseType: !58, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !822, file: !815, line: 364, baseType: !276, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !814, file: !815, line: 388, baseType: !38, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !814, file: !815, line: 396, baseType: !828, size: 32, offset: 160)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !815, line: 43, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !832)
!832 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !805, file: !806, line: 366, baseType: !835, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !812, !59}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !805, file: !806, line: 374, baseType: !839, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{!49, !812}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !805, file: !806, line: 377, baseType: !843, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!49, !812, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !806, line: 122, size: 64, elements: !849)
!849 = !{!850, !851, !852, !853, !854}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !848, file: !806, line: 123, baseType: !176, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !848, file: !806, line: 124, baseType: !58, size: 8, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !848, file: !806, line: 125, baseType: !58, size: 8, offset: 40)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !848, file: !806, line: 126, baseType: !58, size: 8, offset: 48)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !848, file: !806, line: 127, baseType: !58, size: 8, offset: 56)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !805, file: !806, line: 379, baseType: !856, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{!49, !812, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!860 = !{!798, !861, !959, !961, !963, !978, !981, !983, !986, !989}
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "log_backend_uart_api", scope: !800, file: !863, line: 156, type: !864, isLocal: false, isDefinition: true)
!863 = !DIFile(filename: "zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_api", file: !160, line: 62, size: 224, elements: !866)
!866 = !{!867, !934, !938, !942, !943, !947, !951}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !865, file: !160, line: 63, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !871, !888}
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend", file: !160, line: 93, size: 128, elements: !875)
!875 = !{!876, !878, !886, !887}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !874, file: !160, line: 94, baseType: !877, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !874, file: !160, line: 95, baseType: !879, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_control_block", file: !160, line: 81, size: 64, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !880, file: !160, line: 82, baseType: !38, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !880, file: !160, line: 83, baseType: !58, size: 8, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !880, file: !160, line: 84, baseType: !276, size: 8, offset: 40)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !880, file: !160, line: 87, baseType: !58, size: 8, offset: 48)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !160, line: 96, baseType: !44, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "autostart", scope: !874, file: !160, line: 97, baseType: !276, size: 8, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !890)
!890 = !{!891, !907, !913}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !889, file: !31, line: 112, baseType: !892, size: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !170, line: 49, size: 32, elements: !893)
!893 = !{!894, !900, !906}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !892, file: !170, line: 50, baseType: !895, size: 32)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !170, line: 37, size: 32, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !895, file: !170, line: 38, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !895, file: !170, line: 38, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !895, file: !170, line: 39, baseType: !176, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !892, file: !170, line: 51, baseType: !901, size: 32)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !170, line: 43, size: 32, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !901, file: !170, line: 44, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !901, file: !170, line: 44, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !901, file: !170, line: 45, baseType: !176, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !892, file: !170, line: 52, baseType: !176, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !889, file: !31, line: 113, baseType: !908, size: 32)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !908, file: !31, line: 108, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !908, file: !31, line: 108, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !908, file: !31, line: 108, baseType: !176, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !889, file: !31, line: 114, baseType: !914, size: 128)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !915)
!915 = !{!916, !932, !933}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !914, file: !31, line: 89, baseType: !917, size: 96)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !918)
!918 = !{!919, !930, !931}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !917, file: !31, line: 67, baseType: !920, size: 32)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !920, file: !31, line: 52, baseType: !176, size: 1, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !920, file: !31, line: 52, baseType: !176, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !920, file: !31, line: 52, baseType: !176, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !920, file: !31, line: 53, baseType: !176, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !920, file: !31, line: 54, baseType: !176, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !920, file: !31, line: 55, baseType: !176, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !920, file: !31, line: 56, baseType: !176, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !920, file: !31, line: 57, baseType: !176, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !917, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !917, file: !31, line: 76, baseType: !211, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !914, file: !31, line: 93, baseType: !213, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !914, file: !31, line: 94, baseType: !217, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !865, file: !160, line: 66, baseType: !935, size: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !871, !176}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !865, file: !160, line: 67, baseType: !939, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !871}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !865, file: !160, line: 68, baseType: !939, size: 32, offset: 96)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "is_ready", scope: !865, file: !160, line: 69, baseType: !944, size: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{!49, !871}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "format_set", scope: !865, file: !160, line: 70, baseType: !948, size: 32, offset: 160)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{!49, !871, !176}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !865, file: !160, line: 73, baseType: !952, size: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DISubroutineType(types: !954)
!954 = !{null, !871, !159, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_backend_evt_arg", file: !160, line: 54, size: 32, elements: !957)
!957 = !{!958}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !956, file: !160, line: 56, baseType: !38, size: 32)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "log_backend_uart", scope: !800, file: !863, line: 164, type: !873, isLocal: true, isDefinition: true, align: 32)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "log_format_current", scope: !800, file: !863, line: 28, type: !176, isLocal: true, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "log_output_uart", scope: !800, file: !863, line: 91, type: !965, isLocal: true, isDefinition: true)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !439, line: 89, size: 128, elements: !967)
!967 = !{!968, !969, !976, !977}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !966, file: !439, line: 90, baseType: !448, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !966, file: !439, line: 91, baseType: !970, size: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !439, line: 82, size: 96, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !971, file: !439, line: 83, baseType: !281, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !971, file: !439, line: 84, baseType: !38, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !971, file: !439, line: 85, baseType: !44, size: 32, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !966, file: !439, line: 92, baseType: !57, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !966, file: !439, line: 93, baseType: !47, size: 32, offset: 96)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "uart_dev", scope: !800, file: !863, line: 23, type: !980, isLocal: true, isDefinition: true)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "log_output_uart_control_block", scope: !800, file: !863, line: 91, type: !971, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "uart_output_buf", scope: !800, file: !863, line: 90, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !495)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "in_panic", scope: !800, file: !863, line: 26, type: !988, isLocal: true, isDefinition: true)
!988 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !276)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "backend_cb_log_backend_uart", scope: !800, file: !863, line: 164, type: !880, isLocal: true, isDefinition: true)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !69, line: 16, size: 64, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !69, line: 17, baseType: !44, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !992, file: !69, line: 18, baseType: !58, size: 8, offset: 32)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !998, file: !1031, line: 22, type: !1057, isLocal: false, isDefinition: true)
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !999, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1000, retainedTypes: !1012, globals: !1028, splitDebugInlining: false, nameTableKind: None)
!999 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/basic/blinky_pwm")
!1000 = !{!1001, !78}
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !1002, line: 27, baseType: !32, size: 32, elements: !1003)
!1002 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!1004 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!1005 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!1006 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!1007 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!1008 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!1009 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!1010 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!1011 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!1012 = !{!38, !223, !49, !24, !1013, !56, !176, !221}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !1015, line: 54, size: 96, elements: !1016)
!1015 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1016 = !{!1017, !1023, !1027}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !1014, file: !1015, line: 55, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !515, line: 33, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !515, line: 29, size: 32, elements: !1020)
!1020 = !{!1021}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1019, file: !515, line: 30, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !1014, file: !1015, line: 60, baseType: !1024, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !1001}
