; ModuleID = 'build/arduino_due/sensor/ms5837/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.16 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.17 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.16*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !328, line: 13, type: !330, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !206, globals: !325, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/sensor/ms5837/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837")
!29 = !{!30, !37, !101, !121, !136}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !38, line: 53, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!40 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!41 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!42 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!43 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!44 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!45 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!46 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!47 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!48 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!49 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!50 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!51 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!52 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!53 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!54 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!55 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!56 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!57 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!58 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!59 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!60 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!61 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!62 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!63 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!64 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!65 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!66 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!67 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!68 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!69 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!70 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!71 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!72 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!73 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!74 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!75 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!76 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!77 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!78 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!79 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!80 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!81 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!82 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!83 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!84 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!85 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!86 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!87 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!88 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!89 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!90 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!91 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!92 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!93 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!94 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!95 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!96 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!97 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!98 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!99 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!100 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !38, line: 274, baseType: !32, size: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!103 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!104 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!105 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!106 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!107 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!108 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!109 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!110 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!111 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!112 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!113 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!114 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!115 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!116 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!117 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!118 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!119 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!120 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !38, line: 203, baseType: !32, size: 32, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!123 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!124 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!125 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!126 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!127 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!128 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!129 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!130 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!131 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!132 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!133 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!134 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!135 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !137, line: 27, baseType: !32, size: 32, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!139 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!140 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!141 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!142 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!143 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!144 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!145 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!146 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!147 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!148 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!149 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!150 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!151 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!152 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!153 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!154 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!155 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!189 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!190 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!191 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!192 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!193 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!194 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!195 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!196 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!197 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!198 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!199 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!200 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!201 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!202 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!203 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!204 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!205 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!206 = !{!207, !208, !222, !223, !216, !224, !234, !253}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !210, line: 78, size: 32, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !221}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !209, file: !210, line: 80, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !210, line: 45, size: 32, elements: !214)
!214 = !{!215, !218, !219, !220}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !210, line: 47, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !217)
!217 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !213, file: !210, line: 50, baseType: !216, size: 8, offset: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !213, file: !210, line: 53, baseType: !216, size: 8, offset: 16)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !213, file: !210, line: 56, baseType: !216, size: 8, offset: 24)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !209, file: !210, line: 82, baseType: !207, size: 32)
!222 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !226)
!226 = !{!227, !245, !249}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !225, file: !31, line: 89, baseType: !228, size: 96)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !229)
!229 = !{!230, !242, !243}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !228, file: !31, line: 67, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !232)
!232 = !{!233, !235, !236, !237, !238, !239, !240, !241}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !231, file: !31, line: 52, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !231, file: !31, line: 52, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !31, line: 52, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !231, file: !31, line: 53, baseType: !234, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !231, file: !31, line: 54, baseType: !234, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !231, file: !31, line: 55, baseType: !234, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !231, file: !31, line: 56, baseType: !234, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !231, file: !31, line: 57, baseType: !234, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !228, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !228, file: !31, line: 76, baseType: !244, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !234)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !225, file: !31, line: 93, baseType: !246, size: 32, offset: 96)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 32, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 4)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !31, line: 94, baseType: !250, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: -1)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !38, line: 397, size: 160, elements: !256)
!256 = !{!257, !294, !300, !315, !320}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !255, file: !38, line: 398, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !38, line: 354, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!222, !262, !37, !101, !287}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !265, line: 378, size: 192, elements: !266)
!265 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !{!267, !271, !272, !273, !280, !281}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !264, file: !265, line: 380, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !264, file: !265, line: 382, baseType: !13, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !264, file: !265, line: 384, baseType: !13, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !264, file: !265, line: 386, baseType: !274, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !265, line: 351, size: 16, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !275, file: !265, line: 359, baseType: !216, size: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !275, file: !265, line: 364, baseType: !279, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!279 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !265, line: 388, baseType: !207, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !264, file: !265, line: 396, baseType: !282, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !265, line: 43, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !286)
!286 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !38, line: 43, size: 64, elements: !290)
!290 = !{!291, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !289, file: !38, line: 45, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !222)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !289, file: !38, line: 47, baseType: !292, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !255, file: !38, line: 399, baseType: !295, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !38, line: 365, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{!222, !262, !37, !101, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !255, file: !38, line: 400, baseType: !301, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !38, line: 376, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!222, !262, !305, !311}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !38, line: 264, size: 64, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !38, line: 266, baseType: !121, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !307, file: !38, line: 268, baseType: !37, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !38, line: 345, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !262, !305}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !255, file: !38, line: 401, baseType: !316, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !38, line: 385, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DISubroutineType(types: !319)
!319 = !{!222, !262, !37}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !255, file: !38, line: 402, baseType: !321, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !38, line: 393, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{!222, !262, !37, !299}
!325 = !{!25, !326}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !328, line: 13, type: !329, isLocal: true, isDefinition: true)
!328 = !DIFile(filename: "zephyr/samples/sensor/ms5837/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !332, line: 16, size: 64, elements: !333)
!332 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !332, line: 17, baseType: !268, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !331, file: !332, line: 18, baseType: !216, size: 8, offset: 32)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !338, file: !359, line: 18, type: !360, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !340, globals: !358, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837")
!340 = !{!22, !207, !24, !341, !343, !345, !346, !222, !348, !349, !351, !353, !354, !355, !356, !268}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !347, line: 214, baseType: !32)
!347 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !357)
!357 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!358 = !{!336}
!359 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !332, line: 16, size: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !332, line: 17, baseType: !268, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !361, file: !332, line: 18, baseType: !216, size: 8, offset: 32)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "_char_out", scope: !367, file: !372, line: 54, type: !373, isLocal: false, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !370, globals: !371, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837")
!369 = !{!136}
!370 = !{!207, !222}
!371 = !{!365}
!372 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{!222, !222}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !378, file: !443, line: 235, type: !444, isLocal: true, isDefinition: true, align: 32)
!378 = distinct !DICompileUnit(language: DW_LANG_C99, file: !379, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !380, globals: !442, splitDebugInlining: false, nameTableKind: None)
!379 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837")
!380 = !{!207, !222, !381, !392}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !383, line: 46, baseType: !384)
!383 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 41, size: 128, elements: !385)
!385 = !{!386, !388, !389, !391}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !384, file: !383, line: 42, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !234)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !384, file: !383, line: 43, baseType: !387, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !384, file: !383, line: 44, baseType: !390, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !384, file: !383, line: 45, baseType: !390, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !394, line: 75, baseType: !395)
!394 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 41, size: 2176, elements: !396)
!396 = !{!397, !398, !399, !400, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !420, !424, !425, !426, !427, !428, !429, !430, !431, !435, !436, !437, !438, !439, !440, !441}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !395, file: !394, line: 42, baseType: !387, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !395, file: !394, line: 43, baseType: !387, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !395, file: !394, line: 44, baseType: !390, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !395, file: !394, line: 45, baseType: !401, size: 32, offset: 96)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 32, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 1)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !395, file: !394, line: 46, baseType: !387, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !395, file: !394, line: 47, baseType: !387, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !395, file: !394, line: 48, baseType: !390, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !395, file: !394, line: 49, baseType: !387, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !395, file: !394, line: 50, baseType: !387, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !395, file: !394, line: 51, baseType: !390, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !395, file: !394, line: 52, baseType: !387, size: 32, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !395, file: !394, line: 53, baseType: !401, size: 32, offset: 352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !395, file: !394, line: 54, baseType: !387, size: 32, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !395, file: !394, line: 55, baseType: !401, size: 32, offset: 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !395, file: !394, line: 56, baseType: !387, size: 32, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !395, file: !394, line: 57, baseType: !401, size: 32, offset: 480)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !395, file: !394, line: 58, baseType: !417, size: 96, offset: 512)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 96, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 3)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !395, file: !394, line: 59, baseType: !421, size: 160, offset: 608)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 160, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 5)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !395, file: !394, line: 60, baseType: !387, size: 32, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !395, file: !394, line: 61, baseType: !387, size: 32, offset: 800)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !395, file: !394, line: 62, baseType: !390, size: 32, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !395, file: !394, line: 63, baseType: !390, size: 32, offset: 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !395, file: !394, line: 64, baseType: !387, size: 32, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !395, file: !394, line: 65, baseType: !387, size: 32, offset: 928)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !395, file: !394, line: 66, baseType: !387, size: 32, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !395, file: !394, line: 67, baseType: !432, size: 832, offset: 992)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 832, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 26)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !395, file: !394, line: 68, baseType: !387, size: 32, offset: 1824)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !395, file: !394, line: 69, baseType: !390, size: 32, offset: 1856)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !395, file: !394, line: 70, baseType: !421, size: 160, offset: 1888)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !395, file: !394, line: 71, baseType: !387, size: 32, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !395, file: !394, line: 72, baseType: !387, size: 32, offset: 2080)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !395, file: !394, line: 73, baseType: !390, size: 32, offset: 2112)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !395, file: !394, line: 74, baseType: !387, size: 32, offset: 2144)
!442 = !{!376}
!443 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !446, line: 51, size: 64, elements: !447)
!446 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !{!448, !467}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !445, file: !446, line: 60, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DISubroutineType(types: !451)
!451 = !{!222, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !265, line: 378, size: 192, elements: !455)
!455 = !{!456, !457, !458, !459, !465, !466}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !454, file: !265, line: 380, baseType: !268, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !454, file: !265, line: 382, baseType: !13, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !454, file: !265, line: 384, baseType: !13, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !454, file: !265, line: 386, baseType: !460, size: 32, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !265, line: 351, size: 16, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !461, file: !265, line: 359, baseType: !216, size: 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !461, file: !265, line: 364, baseType: !279, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !265, line: 388, baseType: !207, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !454, file: !265, line: 396, baseType: !282, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !445, file: !446, line: 65, baseType: !452, size: 32, offset: 32)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "log_const_log", scope: !470, file: !539, line: 25, type: !829, isLocal: false, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !472, retainedTypes: !478, globals: !536, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837")
!472 = !{!473, !136}
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !474, line: 33, baseType: !32, size: 32, elements: !475)
!474 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!475 = !{!476, !477}
!476 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!477 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!478 = !{!346, !222, !207, !479, !22, !526, !24, !234, !527, !530, !532, !534}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !481)
!481 = !{!482, !499, !505}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !480, file: !31, line: 112, baseType: !483, size: 32)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !484, line: 49, size: 32, elements: !485)
!484 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!485 = !{!486, !492, !498}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !483, file: !484, line: 50, baseType: !487, size: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !484, line: 37, size: 32, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !487, file: !484, line: 38, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !487, file: !484, line: 38, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !487, file: !484, line: 39, baseType: !234, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !483, file: !484, line: 51, baseType: !493, size: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !484, line: 43, size: 32, elements: !494)
!494 = !{!495, !496, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !493, file: !484, line: 44, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !493, file: !484, line: 44, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !493, file: !484, line: 45, baseType: !234, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !483, file: !484, line: 52, baseType: !234, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !480, file: !31, line: 113, baseType: !500, size: 32)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !500, file: !31, line: 108, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !500, file: !31, line: 108, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !500, file: !31, line: 108, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !480, file: !31, line: 114, baseType: !506, size: 128)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !507)
!507 = !{!508, !524, !525}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !506, file: !31, line: 89, baseType: !509, size: 96)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !510)
!510 = !{!511, !522, !523}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !509, file: !31, line: 67, baseType: !512, size: 32)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !512, file: !31, line: 52, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !512, file: !31, line: 52, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !31, line: 52, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !512, file: !31, line: 53, baseType: !234, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !512, file: !31, line: 54, baseType: !234, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !512, file: !31, line: 55, baseType: !234, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !512, file: !31, line: 56, baseType: !234, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !512, file: !31, line: 57, baseType: !234, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !509, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !509, file: !31, line: 76, baseType: !244, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !506, file: !31, line: 93, baseType: !246, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !506, file: !31, line: 94, baseType: !250, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !528, line: 46, baseType: !529)
!528 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !352)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !531)
!531 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!536 = !{!468, !537, !566, !579, !581, !583, !587, !589, !591, !593, !595, !597, !603, !636, !639, !648, !740, !767, !774, !776, !786, !791, !806, !810}
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !470, file: !539, line: 93, type: !540, isLocal: false, isDefinition: true, align: 32)
!539 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !541, line: 2909, size: 128, elements: !542)
!541 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !{!543, !564, !565}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !540, file: !541, line: 2910, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !545, line: 233, baseType: !546)
!545 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 231, size: 64, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !546, file: !545, line: 232, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !550, line: 48, baseType: !551)
!550 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !550, line: 37, size: 64, elements: !552)
!552 = !{!553, !559}
!553 = !DIDerivedType(tag: DW_TAG_member, scope: !551, file: !550, line: 38, baseType: !554, size: 32)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !551, file: !550, line: 38, size: 32, elements: !555)
!555 = !{!556, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !554, file: !550, line: 39, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !550, line: 40, baseType: !557, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !551, file: !550, line: 42, baseType: !560, size: 32, offset: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !551, file: !550, line: 42, size: 32, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !560, file: !550, line: 43, baseType: !557, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !560, file: !550, line: 44, baseType: !557, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !540, file: !541, line: 2911, baseType: !32, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !540, file: !541, line: 2912, baseType: !32, size: 32, offset: 96)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !470, file: !539, line: 910, type: !568, isLocal: true, isDefinition: true, align: 32)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !446, line: 51, size: 64, elements: !570)
!570 = !{!571, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !569, file: !446, line: 60, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DISubroutineType(types: !574)
!574 = !{!222, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !446, line: 48, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !569, file: !446, line: 65, baseType: !575, size: 32, offset: 32)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "panic_mode", scope: !470, file: !539, line: 96, type: !279, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "backend_attached", scope: !470, file: !539, line: 97, type: !279, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !470, file: !539, line: 98, type: !585, isLocal: true, isDefinition: true)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !586, line: 22, baseType: !350)
!586 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !470, file: !539, line: 99, type: !585, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !470, file: !539, line: 105, type: !234, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !470, file: !539, line: 107, type: !244, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !470, file: !539, line: 108, type: !585, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !470, file: !539, line: 109, type: !530, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !470, file: !539, line: 111, type: !599, isLocal: true, isDefinition: true, align: 32)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !600, line: 29, size: 32, elements: !601)
!600 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !599, file: !600, line: 30, baseType: !479, size: 32)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "log_buffer", scope: !470, file: !539, line: 112, type: !605, isLocal: true, isDefinition: true, align: 32)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !606, line: 87, size: 448, elements: !607)
!606 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!607 = !{!608, !609, !610, !611, !612, !613, !617, !626, !631, !633, !634, !635}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !605, file: !606, line: 89, baseType: !234, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !605, file: !606, line: 92, baseType: !234, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !605, file: !606, line: 95, baseType: !234, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !605, file: !606, line: 98, baseType: !234, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !605, file: !606, line: 101, baseType: !234, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !605, file: !606, line: 104, baseType: !614, offset: 160)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !615, line: 43, elements: !616)
!615 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !{}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !605, file: !606, line: 110, baseType: !618, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !606, line: 83, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !622, !624}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !605, file: !606, line: 113, baseType: !627, size: 32, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !606, line: 75, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DISubroutineType(types: !630)
!630 = !{!234, !624}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !605, file: !606, line: 116, baseType: !632, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !605, file: !606, line: 119, baseType: !234, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !605, file: !606, line: 122, baseType: !234, size: 32, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !605, file: !606, line: 124, baseType: !540, size: 128, offset: 320)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !470, file: !539, line: 113, type: !638, isLocal: true, isDefinition: true)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "logging_stack", scope: !470, file: !539, line: 884, type: !641, isLocal: false, isDefinition: true, align: 512)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 6656, elements: !646)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !643, line: 47, size: 8, elements: !644)
!643 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !642, file: !643, line: 48, baseType: !270, size: 8)
!646 = !{!647}
!647 = !DISubrange(count: 832)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "logging_thread", scope: !470, file: !539, line: 885, type: !650, isLocal: false, isDefinition: true)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !651, line: 245, size: 1024, elements: !652)
!651 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !{!653, !698, !711, !712, !713, !714, !720, !735}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !650, file: !651, line: 247, baseType: !654, size: 384)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !651, line: 57, size: 384, elements: !655)
!655 = !{!656, !670, !672, !673, !674, !685, !686, !687}
!656 = !DIDerivedType(tag: DW_TAG_member, scope: !654, file: !651, line: 60, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !654, file: !651, line: 60, size: 64, elements: !658)
!658 = !{!659, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !657, file: !651, line: 61, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !550, line: 49, baseType: !551)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !657, file: !651, line: 62, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !663, line: 49, size: 64, elements: !664)
!663 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !662, file: !663, line: 50, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 64, elements: !668)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!668 = !{!669}
!669 = !DISubrange(count: 2)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !654, file: !651, line: 68, baseType: !671, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !654, file: !651, line: 71, baseType: !216, size: 8, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !654, file: !651, line: 74, baseType: !216, size: 8, offset: 104)
!674 = !DIDerivedType(tag: DW_TAG_member, scope: !654, file: !651, line: 90, baseType: !675, size: 16, offset: 112)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !654, file: !651, line: 90, size: 16, elements: !676)
!676 = !{!677, !684}
!677 = !DIDerivedType(tag: DW_TAG_member, scope: !675, file: !651, line: 91, baseType: !678, size: 16)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !675, file: !651, line: 91, size: 16, elements: !679)
!679 = !{!680, !683}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !678, file: !651, line: 96, baseType: !681, size: 8)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !682)
!682 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !678, file: !651, line: 97, baseType: !216, size: 8, offset: 8)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !675, file: !651, line: 100, baseType: !356, size: 16)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !654, file: !651, line: 107, baseType: !234, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !654, file: !651, line: 127, baseType: !207, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !654, file: !651, line: 131, baseType: !688, size: 192, offset: 192)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !545, line: 244, size: 192, elements: !689)
!689 = !{!690, !691, !697}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !688, file: !545, line: 245, baseType: !660, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !688, file: !545, line: 246, baseType: !692, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !545, line: 242, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !688, file: !545, line: 249, baseType: !529, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !650, file: !651, line: 250, baseType: !699, size: 288, offset: 384)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !700, line: 25, size: 288, elements: !701)
!700 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !699, file: !700, line: 26, baseType: !234, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !699, file: !700, line: 27, baseType: !234, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !699, file: !700, line: 28, baseType: !234, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !699, file: !700, line: 29, baseType: !234, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !699, file: !700, line: 30, baseType: !234, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !699, file: !700, line: 31, baseType: !234, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !699, file: !700, line: 32, baseType: !234, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !699, file: !700, line: 33, baseType: !234, size: 32, offset: 224)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !699, file: !700, line: 34, baseType: !234, size: 32, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !650, file: !651, line: 253, baseType: !207, size: 32, offset: 672)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !650, file: !651, line: 256, baseType: !544, size: 64, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !650, file: !651, line: 294, baseType: !222, size: 32, offset: 768)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !650, file: !651, line: 300, baseType: !715, size: 96, offset: 800)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !651, line: 149, size: 96, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !715, file: !651, line: 153, baseType: !22, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !715, file: !651, line: 162, baseType: !346, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !715, file: !651, line: 168, baseType: !346, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !650, file: !651, line: 325, baseType: !721, size: 32, offset: 896)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !541, line: 5073, size: 160, elements: !723)
!723 = !{!724, !733, !734}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !722, file: !541, line: 5074, baseType: !725, size: 96)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !726, line: 56, size: 96, elements: !727)
!726 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !{!728, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !725, file: !726, line: 57, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !726, line: 57, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !725, file: !726, line: 58, baseType: !207, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !725, file: !726, line: 59, baseType: !346, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !722, file: !541, line: 5075, baseType: !544, size: 64, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !722, file: !541, line: 5076, baseType: !614, offset: 160)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !650, file: !651, line: 343, baseType: !736, size: 64, offset: 928)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !700, line: 60, size: 64, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !736, file: !700, line: 63, baseType: !234, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !736, file: !700, line: 66, baseType: !234, size: 32, offset: 32)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "format_table", scope: !470, file: !539, line: 72, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 128, elements: !247)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !745, line: 105, baseType: !746)
!745 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !749, !526, !234}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !745, line: 89, size: 128, elements: !752)
!752 = !{!753, !758, !765, !766}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !751, file: !745, line: 90, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !745, line: 79, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{!222, !355, !346, !207}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !751, file: !745, line: 91, baseType: !759, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !745, line: 82, size: 96, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !760, file: !745, line: 83, baseType: !585, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !760, file: !745, line: 84, baseType: !207, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !760, file: !745, line: 85, baseType: !268, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !751, file: !745, line: 92, baseType: !355, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !751, file: !745, line: 93, baseType: !346, size: 32, offset: 96)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !470, file: !539, line: 104, type: !769, isLocal: true, isDefinition: true)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !770, line: 33, baseType: !771)
!770 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DISubroutineType(types: !773)
!773 = !{!244}
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "initialized", scope: !470, file: !539, line: 95, type: !585, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !470, file: !539, line: 121, type: !778, isLocal: true, isDefinition: true)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !606, line: 128, size: 160, elements: !780)
!780 = !{!781, !782, !783, !784, !785}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !779, file: !606, line: 130, baseType: !632, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !779, file: !606, line: 133, baseType: !234, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !779, file: !606, line: 136, baseType: !618, size: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !779, file: !606, line: 137, baseType: !627, size: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !779, file: !606, line: 140, baseType: !234, size: 32, offset: 128)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "buf32", scope: !470, file: !539, line: 116, type: !788, isLocal: true, isDefinition: true, align: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 8192, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 256)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "process_lock", scope: !793, file: !539, line: 157, type: !614, isLocal: true, isDefinition: true)
!793 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !539, file: !539, line: 152, type: !794, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !470, retainedNodes: !796)
!794 = !DISubroutineType(types: !795)
!795 = !{null}
!796 = !{!797, !799}
!797 = !DILocalVariable(name: "cnt", scope: !793, file: !539, line: 154, type: !798)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !586, line: 23, baseType: !585)
!799 = !DILocalVariable(name: "key", scope: !800, file: !539, line: 158, type: !802)
!800 = distinct !DILexicalBlock(scope: !801, file: !539, line: 156, column: 18)
!801 = distinct !DILexicalBlock(scope: !793, file: !539, line: 156, column: 6)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !615, line: 106, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !615, line: 32, size: 32, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !803, file: !615, line: 33, baseType: !222, size: 32)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "proc_tid", scope: !470, file: !539, line: 100, type: !808, isLocal: true, isDefinition: true)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !651, line: 347, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !470, file: !539, line: 101, type: !812, isLocal: true, isDefinition: true)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !541, line: 1318, size: 448, elements: !813)
!813 = !{!814, !815, !816, !821, !822, !827, !828}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !812, file: !541, line: 1324, baseType: !688, size: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !812, file: !541, line: 1327, baseType: !544, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !812, file: !541, line: 1330, baseType: !817, size: 32, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !820}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !812, file: !541, line: 1333, baseType: !817, size: 32, offset: 288)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !812, file: !541, line: 1336, baseType: !823, size: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !528, line: 67, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 65, size: 64, elements: !825)
!825 = !{!826}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !824, file: !528, line: 66, baseType: !527, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !812, file: !541, line: 1339, baseType: !234, size: 32, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !812, file: !541, line: 1342, baseType: !207, size: 32, offset: 416)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !332, line: 16, size: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !332, line: 17, baseType: !268, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !830, file: !332, line: 18, baseType: !216, size: 8, offset: 32)
!834 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!835 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !838, file: !846, line: 14, type: !1077, isLocal: false, isDefinition: true)
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !472, retainedTypes: !840, globals: !843, splitDebugInlining: false, nameTableKind: None)
!839 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/ms5837")
!840 = !{!207, !222, !841, !355, !268, !22}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!843 = !{!836, !844, !872, !1054, !1056, !1068, !1070, !1075}
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "sname_cache", scope: !838, file: !846, line: 44, type: !847, isLocal: true, isDefinition: true)
!846 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !848, line: 30, size: 256, elements: !849)
!848 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!849 = !{!850, !863, !864, !869, !870, !871}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !847, file: !848, line: 31, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !852, line: 40, baseType: !853)
!852 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !852, line: 35, size: 64, elements: !854)
!854 = !{!855, !862}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !853, file: !852, line: 36, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !852, line: 33, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !852, line: 29, size: 32, elements: !859)
!859 = !{!860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !852, line: 30, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !853, file: !852, line: 37, baseType: !856, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !847, file: !848, line: 32, baseType: !851, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !847, file: !848, line: 33, baseType: !865, size: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !848, line: 21, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!279, !22, !22}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !847, file: !848, line: 34, baseType: !234, size: 32, offset: 160)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !847, file: !848, line: 35, baseType: !234, size: 32, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !847, file: !848, line: 36, baseType: !346, size: 32, offset: 224)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !874, file: !846, line: 261, type: !268, isLocal: true, isDefinition: true)
!874 = distinct !DISubprogram(name: "link_domain_name_get", scope: !846, file: !846, line: 256, type: !875, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !838, retainedNodes: !877)
!875 = !DISubroutineType(types: !876)
!876 = !{!268, !216}
!877 = !{!878, !879, !880, !881, !882, !885, !1053}
!878 = !DILocalVariable(name: "domain_id", arg: 1, scope: !874, file: !846, line: 256, type: !216)
!879 = !DILocalVariable(name: "cached", scope: !874, file: !846, line: 258, type: !355)
!880 = !DILocalVariable(name: "cache_size", scope: !874, file: !846, line: 259, type: !346)
!881 = !DILocalVariable(name: "id", scope: !874, file: !846, line: 260, type: !22)
!882 = !DILocalVariable(name: "rel_domain_id", scope: !883, file: !846, line: 265, type: !216)
!883 = distinct !DILexicalBlock(scope: !884, file: !846, line: 264, column: 49)
!884 = distinct !DILexicalBlock(scope: !874, file: !846, line: 264, column: 6)
!885 = !DILocalVariable(name: "link", scope: !883, file: !846, line: 266, type: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !889, line: 61, size: 192, elements: !890)
!889 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = !{!891, !980, !981, !990, !991, !1043}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !888, file: !889, line: 62, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !889, line: 38, size: 192, elements: !895)
!895 = !{!896, !959, !963, !968, !972, !976}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !894, file: !889, line: 39, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{!222, !886, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !889, line: 33, size: 64, elements: !902)
!902 = !{!903, !954}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !901, file: !889, line: 34, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !889, line: 27, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !886, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !910)
!910 = !{!911, !927, !933}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !909, file: !31, line: 112, baseType: !912, size: 32)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !484, line: 49, size: 32, elements: !913)
!913 = !{!914, !920, !926}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !912, file: !484, line: 50, baseType: !915, size: 32)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !484, line: 37, size: 32, elements: !916)
!916 = !{!917, !918, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !915, file: !484, line: 38, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !915, file: !484, line: 38, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !915, file: !484, line: 39, baseType: !234, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !912, file: !484, line: 51, baseType: !921, size: 32)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !484, line: 43, size: 32, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !921, file: !484, line: 44, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !921, file: !484, line: 44, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !921, file: !484, line: 45, baseType: !234, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !912, file: !484, line: 52, baseType: !234, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !909, file: !31, line: 113, baseType: !928, size: 32)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !928, file: !31, line: 108, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !928, file: !31, line: 108, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !928, file: !31, line: 108, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !909, file: !31, line: 114, baseType: !934, size: 128)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !935)
!935 = !{!936, !952, !953}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !934, file: !31, line: 89, baseType: !937, size: 96)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !938)
!938 = !{!939, !950, !951}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !937, file: !31, line: 67, baseType: !940, size: 32)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !940, file: !31, line: 52, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !940, file: !31, line: 52, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !940, file: !31, line: 52, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !940, file: !31, line: 53, baseType: !234, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !940, file: !31, line: 54, baseType: !234, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !940, file: !31, line: 55, baseType: !234, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !940, file: !31, line: 56, baseType: !234, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !940, file: !31, line: 57, baseType: !234, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !937, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !937, file: !31, line: 76, baseType: !244, size: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !934, file: !31, line: 93, baseType: !246, size: 32, offset: 96)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !934, file: !31, line: 94, baseType: !250, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !901, file: !889, line: 35, baseType: !955, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !889, line: 30, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !886, !234}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !894, file: !889, line: 40, baseType: !960, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{!222, !886}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !894, file: !889, line: 41, baseType: !964, size: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{!222, !886, !234, !354, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !894, file: !889, line: 43, baseType: !969, size: 32, offset: 96)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!222, !886, !234, !356, !354, !967}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !894, file: !889, line: 45, baseType: !973, size: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{!222, !886, !234, !356, !355, !355}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !894, file: !889, line: 48, baseType: !977, size: 32, offset: 160)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{!222, !886, !234, !356, !216}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !888, file: !889, line: 63, baseType: !268, size: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !888, file: !889, line: 64, baseType: !982, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !889, line: 52, size: 128, elements: !984)
!984 = !{!985, !986, !988, !989}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !983, file: !889, line: 53, baseType: !234, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !983, file: !889, line: 54, baseType: !987, size: 16, offset: 32)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 16, elements: !402)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !983, file: !889, line: 57, baseType: !234, size: 32, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !983, file: !889, line: 58, baseType: !632, size: 32, offset: 96)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !888, file: !889, line: 65, baseType: !207, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !888, file: !889, line: 66, baseType: !992, size: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !606, line: 87, size: 448, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1002, !1011, !1016, !1017, !1018, !1019}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !993, file: !606, line: 89, baseType: !234, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !993, file: !606, line: 92, baseType: !234, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !993, file: !606, line: 95, baseType: !234, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !993, file: !606, line: 98, baseType: !234, size: 32, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !606, line: 101, baseType: !234, size: 32, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !993, file: !606, line: 104, baseType: !1001, offset: 160)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !615, line: 43, elements: !616)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !993, file: !606, line: 110, baseType: !1003, size: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !606, line: 83, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !1007, !1009}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !993, file: !606, line: 113, baseType: !1012, size: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !606, line: 75, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!234, !1009}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !993, file: !606, line: 116, baseType: !632, size: 32, offset: 224)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !993, file: !606, line: 119, baseType: !234, size: 32, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !993, file: !606, line: 122, baseType: !234, size: 32, offset: 288)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !993, file: !606, line: 124, baseType: !1020, size: 128, offset: 320)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !541, line: 2909, size: 128, elements: !1021)
!1021 = !{!1022, !1041, !1042}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !1020, file: !541, line: 2910, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !545, line: 233, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 231, size: 64, elements: !1025)
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !1024, file: !545, line: 232, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !550, line: 48, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !550, line: 37, size: 64, elements: !1029)
!1029 = !{!1030, !1036}
!1030 = !DIDerivedType(tag: DW_TAG_member, scope: !1028, file: !550, line: 38, baseType: !1031, size: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1028, file: !550, line: 38, size: 32, elements: !1032)
!1032 = !{!1033, !1035}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1031, file: !550, line: 39, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1031, file: !550, line: 40, baseType: !1034, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, scope: !1028, file: !550, line: 42, baseType: !1037, size: 32, offset: 32)
!1037 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1028, file: !550, line: 42, size: 32, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1037, file: !550, line: 43, baseType: !1034, size: 32)
