; ModuleID = 'build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.osSemaphoreAttr_t = type { i8*, i32, i8*, i32 }
%struct.osThreadAttr_t = type { i8*, i32, i8*, i32, i8*, i32, i32, i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.cv2_thread = type { %struct._dnode, %struct.k_thread, %struct.k_poll_signal, %struct.k_poll_event, i32, [16 x i8], i32, %struct.k_sem, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, %struct.z_poller, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "sema_attr", scope: !27, file: !212, line: 36, type: !213, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !168, globals: !175, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!29 = !{!30, !42, !113}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 195, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os2.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osError", value: -1)
!36 = !DIEnumerator(name: "osErrorTimeout", value: -2)
!37 = !DIEnumerator(name: "osErrorResource", value: -3)
!38 = !DIEnumerator(name: "osErrorParameter", value: -4)
!39 = !DIEnumerator(name: "osErrorNoMemory", value: -5)
!40 = !DIEnumerator(name: "osErrorISR", value: -6)
!41 = !DIEnumerator(name: "osStatusReserved", value: 2147483647)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !43, line: 27, baseType: !44, size: 32, elements: !45)
!43 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!44 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!46 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!47 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!48 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!49 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!50 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!51 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!52 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!53 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!54 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!55 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!56 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!57 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!58 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!59 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!60 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!61 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!62 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!112 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 101, baseType: !32, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!115 = !DIEnumerator(name: "osPriorityNone", value: 0)
!116 = !DIEnumerator(name: "osPriorityIdle", value: 1)
!117 = !DIEnumerator(name: "osPriorityLow", value: 8)
!118 = !DIEnumerator(name: "osPriorityLow1", value: 9)
!119 = !DIEnumerator(name: "osPriorityLow2", value: 10)
!120 = !DIEnumerator(name: "osPriorityLow3", value: 11)
!121 = !DIEnumerator(name: "osPriorityLow4", value: 12)
!122 = !DIEnumerator(name: "osPriorityLow5", value: 13)
!123 = !DIEnumerator(name: "osPriorityLow6", value: 14)
!124 = !DIEnumerator(name: "osPriorityLow7", value: 15)
!125 = !DIEnumerator(name: "osPriorityBelowNormal", value: 16)
!126 = !DIEnumerator(name: "osPriorityBelowNormal1", value: 17)
!127 = !DIEnumerator(name: "osPriorityBelowNormal2", value: 18)
!128 = !DIEnumerator(name: "osPriorityBelowNormal3", value: 19)
!129 = !DIEnumerator(name: "osPriorityBelowNormal4", value: 20)
!130 = !DIEnumerator(name: "osPriorityBelowNormal5", value: 21)
!131 = !DIEnumerator(name: "osPriorityBelowNormal6", value: 22)
!132 = !DIEnumerator(name: "osPriorityBelowNormal7", value: 23)
!133 = !DIEnumerator(name: "osPriorityNormal", value: 24)
!134 = !DIEnumerator(name: "osPriorityNormal1", value: 25)
!135 = !DIEnumerator(name: "osPriorityNormal2", value: 26)
!136 = !DIEnumerator(name: "osPriorityNormal3", value: 27)
!137 = !DIEnumerator(name: "osPriorityNormal4", value: 28)
!138 = !DIEnumerator(name: "osPriorityNormal5", value: 29)
!139 = !DIEnumerator(name: "osPriorityNormal6", value: 30)
!140 = !DIEnumerator(name: "osPriorityNormal7", value: 31)
!141 = !DIEnumerator(name: "osPriorityAboveNormal", value: 32)
!142 = !DIEnumerator(name: "osPriorityAboveNormal1", value: 33)
!143 = !DIEnumerator(name: "osPriorityAboveNormal2", value: 34)
!144 = !DIEnumerator(name: "osPriorityAboveNormal3", value: 35)
!145 = !DIEnumerator(name: "osPriorityAboveNormal4", value: 36)
!146 = !DIEnumerator(name: "osPriorityAboveNormal5", value: 37)
!147 = !DIEnumerator(name: "osPriorityAboveNormal6", value: 38)
!148 = !DIEnumerator(name: "osPriorityAboveNormal7", value: 39)
!149 = !DIEnumerator(name: "osPriorityHigh", value: 40)
!150 = !DIEnumerator(name: "osPriorityHigh1", value: 41)
!151 = !DIEnumerator(name: "osPriorityHigh2", value: 42)
!152 = !DIEnumerator(name: "osPriorityHigh3", value: 43)
!153 = !DIEnumerator(name: "osPriorityHigh4", value: 44)
!154 = !DIEnumerator(name: "osPriorityHigh5", value: 45)
!155 = !DIEnumerator(name: "osPriorityHigh6", value: 46)
!156 = !DIEnumerator(name: "osPriorityHigh7", value: 47)
!157 = !DIEnumerator(name: "osPriorityRealtime", value: 48)
!158 = !DIEnumerator(name: "osPriorityRealtime1", value: 49)
!159 = !DIEnumerator(name: "osPriorityRealtime2", value: 50)
!160 = !DIEnumerator(name: "osPriorityRealtime3", value: 51)
!161 = !DIEnumerator(name: "osPriorityRealtime4", value: 52)
!162 = !DIEnumerator(name: "osPriorityRealtime5", value: 53)
!163 = !DIEnumerator(name: "osPriorityRealtime6", value: 54)
!164 = !DIEnumerator(name: "osPriorityRealtime7", value: 55)
!165 = !DIEnumerator(name: "osPriorityISR", value: 56)
!166 = !DIEnumerator(name: "osPriorityError", value: -1)
!167 = !DIEnumerator(name: "osPriorityReserved", value: 2147483647)
!168 = !{!169, !171, !32, !172, !173}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !170)
!170 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !44)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !174)
!174 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!175 = !{!25, !176, !183, !203}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !178, line: 66, type: !179, isLocal: false, isDefinition: true)
!178 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 192, elements: !181)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreId_t", file: !31, line: 220, baseType: !171)
!181 = !{!182}
!182 = !DISubrange(count: 6)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "thread_attr", scope: !27, file: !178, line: 72, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 1728, elements: !181)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadAttr_t", file: !31, line: 247, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 237, size: 288, elements: !188)
!188 = !{!189, !193, !194, !195, !196, !197, !198, !200, !202}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !31, line: 238, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !187, file: !31, line: 239, baseType: !172, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !187, file: !31, line: 240, baseType: !171, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !187, file: !31, line: 241, baseType: !172, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !187, file: !31, line: 242, baseType: !171, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !187, file: !31, line: 243, baseType: !172, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !187, file: !31, line: 244, baseType: !199, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "osPriority_t", file: !31, line: 155, baseType: !113)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tz_module", scope: !187, file: !31, line: 245, baseType: !201, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "TZ_ModuleId_t", file: !31, line: 232, baseType: !172)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !187, file: !31, line: 246, baseType: !172, size: 32, offset: 256)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !178, line: 71, type: !205, isLocal: true, isDefinition: true, align: 512)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 101376, elements: !210)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !207, line: 47, size: 8, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !207, line: 48, baseType: !192, size: 8)
!210 = !{!182, !211}
!211 = !DISubrange(count: 2112)
!212 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 768, elements: !181)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreAttr_t", file: !31, line: 279, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 274, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !31, line: 275, baseType: !190, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !215, file: !31, line: 276, baseType: !172, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !215, file: !31, line: 277, baseType: !171, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !215, file: !31, line: 278, baseType: !172, size: 32, offset: 96)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "_char_out", scope: !223, file: !228, line: 54, type: !229, isLocal: false, isDefinition: true)
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !226, globals: !227, splitDebugInlining: false, nameTableKind: None)
!224 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!225 = !{!42}
!226 = !{!171, !32}
!227 = !{!221}
!228 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DISubroutineType(types: !231)
!231 = !{!32, !32}
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !234, file: !299, line: 235, type: !300, isLocal: true, isDefinition: true, align: 32)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !236, globals: !298, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!236 = !{!171, !32, !237, !248}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !239, line: 46, baseType: !240)
!239 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 41, size: 128, elements: !241)
!241 = !{!242, !244, !245, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !240, file: !239, line: 42, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !172)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !240, file: !239, line: 43, baseType: !243, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !240, file: !239, line: 44, baseType: !246, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !240, file: !239, line: 45, baseType: !246, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !250, line: 75, baseType: !251)
!250 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !250, line: 41, size: 2176, elements: !252)
!252 = !{!253, !254, !255, !256, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !276, !280, !281, !282, !283, !284, !285, !286, !287, !291, !292, !293, !294, !295, !296, !297}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !251, file: !250, line: 42, baseType: !243, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !251, file: !250, line: 43, baseType: !243, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !251, file: !250, line: 44, baseType: !246, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !251, file: !250, line: 45, baseType: !257, size: 32, offset: 96)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 32, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 1)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !251, file: !250, line: 46, baseType: !243, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !251, file: !250, line: 47, baseType: !243, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !251, file: !250, line: 48, baseType: !246, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !251, file: !250, line: 49, baseType: !243, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !251, file: !250, line: 50, baseType: !243, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !251, file: !250, line: 51, baseType: !246, size: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !251, file: !250, line: 52, baseType: !243, size: 32, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !251, file: !250, line: 53, baseType: !257, size: 32, offset: 352)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !251, file: !250, line: 54, baseType: !243, size: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !251, file: !250, line: 55, baseType: !257, size: 32, offset: 416)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !251, file: !250, line: 56, baseType: !243, size: 32, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !251, file: !250, line: 57, baseType: !257, size: 32, offset: 480)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !251, file: !250, line: 58, baseType: !273, size: 96, offset: 512)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 96, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 3)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !251, file: !250, line: 59, baseType: !277, size: 160, offset: 608)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 160, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 5)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !251, file: !250, line: 60, baseType: !243, size: 32, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !251, file: !250, line: 61, baseType: !243, size: 32, offset: 800)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !251, file: !250, line: 62, baseType: !246, size: 32, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !251, file: !250, line: 63, baseType: !246, size: 32, offset: 864)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !251, file: !250, line: 64, baseType: !243, size: 32, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !251, file: !250, line: 65, baseType: !243, size: 32, offset: 928)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !251, file: !250, line: 66, baseType: !243, size: 32, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !251, file: !250, line: 67, baseType: !288, size: 832, offset: 992)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 832, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 26)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !251, file: !250, line: 68, baseType: !243, size: 32, offset: 1824)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !251, file: !250, line: 69, baseType: !246, size: 32, offset: 1856)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !251, file: !250, line: 70, baseType: !277, size: 160, offset: 1888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !251, file: !250, line: 71, baseType: !243, size: 32, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !251, file: !250, line: 72, baseType: !243, size: 32, offset: 2080)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !251, file: !250, line: 73, baseType: !246, size: 32, offset: 2112)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !251, file: !250, line: 74, baseType: !243, size: 32, offset: 2144)
!298 = !{!232}
!299 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !302, line: 51, size: 64, elements: !303)
!302 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!303 = !{!304, !332}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !301, file: !302, line: 60, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DISubroutineType(types: !307)
!307 = !{!32, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !311, line: 378, size: 192, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !314, !315, !316, !325, !326}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !311, line: 380, baseType: !190, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !310, file: !311, line: 382, baseType: !13, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !310, file: !311, line: 384, baseType: !13, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !310, file: !311, line: 386, baseType: !317, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !311, line: 351, size: 16, elements: !319)
!319 = !{!320, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !318, file: !311, line: 359, baseType: !321, size: 8)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !322)
!322 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !318, file: !311, line: 364, baseType: !324, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!324 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !311, line: 388, baseType: !171, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !310, file: !311, line: 396, baseType: !327, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !311, line: 43, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !331)
!331 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !301, file: !302, line: 65, baseType: !308, size: 32, offset: 32)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "static_regions", scope: !335, file: !344, line: 62, type: !506, isLocal: true, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !337, globals: !340, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!337 = !{!338, !32, !172, !171}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !339, line: 214, baseType: !44)
!339 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!340 = !{!341, !333}
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !343, file: !344, line: 198, type: !494, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !344, file: !344, line: 175, type: !345, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !489)
!344 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !349, line: 245, size: 1472, elements: !350)
!349 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!350 = !{!351, !420, !433, !434, !435, !440, !452, !453, !457, !458, !464, !484}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !348, file: !349, line: 247, baseType: !352, size: 384)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !349, line: 57, size: 384, elements: !353)
!353 = !{!354, !382, !390, !391, !392, !405, !406, !407}
!354 = !DIDerivedType(tag: DW_TAG_member, scope: !352, file: !349, line: 60, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !349, line: 60, size: 64, elements: !356)
!356 = !{!357, !373}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !355, file: !349, line: 61, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !359, line: 49, baseType: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !359, line: 37, size: 64, elements: !361)
!361 = !{!362, !368}
!362 = !DIDerivedType(tag: DW_TAG_member, scope: !360, file: !359, line: 38, baseType: !363, size: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !360, file: !359, line: 38, size: 32, elements: !364)
!364 = !{!365, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !363, file: !359, line: 39, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !363, file: !359, line: 40, baseType: !366, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, scope: !360, file: !359, line: 42, baseType: !369, size: 32, offset: 32)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !360, file: !359, line: 42, size: 32, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !369, file: !359, line: 43, baseType: !366, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !369, file: !359, line: 44, baseType: !366, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !355, file: !349, line: 62, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !375, line: 49, size: 64, elements: !376)
!375 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !374, file: !375, line: 50, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 64, elements: !380)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!380 = !{!381}
!381 = !DISubrange(count: 2)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !352, file: !349, line: 68, baseType: !383, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !385, line: 233, baseType: !386)
!385 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 231, size: 64, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !386, file: !385, line: 232, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !359, line: 48, baseType: !360)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !352, file: !349, line: 71, baseType: !321, size: 8, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !352, file: !349, line: 74, baseType: !321, size: 8, offset: 104)
!392 = !DIDerivedType(tag: DW_TAG_member, scope: !352, file: !349, line: 90, baseType: !393, size: 16, offset: 112)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !349, line: 90, size: 16, elements: !394)
!394 = !{!395, !402}
!395 = !DIDerivedType(tag: DW_TAG_member, scope: !393, file: !349, line: 91, baseType: !396, size: 16)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !349, line: 91, size: 16, elements: !397)
!397 = !{!398, !401}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !396, file: !349, line: 96, baseType: !399, size: 8)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !400)
!400 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !396, file: !349, line: 97, baseType: !321, size: 8, offset: 8)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !393, file: !349, line: 100, baseType: !403, size: 16)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !404)
!404 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !352, file: !349, line: 107, baseType: !172, size: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !352, file: !349, line: 127, baseType: !171, size: 32, offset: 160)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !352, file: !349, line: 131, baseType: !408, size: 192, offset: 192)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !385, line: 244, size: 192, elements: !409)
!409 = !{!410, !411, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !408, file: !385, line: 245, baseType: !358, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !408, file: !385, line: 246, baseType: !412, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !385, line: 242, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !408, file: !385, line: 249, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !419)
!419 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !348, file: !349, line: 250, baseType: !421, size: 288, offset: 384)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !422, line: 25, size: 288, elements: !423)
!422 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !421, file: !422, line: 26, baseType: !172, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !421, file: !422, line: 27, baseType: !172, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !421, file: !422, line: 28, baseType: !172, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !421, file: !422, line: 29, baseType: !172, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !421, file: !422, line: 30, baseType: !172, size: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !421, file: !422, line: 31, baseType: !172, size: 32, offset: 160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !421, file: !422, line: 32, baseType: !172, size: 32, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !421, file: !422, line: 33, baseType: !172, size: 32, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !421, file: !422, line: 34, baseType: !172, size: 32, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !348, file: !349, line: 253, baseType: !171, size: 32, offset: 672)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !348, file: !349, line: 256, baseType: !384, size: 64, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !348, file: !349, line: 259, baseType: !436, size: 16, offset: 768)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !349, line: 236, size: 16, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !436, file: !349, line: 237, baseType: !324, size: 8)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !436, file: !349, line: 238, baseType: !321, size: 8, offset: 8)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !348, file: !349, line: 271, baseType: !441, size: 128, offset: 800)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !349, line: 34, size: 128, elements: !442)
!442 = !{!443, !449, !450, !451}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !441, file: !349, line: 35, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !445, line: 46, baseType: !446)
!445 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !171, !171, !171}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !441, file: !349, line: 36, baseType: !171, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !441, file: !349, line: 37, baseType: !171, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !441, file: !349, line: 38, baseType: !171, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !348, file: !349, line: 274, baseType: !347, size: 32, offset: 928)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !348, file: !349, line: 279, baseType: !454, size: 256, offset: 960)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 256, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !348, file: !349, line: 294, baseType: !32, size: 32, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !348, file: !349, line: 300, baseType: !459, size: 96, offset: 1248)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !349, line: 149, size: 96, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !459, file: !349, line: 153, baseType: !22, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !459, file: !349, line: 162, baseType: !338, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !459, file: !349, line: 168, baseType: !338, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !348, file: !349, line: 325, baseType: !465, size: 32, offset: 1344)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !467, line: 5073, size: 192, elements: !468)
!467 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = !{!469, !478, !479}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !466, file: !467, line: 5074, baseType: !470, size: 96)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !471, line: 56, size: 96, elements: !472)
!471 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!472 = !{!473, !476, !477}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !470, file: !471, line: 57, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !471, line: 57, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !470, file: !471, line: 58, baseType: !171, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !470, file: !471, line: 59, baseType: !338, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !466, file: !467, line: 5075, baseType: !384, size: 64, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !466, file: !467, line: 5076, baseType: !480, size: 32, offset: 160)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !481, line: 43, size: 32, elements: !482)
!481 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !480, file: !481, line: 52, baseType: !22, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !348, file: !349, line: 343, baseType: !485, size: 64, offset: 1376)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !422, line: 60, size: 64, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !485, file: !422, line: 63, baseType: !172, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !485, file: !422, line: 66, baseType: !172, size: 32, offset: 32)
!489 = !{!490, !491, !492, !493}
!490 = !DILocalVariable(name: "thread", arg: 1, scope: !343, file: !344, line: 175, type: !347)
!491 = !DILocalVariable(name: "region_num", scope: !343, file: !344, line: 200, type: !321)
!492 = !DILocalVariable(name: "guard_start", scope: !343, file: !344, line: 265, type: !22)
!493 = !DILocalVariable(name: "guard_size", scope: !343, file: !344, line: 266, type: !338)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 96, elements: !258)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !496, line: 52, size: 96, elements: !497)
!496 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !495, file: !496, line: 53, baseType: !22, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !495, file: !496, line: 54, baseType: !338, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !495, file: !496, line: 55, baseType: !501, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !502, line: 151, baseType: !503)
!502 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !502, line: 149, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !503, file: !502, line: 150, baseType: !172, size: 32)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 96, elements: !258)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !510, file: !542, line: 39, type: !321, isLocal: true, isDefinition: true)
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !512, globals: !541, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!512 = !{!513, !171, !32, !529, !321}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !515, line: 1168, baseType: !516)
!515 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !515, line: 1155, size: 352, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !516, file: !515, line: 1157, baseType: !246, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !516, file: !515, line: 1158, baseType: !243, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !516, file: !515, line: 1159, baseType: !243, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !516, file: !515, line: 1160, baseType: !243, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !516, file: !515, line: 1161, baseType: !243, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !516, file: !515, line: 1162, baseType: !243, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !516, file: !515, line: 1163, baseType: !243, size: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !516, file: !515, line: 1164, baseType: !243, size: 32, offset: 224)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !516, file: !515, line: 1165, baseType: !243, size: 32, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !516, file: !515, line: 1166, baseType: !243, size: 32, offset: 288)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !516, file: !515, line: 1167, baseType: !243, size: 32, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !532, line: 27, size: 96, elements: !533)
!532 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!533 = !{!534, !535, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !531, file: !532, line: 29, baseType: !172, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !532, line: 31, baseType: !190, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !531, file: !532, line: 37, baseType: !537, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !502, line: 146, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !502, line: 141, size: 32, elements: !539)
!539 = !{!540}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !538, file: !502, line: 143, baseType: !172, size: 32)
!541 = !{!508}
!542 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !545, file: !552, line: 21, type: !229, isLocal: true, isDefinition: true)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !547, globals: !551, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!547 = !{!548, !32, !171}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !550, line: 22, baseType: !32)
!550 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!551 = !{!543}
!552 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !555, file: !560, line: 13, type: !577, isLocal: true, isDefinition: true)
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !557, splitDebugInlining: false, nameTableKind: None)
!556 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!557 = !{!558, !553}
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "mpu_config", scope: !555, file: !560, line: 37, type: !561, isLocal: false, isDefinition: true)
!560 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !532, line: 41, size: 64, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !562, file: !532, line: 43, baseType: !172, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !562, file: !532, line: 45, baseType: !566, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !532, line: 27, size: 96, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !568, file: !532, line: 29, baseType: !172, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !568, file: !532, line: 31, baseType: !190, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !568, file: !532, line: 37, baseType: !573, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !502, line: 146, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !502, line: 141, size: 32, elements: !575)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !574, file: !502, line: 143, baseType: !172, size: 32)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 192, elements: !380)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "thread_list", scope: !580, file: !820, line: 27, type: !647, isLocal: true, isDefinition: true)
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !582, retainedTypes: !605, globals: !816, splitDebugInlining: false, nameTableKind: None)
!581 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/thread.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!582 = !{!113, !583, !592, !30, !596, !42}
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_poll_types_bits", file: !467, line: 5298, baseType: !44, size: 32, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591}
!585 = !DIEnumerator(name: "_POLL_TYPE_IGNORE", value: 0)
!586 = !DIEnumerator(name: "_POLL_TYPE_SIGNAL", value: 1)
!587 = !DIEnumerator(name: "_POLL_TYPE_SEM_AVAILABLE", value: 2)
!588 = !DIEnumerator(name: "_POLL_TYPE_DATA_AVAILABLE", value: 3)
!589 = !DIEnumerator(name: "_POLL_TYPE_MSGQ_DATA_AVAILABLE", value: 4)
!590 = !DIEnumerator(name: "_POLL_TYPE_PIPE_DATA_AVAILABLE", value: 5)
!591 = !DIEnumerator(name: "_POLL_NUM_TYPES", value: 6)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_poll_modes", file: !467, line: 5379, baseType: !44, size: 32, elements: !593)
!593 = !{!594, !595}
!594 = !DIEnumerator(name: "K_POLL_MODE_NOTIFY_ONLY", value: 0)
!595 = !DIEnumerator(name: "K_POLL_NUM_MODES", value: 1)
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 90, baseType: !32, size: 32, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604}
!598 = !DIEnumerator(name: "osThreadInactive", value: 0)
!599 = !DIEnumerator(name: "osThreadReady", value: 1)
!600 = !DIEnumerator(name: "osThreadRunning", value: 2)
!601 = !DIEnumerator(name: "osThreadBlocked", value: 3)
!602 = !DIEnumerator(name: "osThreadTerminated", value: 4)
!603 = !DIEnumerator(name: "osThreadError", value: -1)
!604 = !DIEnumerator(name: "osThreadReserved", value: 2147483647)
!605 = !{!171, !606, !793, !808, !809, !444, !812, !172, !813, !32, !815}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_thread", file: !608, line: 16, size: 2240, elements: !609)
!608 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/wrapper.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!609 = !{!610, !625, !728, !734, !800, !801, !805, !806, !807}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !607, file: !608, line: 17, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !359, line: 49, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !359, line: 37, size: 64, elements: !613)
!613 = !{!614, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, scope: !612, file: !359, line: 38, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !359, line: 38, size: 32, elements: !616)
!616 = !{!617, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !615, file: !359, line: 39, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !615, file: !359, line: 40, baseType: !618, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, scope: !612, file: !359, line: 42, baseType: !621, size: 32, offset: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !359, line: 42, size: 32, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !621, file: !359, line: 43, baseType: !618, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !621, file: !359, line: 44, baseType: !618, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "z_thread", scope: !607, file: !608, line: 18, baseType: !626, size: 1472, offset: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !349, line: 245, size: 1472, elements: !627)
!627 = !{!628, !672, !684, !685, !686, !691, !698, !700, !701, !702, !708, !723}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !626, file: !349, line: 247, baseType: !629, size: 384)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !349, line: 57, size: 384, elements: !630)
!630 = !{!631, !641, !648, !649, !650, !659, !660, !661}
!631 = !DIDerivedType(tag: DW_TAG_member, scope: !629, file: !349, line: 60, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !629, file: !349, line: 60, size: 64, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !632, file: !349, line: 61, baseType: !611, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !632, file: !349, line: 62, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !375, line: 49, size: 64, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !636, file: !375, line: 50, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 64, elements: !380)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !629, file: !349, line: 68, baseType: !642, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !385, line: 233, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 231, size: 64, elements: !645)
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !644, file: !385, line: 232, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !359, line: 48, baseType: !612)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !629, file: !349, line: 71, baseType: !321, size: 8, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !629, file: !349, line: 74, baseType: !321, size: 8, offset: 104)
!650 = !DIDerivedType(tag: DW_TAG_member, scope: !629, file: !349, line: 90, baseType: !651, size: 16, offset: 112)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !629, file: !349, line: 90, size: 16, elements: !652)
!652 = !{!653, !658}
!653 = !DIDerivedType(tag: DW_TAG_member, scope: !651, file: !349, line: 91, baseType: !654, size: 16)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !651, file: !349, line: 91, size: 16, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !654, file: !349, line: 96, baseType: !399, size: 8)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !654, file: !349, line: 97, baseType: !321, size: 8, offset: 8)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !651, file: !349, line: 100, baseType: !403, size: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !629, file: !349, line: 107, baseType: !172, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !629, file: !349, line: 127, baseType: !171, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !629, file: !349, line: 131, baseType: !662, size: 192, offset: 192)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !385, line: 244, size: 192, elements: !663)
!663 = !{!664, !665, !671}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !662, file: !385, line: 245, baseType: !611, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !662, file: !385, line: 246, baseType: !666, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !385, line: 242, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !662, file: !385, line: 249, baseType: !418, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !626, file: !349, line: 250, baseType: !673, size: 288, offset: 384)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !422, line: 25, size: 288, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !673, file: !422, line: 26, baseType: !172, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !673, file: !422, line: 27, baseType: !172, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !673, file: !422, line: 28, baseType: !172, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !673, file: !422, line: 29, baseType: !172, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !673, file: !422, line: 30, baseType: !172, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !673, file: !422, line: 31, baseType: !172, size: 32, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !673, file: !422, line: 32, baseType: !172, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !673, file: !422, line: 33, baseType: !172, size: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !673, file: !422, line: 34, baseType: !172, size: 32, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !626, file: !349, line: 253, baseType: !171, size: 32, offset: 672)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !626, file: !349, line: 256, baseType: !643, size: 64, offset: 704)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !626, file: !349, line: 259, baseType: !687, size: 16, offset: 768)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !349, line: 236, size: 16, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !687, file: !349, line: 237, baseType: !324, size: 8)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !687, file: !349, line: 238, baseType: !321, size: 8, offset: 8)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !626, file: !349, line: 271, baseType: !692, size: 128, offset: 800)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !349, line: 34, size: 128, elements: !693)
!693 = !{!694, !695, !696, !697}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !692, file: !349, line: 35, baseType: !444, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !692, file: !349, line: 36, baseType: !171, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !692, file: !349, line: 37, baseType: !171, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !692, file: !349, line: 38, baseType: !171, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !626, file: !349, line: 274, baseType: !699, size: 32, offset: 928)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !626, file: !349, line: 279, baseType: !454, size: 256, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !626, file: !349, line: 294, baseType: !32, size: 32, offset: 1216)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !626, file: !349, line: 300, baseType: !703, size: 96, offset: 1248)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !349, line: 149, size: 96, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !703, file: !349, line: 153, baseType: !22, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !703, file: !349, line: 162, baseType: !338, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !703, file: !349, line: 168, baseType: !338, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !626, file: !349, line: 325, baseType: !709, size: 32, offset: 1344)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !467, line: 5073, size: 192, elements: !711)
!711 = !{!712, !718, !719}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !710, file: !467, line: 5074, baseType: !713, size: 96)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !471, line: 56, size: 96, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !713, file: !471, line: 57, baseType: !474, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !713, file: !471, line: 58, baseType: !171, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !713, file: !471, line: 59, baseType: !338, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !710, file: !467, line: 5075, baseType: !643, size: 64, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !710, file: !467, line: 5076, baseType: !720, size: 32, offset: 160)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !481, line: 43, size: 32, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !720, file: !481, line: 52, baseType: !22, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !626, file: !349, line: 343, baseType: !724, size: 64, offset: 1376)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !422, line: 60, size: 64, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !724, file: !422, line: 63, baseType: !172, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !724, file: !422, line: 66, baseType: !172, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "poll_signal", scope: !607, file: !608, line: 19, baseType: !729, size: 128, offset: 1536)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !467, line: 5397, size: 128, elements: !730)
!730 = !{!731, !732, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !729, file: !467, line: 5399, baseType: !647, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !729, file: !467, line: 5405, baseType: !44, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !729, file: !467, line: 5408, baseType: !32, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !607, file: !608, line: 20, baseType: !735, size: 160, offset: 1664)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_event", file: !467, line: 5421, size: 160, elements: !736)
!736 = !{!737, !738, !740, !741, !742, !743, !744, !745}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !735, file: !467, line: 5423, baseType: !611, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !735, file: !467, line: 5426, baseType: !739, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !735, file: !467, line: 5429, baseType: !172, size: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !735, file: !467, line: 5432, baseType: !172, size: 6, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !735, file: !467, line: 5435, baseType: !172, size: 7, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !735, file: !467, line: 5438, baseType: !172, size: 1, offset: 117, flags: DIFlagBitField, extraData: i64 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !735, file: !467, line: 5441, baseType: !172, size: 10, offset: 118, flags: DIFlagBitField, extraData: i64 96)
!745 = !DIDerivedType(tag: DW_TAG_member, scope: !735, file: !467, line: 5444, baseType: !746, size: 32, offset: 128)
!746 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !735, file: !467, line: 5444, size: 32, elements: !747)
!747 = !{!748, !749, !751, !759, !782, !784}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !746, file: !467, line: 5445, baseType: !171, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !746, file: !467, line: 5446, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !746, file: !467, line: 5447, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !467, line: 2909, size: 192, elements: !754)
!754 = !{!755, !756, !757, !758}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !753, file: !467, line: 2910, baseType: !643, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !753, file: !467, line: 2911, baseType: !44, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !753, file: !467, line: 2912, baseType: !44, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !753, file: !467, line: 2914, baseType: !647, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !746, file: !467, line: 5448, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !467, line: 2208, size: 224, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !761, file: !467, line: 2209, baseType: !764, size: 224)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !467, line: 1709, size: 224, elements: !765)
!765 = !{!766, !779, !780, !781}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !764, file: !467, line: 1710, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !768, line: 46, baseType: !769)
!768 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !768, line: 41, size: 64, elements: !770)
!770 = !{!771, !778}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !769, file: !768, line: 42, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !768, line: 39, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !768, line: 35, size: 32, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !774, file: !768, line: 36, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !768, line: 32, baseType: !172)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !769, file: !768, line: 43, baseType: !772, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !764, file: !467, line: 1711, baseType: !720, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !764, file: !467, line: 1712, baseType: !643, size: 64, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !764, file: !467, line: 1714, baseType: !647, size: 64, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !746, file: !467, line: 5449, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !746, file: !467, line: 5450, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !467, line: 4204, size: 416, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !794, !795, !796, !797, !798, !799}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !786, file: !467, line: 4206, baseType: !643, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !786, file: !467, line: 4208, baseType: !720, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !786, file: !467, line: 4210, baseType: !338, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !786, file: !467, line: 4212, baseType: !172, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !786, file: !467, line: 4214, baseType: !793, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !786, file: !467, line: 4216, baseType: !793, size: 32, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !786, file: !467, line: 4218, baseType: !793, size: 32, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !786, file: !467, line: 4220, baseType: !793, size: 32, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !786, file: !467, line: 4222, baseType: !172, size: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !786, file: !467, line: 4224, baseType: !647, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !786, file: !467, line: 4227, baseType: !321, size: 8, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "signal_results", scope: !607, file: !608, line: 21, baseType: !172, size: 32, offset: 1824)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !607, file: !608, line: 22, baseType: !802, size: 128, offset: 1856)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 16)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !607, file: !608, line: 23, baseType: !172, size: 32, offset: 1984)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "join_guard", scope: !607, file: !608, line: 24, baseType: !753, size: 192, offset: 2016)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "has_joined", scope: !607, file: !608, line: 25, baseType: !192, size: 8, offset: 2208)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadId_t", file: !31, line: 208, baseType: !171)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !811, line: 22, baseType: !170)
!811 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !349, line: 347, baseType: !699)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !814, line: 46, baseType: !418)
!814 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!816 = !{!817, !578, !852, !857, !859, !861}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "one_time", scope: !819, file: !820, line: 109, type: !172, isLocal: true, isDefinition: true)
!819 = distinct !DISubprogram(name: "osThreadNew", scope: !820, file: !820, line: 103, type: !821, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !580, retainedNodes: !841)
!820 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/thread.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!821 = !DISubroutineType(types: !822)
!822 = !{!808, !823, !171, !827}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadFunc_t", file: !31, line: 158, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !171}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadAttr_t", file: !31, line: 247, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 237, size: 288, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !31, line: 238, baseType: !190, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !830, file: !31, line: 239, baseType: !172, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !830, file: !31, line: 240, baseType: !171, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !830, file: !31, line: 241, baseType: !172, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !830, file: !31, line: 242, baseType: !171, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !830, file: !31, line: 243, baseType: !172, size: 32, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !830, file: !31, line: 244, baseType: !199, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tz_module", scope: !830, file: !31, line: 245, baseType: !201, size: 32, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !830, file: !31, line: 246, baseType: !172, size: 32, offset: 256)
!841 = !{!842, !843, !844, !845, !847, !848, !849, !850, !851}
!842 = !DILocalVariable(name: "threadfunc", arg: 1, scope: !819, file: !820, line: 103, type: !823)
!843 = !DILocalVariable(name: "arg", arg: 2, scope: !819, file: !820, line: 103, type: !171)
!844 = !DILocalVariable(name: "attr", arg: 3, scope: !819, file: !820, line: 104, type: !827)
!845 = !DILocalVariable(name: "prio", scope: !819, file: !820, line: 106, type: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !32)
!847 = !DILocalVariable(name: "cv2_prio", scope: !819, file: !820, line: 107, type: !199)
!848 = !DILocalVariable(name: "tid", scope: !819, file: !820, line: 108, type: !606)
!849 = !DILocalVariable(name: "stack", scope: !819, file: !820, line: 110, type: !171)
!850 = !DILocalVariable(name: "stack_size", scope: !819, file: !820, line: 111, type: !338)
!851 = !DILocalVariable(name: "this_thread_num", scope: !819, file: !820, line: 112, type: !172)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "cv2_thread_pool", scope: !580, file: !820, line: 28, type: !854, isLocal: true, isDefinition: true)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 33600, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 15)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "thread_num", scope: !580, file: !820, line: 29, type: !810, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "thread_num_dynamic", scope: !580, file: !820, line: 30, type: !810, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "init_thread_attrs", scope: !580, file: !820, line: 15, type: !828, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "cv2_semaphore_slab", scope: !866, file: !903, line: 11, type: !917, isLocal: false, isDefinition: true, align: 32)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !868, retainedTypes: !869, globals: !900, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/semaphore.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!868 = !{!30, !42}
!869 = !{!171, !870, !813, !180, !871, !32, !172, !173}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_sem", file: !608, line: 43, size: 320, elements: !873)
!873 = !{!874, !899}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "z_semaphore", scope: !872, file: !608, line: 44, baseType: !875, size: 192)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !467, line: 2909, size: 192, elements: !876)
!876 = !{!877, !896, !897, !898}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !875, file: !467, line: 2910, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !385, line: 233, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 231, size: 64, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !879, file: !385, line: 232, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !359, line: 48, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !359, line: 37, size: 64, elements: !884)
!884 = !{!885, !891}
!885 = !DIDerivedType(tag: DW_TAG_member, scope: !883, file: !359, line: 38, baseType: !886, size: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !883, file: !359, line: 38, size: 32, elements: !887)
!887 = !{!888, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !886, file: !359, line: 39, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !886, file: !359, line: 40, baseType: !889, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, scope: !883, file: !359, line: 42, baseType: !892, size: 32, offset: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !883, file: !359, line: 42, size: 32, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !892, file: !359, line: 43, baseType: !889, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !892, file: !359, line: 44, baseType: !889, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !875, file: !467, line: 2911, baseType: !44, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !875, file: !467, line: 2912, baseType: !44, size: 32, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !875, file: !467, line: 2914, baseType: !882, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !872, file: !608, line: 45, baseType: !802, size: 128, offset: 192)
!900 = !{!864, !901, !907}
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_semaphore_slab", scope: !866, file: !903, line: 11, type: !904, isLocal: false, isDefinition: true, align: 32)
!903 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/semaphore.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 1600, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 200)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "init_sema_attrs", scope: !866, file: !903, line: 14, type: !909, isLocal: true, isDefinition: true)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreAttr_t", file: !31, line: 279, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 274, size: 128, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !911, file: !31, line: 275, baseType: !190, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !911, file: !31, line: 276, baseType: !172, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !911, file: !31, line: 277, baseType: !171, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !911, file: !31, line: 278, baseType: !172, size: 32, offset: 96)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !467, line: 4836, size: 256, elements: !918)
!918 = !{!919, !920, !924, !925, !926, !927, !928}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !917, file: !467, line: 4837, baseType: !878, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !917, file: !467, line: 4838, baseType: !921, size: 32, offset: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !481, line: 43, size: 32, elements: !922)
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !921, file: !481, line: 52, baseType: !22, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !917, file: !467, line: 4839, baseType: !172, size: 32, offset: 96)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !917, file: !467, line: 4840, baseType: !338, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !917, file: !467, line: 4841, baseType: !793, size: 32, offset: 160)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !917, file: !467, line: 4842, baseType: !793, size: 32, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !917, file: !467, line: 4843, baseType: !172, size: 32, offset: 224)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !931, file: !988, line: 603, type: !990, isLocal: true, isDefinition: true, align: 32)
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !933, globals: !985, splitDebugInlining: false, nameTableKind: None)
!932 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!933 = !{!171, !32, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !937, line: 336, size: 160, elements: !938)
!937 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!938 = !{!939, !959, !963, !967, !980}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !936, file: !937, line: 365, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{!32, !943, !958}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !311, line: 378, size: 192, elements: !946)
!946 = !{!947, !948, !949, !950, !956, !957}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !311, line: 380, baseType: !190, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !945, file: !311, line: 382, baseType: !13, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !945, file: !311, line: 384, baseType: !13, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !945, file: !311, line: 386, baseType: !951, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !311, line: 351, size: 16, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !952, file: !311, line: 359, baseType: !321, size: 8)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !952, file: !311, line: 364, baseType: !324, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !945, file: !311, line: 388, baseType: !171, size: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !945, file: !311, line: 396, baseType: !327, size: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !936, file: !937, line: 366, baseType: !960, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !943, !322}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !936, file: !937, line: 374, baseType: !964, size: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{!32, !943}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !936, file: !937, line: 377, baseType: !968, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DISubroutineType(types: !970)
!970 = !{!32, !943, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !937, line: 122, size: 64, elements: !974)
!974 = !{!975, !976, !977, !978, !979}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !973, file: !937, line: 123, baseType: !172, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !973, file: !937, line: 124, baseType: !321, size: 8, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !973, file: !937, line: 125, baseType: !321, size: 8, offset: 40)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !973, file: !937, line: 126, baseType: !321, size: 8, offset: 48)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !973, file: !937, line: 127, baseType: !321, size: 8, offset: 56)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !936, file: !937, line: 379, baseType: !981, size: 32, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{!32, !943, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!985 = !{!929, !986}
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !931, file: !988, line: 38, type: !989, isLocal: true, isDefinition: true)
!988 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !302, line: 51, size: 64, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !991, file: !302, line: 60, baseType: !964, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !991, file: !302, line: 65, baseType: !943, size: 32, offset: 32)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !997, file: !1002, line: 7, type: !1003, isLocal: false, isDefinition: true, align: 16)
!997 = distinct !DICompileUnit(language: DW_LANG_C99, file: !998, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !999, splitDebugInlining: false, nameTableKind: None)
!998 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!999 = !{!995, !1000}
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !997, file: !1002, line: 12, type: !1003, isLocal: false, isDefinition: true, align: 16)
!1002 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/philosophers")
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 48, elements: !274)
