; ModuleID = 'build/adafruit_feather_nrf52840/basic/threads/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct._sfnode, %struct._wait_q_t }
%struct._sflist = type { %struct._sfnode*, %struct._sfnode* }
%struct._sfnode = type { i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.led = type { %struct.gpio_dt_spec, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct._sfnode }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "printk_fifo", scope: !27, file: !218, line: 37, type: !410, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !112, globals: !215, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/threads/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!29 = !{!30, !101, !107}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !102, line: 506, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!105 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!106 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !102, line: 512, baseType: !32, size: 32, elements: !108)
!108 = !{!109, !110, !111}
!109 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!110 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!111 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!112 = !{!113, !117, !118, !119, !202, !207, !167, !107, !101, !212, !156, !213}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !114, line: 46, baseType: !115)
!114 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !116)
!116 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !102, line: 523, size: 288, elements: !122)
!122 = !{!123, !157, !163, !168, !172, !173, !174, !178, !198}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !121, file: !102, line: 524, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!118, !127, !154, !155}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !130, line: 378, size: 192, elements: !131)
!130 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!131 = !{!132, !136, !137, !138, !147, !148}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !130, line: 380, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !129, file: !130, line: 382, baseType: !13, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !129, file: !130, line: 384, baseType: !13, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !129, file: !130, line: 386, baseType: !139, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !130, line: 351, size: 16, elements: !141)
!141 = !{!142, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !140, file: !130, line: 359, baseType: !143, size: 8)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !140, file: !130, line: 364, baseType: !146, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!146 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !130, line: 388, baseType: !117, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !129, file: !130, line: 396, baseType: !149, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !130, line: 43, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !153)
!153 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !102, line: 237, baseType: !143)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !102, line: 257, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !121, file: !102, line: 530, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{!118, !127, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !102, line: 229, baseType: !156)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !121, file: !102, line: 532, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DISubroutineType(types: !166)
!166 = !{!118, !127, !167, !162}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !102, line: 216, baseType: !156)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !121, file: !102, line: 535, baseType: !169, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{!118, !127, !167}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !121, file: !102, line: 537, baseType: !169, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !121, file: !102, line: 539, baseType: !169, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !121, file: !102, line: 541, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DISubroutineType(types: !177)
!177 = !{!118, !127, !154, !101, !107}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !121, file: !102, line: 544, baseType: !179, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!118, !127, !182, !146}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !102, line: 478, size: 96, elements: !184)
!184 = !{!185, !192, !197}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !183, file: !102, line: 482, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 33, baseType: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 29, size: 32, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !187, line: 30, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !183, file: !102, line: 485, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !102, line: 464, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !127, !182, !167}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !183, file: !102, line: 493, baseType: !167, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !121, file: !102, line: 547, baseType: !199, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!156, !127}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !102, line: 428, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !204, file: !102, line: 434, baseType: !167, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !102, line: 441, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !209, file: !102, line: 447, baseType: !167, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !214)
!214 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!215 = !{!25, !216, !368, !372, !374, !376, !378, !380, !385, !387, !389, !391, !393, !395, !408}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "_k_thread_data_blink0_id", scope: !27, file: !218, line: 111, type: !219, isLocal: false, isDefinition: true, align: 32)
!218 = !DIFile(filename: "zephyr/samples/basic/threads/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !220, line: 620, size: 384, elements: !221)
!220 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !342, !350, !351, !356, !357, !358, !359, !360, !361, !363, !367}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !219, file: !220, line: 621, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !225, line: 245, size: 1024, elements: !226)
!225 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !{!227, !294, !307, !308, !309, !310, !318, !337}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !224, file: !225, line: 247, baseType: !228, size: 384)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !225, line: 57, size: 384, elements: !229)
!229 = !{!230, !258, !266, !267, !268, !281, !282, !283}
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !228, file: !225, line: 60, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !228, file: !225, line: 60, size: 64, elements: !232)
!232 = !{!233, !249}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !231, file: !225, line: 61, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !235, line: 49, baseType: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !235, line: 37, size: 64, elements: !237)
!237 = !{!238, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !235, line: 38, baseType: !239, size: 32)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !235, line: 38, size: 32, elements: !240)
!240 = !{!241, !243}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !239, file: !235, line: 39, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !235, line: 40, baseType: !242, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !235, line: 42, baseType: !245, size: 32, offset: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !235, line: 42, size: 32, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !245, file: !235, line: 43, baseType: !242, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !235, line: 44, baseType: !242, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !231, file: !225, line: 62, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !251, line: 49, size: 64, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !250, file: !251, line: 50, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, elements: !256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!256 = !{!257}
!257 = !DISubrange(count: 2)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !228, file: !225, line: 68, baseType: !259, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !261, line: 233, baseType: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 231, size: 64, elements: !263)
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !262, file: !261, line: 232, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !235, line: 48, baseType: !236)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !228, file: !225, line: 71, baseType: !143, size: 8, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !228, file: !225, line: 74, baseType: !143, size: 8, offset: 104)
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !228, file: !225, line: 90, baseType: !269, size: 16, offset: 112)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !228, file: !225, line: 90, size: 16, elements: !270)
!270 = !{!271, !278}
!271 = !DIDerivedType(tag: DW_TAG_member, scope: !269, file: !225, line: 91, baseType: !272, size: 16)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !225, line: 91, size: 16, elements: !273)
!273 = !{!274, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !272, file: !225, line: 96, baseType: !275, size: 8)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !276)
!276 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !272, file: !225, line: 97, baseType: !143, size: 8, offset: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !269, file: !225, line: 100, baseType: !279, size: 16)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !280)
!280 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !228, file: !225, line: 107, baseType: !156, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !228, file: !225, line: 127, baseType: !117, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !228, file: !225, line: 131, baseType: !284, size: 192, offset: 192)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !261, line: 244, size: 192, elements: !285)
!285 = !{!286, !287, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !284, file: !261, line: 245, baseType: !234, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !284, file: !261, line: 246, baseType: !288, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !261, line: 242, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !284, file: !261, line: 249, baseType: !115, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !224, file: !225, line: 250, baseType: !295, size: 288, offset: 384)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !296, line: 25, size: 288, elements: !297)
!296 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !295, file: !296, line: 26, baseType: !156, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !295, file: !296, line: 27, baseType: !156, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !295, file: !296, line: 28, baseType: !156, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !295, file: !296, line: 29, baseType: !156, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !295, file: !296, line: 30, baseType: !156, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !295, file: !296, line: 31, baseType: !156, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !295, file: !296, line: 32, baseType: !156, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !295, file: !296, line: 33, baseType: !156, size: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !295, file: !296, line: 34, baseType: !156, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !224, file: !225, line: 253, baseType: !117, size: 32, offset: 672)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !224, file: !225, line: 256, baseType: !260, size: 64, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !224, file: !225, line: 294, baseType: !118, size: 32, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !224, file: !225, line: 300, baseType: !311, size: 96, offset: 800)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !225, line: 149, size: 96, elements: !312)
!312 = !{!313, !314, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !311, file: !225, line: 153, baseType: !22, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !311, file: !225, line: 162, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !316, line: 214, baseType: !32)
!316 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !311, file: !225, line: 168, baseType: !315, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !224, file: !225, line: 325, baseType: !319, size: 32, offset: 896)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !220, line: 5073, size: 192, elements: !321)
!321 = !{!322, !331, !332}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !320, file: !220, line: 5074, baseType: !323, size: 96)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !324, line: 56, size: 96, elements: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !{!326, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !323, file: !324, line: 57, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !324, line: 57, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !323, file: !324, line: 58, baseType: !117, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !323, file: !324, line: 59, baseType: !315, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !320, file: !220, line: 5075, baseType: !260, size: 64, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !320, file: !220, line: 5076, baseType: !333, size: 32, offset: 160)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !333, file: !334, line: 52, baseType: !22, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !224, file: !225, line: 343, baseType: !338, size: 64, offset: 928)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !296, line: 60, size: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !338, file: !296, line: 63, baseType: !156, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !338, file: !296, line: 66, baseType: !156, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !219, file: !220, line: 622, baseType: !343, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !345, line: 44, baseType: !346)
!345 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !347, line: 47, size: 8, elements: !348)
!347 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !347, line: 48, baseType: !135, size: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !219, file: !220, line: 623, baseType: !32, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !219, file: !220, line: 624, baseType: !352, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !345, line: 46, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !117, !117, !117}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !219, file: !220, line: 625, baseType: !117, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !219, file: !220, line: 626, baseType: !117, size: 32, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !219, file: !220, line: 627, baseType: !117, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !219, file: !220, line: 628, baseType: !118, size: 32, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !219, file: !220, line: 629, baseType: !156, size: 32, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !219, file: !220, line: 630, baseType: !362, size: 32, offset: 288)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !118)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !219, file: !220, line: 631, baseType: !364, size: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DISubroutineType(types: !366)
!366 = !{null}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !219, file: !220, line: 632, baseType: !133, size: 32, offset: 352)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "blink0_id", scope: !27, file: !218, line: 111, type: !370, isLocal: false, isDefinition: true)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !225, line: 347, baseType: !223)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "_k_thread_data_blink1_id", scope: !27, file: !218, line: 113, type: !219, isLocal: false, isDefinition: true, align: 32)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "blink1_id", scope: !27, file: !218, line: 113, type: !370, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "_k_thread_data_uart_out_id", scope: !27, file: !218, line: 115, type: !219, isLocal: false, isDefinition: true, align: 32)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "uart_out_id", scope: !27, file: !218, line: 115, type: !370, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "_k_thread_stack_blink0_id", scope: !27, file: !218, line: 111, type: !382, isLocal: false, isDefinition: true, align: 64)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 8192, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 1024)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_k_thread_obj_blink0_id", scope: !27, file: !218, line: 111, type: !224, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "_k_thread_stack_blink1_id", scope: !27, file: !218, line: 113, type: !382, isLocal: false, isDefinition: true, align: 64)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "_k_thread_obj_blink1_id", scope: !27, file: !218, line: 113, type: !224, isLocal: false, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "_k_thread_stack_uart_out_id", scope: !27, file: !218, line: 115, type: !382, isLocal: false, isDefinition: true, align: 64)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "_k_thread_obj_uart_out_id", scope: !27, file: !218, line: 115, type: !224, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "led0", scope: !27, file: !218, line: 44, type: !397, isLocal: true, isDefinition: true)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led", file: !218, line: 39, size: 96, elements: !399)
!399 = !{!400, !407}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !398, file: !218, line: 40, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !102, line: 271, size: 64, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !401, file: !102, line: 273, baseType: !127, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !401, file: !102, line: 275, baseType: !154, size: 8, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !401, file: !102, line: 277, baseType: !406, size: 16, offset: 48)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !102, line: 249, baseType: !279)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !398, file: !218, line: 41, baseType: !143, size: 8, offset: 64)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "led1", scope: !27, file: !218, line: 49, type: !397, isLocal: true, isDefinition: true)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !220, line: 2208, size: 160, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !410, file: !220, line: 2209, baseType: !413, size: 160)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !220, line: 1709, size: 160, elements: !414)
!414 = !{!415, !428, !429}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !413, file: !220, line: 1710, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !417, line: 46, baseType: !418)
!417 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !417, line: 41, size: 64, elements: !419)
!419 = !{!420, !427}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !418, file: !417, line: 42, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !417, line: 39, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !417, line: 35, size: 32, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !423, file: !417, line: 36, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !417, line: 32, baseType: !156)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !418, file: !417, line: 43, baseType: !421, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !413, file: !220, line: 1711, baseType: !333, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !413, file: !220, line: 1712, baseType: !260, size: 64, offset: 96)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "_char_out", scope: !432, file: !437, line: 54, type: !438, isLocal: false, isDefinition: true)
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !435, globals: !436, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!434 = !{!30}
!435 = !{!117, !118}
!436 = !{!430}
!437 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DISubroutineType(types: !440)
!440 = !{!118, !118}
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !443, file: !477, line: 27, type: !504, isLocal: true, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !445, retainedTypes: !457, globals: !474, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!445 = !{!446, !30}
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !447, line: 27, baseType: !32, size: 32, elements: !448)
!447 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456}
!449 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!450 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!451 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!452 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!453 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!454 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!455 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!456 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!457 = !{!117, !113, !118, !24, !458, !473, !156, !213}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !460, line: 54, size: 96, elements: !461)
!460 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = !{!462, !468, !472}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !459, file: !460, line: 55, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 33, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 29, size: 32, elements: !465)
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !464, file: !187, line: 30, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !459, file: !460, line: 60, baseType: !469, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !446}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !459, file: !460, line: 65, baseType: !469, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!474 = !{!441, !475, !481, !483, !494, !496}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !443, file: !477, line: 44, type: !478, isLocal: true, isDefinition: true)
!477 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !478, file: !334, line: 52, baseType: !22, size: 32)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !443, file: !477, line: 49, type: !478, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !443, file: !477, line: 36, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 128, elements: !492)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !447, line: 114, size: 128, elements: !487)
!487 = !{!488, !489, !490, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !486, file: !447, line: 115, baseType: !446, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !486, file: !447, line: 141, baseType: !143, size: 8, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !486, file: !447, line: 149, baseType: !156, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !486, file: !447, line: 156, baseType: !156, size: 32, offset: 96)
!492 = !{!493}
!493 = !DISubrange(count: 1)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !443, file: !477, line: 40, type: !485, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !443, file: !477, line: 28, type: !498, isLocal: true, isDefinition: true)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !187, line: 40, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !187, line: 35, size: 64, elements: !500)
!500 = !{!501, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !499, file: !187, line: 36, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !499, file: !187, line: 37, baseType: !502, size: 32, offset: 32)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 32, elements: !492)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !506, line: 22, baseType: !507)
!506 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!508 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!509 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !512, file: !538, line: 50, type: !362, isLocal: true, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !445, retainedTypes: !514, globals: !535, splitDebugInlining: false, nameTableKind: None)
!513 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!514 = !{!152, !113, !315, !118, !117, !156, !213, !515, !473, !362, !526}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !517, line: 45, size: 64, elements: !518)
!517 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !{!519, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !516, file: !517, line: 46, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 33, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 29, size: 32, elements: !522)
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !521, file: !187, line: 30, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !516, file: !517, line: 48, baseType: !156, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !517, line: 38, size: 64, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !527, file: !517, line: 39, baseType: !520, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !527, file: !517, line: 41, baseType: !531, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !517, line: 35, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !362}
!535 = !{!536, !542, !550, !510, !552, !562}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "latency_lock", scope: !512, file: !538, line: 44, type: !539, isLocal: true, isDefinition: true)
!538 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !539, file: !334, line: 52, baseType: !22, size: 32)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !512, file: !538, line: 46, type: !544, isLocal: true, isDefinition: true)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !187, line: 40, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !187, line: 35, size: 64, elements: !546)
!546 = !{!547, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !545, file: !187, line: 36, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !545, file: !187, line: 37, baseType: !548, size: 32, offset: 32)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "latency_subs", scope: !512, file: !538, line: 52, type: !544, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !512, file: !538, line: 39, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, elements: !560)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 35, size: 96, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !555, file: !538, line: 36, baseType: !446, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !555, file: !538, line: 37, baseType: !143, size: 8, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !555, file: !538, line: 38, baseType: !505, size: 32, offset: 64)
!560 = !{!561}
!561 = !DISubrange(count: 0)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !512, file: !538, line: 48, type: !362, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !566, file: !573, line: 47, type: !587, isLocal: true, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !568, retainedTypes: !569, globals: !570, splitDebugInlining: false, nameTableKind: None)
!567 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!568 = !{!446}
!569 = !{!315, !118}
!570 = !{!571, !564, !583}
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "cpus_states", scope: !566, file: !573, line: 50, type: !574, isLocal: true, isDefinition: true)
!573 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 32, elements: !492)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !447, line: 114, size: 128, elements: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !577, file: !447, line: 115, baseType: !446, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !577, file: !447, line: 141, baseType: !143, size: 8, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !577, file: !447, line: 149, baseType: !156, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !577, file: !447, line: 156, baseType: !156, size: 32, offset: 96)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !566, file: !573, line: 55, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 8, elements: !492)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, elements: !560)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "static_regions", scope: !590, file: !597, line: 62, type: !717, isLocal: true, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !592, globals: !593, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!592 = !{!315, !118, !156, !117}
!593 = !{!594, !588}
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !596, file: !597, line: 198, type: !705, isLocal: true, isDefinition: true)
!596 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !597, file: !597, line: 175, type: !598, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !590, retainedNodes: !702)
!597 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = !DISubroutineType(types: !599)
!599 = !{null, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !225, line: 245, size: 1024, elements: !602)
!602 = !{!603, !661, !673, !674, !675, !676, !682, !697}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !601, file: !225, line: 247, baseType: !604, size: 384)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !225, line: 57, size: 384, elements: !605)
!605 = !{!606, !630, !637, !638, !639, !648, !649, !650}
!606 = !DIDerivedType(tag: DW_TAG_member, scope: !604, file: !225, line: 60, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !604, file: !225, line: 60, size: 64, elements: !608)
!608 = !{!609, !624}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !607, file: !225, line: 61, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !235, line: 49, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !235, line: 37, size: 64, elements: !612)
!612 = !{!613, !619}
!613 = !DIDerivedType(tag: DW_TAG_member, scope: !611, file: !235, line: 38, baseType: !614, size: 32)
!614 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !611, file: !235, line: 38, size: 32, elements: !615)
!615 = !{!616, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !614, file: !235, line: 39, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !614, file: !235, line: 40, baseType: !617, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, scope: !611, file: !235, line: 42, baseType: !620, size: 32, offset: 32)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !611, file: !235, line: 42, size: 32, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !620, file: !235, line: 43, baseType: !617, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !620, file: !235, line: 44, baseType: !617, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !607, file: !225, line: 62, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !251, line: 49, size: 64, elements: !626)
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !625, file: !251, line: 50, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 64, elements: !256)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !604, file: !225, line: 68, baseType: !631, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !261, line: 233, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 231, size: 64, elements: !634)
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !633, file: !261, line: 232, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !235, line: 48, baseType: !611)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !604, file: !225, line: 71, baseType: !143, size: 8, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !604, file: !225, line: 74, baseType: !143, size: 8, offset: 104)
!639 = !DIDerivedType(tag: DW_TAG_member, scope: !604, file: !225, line: 90, baseType: !640, size: 16, offset: 112)
!640 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !604, file: !225, line: 90, size: 16, elements: !641)
!641 = !{!642, !647}
!642 = !DIDerivedType(tag: DW_TAG_member, scope: !640, file: !225, line: 91, baseType: !643, size: 16)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !640, file: !225, line: 91, size: 16, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !643, file: !225, line: 96, baseType: !275, size: 8)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !643, file: !225, line: 97, baseType: !143, size: 8, offset: 8)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !640, file: !225, line: 100, baseType: !279, size: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !604, file: !225, line: 107, baseType: !156, size: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !604, file: !225, line: 127, baseType: !117, size: 32, offset: 160)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !604, file: !225, line: 131, baseType: !651, size: 192, offset: 192)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !261, line: 244, size: 192, elements: !652)
!652 = !{!653, !654, !660}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !651, file: !261, line: 245, baseType: !610, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !651, file: !261, line: 246, baseType: !655, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !261, line: 242, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !651, file: !261, line: 249, baseType: !115, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !601, file: !225, line: 250, baseType: !662, size: 288, offset: 384)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !296, line: 25, size: 288, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !662, file: !296, line: 26, baseType: !156, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !662, file: !296, line: 27, baseType: !156, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !662, file: !296, line: 28, baseType: !156, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !662, file: !296, line: 29, baseType: !156, size: 32, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !662, file: !296, line: 30, baseType: !156, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !662, file: !296, line: 31, baseType: !156, size: 32, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !662, file: !296, line: 32, baseType: !156, size: 32, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !662, file: !296, line: 33, baseType: !156, size: 32, offset: 224)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !662, file: !296, line: 34, baseType: !156, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !601, file: !225, line: 253, baseType: !117, size: 32, offset: 672)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !601, file: !225, line: 256, baseType: !632, size: 64, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !601, file: !225, line: 294, baseType: !118, size: 32, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !601, file: !225, line: 300, baseType: !677, size: 96, offset: 800)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !225, line: 149, size: 96, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !677, file: !225, line: 153, baseType: !22, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !677, file: !225, line: 162, baseType: !315, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !677, file: !225, line: 168, baseType: !315, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !601, file: !225, line: 325, baseType: !683, size: 32, offset: 896)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !220, line: 5073, size: 192, elements: !685)
!685 = !{!686, !692, !693}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !684, file: !220, line: 5074, baseType: !687, size: 96)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !324, line: 56, size: 96, elements: !688)
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !687, file: !324, line: 57, baseType: !327, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !687, file: !324, line: 58, baseType: !117, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !687, file: !324, line: 59, baseType: !315, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !684, file: !220, line: 5075, baseType: !632, size: 64, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !684, file: !220, line: 5076, baseType: !694, size: 32, offset: 160)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !694, file: !334, line: 52, baseType: !22, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !601, file: !225, line: 343, baseType: !698, size: 64, offset: 928)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !296, line: 60, size: 64, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !698, file: !296, line: 63, baseType: !156, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !698, file: !296, line: 66, baseType: !156, size: 32, offset: 32)
!702 = !{!703, !704}
!703 = !DILocalVariable(name: "thread", arg: 1, scope: !596, file: !597, line: 175, type: !600)
!704 = !DILocalVariable(name: "region_num", scope: !596, file: !597, line: 200, type: !143)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, elements: !560)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !707, line: 52, size: 96, elements: !708)
!707 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = !{!709, !710, !711}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !706, file: !707, line: 53, baseType: !22, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !706, file: !707, line: 54, baseType: !315, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !706, file: !707, line: 55, baseType: !712, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !713, line: 151, baseType: !714)
!713 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !713, line: 149, size: 32, elements: !715)
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !714, file: !713, line: 150, baseType: !156, size: 32)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 96, elements: !492)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !721, file: !755, line: 39, type: !143, isLocal: true, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !723, globals: !754, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!723 = !{!724, !117, !118, !742, !143}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !726, line: 1226, baseType: !727)
!726 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !726, line: 1213, size: 352, elements: !728)
!728 = !{!729, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !727, file: !726, line: 1215, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !156)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !727, file: !726, line: 1216, baseType: !731, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !727, file: !726, line: 1217, baseType: !731, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !727, file: !726, line: 1218, baseType: !731, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !727, file: !726, line: 1219, baseType: !731, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !727, file: !726, line: 1220, baseType: !731, size: 32, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !727, file: !726, line: 1221, baseType: !731, size: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !727, file: !726, line: 1222, baseType: !731, size: 32, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !727, file: !726, line: 1223, baseType: !731, size: 32, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !727, file: !726, line: 1224, baseType: !731, size: 32, offset: 288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !727, file: !726, line: 1225, baseType: !731, size: 32, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !745, line: 27, size: 96, elements: !746)
!745 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !744, file: !745, line: 29, baseType: !156, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !744, file: !745, line: 31, baseType: !133, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !744, file: !745, line: 37, baseType: !750, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !713, line: 146, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !713, line: 141, size: 32, elements: !752)
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !751, file: !713, line: 143, baseType: !156, size: 32)
!754 = !{!719}
!755 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !758, file: !765, line: 21, type: !438, isLocal: true, isDefinition: true)
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !760, globals: !764, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!760 = !{!761, !118, !117}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !763, line: 22, baseType: !118)
!763 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!764 = !{!756}
!765 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !768, file: !773, line: 13, type: !790, isLocal: true, isDefinition: true)
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !770, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!770 = !{!771, !766}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "mpu_config", scope: !768, file: !773, line: 37, type: !774, isLocal: false, isDefinition: true)
!773 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !745, line: 41, size: 64, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !775, file: !745, line: 43, baseType: !156, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !775, file: !745, line: 45, baseType: !779, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !745, line: 27, size: 96, elements: !782)
!782 = !{!783, !784, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !781, file: !745, line: 29, baseType: !156, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !781, file: !745, line: 31, baseType: !133, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !781, file: !745, line: 37, baseType: !786, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !713, line: 146, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !713, line: 141, size: 32, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !787, file: !713, line: 143, baseType: !156, size: 32)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 192, elements: !256)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !793, file: !963, line: 93, type: !964, isLocal: true, isDefinition: true, align: 32)
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !795, globals: !958, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!795 = !{!796, !143, !117, !118, !876, !156, !877, !913, !924}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !798, line: 1071, baseType: !799)
!798 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !798, line: 1035, size: 19584, elements: !800)
!800 = !{!801, !805, !806, !807, !811, !812, !814, !815, !816, !817, !818, !819, !823, !824, !825, !829, !830, !834, !835, !839, !840, !844, !845, !846, !847, !848, !849, !850, !854, !855, !856, !857, !861, !862, !866}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !799, file: !798, line: 1036, baseType: !802, size: 960)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 960, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 30)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !799, file: !798, line: 1037, baseType: !731, size: 32, offset: 960)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !799, file: !798, line: 1038, baseType: !731, size: 32, offset: 992)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !799, file: !798, line: 1039, baseType: !808, size: 1088, offset: 1024)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 1088, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 34)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !799, file: !798, line: 1040, baseType: !731, size: 32, offset: 2112)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !799, file: !798, line: 1041, baseType: !813, size: 64, offset: 2144)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 64, elements: !256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !799, file: !798, line: 1042, baseType: !731, size: 32, offset: 2208)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !799, file: !798, line: 1043, baseType: !731, size: 32, offset: 2240)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !799, file: !798, line: 1044, baseType: !731, size: 32, offset: 2272)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !799, file: !798, line: 1045, baseType: !731, size: 32, offset: 2304)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !799, file: !798, line: 1046, baseType: !731, size: 32, offset: 2336)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !799, file: !798, line: 1047, baseType: !820, size: 3808, offset: 2368)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 3808, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 119)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !799, file: !798, line: 1048, baseType: !731, size: 32, offset: 6176)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !799, file: !798, line: 1049, baseType: !731, size: 32, offset: 6208)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !799, file: !798, line: 1050, baseType: !826, size: 1952, offset: 6240)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 1952, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 61)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !799, file: !798, line: 1051, baseType: !731, size: 32, offset: 8192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !799, file: !798, line: 1052, baseType: !831, size: 288, offset: 8224)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 288, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 9)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !799, file: !798, line: 1053, baseType: !730, size: 32, offset: 8512)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !799, file: !798, line: 1054, baseType: !836, size: 96, offset: 8544)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 96, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 3)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !799, file: !798, line: 1055, baseType: !730, size: 32, offset: 8640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !799, file: !798, line: 1056, baseType: !841, size: 1568, offset: 8672)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 1568, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 49)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !799, file: !798, line: 1057, baseType: !731, size: 32, offset: 10240)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !799, file: !798, line: 1058, baseType: !836, size: 96, offset: 10272)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !799, file: !798, line: 1059, baseType: !731, size: 32, offset: 10368)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !799, file: !798, line: 1060, baseType: !813, size: 64, offset: 10400)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !799, file: !798, line: 1061, baseType: !731, size: 32, offset: 10464)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !799, file: !798, line: 1062, baseType: !731, size: 32, offset: 10496)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !799, file: !798, line: 1063, baseType: !851, size: 672, offset: 10528)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 672, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 21)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !799, file: !798, line: 1064, baseType: !731, size: 32, offset: 11200)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !799, file: !798, line: 1065, baseType: !730, size: 32, offset: 11232)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !799, file: !798, line: 1066, baseType: !731, size: 32, offset: 11264)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !799, file: !798, line: 1067, baseType: !858, size: 1504, offset: 11296)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 1504, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 47)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !799, file: !798, line: 1068, baseType: !730, size: 32, offset: 12800)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !799, file: !798, line: 1069, baseType: !863, size: 5600, offset: 12832)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 5600, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 175)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !799, file: !798, line: 1070, baseType: !867, size: 1152, offset: 18432)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 1152, elements: !832)
!868 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !798, line: 278, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !798, line: 272, size: 128, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !870, file: !798, line: 273, baseType: !731, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !870, file: !798, line: 274, baseType: !731, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !870, file: !798, line: 275, baseType: !731, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !870, file: !798, line: 277, baseType: !730, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !726, line: 468, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !726, line: 445, size: 1120, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !906, !910, !912}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !879, file: !726, line: 447, baseType: !730, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !879, file: !726, line: 448, baseType: !731, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !879, file: !726, line: 449, baseType: !731, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !879, file: !726, line: 450, baseType: !731, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !879, file: !726, line: 451, baseType: !731, size: 32, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !879, file: !726, line: 452, baseType: !731, size: 32, offset: 160)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !879, file: !726, line: 453, baseType: !888, size: 96, offset: 192)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 96, elements: !890)
!889 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !143)
!890 = !{!891}
!891 = !DISubrange(count: 12)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !879, file: !726, line: 454, baseType: !731, size: 32, offset: 288)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !879, file: !726, line: 455, baseType: !731, size: 32, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !879, file: !726, line: 456, baseType: !731, size: 32, offset: 352)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !879, file: !726, line: 457, baseType: !731, size: 32, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !879, file: !726, line: 458, baseType: !731, size: 32, offset: 416)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !879, file: !726, line: 459, baseType: !731, size: 32, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !879, file: !726, line: 460, baseType: !731, size: 32, offset: 480)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !879, file: !726, line: 461, baseType: !813, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !879, file: !726, line: 462, baseType: !730, size: 32, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !879, file: !726, line: 463, baseType: !730, size: 32, offset: 608)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !879, file: !726, line: 464, baseType: !903, size: 128, offset: 640)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 128, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 4)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !879, file: !726, line: 465, baseType: !907, size: 160, offset: 768)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 160, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 5)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !879, file: !726, line: 466, baseType: !911, size: 160, offset: 928)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 160, elements: !908)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !879, file: !726, line: 467, baseType: !731, size: 32, offset: 1088)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !915, file: !914, line: 167, baseType: !923)
!914 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!915 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !914, file: !914, line: 134, type: !916, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !793, retainedNodes: !918)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !156}
!918 = !{!919, !920, !922}
!919 = !DILocalVariable(name: "time_us", arg: 1, scope: !915, file: !914, line: 134, type: !156)
!920 = !DILocalVariable(name: "delay_cycles", scope: !915, file: !914, line: 168, type: !921)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!922 = !DILocalVariable(name: "cycles", scope: !915, file: !914, line: 171, type: !156)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !798, line: 2399, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !798, line: 2373, size: 10880, elements: !927)
!927 = !{!928, !932, !933, !934, !935, !939, !940, !945, !946, !947, !948, !949, !950, !954, !955, !956, !957}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !926, file: !798, line: 2374, baseType: !929, size: 8192)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 8192, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !926, file: !798, line: 2375, baseType: !730, size: 32, offset: 8192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !926, file: !798, line: 2376, baseType: !730, size: 32, offset: 8224)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !926, file: !798, line: 2377, baseType: !730, size: 32, offset: 8256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !926, file: !798, line: 2378, baseType: !936, size: 1984, offset: 8288)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 1984, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 62)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !926, file: !798, line: 2379, baseType: !731, size: 32, offset: 10272)
!940 = !DIDerivedType(tag: DW_TAG_member, scope: !926, file: !798, line: 2381, baseType: !941, size: 32, offset: 10304)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !926, file: !798, line: 2381, size: 32, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !941, file: !798, line: 2382, baseType: !731, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !941, file: !798, line: 2383, baseType: !731, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !926, file: !798, line: 2386, baseType: !731, size: 32, offset: 10336)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !926, file: !798, line: 2387, baseType: !731, size: 32, offset: 10368)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !926, file: !798, line: 2389, baseType: !731, size: 32, offset: 10400)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !926, file: !798, line: 2391, baseType: !731, size: 32, offset: 10432)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !926, file: !798, line: 2393, baseType: !731, size: 32, offset: 10464)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !926, file: !798, line: 2394, baseType: !951, size: 256, offset: 10496)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 256, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 8)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !926, file: !798, line: 2395, baseType: !731, size: 32, offset: 10752)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !926, file: !798, line: 2396, baseType: !730, size: 32, offset: 10784)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !926, file: !798, line: 2397, baseType: !731, size: 32, offset: 10816)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !926, file: !798, line: 2398, baseType: !731, size: 32, offset: 10848)
!958 = !{!791, !959}
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !915, file: !914, line: 161, type: !961, isLocal: true, isDefinition: true, align: 128)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 48, elements: !837)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!963 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !966, line: 51, size: 64, elements: !967)
!966 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!967 = !{!968, !975}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !965, file: !966, line: 60, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!118, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !966, line: 48, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !965, file: !966, line: 65, baseType: !972, size: 32, offset: 32)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !978, file: !1213, line: 733, type: !1316, isLocal: false, isDefinition: true, align: 32)
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !980, retainedTypes: !1123, globals: !1209, splitDebugInlining: false, nameTableKind: None)
!979 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/threads")
!980 = !{!981, !987, !30, !992, !997, !1004, !1012, !1020, !1029, !1033, !1088, !1095, !1114}
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !982, line: 23, baseType: !32, size: 32, elements: !983)
!982 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!983 = !{!984, !985, !986}
!984 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!985 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!986 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!987 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !982, line: 48, baseType: !32, size: 32, elements: !988)
!988 = !{!989, !990, !991}
!989 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!990 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!991 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!992 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !993, line: 167, baseType: !32, size: 32, elements: !994)
!993 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!994 = !{!995, !996}
!995 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!996 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!997 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !993, line: 107, baseType: !32, size: 32, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003}
!999 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!1000 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!1001 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!1002 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!1003 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!1004 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !993, line: 208, baseType: !32, size: 32, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011}
!1006 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!1007 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!1008 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!1009 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!1010 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!1011 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!1012 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !993, line: 261, baseType: !32, size: 32, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019}
!1014 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!1015 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!1016 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!1017 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!1018 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!1019 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !993, line: 237, baseType: !32, size: 32, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028}
