; ModuleID = 'build/96b_meerkat96/led_lp503x/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.16 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.17 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.16*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/led_lp503x/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/led_lp503x")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/led_lp503x")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !230, line: 16, type: !232, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !227, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/led_lp503x/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/led_lp503x")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_driver_api", file: !157, line: 113, size: 224, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/drivers/led.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159, !189, !191, !196, !212, !217, !222}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !156, file: !157, line: 115, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_on", file: !157, line: 89, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!123, !164, !135}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = !{!169, !173, !174, !175, !182, !183}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !167, line: 380, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !166, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !166, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !166, file: !167, line: 386, baseType: !176, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !177, file: !167, line: 359, baseType: !117, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !177, file: !167, line: 364, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!181 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 388, baseType: !108, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !166, file: !167, line: 396, baseType: !184, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !167, line: 43, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !188)
!188 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !156, file: !157, line: 116, baseType: !190, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_off", file: !157, line: 97, baseType: !161)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !156, file: !157, line: 118, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_blink", file: !157, line: 54, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!123, !164, !135, !135, !135}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !156, file: !157, line: 119, baseType: !197, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_get_info", file: !157, line: 63, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!123, !164, !135, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_info", file: !157, line: 41, size: 128, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !204, file: !157, line: 42, baseType: !170, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !204, file: !157, line: 43, baseType: !135, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_colors", scope: !204, file: !157, line: 44, baseType: !117, size: 8, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "color_mapping", scope: !204, file: !157, line: 45, baseType: !210, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "set_brightness", scope: !156, file: !157, line: 120, baseType: !213, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_brightness", file: !157, line: 72, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{!123, !164, !135, !117}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "set_color", scope: !156, file: !157, line: 121, baseType: !218, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_color", file: !157, line: 80, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{!123, !164, !135, !117, !210}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "write_channels", scope: !156, file: !157, line: 122, baseType: !223, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_write_channels", file: !157, line: 105, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{!123, !164, !135, !135, !210}
!227 = !{!25, !228}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !230, line: 16, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/samples/drivers/led_lp503x/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 17, baseType: !170, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !233, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !240, file: !296, line: 18, type: !298, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, globals: !293, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/led_lp503x")
!242 = !{!30}
!243 = !{!22, !108, !24, !244, !246, !248, !249, !123, !251, !252, !254, !256, !257, !258, !259, !261, !124, !117, !272, !135, !170}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 214, baseType: !32)
!250 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !260)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !263)
!263 = !{!264, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !262, file: !111, line: 80, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !111, line: 47, baseType: !117, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !265, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !265, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !265, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !262, file: !111, line: 82, baseType: !108, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !274)
!274 = !{!275, !291, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !273, file: !31, line: 89, baseType: !276, size: 96)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !277)
!277 = !{!278, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !276, file: !31, line: 67, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !279, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !279, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !279, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !279, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !279, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !279, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !276, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !276, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !273, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !31, line: 94, baseType: !151, offset: 128)
!293 = !{!238, !294}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !240, file: !296, line: 18, type: !297, isLocal: true, isDefinition: true)
!296 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !234, line: 17, baseType: !170, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !299, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "_char_out", scope: !305, file: !310, line: 54, type: !311, isLocal: false, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !308, globals: !309, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/led_lp503x")
!307 = !{!37}
!308 = !{!108, !123}
!309 = !{!303}
!310 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !123}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !316, file: !730, line: 258, type: !731, isLocal: true, isDefinition: true, align: 32)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !318, retainedTypes: !601, globals: !729, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/led_lp503x")
!318 = !{!319, !351, !361, !410, !416, !537, !572}
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !320, line: 54, baseType: !32, size: 32, elements: !321)
!320 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!322 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!323 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!324 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!325 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!326 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!327 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!328 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!329 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!330 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!331 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!332 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!333 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!334 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!335 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!336 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!337 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!338 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!339 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!340 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!341 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!342 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!343 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!344 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!345 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!346 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!347 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!348 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!349 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!350 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !320, line: 224, baseType: !32, size: 32, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360}
!353 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!354 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!355 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!356 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!357 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!358 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!359 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!360 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !320, line: 275, baseType: !32, size: 32, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!363 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!364 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!365 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!366 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!367 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!368 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!369 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!370 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!371 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!372 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!373 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!374 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!375 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!376 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!377 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!378 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!379 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!380 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!381 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!382 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!383 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!384 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!385 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!386 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!387 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!388 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!389 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!390 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!391 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!392 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!393 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!394 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!395 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!396 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!397 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!398 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!399 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!400 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!401 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!402 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!403 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!404 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!405 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!406 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!407 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!408 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!409 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!410 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !320, line: 327, baseType: !32, size: 32, elements: !411)
!411 = !{!412, !413, !414, !415}
!412 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!413 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!414 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!415 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !417, line: 76, baseType: !32, size: 32, elements: !418)
!417 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!419 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!420 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!421 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!422 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!423 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!424 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!425 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!426 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!427 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!428 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!429 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!430 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!431 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!432 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!433 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!434 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!435 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!436 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!437 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!438 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!439 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!440 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!441 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!442 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!443 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!444 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!445 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!446 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!447 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!448 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!449 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!450 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!451 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!452 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!453 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!454 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!455 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!456 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!457 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!458 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!459 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!460 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!461 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!462 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!463 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!464 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!465 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!466 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!467 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!468 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!469 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!470 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!471 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!472 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!473 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!474 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!475 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!476 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!477 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!478 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!479 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!480 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!481 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!482 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!483 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!484 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!485 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!486 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!487 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!488 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!489 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!490 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!491 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!492 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!493 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!494 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!495 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!496 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!497 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!498 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!499 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!500 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!501 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!502 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!503 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!504 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!505 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!506 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!507 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!508 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!509 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!510 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!511 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!512 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!513 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!514 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!515 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!516 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!517 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!518 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!519 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!520 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!521 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!522 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!523 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!524 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!525 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!526 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!527 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!528 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!529 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!530 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!531 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!532 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!533 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!534 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!535 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!536 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !320, line: 237, baseType: !32, size: 32, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!539 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!540 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!541 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!542 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!543 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!544 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!545 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!546 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!547 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!548 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!549 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!550 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!551 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!552 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!553 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!554 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!555 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!556 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!557 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!558 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!559 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!560 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!561 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!562 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!563 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!564 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!565 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!566 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!567 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!568 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!569 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!570 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!571 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!572 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !417, line: 44, baseType: !32, size: 32, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!574 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!575 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!576 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!577 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!578 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!579 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!580 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!581 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!582 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!583 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!584 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!585 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!586 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!587 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!588 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!589 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!590 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!591 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!592 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!593 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!594 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!595 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!596 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!597 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!598 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!599 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!600 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!601 = !{!602, !674, !717, !728, !135}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !604, line: 4575, baseType: !605)
!604 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !604, line: 4532, size: 390144, elements: !606)
!606 = !{!607, !609, !610, !611, !612, !616, !626, !630, !640, !644}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !605, file: !604, line: 4533, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !605, file: !604, line: 4534, baseType: !608, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !605, file: !604, line: 4535, baseType: !608, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !605, file: !604, line: 4536, baseType: !608, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !605, file: !604, line: 4537, baseType: !613, size: 16256, offset: 128)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 16256, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 2032)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !605, file: !604, line: 4543, baseType: !617, size: 4224, offset: 16384)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 4224, elements: !624)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !605, file: !604, line: 4538, size: 128, elements: !619)
!619 = !{!620, !621, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !618, file: !604, line: 4539, baseType: !608, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !618, file: !604, line: 4540, baseType: !608, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !618, file: !604, line: 4541, baseType: !608, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !618, file: !604, line: 4542, baseType: !608, size: 32, offset: 96)
!624 = !{!625}
!625 = !DISubrange(count: 33)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !605, file: !604, line: 4544, baseType: !627, size: 110464, offset: 20608)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 110464, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 13808)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !605, file: !604, line: 4550, baseType: !631, size: 24448, offset: 131072)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 24448, elements: !638)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !605, file: !604, line: 4545, size: 128, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !632, file: !604, line: 4546, baseType: !608, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !632, file: !604, line: 4547, baseType: !608, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !632, file: !604, line: 4548, baseType: !608, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !632, file: !604, line: 4549, baseType: !608, size: 32, offset: 96)
!638 = !{!639}
!639 = !DISubrange(count: 191)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !605, file: !604, line: 4551, baseType: !641, size: 106624, offset: 155520)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 106624, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 13328)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !605, file: !604, line: 4574, baseType: !645, size: 128000, offset: 262144)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 128000, elements: !672)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !605, file: !604, line: 4552, size: 1024, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !668, !669, !670, !671}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !646, file: !604, line: 4553, baseType: !608, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !646, file: !604, line: 4554, baseType: !608, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !646, file: !604, line: 4555, baseType: !608, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !646, file: !604, line: 4556, baseType: !608, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !646, file: !604, line: 4557, baseType: !608, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !646, file: !604, line: 4558, baseType: !608, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !646, file: !604, line: 4559, baseType: !608, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !646, file: !604, line: 4560, baseType: !608, size: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !646, file: !604, line: 4561, baseType: !608, size: 32, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !646, file: !604, line: 4562, baseType: !608, size: 32, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !646, file: !604, line: 4563, baseType: !608, size: 32, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !646, file: !604, line: 4564, baseType: !608, size: 32, offset: 352)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !646, file: !604, line: 4565, baseType: !608, size: 32, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !646, file: !604, line: 4566, baseType: !608, size: 32, offset: 416)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !646, file: !604, line: 4567, baseType: !608, size: 32, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !646, file: !604, line: 4568, baseType: !608, size: 32, offset: 480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !646, file: !604, line: 4569, baseType: !665, size: 384, offset: 512)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 384, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 48)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !646, file: !604, line: 4570, baseType: !608, size: 32, offset: 896)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !646, file: !604, line: 4571, baseType: !608, size: 32, offset: 928)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !646, file: !604, line: 4572, baseType: !608, size: 32, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !646, file: !604, line: 4573, baseType: !608, size: 32, offset: 992)
!672 = !{!673}
!673 = !DISubrange(count: 125)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !604, line: 38320, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !604, line: 38303, size: 23040, elements: !677)
!677 = !{!678, !680, !684, !685, !686, !687, !691, !695, !699, !703, !707}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !676, file: !604, line: 38304, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !676, file: !604, line: 38305, baseType: !681, size: 256, offset: 32)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 256, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !676, file: !604, line: 38306, baseType: !608, size: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !676, file: !604, line: 38307, baseType: !608, size: 32, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !676, file: !604, line: 38308, baseType: !608, size: 32, offset: 352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !676, file: !604, line: 38309, baseType: !688, size: 3712, offset: 384)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 3712, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 464)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !676, file: !604, line: 38310, baseType: !692, size: 864, offset: 4096)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 864, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 27)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !676, file: !604, line: 38311, baseType: !696, size: 3232, offset: 4960)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 3232, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 404)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !676, file: !604, line: 38312, baseType: !700, size: 3776, offset: 8192)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 3776, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 118)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !676, file: !604, line: 38313, baseType: !704, size: 4416, offset: 11968)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 4416, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 552)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !676, file: !604, line: 38319, baseType: !708, size: 6656, offset: 16384)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 6656, elements: !715)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !676, file: !604, line: 38314, size: 128, elements: !710)
!710 = !{!711, !712, !713, !714}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !709, file: !604, line: 38315, baseType: !608, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !709, file: !604, line: 38316, baseType: !608, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !709, file: !604, line: 38317, baseType: !608, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !709, file: !604, line: 38318, baseType: !608, size: 32, offset: 96)
!715 = !{!716}
!716 = !DISubrange(count: 52)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !604, line: 43319, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !604, line: 43313, size: 80, elements: !720)
!720 = !{!721, !723, !724, !726, !727}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !719, file: !604, line: 43314, baseType: !722, size: 16)
!722 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !259)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !719, file: !604, line: 43315, baseType: !722, size: 16, offset: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !719, file: !604, line: 43316, baseType: !725, size: 16, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !719, file: !604, line: 43317, baseType: !722, size: 16, offset: 48)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !719, file: !604, line: 43318, baseType: !722, size: 16, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!729 = !{!314}
!730 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !733, line: 51, size: 64, elements: !734)
!733 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!734 = !{!735, !742}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !732, file: !733, line: 60, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = !DISubroutineType(types: !738)
!738 = !{!123, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !733, line: 48, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !732, file: !733, line: 65, baseType: !739, size: 32, offset: 32)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "log_const_log", scope: !745, file: !826, line: 25, type: !1054, isLocal: false, isDefinition: true)
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !747, retainedTypes: !753, globals: !823, splitDebugInlining: false, nameTableKind: None)
!746 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/led_lp503x")
!747 = !{!748, !30, !37}
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !749, line: 33, baseType: !32, size: 32, elements: !750)
!749 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!750 = !{!751, !752}
!751 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!752 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!753 = !{!249, !123, !108, !754, !124, !765, !117, !766, !135, !787, !22, !24, !814, !817, !819, !821}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !756)
!756 = !{!757, !764}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !755, file: !111, line: 80, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !759)
!759 = !{!760, !761, !762, !763}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !758, file: !111, line: 47, baseType: !117, size: 8)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !758, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !758, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !758, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !755, file: !111, line: 82, baseType: !108, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !768)
!768 = !{!769, !785, !786}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !767, file: !31, line: 89, baseType: !770, size: 96)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !771)
!771 = !{!772, !783, !784}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !770, file: !31, line: 67, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !773, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !773, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !773, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !773, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !773, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !773, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !773, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !773, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !770, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !770, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !767, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !31, line: 94, baseType: !151, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !789)
!789 = !{!790, !807, !813}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !788, file: !31, line: 112, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !792, line: 49, size: 32, elements: !793)
!792 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!793 = !{!794, !800, !806}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !791, file: !792, line: 50, baseType: !795, size: 32)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !792, line: 37, size: 32, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !795, file: !792, line: 38, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !795, file: !792, line: 38, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !795, file: !792, line: 39, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !791, file: !792, line: 51, baseType: !801, size: 32)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !792, line: 43, size: 32, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !801, file: !792, line: 44, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !801, file: !792, line: 44, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !801, file: !792, line: 45, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !791, file: !792, line: 52, baseType: !135, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !788, file: !31, line: 113, baseType: !808, size: 32)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !808, file: !31, line: 108, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !808, file: !31, line: 108, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !808, file: !31, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !788, file: !31, line: 114, baseType: !767, size: 128)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !815, line: 46, baseType: !816)
!815 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !255)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !818)
!818 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!823 = !{!743, !824, !853, !860, !862, !864, !868, !870, !872, !874, !876, !878, !884, !917, !920, !929, !1015, !1042, !1049, !1051, !1059, !1069, !1074, !1089, !1093}
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !745, file: !826, line: 93, type: !827, isLocal: false, isDefinition: true, align: 32)
!826 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !828, line: 2909, size: 128, elements: !829)
!828 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = !{!830, !851, !852}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !827, file: !828, line: 2910, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !832, line: 233, baseType: !833)
!832 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !832, line: 231, size: 64, elements: !834)
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !833, file: !832, line: 232, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !837, line: 48, baseType: !838)
!837 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !837, line: 37, size: 64, elements: !839)
!839 = !{!840, !846}
!840 = !DIDerivedType(tag: DW_TAG_member, scope: !838, file: !837, line: 38, baseType: !841, size: 32)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !838, file: !837, line: 38, size: 32, elements: !842)
!842 = !{!843, !845}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !841, file: !837, line: 39, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !841, file: !837, line: 40, baseType: !844, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, scope: !838, file: !837, line: 42, baseType: !847, size: 32, offset: 32)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !838, file: !837, line: 42, size: 32, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !847, file: !837, line: 43, baseType: !844, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !847, file: !837, line: 44, baseType: !844, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !827, file: !828, line: 2911, baseType: !32, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !827, file: !828, line: 2912, baseType: !32, size: 32, offset: 96)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !745, file: !826, line: 910, type: !855, isLocal: true, isDefinition: true, align: 32)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !733, line: 51, size: 64, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !856, file: !733, line: 60, baseType: !736, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !856, file: !733, line: 65, baseType: !739, size: 32, offset: 32)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "panic_mode", scope: !745, file: !826, line: 96, type: !181, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "backend_attached", scope: !745, file: !826, line: 97, type: !181, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !745, file: !826, line: 98, type: !866, isLocal: true, isDefinition: true)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !867, line: 22, baseType: !253)
!867 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !745, file: !826, line: 99, type: !866, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !745, file: !826, line: 105, type: !135, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !745, file: !826, line: 107, type: !145, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !745, file: !826, line: 108, type: !866, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !745, file: !826, line: 109, type: !817, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !745, file: !826, line: 111, type: !880, isLocal: true, isDefinition: true, align: 32)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !881, line: 29, size: 32, elements: !882)
!881 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !880, file: !881, line: 30, baseType: !787, size: 32)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "log_buffer", scope: !745, file: !826, line: 112, type: !886, isLocal: true, isDefinition: true, align: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !887, line: 87, size: 448, elements: !888)
!887 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = !{!889, !890, !891, !892, !893, !894, !898, !907, !912, !914, !915, !916}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !886, file: !887, line: 89, baseType: !135, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !886, file: !887, line: 92, baseType: !135, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !886, file: !887, line: 95, baseType: !135, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !886, file: !887, line: 98, baseType: !135, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !886, file: !887, line: 101, baseType: !135, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !886, file: !887, line: 104, baseType: !895, offset: 160)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !896, line: 43, elements: !897)
!896 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!897 = !{}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !886, file: !887, line: 110, baseType: !899, size: 32, offset: 160)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !887, line: 83, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !903, !905}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !886, file: !887, line: 113, baseType: !908, size: 32, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !887, line: 75, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(types: !911)
!911 = !{!135, !905}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !886, file: !887, line: 116, baseType: !913, size: 32, offset: 224)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !886, file: !887, line: 119, baseType: !135, size: 32, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !886, file: !887, line: 122, baseType: !135, size: 32, offset: 288)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !886, file: !887, line: 124, baseType: !827, size: 128, offset: 320)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !745, file: !826, line: 113, type: !919, isLocal: true, isDefinition: true)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "logging_stack", scope: !745, file: !826, line: 884, type: !922, isLocal: false, isDefinition: true, align: 64)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 6144, elements: !927)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !924, line: 47, size: 8, elements: !925)
!924 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !923, file: !924, line: 48, baseType: !172, size: 8)
!927 = !{!928}
!928 = !DISubrange(count: 768)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "logging_thread", scope: !745, file: !826, line: 885, type: !931, isLocal: false, isDefinition: true)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !932, line: 245, size: 896, elements: !933)
!932 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!933 = !{!934, !979, !992, !993, !994, !995, !1010}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !931, file: !932, line: 247, baseType: !935, size: 384)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !932, line: 57, size: 384, elements: !936)
!936 = !{!937, !951, !953, !954, !955, !966, !967, !968}
!937 = !DIDerivedType(tag: DW_TAG_member, scope: !935, file: !932, line: 60, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !935, file: !932, line: 60, size: 64, elements: !939)
!939 = !{!940, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !938, file: !932, line: 61, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !837, line: 49, baseType: !838)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !938, file: !932, line: 62, baseType: !943, size: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !944, line: 49, size: 64, elements: !945)
!944 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !943, file: !944, line: 50, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 64, elements: !949)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!949 = !{!950}
!950 = !DISubrange(count: 2)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !935, file: !932, line: 68, baseType: !952, size: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !935, file: !932, line: 71, baseType: !117, size: 8, offset: 96)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !935, file: !932, line: 74, baseType: !117, size: 8, offset: 104)
!955 = !DIDerivedType(tag: DW_TAG_member, scope: !935, file: !932, line: 90, baseType: !956, size: 16, offset: 112)
!956 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !935, file: !932, line: 90, size: 16, elements: !957)
!957 = !{!958, !965}
!958 = !DIDerivedType(tag: DW_TAG_member, scope: !956, file: !932, line: 91, baseType: !959, size: 16)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !956, file: !932, line: 91, size: 16, elements: !960)
!960 = !{!961, !964}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !959, file: !932, line: 96, baseType: !962, size: 8)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !963)
!963 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !959, file: !932, line: 97, baseType: !117, size: 8, offset: 8)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !956, file: !932, line: 100, baseType: !259, size: 16)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !935, file: !932, line: 107, baseType: !135, size: 32, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !935, file: !932, line: 127, baseType: !108, size: 32, offset: 160)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !935, file: !932, line: 131, baseType: !969, size: 192, offset: 192)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !832, line: 244, size: 192, elements: !970)
!970 = !{!971, !972, !978}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !969, file: !832, line: 245, baseType: !941, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !969, file: !832, line: 246, baseType: !973, size: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !832, line: 242, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !969, file: !832, line: 249, baseType: !816, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !931, file: !932, line: 250, baseType: !980, size: 288, offset: 384)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !981, line: 25, size: 288, elements: !982)
!981 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990, !991}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !980, file: !981, line: 26, baseType: !135, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !980, file: !981, line: 27, baseType: !135, size: 32, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !980, file: !981, line: 28, baseType: !135, size: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !980, file: !981, line: 29, baseType: !135, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !980, file: !981, line: 30, baseType: !135, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !980, file: !981, line: 31, baseType: !135, size: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !980, file: !981, line: 32, baseType: !135, size: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !980, file: !981, line: 33, baseType: !135, size: 32, offset: 224)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !980, file: !981, line: 34, baseType: !135, size: 32, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !931, file: !932, line: 253, baseType: !108, size: 32, offset: 672)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !931, file: !932, line: 256, baseType: !831, size: 64, offset: 704)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !931, file: !932, line: 294, baseType: !123, size: 32, offset: 768)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !931, file: !932, line: 325, baseType: !996, size: 32, offset: 800)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !828, line: 5073, size: 160, elements: !998)
!998 = !{!999, !1008, !1009}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !997, file: !828, line: 5074, baseType: !1000, size: 96)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !1001, line: 56, size: 96, elements: !1002)
!1001 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1002 = !{!1003, !1006, !1007}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !1000, file: !1001, line: 57, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !1001, line: 57, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !1000, file: !1001, line: 58, baseType: !108, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !1000, file: !1001, line: 59, baseType: !249, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !997, file: !828, line: 5075, baseType: !831, size: 64, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !997, file: !828, line: 5076, baseType: !895, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !931, file: !932, line: 343, baseType: !1011, size: 64, offset: 832)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !981, line: 60, size: 64, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !1011, file: !981, line: 63, baseType: !135, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !1011, file: !981, line: 66, baseType: !135, size: 32, offset: 32)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "format_table", scope: !745, file: !826, line: 72, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 128, elements: !148)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !1020, line: 105, baseType: !1021)
!1020 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{null, !1024, !766, !135}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !1020, line: 89, size: 128, elements: !1027)
!1027 = !{!1028, !1033, !1040, !1041}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1026, file: !1020, line: 90, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !1020, line: 79, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!123, !258, !249, !108}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !1026, file: !1020, line: 91, baseType: !1034, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !1020, line: 82, size: 96, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1035, file: !1020, line: 83, baseType: !866, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1035, file: !1020, line: 84, baseType: !108, size: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !1035, file: !1020, line: 85, baseType: !170, size: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1026, file: !1020, line: 92, baseType: !258, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1026, file: !1020, line: 93, baseType: !249, size: 32, offset: 96)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !745, file: !826, line: 104, type: !1044, isLocal: true, isDefinition: true)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !1045, line: 33, baseType: !1046)
!1045 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 32)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!145}
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "initialized", scope: !745, file: !826, line: 95, type: !866, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !745, file: !826, line: 25, type: !1053, isLocal: true, isDefinition: true)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1055, file: !234, line: 17, baseType: !170, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1055, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !745, file: !826, line: 121, type: !1061, isLocal: true, isDefinition: true)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !887, line: 128, size: 160, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1062, file: !887, line: 130, baseType: !913, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1062, file: !887, line: 133, baseType: !135, size: 32, offset: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !1062, file: !887, line: 136, baseType: !899, size: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !1062, file: !887, line: 137, baseType: !908, size: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1062, file: !887, line: 140, baseType: !135, size: 32, offset: 128)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(name: "buf32", scope: !745, file: !826, line: 116, type: !1071, isLocal: true, isDefinition: true, align: 64)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8192, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 256)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(name: "process_lock", scope: !1076, file: !826, line: 157, type: !895, isLocal: true, isDefinition: true)
!1076 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !826, file: !826, line: 152, type: !1077, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !745, retainedNodes: !1079)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{null}
!1079 = !{!1080, !1082}
!1080 = !DILocalVariable(name: "cnt", scope: !1076, file: !826, line: 154, type: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !867, line: 23, baseType: !866)
!1082 = !DILocalVariable(name: "key", scope: !1083, file: !826, line: 158, type: !1085)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !826, line: 156, column: 18)
!1084 = distinct !DILexicalBlock(scope: !1076, file: !826, line: 156, column: 6)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !896, line: 106, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !896, line: 32, size: 32, elements: !1087)
!1087 = !{!1088}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1086, file: !896, line: 33, baseType: !123, size: 32)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(name: "proc_tid", scope: !745, file: !826, line: 100, type: !1091, isLocal: true, isDefinition: true)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !932, line: 347, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !745, file: !826, line: 101, type: !1095, isLocal: true, isDefinition: true)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !828, line: 1318, size: 448, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1104, !1105, !1110, !1111}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1095, file: !828, line: 1324, baseType: !969, size: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !1095, file: !828, line: 1327, baseType: !831, size: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !1095, file: !828, line: 1330, baseType: !1100, size: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 32)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !1095, file: !828, line: 1333, baseType: !1100, size: 32, offset: 288)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !1095, file: !828, line: 1336, baseType: !1106, size: 64, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !815, line: 67, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !815, line: 65, size: 64, elements: !1108)
!1108 = !{!1109}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !1107, file: !815, line: 66, baseType: !814, size: 64)
