; ModuleID = 'build/actinius_icarus_som/kernel/condition_variables/condvar/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "count_mutex", scope: !27, file: !116, line: 16, type: !262, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/condvar/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !143, !154}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "count_threshold_cv", scope: !27, file: !116, line: 17, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/condvar/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !116, line: 14, type: !109, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 21, type: !145, isLocal: false, isDefinition: true, align: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 24576, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152, !153}
!152 = !DISubrange(count: 3)
!153 = !DISubrange(count: 1024)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 23, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 3840, elements: !261)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !158, line: 245, size: 1280, elements: !159)
!158 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!159 = !{!160, !209, !222, !223, !224, !228, !229, !237, !256}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !157, file: !158, line: 247, baseType: !161, size: 384)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !158, line: 57, size: 384, elements: !162)
!162 = !{!163, !177, !179, !182, !183, !196, !197, !198}
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !158, line: 60, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !158, line: 60, size: 64, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !164, file: !158, line: 61, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !164, file: !158, line: 62, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !170, line: 49, size: 64, elements: !171)
!170 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !169, file: !170, line: 50, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !175)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !161, file: !158, line: 68, baseType: !178, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !161, file: !158, line: 71, baseType: !180, size: 8, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !181)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !161, file: !158, line: 74, baseType: !180, size: 8, offset: 104)
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !158, line: 90, baseType: !184, size: 16, offset: 112)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !158, line: 90, size: 16, elements: !185)
!185 = !{!186, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !184, file: !158, line: 91, baseType: !187, size: 16)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !184, file: !158, line: 91, size: 16, elements: !188)
!188 = !{!189, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !187, file: !158, line: 96, baseType: !190, size: 8)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !191)
!191 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !187, file: !158, line: 97, baseType: !180, size: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !184, file: !158, line: 100, baseType: !194, size: 16)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !195)
!195 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !161, file: !158, line: 107, baseType: !110, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !161, file: !158, line: 127, baseType: !107, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !161, file: !158, line: 131, baseType: !199, size: 192, offset: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !200)
!200 = !{!201, !202, !208}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !122, line: 245, baseType: !167, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !199, file: !122, line: 246, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !199, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !157, file: !158, line: 250, baseType: !210, size: 288, offset: 384)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !211, line: 25, size: 288, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !210, file: !211, line: 26, baseType: !110, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !210, file: !211, line: 27, baseType: !110, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !210, file: !211, line: 28, baseType: !110, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !210, file: !211, line: 29, baseType: !110, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !210, file: !211, line: 30, baseType: !110, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !210, file: !211, line: 31, baseType: !110, size: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !210, file: !211, line: 32, baseType: !110, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !210, file: !211, line: 33, baseType: !110, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !210, file: !211, line: 34, baseType: !110, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !157, file: !158, line: 253, baseType: !107, size: 32, offset: 672)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !157, file: !158, line: 256, baseType: !121, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !158, line: 279, baseType: !225, size: 256, offset: 768)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !157, file: !158, line: 294, baseType: !109, size: 32, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !157, file: !158, line: 300, baseType: !230, size: 96, offset: 1056)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !158, line: 149, size: 96, elements: !231)
!231 = !{!232, !233, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !230, file: !158, line: 153, baseType: !22, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !230, file: !158, line: 162, baseType: !234, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !235, line: 214, baseType: !32)
!235 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !230, file: !158, line: 168, baseType: !234, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !157, file: !158, line: 325, baseType: !238, size: 32, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !240)
!240 = !{!241, !250, !251}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !118, line: 5074, baseType: !242, size: 96)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !243, line: 56, size: 96, elements: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !{!245, !248, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !242, file: !243, line: 57, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !243, line: 57, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !242, file: !243, line: 58, baseType: !107, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !242, file: !243, line: 59, baseType: !234, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !239, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !239, file: !118, line: 5076, baseType: !252, size: 32, offset: 160)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !253, line: 43, size: 32, elements: !254)
!253 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !252, file: !253, line: 52, baseType: !22, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !157, file: !158, line: 343, baseType: !257, size: 64, offset: 1184)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !211, line: 60, size: 64, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !257, file: !211, line: 63, baseType: !110, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !257, file: !211, line: 66, baseType: !110, size: 32, offset: 32)
!261 = !{!152}
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !263)
!263 = !{!264, !265, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !262, file: !118, line: 2722, baseType: !121, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !262, file: !118, line: 2724, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !262, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !262, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !271, file: !288, line: 18, type: !289, isLocal: false, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !273, globals: !287, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!273 = !{!22, !107, !24, !274, !276, !278, !234, !109, !281, !282, !283, !284, !285, !286, !194, !279}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!287 = !{!269}
!288 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !292)
!291 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 17, baseType: !279, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !290, file: !291, line: 18, baseType: !180, size: 8, offset: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_char_out", scope: !297, file: !301, line: 54, type: !302, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !299, globals: !300, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!299 = !{!107, !109}
!300 = !{!295}
!301 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!109, !109}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !307, file: !362, line: 35, type: !379, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !309, globals: !359, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!309 = !{!107, !109, !310, !110, !321}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !312, file: !311, line: 167, baseType: !320)
!311 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !311, file: !311, line: 134, type: !313, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !307, retainedNodes: !315)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !110}
!315 = !{!316, !317, !319}
!316 = !DILocalVariable(name: "time_us", arg: 1, scope: !312, file: !311, line: 134, type: !110)
!317 = !DILocalVariable(name: "delay_cycles", scope: !312, file: !311, line: 168, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!319 = !DILocalVariable(name: "cycles", scope: !312, file: !311, line: 171, type: !110)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !323, line: 1928, baseType: !324)
!323 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 1909, size: 11360, elements: !325)
!325 = !{!326, !332, !333, !334, !335, !339, !340, !341, !342, !344, !345, !349, !350, !351, !352, !353, !357, !358}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !324, file: !323, line: 1910, baseType: !327, size: 8192)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 8192, elements: !330)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!330 = !{!331}
!331 = !DISubrange(count: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !324, file: !323, line: 1911, baseType: !328, size: 32, offset: 8192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !324, file: !323, line: 1912, baseType: !328, size: 32, offset: 8224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !324, file: !323, line: 1913, baseType: !328, size: 32, offset: 8256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !324, file: !323, line: 1914, baseType: !336, size: 1984, offset: 8288)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 1984, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 62)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !324, file: !323, line: 1915, baseType: !329, size: 32, offset: 10272)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !324, file: !323, line: 1916, baseType: !328, size: 32, offset: 10304)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !324, file: !323, line: 1917, baseType: !329, size: 32, offset: 10336)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !324, file: !323, line: 1918, baseType: !343, size: 96, offset: 10368)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 96, elements: !261)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !324, file: !323, line: 1919, baseType: !329, size: 32, offset: 10464)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !324, file: !323, line: 1920, baseType: !346, size: 256, offset: 10496)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 256, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 8)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !324, file: !323, line: 1921, baseType: !329, size: 32, offset: 10752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !324, file: !323, line: 1922, baseType: !328, size: 32, offset: 10784)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !324, file: !323, line: 1923, baseType: !329, size: 32, offset: 10816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !324, file: !323, line: 1924, baseType: !329, size: 32, offset: 10848)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !324, file: !323, line: 1925, baseType: !354, size: 416, offset: 10880)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 416, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 13)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !324, file: !323, line: 1926, baseType: !329, size: 32, offset: 11296)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !324, file: !323, line: 1927, baseType: !329, size: 32, offset: 11328)
!359 = !{!305, !360, !375}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !307, file: !362, line: 65, type: !363, isLocal: true, isDefinition: true, align: 32)
!362 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !365, line: 51, size: 64, elements: !366)
!365 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!366 = !{!367, !374}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !364, file: !365, line: 60, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = !DISubroutineType(types: !370)
!370 = !{!109, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !365, line: 48, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !364, file: !365, line: 65, baseType: !371, size: 32, offset: 32)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !312, file: !311, line: 161, type: !377, isLocal: true, isDefinition: true, align: 128)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 48, elements: !261)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !291, line: 17, baseType: !279, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !380, file: !291, line: 18, baseType: !180, size: 8, offset: 32)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !386, file: !420, line: 22, type: !452, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !400, globals: !417, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!388 = !{!389, !30}
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !390, line: 27, baseType: !32, size: 32, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399}
!392 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!393 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!394 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!395 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!396 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!397 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!398 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!399 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!400 = !{!107, !103, !109, !24, !401, !285, !110, !111}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !403, line: 54, size: 96, elements: !404)
!403 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !{!405, !412, !416}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !402, file: !403, line: 55, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !408)
!407 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !407, line: 30, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !402, file: !403, line: 60, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !389}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !402, file: !403, line: 65, baseType: !413, size: 32, offset: 64)
!417 = !{!384, !418, !426, !431, !433, !442, !444}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !386, file: !420, line: 27, type: !421, isLocal: true, isDefinition: true)
!420 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 32, elements: !424)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !423, line: 22, baseType: !102)
!423 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = !{!425}
!425 = !DISubrange(count: 1)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !386, file: !420, line: 44, type: !428, isLocal: true, isDefinition: true)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !253, line: 43, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !428, file: !253, line: 52, baseType: !22, size: 32)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !386, file: !420, line: 49, type: !428, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !386, file: !420, line: 36, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 128, elements: !424)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !390, line: 114, size: 128, elements: !437)
!437 = !{!438, !439, !440, !441}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !436, file: !390, line: 115, baseType: !389, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !436, file: !390, line: 141, baseType: !180, size: 8, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !436, file: !390, line: 149, baseType: !110, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !436, file: !390, line: 156, baseType: !110, size: 32, offset: 96)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !386, file: !420, line: 40, type: !435, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !386, file: !420, line: 28, type: !446, isLocal: true, isDefinition: true)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !448)
!448 = !{!449, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !447, file: !407, line: 36, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !447, file: !407, line: 37, baseType: !450, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !453, file: !291, line: 17, baseType: !279, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !453, file: !291, line: 18, baseType: !180, size: 8, offset: 32)
!457 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!458 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !461, file: !490, line: 50, type: !477, isLocal: true, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !463, globals: !487, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!463 = !{!464, !103, !234, !109, !107, !110, !111, !466, !285, !477, !478}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !465)
!465 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !468, line: 45, size: 64, elements: !469)
!468 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !{!470, !476}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !467, file: !468, line: 46, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !473)
!473 = !{!474}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !407, line: 30, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !467, file: !468, line: 48, baseType: !110, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !468, line: 38, size: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !479, file: !468, line: 39, baseType: !471, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !479, file: !468, line: 41, baseType: !483, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !468, line: 35, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !477}
!487 = !{!488, !494, !502, !459, !504, !514}
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "latency_lock", scope: !461, file: !490, line: 44, type: !491, isLocal: true, isDefinition: true)
!490 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !253, line: 43, size: 32, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !491, file: !253, line: 52, baseType: !22, size: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !461, file: !490, line: 46, type: !496, isLocal: true, isDefinition: true)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !498)
!498 = !{!499, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !497, file: !407, line: 36, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !497, file: !407, line: 37, baseType: !500, size: 32, offset: 32)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "latency_subs", scope: !461, file: !490, line: 52, type: !496, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !461, file: !490, line: 39, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, elements: !512)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 35, size: 96, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !507, file: !490, line: 36, baseType: !389, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !507, file: !490, line: 37, baseType: !180, size: 8, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !507, file: !490, line: 38, baseType: !422, size: 32, offset: 64)
!512 = !{!513}
!513 = !DISubrange(count: 0)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !461, file: !490, line: 48, type: !477, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !518, file: !525, line: 47, type: !539, isLocal: true, isDefinition: true)
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !520, retainedTypes: !521, globals: !522, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!520 = !{!389}
!521 = !{!234, !109}
!522 = !{!523, !516, !535}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "cpus_states", scope: !518, file: !525, line: 50, type: !526, isLocal: true, isDefinition: true)
!525 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 32, elements: !424)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !390, line: 114, size: 128, elements: !530)
!530 = !{!531, !532, !533, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !529, file: !390, line: 115, baseType: !389, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !529, file: !390, line: 141, baseType: !180, size: 8, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !529, file: !390, line: 149, baseType: !110, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !529, file: !390, line: 156, baseType: !110, size: 32, offset: 96)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !518, file: !525, line: 55, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 8, elements: !424)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, elements: !512)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !542, file: !549, line: 17, type: !675, isLocal: false, isDefinition: true)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !544, globals: !545, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!544 = !{!234, !109, !110, !107}
!545 = !{!540, !546, !671}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !548, file: !549, line: 198, type: !658, isLocal: true, isDefinition: true)
!548 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !549, file: !549, line: 175, type: !550, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !542, retainedNodes: !655)
!549 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!550 = !DISubroutineType(types: !551)
!551 = !{null, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !158, line: 245, size: 1280, elements: !554)
!554 = !{!555, !613, !625, !626, !627, !628, !629, !635, !650}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !553, file: !158, line: 247, baseType: !556, size: 384)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !158, line: 57, size: 384, elements: !557)
!557 = !{!558, !582, !589, !590, !591, !600, !601, !602}
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !158, line: 60, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !158, line: 60, size: 64, elements: !560)
!560 = !{!561, !576}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !559, file: !158, line: 61, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !564)
!564 = !{!565, !571}
!565 = !DIDerivedType(tag: DW_TAG_member, scope: !563, file: !127, line: 38, baseType: !566, size: 32)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !563, file: !127, line: 38, size: 32, elements: !567)
!567 = !{!568, !570}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !566, file: !127, line: 39, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !566, file: !127, line: 40, baseType: !569, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, scope: !563, file: !127, line: 42, baseType: !572, size: 32, offset: 32)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !563, file: !127, line: 42, size: 32, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !572, file: !127, line: 43, baseType: !569, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !572, file: !127, line: 44, baseType: !569, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !559, file: !158, line: 62, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !170, line: 49, size: 64, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !577, file: !170, line: 50, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 64, elements: !175)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !556, file: !158, line: 68, baseType: !583, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !585, file: !122, line: 232, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !563)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !556, file: !158, line: 71, baseType: !180, size: 8, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !556, file: !158, line: 74, baseType: !180, size: 8, offset: 104)
!591 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !158, line: 90, baseType: !592, size: 16, offset: 112)
!592 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !158, line: 90, size: 16, elements: !593)
!593 = !{!594, !599}
!594 = !DIDerivedType(tag: DW_TAG_member, scope: !592, file: !158, line: 91, baseType: !595, size: 16)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !592, file: !158, line: 91, size: 16, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !595, file: !158, line: 96, baseType: !190, size: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !595, file: !158, line: 97, baseType: !180, size: 8, offset: 8)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !592, file: !158, line: 100, baseType: !194, size: 16)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !556, file: !158, line: 107, baseType: !110, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !556, file: !158, line: 127, baseType: !107, size: 32, offset: 160)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !556, file: !158, line: 131, baseType: !603, size: 192, offset: 192)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !604)
!604 = !{!605, !606, !612}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !603, file: !122, line: 245, baseType: !562, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !603, file: !122, line: 246, baseType: !607, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !603, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !553, file: !158, line: 250, baseType: !614, size: 288, offset: 384)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !211, line: 25, size: 288, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !614, file: !211, line: 26, baseType: !110, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !614, file: !211, line: 27, baseType: !110, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !614, file: !211, line: 28, baseType: !110, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !614, file: !211, line: 29, baseType: !110, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !614, file: !211, line: 30, baseType: !110, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !614, file: !211, line: 31, baseType: !110, size: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !614, file: !211, line: 32, baseType: !110, size: 32, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !614, file: !211, line: 33, baseType: !110, size: 32, offset: 224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !614, file: !211, line: 34, baseType: !110, size: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !553, file: !158, line: 253, baseType: !107, size: 32, offset: 672)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !553, file: !158, line: 256, baseType: !584, size: 64, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !553, file: !158, line: 279, baseType: !225, size: 256, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !553, file: !158, line: 294, baseType: !109, size: 32, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !553, file: !158, line: 300, baseType: !630, size: 96, offset: 1056)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !158, line: 149, size: 96, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !158, line: 153, baseType: !22, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !158, line: 162, baseType: !234, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !630, file: !158, line: 168, baseType: !234, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !553, file: !158, line: 325, baseType: !636, size: 32, offset: 1152)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !638)
!638 = !{!639, !645, !646}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !637, file: !118, line: 5074, baseType: !640, size: 96)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !243, line: 56, size: 96, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !640, file: !243, line: 57, baseType: !246, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !640, file: !243, line: 58, baseType: !107, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !640, file: !243, line: 59, baseType: !234, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !637, file: !118, line: 5075, baseType: !584, size: 64, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !637, file: !118, line: 5076, baseType: !647, size: 32, offset: 160)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !253, line: 43, size: 32, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !647, file: !253, line: 52, baseType: !22, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !553, file: !158, line: 343, baseType: !651, size: 64, offset: 1184)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !211, line: 60, size: 64, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !651, file: !211, line: 63, baseType: !110, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !651, file: !211, line: 66, baseType: !110, size: 32, offset: 32)
!655 = !{!656, !657}
!656 = !DILocalVariable(name: "thread", arg: 1, scope: !548, file: !549, line: 175, type: !552)
!657 = !DILocalVariable(name: "region_num", scope: !548, file: !549, line: 200, type: !180)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, elements: !512)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !660, line: 52, size: 96, elements: !661)
!660 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !659, file: !660, line: 53, baseType: !22, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !659, file: !660, line: 54, baseType: !234, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !659, file: !660, line: 55, baseType: !665, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !666, line: 304, baseType: !667)
!666 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !666, line: 301, size: 32, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !667, file: !666, line: 302, baseType: !194, size: 16)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !667, file: !666, line: 303, baseType: !194, size: 16, offset: 16)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "static_regions", scope: !542, file: !549, line: 62, type: !673, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 96, elements: !424)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !676, file: !291, line: 17, baseType: !279, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !676, file: !291, line: 18, baseType: !180, size: 8, offset: 32)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !682, file: !736, line: 39, type: !180, isLocal: true, isDefinition: true)
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !684, globals: !727, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!684 = !{!685, !107, !109, !713}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !687, line: 1495, baseType: !688)
!687 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 1474, size: 448, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !703}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !688, file: !687, line: 1476, baseType: !328, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !688, file: !687, line: 1477, baseType: !329, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !688, file: !687, line: 1478, baseType: !329, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !688, file: !687, line: 1479, baseType: !329, size: 32, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !688, file: !687, line: 1480, baseType: !329, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !688, file: !687, line: 1481, baseType: !329, size: 32, offset: 160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !688, file: !687, line: 1482, baseType: !329, size: 32, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !688, file: !687, line: 1483, baseType: !329, size: 32, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !688, file: !687, line: 1484, baseType: !329, size: 32, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !688, file: !687, line: 1485, baseType: !329, size: 32, offset: 288)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !688, file: !687, line: 1486, baseType: !329, size: 32, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !688, file: !687, line: 1487, baseType: !702, size: 32, offset: 352)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 32, elements: !424)
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !688, file: !687, line: 1488, baseType: !704, size: 64, offset: 384)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !688, file: !687, line: 1488, size: 64, elements: !705)
!705 = !{!706, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !704, file: !687, line: 1489, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 64, elements: !175)
!708 = !DIDerivedType(tag: DW_TAG_member, scope: !704, file: !687, line: 1490, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !687, line: 1490, size: 64, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !709, file: !687, line: 1491, baseType: !329, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !709, file: !687, line: 1492, baseType: !329, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !716, line: 27, size: 128, elements: !717)
!716 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !715, file: !716, line: 29, baseType: !110, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !716, line: 31, baseType: !279, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !715, file: !716, line: 37, baseType: !721, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !666, line: 298, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !666, line: 289, size: 64, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !722, file: !666, line: 291, baseType: !180, size: 5, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !722, file: !666, line: 293, baseType: !180, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !722, file: !666, line: 295, baseType: !110, size: 32, offset: 32)
!727 = !{!680, !728}
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !682, file: !730, line: 31, type: !731, isLocal: true, isDefinition: true)
!730 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 160, elements: !424)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !730, line: 21, size: 160, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !732, file: !730, line: 22, baseType: !109, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !732, file: !730, line: 23, baseType: !715, size: 128, offset: 32)
!736 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !739, file: !746, line: 21, type: !302, isLocal: true, isDefinition: true)
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !741, globals: !745, splitDebugInlining: false, nameTableKind: None)
!740 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!741 = !{!742, !109, !107}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !744, line: 22, baseType: !109)
!744 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = !{!737}
!746 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !749, file: !754, line: 13, type: !773, isLocal: true, isDefinition: true)
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !751, splitDebugInlining: false, nameTableKind: None)
!750 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!751 = !{!752, !747}
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "mpu_config", scope: !749, file: !754, line: 37, type: !755, isLocal: false, isDefinition: true)
!754 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !716, line: 41, size: 64, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !756, file: !716, line: 43, baseType: !110, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !756, file: !716, line: 45, baseType: !760, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !716, line: 27, size: 128, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !762, file: !716, line: 29, baseType: !110, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !716, line: 31, baseType: !279, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !762, file: !716, line: 37, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !666, line: 298, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !666, line: 289, size: 64, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !768, file: !666, line: 291, baseType: !180, size: 5, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !768, file: !666, line: 293, baseType: !180, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !768, file: !666, line: 295, baseType: !110, size: 32, offset: 32)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 256, elements: !175)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !776, file: !980, line: 18, type: !1216, isLocal: false, isDefinition: true)
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !778, retainedTypes: !896, globals: !976, splitDebugInlining: false, nameTableKind: None)
!777 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/kernel/condition_variables/condvar")
!778 = !{!779, !785, !30, !790, !795, !799, !803, !807, !813, !817, !861, !868, !887}
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !780, line: 23, baseType: !32, size: 32, elements: !781)
!780 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!781 = !{!782, !783, !784}
!782 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!783 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!784 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !780, line: 48, baseType: !32, size: 32, elements: !786)
!786 = !{!787, !788, !789}
!787 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!788 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!789 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !791, line: 167, baseType: !32, size: 32, elements: !792)
!791 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!792 = !{!793, !794}
!793 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!794 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !791, line: 107, baseType: !32, size: 32, elements: !796)
!796 = !{!797, !798}
!797 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!798 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!799 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !791, line: 208, baseType: !32, size: 32, elements: !800)
!800 = !{!801, !802}
!801 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!802 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !791, line: 261, baseType: !32, size: 32, elements: !804)
!804 = !{!805, !806}
!805 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!806 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !791, line: 237, baseType: !32, size: 32, elements: !808)
!808 = !{!809, !810, !811, !812}
!809 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!810 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!811 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!812 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!813 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !791, line: 152, baseType: !32, size: 32, elements: !814)
!814 = !{!815, !816}
!815 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!816 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!817 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 71, baseType: !109, size: 32, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!819 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!820 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!821 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!822 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!823 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!824 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!825 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!826 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!827 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!828 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!829 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!830 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!831 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!832 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!833 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!834 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!835 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!836 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!837 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!838 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!839 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!840 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!841 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!842 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!843 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!844 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!845 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!846 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!847 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!848 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!849 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!850 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!851 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!852 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!853 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!854 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!855 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!856 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!857 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!858 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!859 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!860 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !862, line: 44, baseType: !32, size: 32, elements: !863)
!862 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!863 = !{!864, !865, !866, !867}
!864 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!865 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!866 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!867 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!868 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !869, line: 54, baseType: !32, size: 32, elements: !870)
!869 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!871 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!872 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!873 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!874 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!875 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!876 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!877 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!878 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!879 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!880 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!881 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!882 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!883 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!884 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!885 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!886 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 53, baseType: !32, size: 32, elements: !889)
!888 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!891 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!892 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!893 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!894 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!895 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!896 = !{!779, !107, !109, !897, !939, !940, !941, !942, !103, !110, !111, !943, !944, !286, !477, !945, !975, !234}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !323, line: 923, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 883, size: 10464, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !909, !910, !911, !912, !913, !914, !915, !916, !920, !921, !922, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !899, file: !323, line: 884, baseType: !329, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !899, file: !323, line: 885, baseType: !329, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !899, file: !323, line: 886, baseType: !329, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !899, file: !323, line: 887, baseType: !329, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !899, file: !323, line: 888, baseType: !906, size: 896, offset: 128)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 896, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 28)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !899, file: !323, line: 889, baseType: !329, size: 32, offset: 1024)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !899, file: !323, line: 890, baseType: !329, size: 32, offset: 1056)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !899, file: !323, line: 891, baseType: !329, size: 32, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !899, file: !323, line: 892, baseType: !329, size: 32, offset: 1120)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !899, file: !323, line: 893, baseType: !906, size: 896, offset: 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !899, file: !323, line: 894, baseType: !329, size: 32, offset: 2048)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !899, file: !323, line: 895, baseType: !329, size: 32, offset: 2080)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !899, file: !323, line: 896, baseType: !917, size: 960, offset: 2112)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 960, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 30)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !899, file: !323, line: 897, baseType: !329, size: 32, offset: 3072)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !899, file: !323, line: 898, baseType: !329, size: 32, offset: 3104)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !899, file: !323, line: 899, baseType: !923, size: 3008, offset: 3136)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 3008, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 94)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !899, file: !323, line: 900, baseType: !329, size: 32, offset: 6144)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !899, file: !323, line: 901, baseType: !329, size: 32, offset: 6176)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !899, file: !323, line: 902, baseType: !329, size: 32, offset: 6208)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !899, file: !323, line: 903, baseType: !328, size: 32, offset: 6240)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !899, file: !323, line: 904, baseType: !336, size: 1984, offset: 6272)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !899, file: !323, line: 905, baseType: !328, size: 32, offset: 8256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !899, file: !323, line: 907, baseType: !328, size: 32, offset: 8288)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !899, file: !323, line: 910, baseType: !328, size: 32, offset: 8320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !899, file: !323, line: 911, baseType: !328, size: 32, offset: 8352)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !899, file: !323, line: 913, baseType: !328, size: 32, offset: 8384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !899, file: !323, line: 917, baseType: !328, size: 32, offset: 8416)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !899, file: !323, line: 919, baseType: !336, size: 1984, offset: 8448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !899, file: !323, line: 920, baseType: !329, size: 32, offset: 10432)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !791, line: 146, baseType: !795)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !791, line: 164, baseType: !813)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!943 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !687, line: 485, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 468, size: 28704, elements: !948)
!948 = !{!949, !953, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !970, !974}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !947, file: !687, line: 470, baseType: !950, size: 512)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 512, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 16)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !947, file: !687, line: 471, baseType: !954, size: 512, offset: 512)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 512, elements: !951)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !947, file: !687, line: 472, baseType: !950, size: 512, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !947, file: !687, line: 473, baseType: !954, size: 512, offset: 1536)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !947, file: !687, line: 474, baseType: !950, size: 512, offset: 2048)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !947, file: !687, line: 475, baseType: !954, size: 512, offset: 2560)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !947, file: !687, line: 476, baseType: !950, size: 512, offset: 3072)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !947, file: !687, line: 477, baseType: !954, size: 512, offset: 3584)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !947, file: !687, line: 478, baseType: !950, size: 512, offset: 4096)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !947, file: !687, line: 479, baseType: !954, size: 512, offset: 4608)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !947, file: !687, line: 480, baseType: !950, size: 512, offset: 5120)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !947, file: !687, line: 481, baseType: !954, size: 512, offset: 5632)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !947, file: !687, line: 482, baseType: !966, size: 3968, offset: 6144)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 3968, elements: !968)
!967 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !180)
!968 = !{!969}
!969 = !DISubrange(count: 496)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !947, file: !687, line: 483, baseType: !971, size: 18560, offset: 10112)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 18560, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 580)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !947, file: !687, line: 484, baseType: !329, size: 32, offset: 28672)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !862, line: 56, baseType: !107)
!976 = !{!774, !977, !1029, !1070, !1078, !1095, !1106, !1108, !1125, !1127, !1137, !1140, !1156, !1194, !1208}
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "on", scope: !979, file: !980, line: 549, type: !422, isLocal: true, isDefinition: true)
!979 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !980, file: !980, line: 547, type: !981, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !776, retainedNodes: !983)
!980 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!981 = !DISubroutineType(types: !982)
!982 = !{null, !785}
!983 = !{!984, !985, !988}
!984 = !DILocalVariable(name: "start_mode", arg: 1, scope: !979, file: !980, line: 547, type: !785)
!985 = !DILocalVariable(name: "err", scope: !986, file: !980, line: 553, type: !109)
!986 = distinct !DILexicalBlock(scope: !987, file: !980, line: 552, column: 31)
!987 = distinct !DILexicalBlock(scope: !979, file: !980, line: 552, column: 6)
!988 = !DILocalVariable(name: "mgr", scope: !986, file: !980, line: 554, type: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !991, line: 154, size: 256, elements: !992)
!991 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!992 = !{!993, !1005, !1006, !1022, !1026, !1027, !1028}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !990, file: !991, line: 158, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !996)
!996 = !{!997, !1004}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !995, file: !407, line: 36, baseType: !998, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !1001)
!1001 = !{!1002}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1000, file: !407, line: 30, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !995, file: !407, line: 37, baseType: !998, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !990, file: !991, line: 163, baseType: !994, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !990, file: !991, line: 166, baseType: !1007, size: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !991, line: 133, size: 96, elements: !1010)
!1010 = !{!1011, !1020, !1021}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1009, file: !991, line: 135, baseType: !1012, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !991, line: 129, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !989, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !991, line: 101, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !989, !109}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1009, file: !991, line: 138, baseType: !1012, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1009, file: !991, line: 143, baseType: !1012, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !990, file: !991, line: 169, baseType: !1023, size: 32, offset: 160)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !253, line: 43, size: 32, elements: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !1023, file: !253, line: 52, baseType: !22, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !990, file: !991, line: 172, baseType: !109, size: 32, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !990, file: !991, line: 175, baseType: !194, size: 16, offset: 224)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !990, file: !991, line: 178, baseType: !194, size: 16, offset: 240)
