; ModuleID = 'build/adafruit_feather_nrf52840/drivers/counter/alarm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.counter_alarm_cfg = type { void (%struct.device*, i8, i32, i8*)*, i32, i8*, i32 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "alarm_cfg", scope: !27, file: !228, line: 16, type: !176, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !227, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/counter/alarm/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !120, !167}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_config_info", file: !112, line: 169, size: 96, elements: !113)
!112 = !DIFile(filename: "zephyr/include/zephyr/drivers/counter.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !{!114, !115, !116, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "max_top_value", scope: !111, file: !112, line: 170, baseType: !102, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !111, file: !112, line: 171, baseType: !102, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !111, file: !112, line: 172, baseType: !117, size: 8, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !111, file: !112, line: 173, baseType: !117, size: 8, offset: 72)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_driver_api", file: !112, line: 198, size: 384, elements: !122)
!122 = !{!123, !153, !155, !161, !169, !186, !191, !208, !213, !215, !220, !225}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !121, file: !112, line: 199, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_start", file: !112, line: 176, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DISubroutineType(types: !127)
!127 = !{!108, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !131, line: 378, size: 192, elements: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = !{!133, !137, !138, !139, !146, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !131, line: 380, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !130, file: !131, line: 382, baseType: !13, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !130, file: !131, line: 384, baseType: !13, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !130, file: !131, line: 386, baseType: !140, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !131, line: 351, size: 16, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !141, file: !131, line: 359, baseType: !117, size: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !141, file: !131, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !130, file: !131, line: 388, baseType: !107, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !130, file: !131, line: 396, baseType: !148, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !131, line: 43, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !121, file: !112, line: 200, baseType: !154, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_stop", file: !112, line: 177, baseType: !125)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "get_value", scope: !121, file: !112, line: 201, baseType: !156, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_value", file: !112, line: 178, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DISubroutineType(types: !159)
!159 = !{!108, !128, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "get_value_64", scope: !121, file: !112, line: 202, baseType: !162, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_value_64", file: !112, line: 180, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{!108, !128, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !168)
!168 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "set_alarm", scope: !121, file: !112, line: 203, baseType: !170, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_alarm", file: !112, line: 182, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DISubroutineType(types: !173)
!173 = !{!108, !128, !117, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_alarm_cfg", file: !112, line: 129, size: 128, elements: !177)
!177 = !{!178, !183, !184, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !176, file: !112, line: 130, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_alarm_callback_t", file: !112, line: 111, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !128, !117, !102, !107}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !176, file: !112, line: 131, baseType: !102, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !176, file: !112, line: 132, baseType: !107, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !112, line: 133, baseType: !102, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_alarm", scope: !121, file: !112, line: 204, baseType: !187, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_cancel_alarm", file: !112, line: 185, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!108, !128, !117}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "set_top_value", scope: !121, file: !112, line: 205, baseType: !192, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_top_value", file: !112, line: 187, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!108, !128, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_top_cfg", file: !112, line: 152, size: 128, elements: !199)
!199 = !{!200, !201, !206, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !198, file: !112, line: 153, baseType: !102, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !198, file: !112, line: 154, baseType: !202, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_top_callback_t", file: !112, line: 141, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !128, !107}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !198, file: !112, line: 155, baseType: !107, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !198, file: !112, line: 156, baseType: !102, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !121, file: !112, line: 206, baseType: !209, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_pending_int", file: !112, line: 189, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!102, !128}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "get_top_value", scope: !121, file: !112, line: 207, baseType: !214, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_top_value", file: !112, line: 190, baseType: !210)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "get_guard_period", scope: !121, file: !112, line: 208, baseType: !216, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_guard_period", file: !112, line: 191, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{!102, !128, !102}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "set_guard_period", scope: !121, file: !112, line: 209, baseType: !221, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_guard_period", file: !112, line: 193, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{!108, !128, !102, !102}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "get_freq", scope: !121, file: !112, line: 210, baseType: !226, size: 32, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_freq", file: !112, line: 196, baseType: !210)
!227 = !{!25}
!228 = !DIFile(filename: "zephyr/samples/drivers/counter/alarm/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "_char_out", scope: !231, file: !235, line: 54, type: !236, isLocal: false, isDefinition: true)
!231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !232, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !233, globals: !234, splitDebugInlining: false, nameTableKind: None)
!232 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!233 = !{!107, !108}
!234 = !{!229}
!235 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DISubroutineType(types: !238)
!238 = !{!108, !108}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !241, file: !276, line: 27, type: !303, isLocal: true, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !243, retainedTypes: !255, globals: !273, splitDebugInlining: false, nameTableKind: None)
!242 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!243 = !{!244, !30}
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !245, line: 27, baseType: !32, size: 32, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254}
!247 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!248 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!249 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!250 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!251 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!252 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!253 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!254 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!255 = !{!107, !103, !108, !24, !256, !272, !102, !167}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !258, line: 54, size: 96, elements: !259)
!258 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !{!260, !267, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !257, file: !258, line: 55, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !263)
!262 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !262, line: 30, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !257, file: !258, line: 60, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !244}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !257, file: !258, line: 65, baseType: !268, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!273 = !{!239, !274, !280, !282, !293, !295}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !241, file: !276, line: 44, type: !277, isLocal: true, isDefinition: true)
!276 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !241, file: !276, line: 49, type: !277, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !241, file: !276, line: 36, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 128, elements: !291)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !245, line: 114, size: 128, elements: !286)
!286 = !{!287, !288, !289, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !285, file: !245, line: 115, baseType: !244, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !285, file: !245, line: 141, baseType: !117, size: 8, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !285, file: !245, line: 149, baseType: !102, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !285, file: !245, line: 156, baseType: !102, size: 32, offset: 96)
!291 = !{!292}
!292 = !DISubrange(count: 1)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !241, file: !276, line: 40, type: !284, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !241, file: !276, line: 28, type: !297, isLocal: true, isDefinition: true)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !299)
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !298, file: !262, line: 36, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !298, file: !262, line: 37, baseType: !301, size: 32, offset: 32)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 32, elements: !291)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !305, line: 22, baseType: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!307 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!308 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !311, file: !340, line: 50, type: !327, isLocal: true, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !243, retainedTypes: !313, globals: !337, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!313 = !{!151, !103, !314, !108, !107, !102, !167, !316, !272, !327, !328}
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !315, line: 214, baseType: !32)
!315 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !318, line: 45, size: 64, elements: !319)
!318 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = !{!320, !326}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !317, file: !318, line: 46, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !262, line: 30, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !317, file: !318, line: 48, baseType: !102, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !318, line: 38, size: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !329, file: !318, line: 39, baseType: !321, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !329, file: !318, line: 41, baseType: !333, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !318, line: 35, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !327}
!337 = !{!338, !342, !350, !309, !352, !362}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "latency_lock", scope: !311, file: !340, line: 44, type: !341, isLocal: true, isDefinition: true)
!340 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !311, file: !340, line: 46, type: !344, isLocal: true, isDefinition: true)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !345, file: !262, line: 36, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !345, file: !262, line: 37, baseType: !348, size: 32, offset: 32)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "latency_subs", scope: !311, file: !340, line: 52, type: !344, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !311, file: !340, line: 39, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, elements: !360)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 35, size: 96, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !340, line: 36, baseType: !244, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !355, file: !340, line: 37, baseType: !117, size: 8, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !355, file: !340, line: 38, baseType: !304, size: 32, offset: 64)
!360 = !{!361}
!361 = !DISubrange(count: 0)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !311, file: !340, line: 48, type: !327, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !366, file: !373, line: 47, type: !387, isLocal: true, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !368, retainedTypes: !369, globals: !370, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!368 = !{!244}
!369 = !{!314, !108}
!370 = !{!371, !364, !383}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "cpus_states", scope: !366, file: !373, line: 50, type: !374, isLocal: true, isDefinition: true)
!373 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 32, elements: !291)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !245, line: 114, size: 128, elements: !378)
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !245, line: 115, baseType: !244, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !377, file: !245, line: 141, baseType: !117, size: 8, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !377, file: !245, line: 149, baseType: !102, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !377, file: !245, line: 156, baseType: !102, size: 32, offset: 96)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !366, file: !373, line: 55, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 8, elements: !291)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, elements: !360)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "static_regions", scope: !390, file: !397, line: 62, type: !530, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!392 = !{!314, !108, !102, !107}
!393 = !{!394, !388}
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !396, file: !397, line: 198, type: !518, isLocal: true, isDefinition: true)
!396 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !397, file: !397, line: 175, type: !398, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !515)
!397 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DISubroutineType(types: !399)
!399 = !{null, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !402, line: 245, size: 1024, elements: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !471, !484, !485, !486, !487, !493, !510}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !401, file: !402, line: 247, baseType: !405, size: 384)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !402, line: 57, size: 384, elements: !406)
!406 = !{!407, !435, !443, !444, !445, !458, !459, !460}
!407 = !DIDerivedType(tag: DW_TAG_member, scope: !405, file: !402, line: 60, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !405, file: !402, line: 60, size: 64, elements: !409)
!409 = !{!410, !426}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !408, file: !402, line: 61, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !412, line: 49, baseType: !413)
!412 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !412, line: 37, size: 64, elements: !414)
!414 = !{!415, !421}
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !413, file: !412, line: 38, baseType: !416, size: 32)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !412, line: 38, size: 32, elements: !417)
!417 = !{!418, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !416, file: !412, line: 39, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !416, file: !412, line: 40, baseType: !419, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, scope: !413, file: !412, line: 42, baseType: !422, size: 32, offset: 32)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !412, line: 42, size: 32, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !422, file: !412, line: 43, baseType: !419, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !422, file: !412, line: 44, baseType: !419, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !408, file: !402, line: 62, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !428, line: 49, size: 64, elements: !429)
!428 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !427, file: !428, line: 50, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 64, elements: !433)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!433 = !{!434}
!434 = !DISubrange(count: 2)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !405, file: !402, line: 68, baseType: !436, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !438, line: 233, baseType: !439)
!438 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 231, size: 64, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !439, file: !438, line: 232, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !412, line: 48, baseType: !413)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !405, file: !402, line: 71, baseType: !117, size: 8, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !405, file: !402, line: 74, baseType: !117, size: 8, offset: 104)
!445 = !DIDerivedType(tag: DW_TAG_member, scope: !405, file: !402, line: 90, baseType: !446, size: 16, offset: 112)
!446 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !405, file: !402, line: 90, size: 16, elements: !447)
!447 = !{!448, !455}
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !402, line: 91, baseType: !449, size: 16)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !402, line: 91, size: 16, elements: !450)
!450 = !{!451, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !449, file: !402, line: 96, baseType: !452, size: 8)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !453)
!453 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !449, file: !402, line: 97, baseType: !117, size: 8, offset: 8)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !446, file: !402, line: 100, baseType: !456, size: 16)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !457)
!457 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !405, file: !402, line: 107, baseType: !102, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !405, file: !402, line: 127, baseType: !107, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !405, file: !402, line: 131, baseType: !461, size: 192, offset: 192)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !438, line: 244, size: 192, elements: !462)
!462 = !{!463, !464, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !461, file: !438, line: 245, baseType: !411, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !461, file: !438, line: 246, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !438, line: 242, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !461, file: !438, line: 249, baseType: !105, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !401, file: !402, line: 250, baseType: !472, size: 288, offset: 384)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !473, line: 25, size: 288, elements: !474)
!473 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !472, file: !473, line: 26, baseType: !102, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !472, file: !473, line: 27, baseType: !102, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !472, file: !473, line: 28, baseType: !102, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !472, file: !473, line: 29, baseType: !102, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !472, file: !473, line: 30, baseType: !102, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !472, file: !473, line: 31, baseType: !102, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !472, file: !473, line: 32, baseType: !102, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !472, file: !473, line: 33, baseType: !102, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !472, file: !473, line: 34, baseType: !102, size: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !401, file: !402, line: 253, baseType: !107, size: 32, offset: 672)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !401, file: !402, line: 256, baseType: !437, size: 64, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !401, file: !402, line: 294, baseType: !108, size: 32, offset: 768)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !401, file: !402, line: 300, baseType: !488, size: 96, offset: 800)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !402, line: 149, size: 96, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !488, file: !402, line: 153, baseType: !22, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !488, file: !402, line: 162, baseType: !314, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !488, file: !402, line: 168, baseType: !314, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !401, file: !402, line: 325, baseType: !494, size: 32, offset: 896)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !496, line: 5073, size: 160, elements: !497)
!496 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !{!498, !507, !508}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !495, file: !496, line: 5074, baseType: !499, size: 96)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !500, line: 56, size: 96, elements: !501)
!500 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!501 = !{!502, !505, !506}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !499, file: !500, line: 57, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !500, line: 57, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !499, file: !500, line: 58, baseType: !107, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !499, file: !500, line: 59, baseType: !314, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !495, file: !496, line: 5075, baseType: !437, size: 64, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !495, file: !496, line: 5076, baseType: !509, offset: 160)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !401, file: !402, line: 343, baseType: !511, size: 64, offset: 928)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !473, line: 60, size: 64, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !511, file: !473, line: 63, baseType: !102, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !511, file: !473, line: 66, baseType: !102, size: 32, offset: 32)
!515 = !{!516, !517}
!516 = !DILocalVariable(name: "thread", arg: 1, scope: !396, file: !397, line: 175, type: !400)
!517 = !DILocalVariable(name: "region_num", scope: !396, file: !397, line: 200, type: !117)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, elements: !360)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !520, line: 52, size: 96, elements: !521)
!520 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!521 = !{!522, !523, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !519, file: !520, line: 53, baseType: !22, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !520, line: 54, baseType: !314, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !519, file: !520, line: 55, baseType: !525, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !526, line: 151, baseType: !527)
!526 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 149, size: 32, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !527, file: !526, line: 150, baseType: !102, size: 32)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 96, elements: !291)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !534, file: !568, line: 39, type: !117, isLocal: true, isDefinition: true)
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !536, globals: !567, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!536 = !{!537, !107, !108, !555, !117}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !539, line: 1226, baseType: !540)
!539 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 1213, size: 352, elements: !541)
!541 = !{!542, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !540, file: !539, line: 1215, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !540, file: !539, line: 1216, baseType: !544, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !540, file: !539, line: 1217, baseType: !544, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !540, file: !539, line: 1218, baseType: !544, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !540, file: !539, line: 1219, baseType: !544, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !540, file: !539, line: 1220, baseType: !544, size: 32, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !540, file: !539, line: 1221, baseType: !544, size: 32, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !540, file: !539, line: 1222, baseType: !544, size: 32, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !540, file: !539, line: 1223, baseType: !544, size: 32, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !540, file: !539, line: 1224, baseType: !544, size: 32, offset: 288)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !540, file: !539, line: 1225, baseType: !544, size: 32, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !558, line: 27, size: 96, elements: !559)
!558 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!559 = !{!560, !561, !562}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !557, file: !558, line: 29, baseType: !102, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !557, file: !558, line: 31, baseType: !134, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !557, file: !558, line: 37, baseType: !563, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !526, line: 146, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !526, line: 141, size: 32, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !564, file: !526, line: 143, baseType: !102, size: 32)
!567 = !{!532}
!568 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !571, file: !578, line: 21, type: !236, isLocal: true, isDefinition: true)
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !573, globals: !577, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!573 = !{!574, !108, !107}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !576, line: 22, baseType: !108)
!576 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!577 = !{!569}
!578 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !581, file: !586, line: 13, type: !603, isLocal: true, isDefinition: true)
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !583, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!583 = !{!584, !579}
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "mpu_config", scope: !581, file: !586, line: 37, type: !587, isLocal: false, isDefinition: true)
!586 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !558, line: 41, size: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !588, file: !558, line: 43, baseType: !102, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !588, file: !558, line: 45, baseType: !592, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !558, line: 27, size: 96, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !594, file: !558, line: 29, baseType: !102, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !594, file: !558, line: 31, baseType: !134, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !594, file: !558, line: 37, baseType: !599, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !526, line: 146, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !526, line: 141, size: 32, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !600, file: !526, line: 143, baseType: !102, size: 32)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 192, elements: !433)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !606, file: !776, line: 93, type: !777, isLocal: true, isDefinition: true, align: 32)
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !608, globals: !771, splitDebugInlining: false, nameTableKind: None)
!607 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!608 = !{!609, !117, !107, !108, !689, !102, !690, !726, !737}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !611, line: 1071, baseType: !612)
!611 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 1035, size: 19584, elements: !613)
!613 = !{!614, !618, !619, !620, !624, !625, !627, !628, !629, !630, !631, !632, !636, !637, !638, !642, !643, !647, !648, !652, !653, !657, !658, !659, !660, !661, !662, !663, !667, !668, !669, !670, !674, !675, !679}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !612, file: !611, line: 1036, baseType: !615, size: 960)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 960, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 30)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !612, file: !611, line: 1037, baseType: !544, size: 32, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !612, file: !611, line: 1038, baseType: !544, size: 32, offset: 992)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !612, file: !611, line: 1039, baseType: !621, size: 1088, offset: 1024)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1088, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 34)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !612, file: !611, line: 1040, baseType: !544, size: 32, offset: 2112)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !612, file: !611, line: 1041, baseType: !626, size: 64, offset: 2144)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 64, elements: !433)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !612, file: !611, line: 1042, baseType: !544, size: 32, offset: 2208)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !612, file: !611, line: 1043, baseType: !544, size: 32, offset: 2240)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !612, file: !611, line: 1044, baseType: !544, size: 32, offset: 2272)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !612, file: !611, line: 1045, baseType: !544, size: 32, offset: 2304)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !612, file: !611, line: 1046, baseType: !544, size: 32, offset: 2336)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !612, file: !611, line: 1047, baseType: !633, size: 3808, offset: 2368)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 3808, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 119)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !612, file: !611, line: 1048, baseType: !544, size: 32, offset: 6176)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !612, file: !611, line: 1049, baseType: !544, size: 32, offset: 6208)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !612, file: !611, line: 1050, baseType: !639, size: 1952, offset: 6240)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1952, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 61)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !612, file: !611, line: 1051, baseType: !544, size: 32, offset: 8192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !612, file: !611, line: 1052, baseType: !644, size: 288, offset: 8224)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 288, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 9)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !612, file: !611, line: 1053, baseType: !543, size: 32, offset: 8512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !612, file: !611, line: 1054, baseType: !649, size: 96, offset: 8544)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 96, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 3)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !612, file: !611, line: 1055, baseType: !543, size: 32, offset: 8640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !612, file: !611, line: 1056, baseType: !654, size: 1568, offset: 8672)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1568, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 49)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !612, file: !611, line: 1057, baseType: !544, size: 32, offset: 10240)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !612, file: !611, line: 1058, baseType: !649, size: 96, offset: 10272)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !612, file: !611, line: 1059, baseType: !544, size: 32, offset: 10368)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !612, file: !611, line: 1060, baseType: !626, size: 64, offset: 10400)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !612, file: !611, line: 1061, baseType: !544, size: 32, offset: 10464)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !612, file: !611, line: 1062, baseType: !544, size: 32, offset: 10496)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !612, file: !611, line: 1063, baseType: !664, size: 672, offset: 10528)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 672, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 21)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !612, file: !611, line: 1064, baseType: !544, size: 32, offset: 11200)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !612, file: !611, line: 1065, baseType: !543, size: 32, offset: 11232)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !612, file: !611, line: 1066, baseType: !544, size: 32, offset: 11264)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !612, file: !611, line: 1067, baseType: !671, size: 1504, offset: 11296)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1504, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 47)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !612, file: !611, line: 1068, baseType: !543, size: 32, offset: 12800)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !612, file: !611, line: 1069, baseType: !676, size: 5600, offset: 12832)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 5600, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 175)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !612, file: !611, line: 1070, baseType: !680, size: 1152, offset: 18432)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 1152, elements: !645)
!681 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !611, line: 278, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 272, size: 128, elements: !684)
!684 = !{!685, !686, !687, !688}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !683, file: !611, line: 273, baseType: !544, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !683, file: !611, line: 274, baseType: !544, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !683, file: !611, line: 275, baseType: !544, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !683, file: !611, line: 277, baseType: !543, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !539, line: 468, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 445, size: 1120, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !719, !723, !725}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !692, file: !539, line: 447, baseType: !543, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !692, file: !539, line: 448, baseType: !544, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !692, file: !539, line: 449, baseType: !544, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !692, file: !539, line: 450, baseType: !544, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !692, file: !539, line: 451, baseType: !544, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !692, file: !539, line: 452, baseType: !544, size: 32, offset: 160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !692, file: !539, line: 453, baseType: !701, size: 96, offset: 192)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 96, elements: !703)
!702 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!703 = !{!704}
!704 = !DISubrange(count: 12)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !692, file: !539, line: 454, baseType: !544, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !692, file: !539, line: 455, baseType: !544, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !692, file: !539, line: 456, baseType: !544, size: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !692, file: !539, line: 457, baseType: !544, size: 32, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !692, file: !539, line: 458, baseType: !544, size: 32, offset: 416)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !692, file: !539, line: 459, baseType: !544, size: 32, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !692, file: !539, line: 460, baseType: !544, size: 32, offset: 480)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !692, file: !539, line: 461, baseType: !626, size: 64, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !692, file: !539, line: 462, baseType: !543, size: 32, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !692, file: !539, line: 463, baseType: !543, size: 32, offset: 608)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !692, file: !539, line: 464, baseType: !716, size: 128, offset: 640)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 128, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 4)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !692, file: !539, line: 465, baseType: !720, size: 160, offset: 768)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 160, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 5)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !692, file: !539, line: 466, baseType: !724, size: 160, offset: 928)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 160, elements: !721)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !692, file: !539, line: 467, baseType: !544, size: 32, offset: 1088)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !728, file: !727, line: 167, baseType: !736)
!727 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!728 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !727, file: !727, line: 134, type: !729, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !606, retainedNodes: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !102}
!731 = !{!732, !733, !735}
!732 = !DILocalVariable(name: "time_us", arg: 1, scope: !728, file: !727, line: 134, type: !102)
!733 = !DILocalVariable(name: "delay_cycles", scope: !728, file: !727, line: 168, type: !734)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!735 = !DILocalVariable(name: "cycles", scope: !728, file: !727, line: 171, type: !102)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !611, line: 2399, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 2373, size: 10880, elements: !740)
!740 = !{!741, !745, !746, !747, !748, !752, !753, !758, !759, !760, !761, !762, !763, !767, !768, !769, !770}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !739, file: !611, line: 2374, baseType: !742, size: 8192)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 8192, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !739, file: !611, line: 2375, baseType: !543, size: 32, offset: 8192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !739, file: !611, line: 2376, baseType: !543, size: 32, offset: 8224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !739, file: !611, line: 2377, baseType: !543, size: 32, offset: 8256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !739, file: !611, line: 2378, baseType: !749, size: 1984, offset: 8288)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1984, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 62)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !739, file: !611, line: 2379, baseType: !544, size: 32, offset: 10272)
!753 = !DIDerivedType(tag: DW_TAG_member, scope: !739, file: !611, line: 2381, baseType: !754, size: 32, offset: 10304)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !739, file: !611, line: 2381, size: 32, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !754, file: !611, line: 2382, baseType: !544, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !754, file: !611, line: 2383, baseType: !544, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !739, file: !611, line: 2386, baseType: !544, size: 32, offset: 10336)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !739, file: !611, line: 2387, baseType: !544, size: 32, offset: 10368)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !739, file: !611, line: 2389, baseType: !544, size: 32, offset: 10400)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !739, file: !611, line: 2391, baseType: !544, size: 32, offset: 10432)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !739, file: !611, line: 2393, baseType: !544, size: 32, offset: 10464)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !739, file: !611, line: 2394, baseType: !764, size: 256, offset: 10496)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 256, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 8)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !739, file: !611, line: 2395, baseType: !544, size: 32, offset: 10752)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !739, file: !611, line: 2396, baseType: !543, size: 32, offset: 10784)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !739, file: !611, line: 2397, baseType: !544, size: 32, offset: 10816)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !739, file: !611, line: 2398, baseType: !544, size: 32, offset: 10848)
!771 = !{!604, !772}
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !728, file: !727, line: 161, type: !774, isLocal: true, isDefinition: true, align: 128)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 48, elements: !650)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!776 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !779, line: 51, size: 64, elements: !780)
!779 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!780 = !{!781, !788}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !778, file: !779, line: 60, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{!108, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !779, line: 48, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !778, file: !779, line: 65, baseType: !785, size: 32, offset: 32)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !791, file: !1026, line: 733, type: !1127, isLocal: false, isDefinition: true, align: 32)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !793, retainedTypes: !936, globals: !1022, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/counter/alarm")
!793 = !{!794, !800, !30, !805, !810, !817, !825, !833, !842, !846, !901, !908, !927}
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !795, line: 23, baseType: !32, size: 32, elements: !796)
!795 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = !{!797, !798, !799}
!797 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!798 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!799 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!800 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !795, line: 48, baseType: !32, size: 32, elements: !801)
!801 = !{!802, !803, !804}
!802 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!803 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!804 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !806, line: 167, baseType: !32, size: 32, elements: !807)
!806 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!807 = !{!808, !809}
!808 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!809 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!810 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !806, line: 107, baseType: !32, size: 32, elements: !811)
!811 = !{!812, !813, !814, !815, !816}
!812 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!813 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!814 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!815 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!816 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!817 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !806, line: 208, baseType: !32, size: 32, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824}
!819 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!820 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!821 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!822 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!823 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!824 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!825 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !806, line: 261, baseType: !32, size: 32, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832}
!827 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!828 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!829 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!830 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!831 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!832 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !806, line: 237, baseType: !32, size: 32, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841}
!835 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!836 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!837 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!838 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!839 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!840 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!841 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !806, line: 152, baseType: !32, size: 32, elements: !843)
!843 = !{!844, !845}
!844 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!845 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !611, line: 71, baseType: !108, size: 32, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900}
!848 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!849 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!850 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!851 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!852 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!853 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!854 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!855 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!856 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!857 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!858 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!859 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!860 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!861 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!862 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!863 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!864 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!865 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!866 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!867 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!868 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!869 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!870 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!871 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!872 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!873 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!874 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!875 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!876 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!877 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!878 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!879 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!880 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!881 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!882 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!883 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!884 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!885 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!886 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!887 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!888 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!889 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!890 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!891 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!892 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!893 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!894 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!895 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!896 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!897 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!898 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!899 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!900 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !902, line: 44, baseType: !32, size: 32, elements: !903)
!902 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!903 = !{!904, !905, !906, !907}
!904 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!905 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!906 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!907 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !909, line: 54, baseType: !32, size: 32, elements: !910)
!909 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!911 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!912 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!913 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!914 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!915 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!916 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!917 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!918 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!919 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!920 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!921 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!922 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!923 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!924 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!925 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!926 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !928, line: 53, baseType: !32, size: 32, elements: !929)
!928 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !{!930, !931, !932, !933, !934, !935}
!930 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!931 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!932 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!933 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!934 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!935 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!936 = !{!794, !107, !108, !937, !986, !987, !988, !989, !103, !102, !167, !145, !689, !990, !327, !991, !1021, !314}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !611, line: 1022, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 979, size: 11712, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !952, !953, !954, !955, !956, !957, !958, !959, !960, !964, !965, !966, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !939, file: !611, line: 980, baseType: !544, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !939, file: !611, line: 981, baseType: !544, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !939, file: !611, line: 982, baseType: !544, size: 32, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !939, file: !611, line: 983, baseType: !544, size: 32, offset: 96)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !939, file: !611, line: 984, baseType: !544, size: 32, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !939, file: !611, line: 985, baseType: !544, size: 32, offset: 160)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !939, file: !611, line: 986, baseType: !544, size: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !939, file: !611, line: 987, baseType: !949, size: 1824, offset: 224)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1824, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 57)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !939, file: !611, line: 988, baseType: !544, size: 32, offset: 2048)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !939, file: !611, line: 989, baseType: !544, size: 32, offset: 2080)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !939, file: !611, line: 990, baseType: !543, size: 32, offset: 2112)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !939, file: !611, line: 991, baseType: !544, size: 32, offset: 2144)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !939, file: !611, line: 992, baseType: !544, size: 32, offset: 2176)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !939, file: !611, line: 993, baseType: !720, size: 160, offset: 2208)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !939, file: !611, line: 994, baseType: !544, size: 32, offset: 2368)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !939, file: !611, line: 996, baseType: !544, size: 32, offset: 2400)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !939, file: !611, line: 998, baseType: !961, size: 3744, offset: 2432)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 3744, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 117)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !939, file: !611, line: 999, baseType: !544, size: 32, offset: 6176)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !939, file: !611, line: 1000, baseType: !544, size: 32, offset: 6208)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !939, file: !611, line: 1001, baseType: !967, size: 2016, offset: 6240)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 2016, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 63)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !939, file: !611, line: 1002, baseType: !543, size: 32, offset: 8256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !939, file: !611, line: 1004, baseType: !543, size: 32, offset: 8288)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !939, file: !611, line: 1005, baseType: !543, size: 32, offset: 8320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !939, file: !611, line: 1006, baseType: !543, size: 32, offset: 8352)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !939, file: !611, line: 1008, baseType: !543, size: 32, offset: 8384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !939, file: !611, line: 1009, baseType: !543, size: 32, offset: 8416)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !939, file: !611, line: 1011, baseType: !749, size: 1984, offset: 8448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !939, file: !611, line: 1012, baseType: !544, size: 32, offset: 10432)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !939, file: !611, line: 1013, baseType: !649, size: 96, offset: 10464)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !939, file: !611, line: 1014, baseType: !544, size: 32, offset: 10560)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !939, file: !611, line: 1016, baseType: !649, size: 96, offset: 10592)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !939, file: !611, line: 1017, baseType: !544, size: 32, offset: 10688)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !939, file: !611, line: 1018, baseType: !764, size: 256, offset: 10720)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !939, file: !611, line: 1019, baseType: !544, size: 32, offset: 10976)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !939, file: !611, line: 1020, baseType: !664, size: 672, offset: 11008)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !939, file: !611, line: 1021, baseType: !544, size: 32, offset: 11680)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !806, line: 146, baseType: !810)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !806, line: 164, baseType: !842)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !539, line: 426, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 411, size: 28704, elements: !994)
!994 = !{!995, !997, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1016, !1020}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !993, file: !539, line: 413, baseType: !996, size: 256)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 256, elements: !765)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !993, file: !539, line: 414, baseType: !998, size: 768, offset: 256)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 768, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 24)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !993, file: !539, line: 415, baseType: !996, size: 256, offset: 1024)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !993, file: !539, line: 416, baseType: !998, size: 768, offset: 1280)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !993, file: !539, line: 417, baseType: !996, size: 256, offset: 2048)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !993, file: !539, line: 418, baseType: !998, size: 768, offset: 2304)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !993, file: !539, line: 419, baseType: !996, size: 256, offset: 3072)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !993, file: !539, line: 420, baseType: !998, size: 768, offset: 3328)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !993, file: !539, line: 421, baseType: !996, size: 256, offset: 4096)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !993, file: !539, line: 422, baseType: !1009, size: 1792, offset: 4352)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 1792, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 56)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !993, file: !539, line: 423, baseType: !1013, size: 1920, offset: 6144)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 1920, elements: !1014)
!1014 = !{!1015}
!1015 = !DISubrange(count: 240)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !993, file: !539, line: 424, baseType: !1017, size: 20608, offset: 8064)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 20608, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 644)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !993, file: !539, line: 425, baseType: !544, size: 32, offset: 28672)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !902, line: 56, baseType: !107)
!1022 = !{!1023, !1073, !1114, !789, !1117, !1142, !1144, !1161, !1163, !1173, !1176, !1191, !1228, !1242}
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "on", scope: !1025, file: !1026, line: 549, type: !304, isLocal: true, isDefinition: true)
!1025 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !1026, file: !1026, line: 547, type: !1027, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !791, retainedNodes: !1029)
!1026 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !800}
!1029 = !{!1030, !1031, !1034}
!1030 = !DILocalVariable(name: "start_mode", arg: 1, scope: !1025, file: !1026, line: 547, type: !800)
!1031 = !DILocalVariable(name: "err", scope: !1032, file: !1026, line: 553, type: !108)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !1026, line: 552, column: 31)
!1033 = distinct !DILexicalBlock(scope: !1025, file: !1026, line: 552, column: 6)
!1034 = !DILocalVariable(name: "mgr", scope: !1032, file: !1026, line: 554, type: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !1037, line: 154, size: 224, elements: !1038)
!1037 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1038 = !{!1039, !1051, !1052, !1068, !1070, !1071, !1072}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !1036, file: !1037, line: 158, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !1042)
!1042 = !{!1043, !1050}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1041, file: !262, line: 36, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !1047)
!1047 = !{!1048}
