; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.osSemaphoreAttr_t = type { i8*, i32, i8*, i32 }
%struct.osThreadAttr_t = type { i8*, i32, i8*, i32, i8*, i32, i32, i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.cv2_thread = type { %struct._dnode, %struct.k_thread, %struct.k_poll_signal, %struct.k_poll_event, i32, [16 x i8], i32, %struct.k_sem, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, %struct.z_poller, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "sema_attr", scope: !27, file: !212, line: 36, type: !213, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !168, globals: !175, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/philosophers")
!29 = !{!30, !42, !113}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 195, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os2.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osError", value: -1)
!36 = !DIEnumerator(name: "osErrorTimeout", value: -2)
!37 = !DIEnumerator(name: "osErrorResource", value: -3)
!38 = !DIEnumerator(name: "osErrorParameter", value: -4)
!39 = !DIEnumerator(name: "osErrorNoMemory", value: -5)
!40 = !DIEnumerator(name: "osErrorISR", value: -6)
!41 = !DIEnumerator(name: "osStatusReserved", value: 2147483647)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !43, line: 27, baseType: !44, size: 32, elements: !45)
!43 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!44 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!46 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!47 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!48 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!49 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!50 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!51 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!52 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!53 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!54 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!55 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!56 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!57 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!58 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!59 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!60 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!61 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!62 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!112 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 101, baseType: !32, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!115 = !DIEnumerator(name: "osPriorityNone", value: 0)
!116 = !DIEnumerator(name: "osPriorityIdle", value: 1)
!117 = !DIEnumerator(name: "osPriorityLow", value: 8)
!118 = !DIEnumerator(name: "osPriorityLow1", value: 9)
!119 = !DIEnumerator(name: "osPriorityLow2", value: 10)
!120 = !DIEnumerator(name: "osPriorityLow3", value: 11)
!121 = !DIEnumerator(name: "osPriorityLow4", value: 12)
!122 = !DIEnumerator(name: "osPriorityLow5", value: 13)
!123 = !DIEnumerator(name: "osPriorityLow6", value: 14)
!124 = !DIEnumerator(name: "osPriorityLow7", value: 15)
!125 = !DIEnumerator(name: "osPriorityBelowNormal", value: 16)
!126 = !DIEnumerator(name: "osPriorityBelowNormal1", value: 17)
!127 = !DIEnumerator(name: "osPriorityBelowNormal2", value: 18)
!128 = !DIEnumerator(name: "osPriorityBelowNormal3", value: 19)
!129 = !DIEnumerator(name: "osPriorityBelowNormal4", value: 20)
!130 = !DIEnumerator(name: "osPriorityBelowNormal5", value: 21)
!131 = !DIEnumerator(name: "osPriorityBelowNormal6", value: 22)
!132 = !DIEnumerator(name: "osPriorityBelowNormal7", value: 23)
!133 = !DIEnumerator(name: "osPriorityNormal", value: 24)
!134 = !DIEnumerator(name: "osPriorityNormal1", value: 25)
!135 = !DIEnumerator(name: "osPriorityNormal2", value: 26)
!136 = !DIEnumerator(name: "osPriorityNormal3", value: 27)
!137 = !DIEnumerator(name: "osPriorityNormal4", value: 28)
!138 = !DIEnumerator(name: "osPriorityNormal5", value: 29)
!139 = !DIEnumerator(name: "osPriorityNormal6", value: 30)
!140 = !DIEnumerator(name: "osPriorityNormal7", value: 31)
!141 = !DIEnumerator(name: "osPriorityAboveNormal", value: 32)
!142 = !DIEnumerator(name: "osPriorityAboveNormal1", value: 33)
!143 = !DIEnumerator(name: "osPriorityAboveNormal2", value: 34)
!144 = !DIEnumerator(name: "osPriorityAboveNormal3", value: 35)
!145 = !DIEnumerator(name: "osPriorityAboveNormal4", value: 36)
!146 = !DIEnumerator(name: "osPriorityAboveNormal5", value: 37)
!147 = !DIEnumerator(name: "osPriorityAboveNormal6", value: 38)
!148 = !DIEnumerator(name: "osPriorityAboveNormal7", value: 39)
!149 = !DIEnumerator(name: "osPriorityHigh", value: 40)
!150 = !DIEnumerator(name: "osPriorityHigh1", value: 41)
!151 = !DIEnumerator(name: "osPriorityHigh2", value: 42)
!152 = !DIEnumerator(name: "osPriorityHigh3", value: 43)
!153 = !DIEnumerator(name: "osPriorityHigh4", value: 44)
!154 = !DIEnumerator(name: "osPriorityHigh5", value: 45)
!155 = !DIEnumerator(name: "osPriorityHigh6", value: 46)
!156 = !DIEnumerator(name: "osPriorityHigh7", value: 47)
!157 = !DIEnumerator(name: "osPriorityRealtime", value: 48)
!158 = !DIEnumerator(name: "osPriorityRealtime1", value: 49)
!159 = !DIEnumerator(name: "osPriorityRealtime2", value: 50)
!160 = !DIEnumerator(name: "osPriorityRealtime3", value: 51)
!161 = !DIEnumerator(name: "osPriorityRealtime4", value: 52)
!162 = !DIEnumerator(name: "osPriorityRealtime5", value: 53)
!163 = !DIEnumerator(name: "osPriorityRealtime6", value: 54)
!164 = !DIEnumerator(name: "osPriorityRealtime7", value: 55)
!165 = !DIEnumerator(name: "osPriorityISR", value: 56)
!166 = !DIEnumerator(name: "osPriorityError", value: -1)
!167 = !DIEnumerator(name: "osPriorityReserved", value: 2147483647)
!168 = !{!169, !171, !32, !172, !173}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !170)
!170 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !44)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !174)
!174 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!175 = !{!25, !176, !183, !203}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !178, line: 66, type: !179, isLocal: false, isDefinition: true)
!178 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 192, elements: !181)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreId_t", file: !31, line: 220, baseType: !171)
!181 = !{!182}
!182 = !DISubrange(count: 6)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "thread_attr", scope: !27, file: !178, line: 72, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 1728, elements: !181)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadAttr_t", file: !31, line: 247, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 237, size: 288, elements: !188)
!188 = !{!189, !193, !194, !195, !196, !197, !198, !200, !202}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !31, line: 238, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !187, file: !31, line: 239, baseType: !172, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !187, file: !31, line: 240, baseType: !171, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !187, file: !31, line: 241, baseType: !172, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !187, file: !31, line: 242, baseType: !171, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !187, file: !31, line: 243, baseType: !172, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !187, file: !31, line: 244, baseType: !199, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "osPriority_t", file: !31, line: 155, baseType: !113)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tz_module", scope: !187, file: !31, line: 245, baseType: !201, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "TZ_ModuleId_t", file: !31, line: 232, baseType: !172)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !187, file: !31, line: 246, baseType: !172, size: 32, offset: 256)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !178, line: 71, type: !205, isLocal: true, isDefinition: true, align: 64)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 98304, elements: !210)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !207, line: 47, size: 8, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !207, line: 48, baseType: !192, size: 8)
!210 = !{!182, !211}
!211 = !DISubrange(count: 2048)
!212 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 768, elements: !181)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreAttr_t", file: !31, line: 279, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 274, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !31, line: 275, baseType: !190, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !215, file: !31, line: 276, baseType: !172, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !215, file: !31, line: 277, baseType: !171, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !215, file: !31, line: 278, baseType: !172, size: 32, offset: 96)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "_char_out", scope: !223, file: !228, line: 54, type: !229, isLocal: false, isDefinition: true)
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !226, globals: !227, splitDebugInlining: false, nameTableKind: None)
!224 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/philosophers")
!225 = !{!42}
!226 = !{!171, !32}
!227 = !{!221}
!228 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DISubroutineType(types: !231)
!231 = !{!32, !32}
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !234, file: !972, line: 202, type: !973, isLocal: true, isDefinition: true, align: 32)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !236, globals: !971, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/philosophers")
!236 = !{!171, !32, !237, !365, !704, !705, !772}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !239, line: 335, baseType: !240)
!239 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 320, size: 288, elements: !241)
!241 = !{!242, !255, !265, !279, !290, !301, !305, !316, !317, !328, !329, !344, !345, !355}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !240, file: !239, line: 321, baseType: !243, size: 16)
!243 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !239, line: 50, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 43, size: 16, elements: !246)
!246 = !{!247, !254}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !245, file: !239, line: 48, baseType: !248, size: 16)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !245, file: !239, line: 44, size: 16, elements: !249)
!249 = !{!250, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !248, file: !239, line: 45, baseType: !251, size: 7, flags: DIFlagBitField, extraData: i64 0)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !252)
!252 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !248, file: !239, line: 47, baseType: !251, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !245, file: !239, line: 49, baseType: !251, size: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !240, file: !239, line: 322, baseType: !256, size: 16, offset: 16)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 16, elements: !263)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !258, line: 52, baseType: !259)
!258 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !262)
!262 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!263 = !{!264}
!264 = !DISubrange(count: 2)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !240, file: !239, line: 323, baseType: !266, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !239, line: 107, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 94, size: 32, elements: !269)
!269 = !{!270, !278}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !268, file: !239, line: 105, baseType: !271, size: 32)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !239, line: 95, size: 32, elements: !272)
!272 = !{!273, !274, !275, !276, !277}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !271, file: !239, line: 97, baseType: !172, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !271, file: !239, line: 99, baseType: !172, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !271, file: !239, line: 100, baseType: !172, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !271, file: !239, line: 102, baseType: !172, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !271, file: !239, line: 103, baseType: !172, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !268, file: !239, line: 106, baseType: !172, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !240, file: !239, line: 324, baseType: !280, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !239, line: 155, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 148, size: 32, elements: !283)
!283 = !{!284, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !282, file: !239, line: 153, baseType: !285, size: 32)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !282, file: !239, line: 149, size: 32, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !285, file: !239, line: 150, baseType: !172, size: 16, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !285, file: !239, line: 151, baseType: !172, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !282, file: !239, line: 154, baseType: !172, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !240, file: !239, line: 325, baseType: !291, size: 8, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !239, line: 194, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 187, size: 8, elements: !294)
!294 = !{!295, !300}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !293, file: !239, line: 192, baseType: !296, size: 8)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !293, file: !239, line: 188, size: 8, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !296, file: !239, line: 189, baseType: !261, size: 1, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !296, file: !239, line: 190, baseType: !261, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !293, file: !239, line: 193, baseType: !261, size: 8)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !240, file: !239, line: 326, baseType: !302, size: 24, offset: 104)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 24, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 3)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !240, file: !239, line: 327, baseType: !306, size: 8, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !239, line: 215, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 208, size: 8, elements: !309)
!309 = !{!310, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !308, file: !239, line: 213, baseType: !311, size: 8)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !308, file: !239, line: 209, size: 8, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !311, file: !239, line: 210, baseType: !261, size: 1, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !311, file: !239, line: 211, baseType: !261, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !308, file: !239, line: 214, baseType: !261, size: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !240, file: !239, line: 328, baseType: !302, size: 24, offset: 136)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !240, file: !239, line: 329, baseType: !318, size: 8, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !239, line: 236, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 229, size: 8, elements: !321)
!321 = !{!322, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !320, file: !239, line: 234, baseType: !323, size: 8)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !239, line: 230, size: 8, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !323, file: !239, line: 231, baseType: !259, size: 1, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !323, file: !239, line: 232, baseType: !259, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !320, file: !239, line: 235, baseType: !261, size: 8)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !240, file: !239, line: 330, baseType: !302, size: 24, offset: 168)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !240, file: !239, line: 331, baseType: !330, size: 16, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !239, line: 262, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 250, size: 16, elements: !333)
!333 = !{!334, !343}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !332, file: !239, line: 260, baseType: !335, size: 16)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !239, line: 251, size: 16, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !335, file: !239, line: 252, baseType: !251, size: 1, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !335, file: !239, line: 253, baseType: !251, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !335, file: !239, line: 254, baseType: !251, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !335, file: !239, line: 255, baseType: !251, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !335, file: !239, line: 256, baseType: !251, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !335, file: !239, line: 258, baseType: !251, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !332, file: !239, line: 261, baseType: !251, size: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !240, file: !239, line: 332, baseType: !256, size: 16, offset: 208)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !240, file: !239, line: 333, baseType: !346, size: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !239, line: 290, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 284, size: 32, elements: !349)
!349 = !{!350, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !348, file: !239, line: 288, baseType: !351, size: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !239, line: 285, size: 32, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !351, file: !239, line: 286, baseType: !172, size: 22, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !348, file: !239, line: 289, baseType: !172, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !240, file: !239, line: 334, baseType: !356, size: 16, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !239, line: 308, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !239, line: 303, size: 16, elements: !359)
!359 = !{!360, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !358, file: !239, line: 306, baseType: !361, size: 16)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !239, line: 304, size: 16, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !361, file: !239, line: 305, baseType: !251, size: 16, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !358, file: !239, line: 307, baseType: !251, size: 16)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !367, line: 928, baseType: !368)
!367 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 899, size: 672, elements: !369)
!369 = !{!370, !394, !418, !444, !469, !485, !486, !504, !505, !522, !533, !534, !549, !569, !570, !582, !594, !604, !605, !622, !626, !637, !638, !650, !662, !663, !674, !690}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !368, file: !367, line: 900, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !367, line: 64, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 43, size: 32, elements: !374)
!374 = !{!375, !393}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !373, file: !367, line: 62, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !373, file: !367, line: 44, size: 32, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !376, file: !367, line: 45, baseType: !172, size: 1, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !376, file: !367, line: 46, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !376, file: !367, line: 47, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !376, file: !367, line: 48, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !376, file: !367, line: 49, baseType: !172, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !376, file: !367, line: 50, baseType: !172, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !376, file: !367, line: 51, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !376, file: !367, line: 52, baseType: !172, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !376, file: !367, line: 53, baseType: !172, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !376, file: !367, line: 54, baseType: !172, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !376, file: !367, line: 55, baseType: !172, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !376, file: !367, line: 56, baseType: !172, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !376, file: !367, line: 58, baseType: !172, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !376, file: !367, line: 59, baseType: !172, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !376, file: !367, line: 60, baseType: !172, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !373, file: !367, line: 63, baseType: !172, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !368, file: !367, line: 901, baseType: !395, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !367, line: 125, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 104, size: 32, elements: !398)
!398 = !{!399, !417}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !397, file: !367, line: 123, baseType: !400, size: 32)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !397, file: !367, line: 105, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !400, file: !367, line: 106, baseType: !172, size: 1, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !400, file: !367, line: 107, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !400, file: !367, line: 108, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !400, file: !367, line: 109, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !400, file: !367, line: 110, baseType: !172, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !400, file: !367, line: 111, baseType: !172, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !400, file: !367, line: 112, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !400, file: !367, line: 113, baseType: !172, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !400, file: !367, line: 114, baseType: !172, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !400, file: !367, line: 115, baseType: !172, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !400, file: !367, line: 116, baseType: !172, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !400, file: !367, line: 117, baseType: !172, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !400, file: !367, line: 119, baseType: !172, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !400, file: !367, line: 120, baseType: !172, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !400, file: !367, line: 121, baseType: !172, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !397, file: !367, line: 124, baseType: !172, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !368, file: !367, line: 902, baseType: !419, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !367, line: 186, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 165, size: 32, elements: !422)
!422 = !{!423, !443}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !421, file: !367, line: 184, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !421, file: !367, line: 166, size: 32, elements: !425)
!425 = !{!426, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !424, file: !367, line: 167, baseType: !427, size: 1, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !172)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !424, file: !367, line: 168, baseType: !427, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !424, file: !367, line: 169, baseType: !427, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !424, file: !367, line: 170, baseType: !427, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !424, file: !367, line: 171, baseType: !427, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !424, file: !367, line: 172, baseType: !427, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !424, file: !367, line: 173, baseType: !427, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !424, file: !367, line: 174, baseType: !427, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !424, file: !367, line: 175, baseType: !427, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !424, file: !367, line: 176, baseType: !427, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !424, file: !367, line: 177, baseType: !427, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !424, file: !367, line: 178, baseType: !427, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !424, file: !367, line: 180, baseType: !427, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !424, file: !367, line: 181, baseType: !427, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !424, file: !367, line: 182, baseType: !427, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !421, file: !367, line: 185, baseType: !172, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !368, file: !367, line: 903, baseType: !445, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !367, line: 247, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 226, size: 32, elements: !449)
!449 = !{!450, !468}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !448, file: !367, line: 245, baseType: !451, size: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !367, line: 227, size: 32, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !451, file: !367, line: 228, baseType: !172, size: 1, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !451, file: !367, line: 229, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !451, file: !367, line: 230, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !451, file: !367, line: 231, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !451, file: !367, line: 232, baseType: !172, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !451, file: !367, line: 233, baseType: !172, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !451, file: !367, line: 234, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !451, file: !367, line: 235, baseType: !172, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !451, file: !367, line: 236, baseType: !172, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !451, file: !367, line: 237, baseType: !172, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !451, file: !367, line: 238, baseType: !172, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !451, file: !367, line: 239, baseType: !172, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !451, file: !367, line: 241, baseType: !172, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !451, file: !367, line: 242, baseType: !172, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !451, file: !367, line: 243, baseType: !172, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !448, file: !367, line: 246, baseType: !172, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !368, file: !367, line: 904, baseType: !470, size: 16, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !367, line: 300, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 287, size: 16, elements: !473)
!473 = !{!474, !484}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !472, file: !367, line: 298, baseType: !475, size: 16)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !367, line: 288, size: 16, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !475, file: !367, line: 290, baseType: !251, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !475, file: !367, line: 291, baseType: !251, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !475, file: !367, line: 293, baseType: !251, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !475, file: !367, line: 294, baseType: !251, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !475, file: !367, line: 295, baseType: !251, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !475, file: !367, line: 296, baseType: !251, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !475, file: !367, line: 297, baseType: !251, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !472, file: !367, line: 299, baseType: !251, size: 16)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !368, file: !367, line: 905, baseType: !256, size: 16, offset: 144)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !368, file: !367, line: 906, baseType: !487, size: 16, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !367, line: 352, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 336, size: 16, elements: !490)
!490 = !{!491, !503}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !489, file: !367, line: 350, baseType: !492, size: 16)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !489, file: !367, line: 337, size: 16, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !492, file: !367, line: 339, baseType: !251, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !492, file: !367, line: 340, baseType: !251, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !492, file: !367, line: 341, baseType: !251, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !492, file: !367, line: 342, baseType: !251, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !492, file: !367, line: 343, baseType: !251, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !492, file: !367, line: 344, baseType: !251, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !492, file: !367, line: 345, baseType: !251, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !492, file: !367, line: 346, baseType: !251, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !492, file: !367, line: 348, baseType: !251, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !489, file: !367, line: 351, baseType: !251, size: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !368, file: !367, line: 907, baseType: !256, size: 16, offset: 176)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !368, file: !367, line: 908, baseType: !506, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !367, line: 398, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 381, size: 32, elements: !509)
!509 = !{!510, !521}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !508, file: !367, line: 396, baseType: !511, size: 32)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !367, line: 382, size: 32, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !511, file: !367, line: 384, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !511, file: !367, line: 385, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !511, file: !367, line: 386, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !511, file: !367, line: 388, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !511, file: !367, line: 389, baseType: !172, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !511, file: !367, line: 390, baseType: !172, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !511, file: !367, line: 392, baseType: !172, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !511, file: !367, line: 394, baseType: !172, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !508, file: !367, line: 397, baseType: !172, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !368, file: !367, line: 909, baseType: !523, size: 8, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !367, line: 433, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 426, size: 8, elements: !526)
!526 = !{!527, !532}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !525, file: !367, line: 431, baseType: !528, size: 8)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !525, file: !367, line: 427, size: 8, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !528, file: !367, line: 428, baseType: !261, size: 5, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !528, file: !367, line: 430, baseType: !261, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !525, file: !367, line: 432, baseType: !261, size: 8)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !368, file: !367, line: 910, baseType: !302, size: 24, offset: 232)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !368, file: !367, line: 911, baseType: !535, size: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !367, line: 462, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 448, size: 32, elements: !538)
!538 = !{!539, !548}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !537, file: !367, line: 460, baseType: !540, size: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !537, file: !367, line: 449, size: 32, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !540, file: !367, line: 451, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !540, file: !367, line: 453, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !540, file: !367, line: 454, baseType: !172, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !540, file: !367, line: 455, baseType: !172, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !540, file: !367, line: 457, baseType: !172, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !540, file: !367, line: 459, baseType: !172, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !537, file: !367, line: 461, baseType: !172, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !368, file: !367, line: 912, baseType: !550, size: 16, offset: 288)
!550 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !367, line: 520, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 503, size: 16, elements: !553)
!553 = !{!554, !568}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !552, file: !367, line: 518, baseType: !555, size: 16)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !552, file: !367, line: 504, size: 16, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !555, file: !367, line: 506, baseType: !251, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !555, file: !367, line: 507, baseType: !251, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !555, file: !367, line: 508, baseType: !251, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !555, file: !367, line: 509, baseType: !251, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !555, file: !367, line: 510, baseType: !251, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !555, file: !367, line: 511, baseType: !251, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !555, file: !367, line: 512, baseType: !251, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !555, file: !367, line: 513, baseType: !251, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !555, file: !367, line: 514, baseType: !251, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !555, file: !367, line: 515, baseType: !251, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !555, file: !367, line: 516, baseType: !251, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !552, file: !367, line: 519, baseType: !251, size: 16)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !368, file: !367, line: 913, baseType: !256, size: 16, offset: 304)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !368, file: !367, line: 914, baseType: !571, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !367, line: 559, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 552, size: 32, elements: !574)
!574 = !{!575, !581}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !573, file: !367, line: 557, baseType: !576, size: 32)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !573, file: !367, line: 553, size: 32, elements: !577)
!577 = !{!578, !579, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !576, file: !367, line: 554, baseType: !172, size: 10, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !576, file: !367, line: 555, baseType: !172, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !576, file: !367, line: 556, baseType: !172, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !573, file: !367, line: 558, baseType: !172, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !368, file: !367, line: 915, baseType: !583, size: 32, offset: 352)
!583 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !367, line: 585, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 578, size: 32, elements: !586)
!586 = !{!587, !593}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !585, file: !367, line: 583, baseType: !588, size: 32)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !585, file: !367, line: 579, size: 32, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !588, file: !367, line: 580, baseType: !172, size: 16, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !588, file: !367, line: 581, baseType: !172, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !588, file: !367, line: 582, baseType: !172, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !585, file: !367, line: 584, baseType: !172, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !368, file: !367, line: 916, baseType: !595, size: 8, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !367, line: 610, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 604, size: 8, elements: !598)
!598 = !{!599, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !597, file: !367, line: 608, baseType: !600, size: 8)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !367, line: 605, size: 8, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !600, file: !367, line: 607, baseType: !261, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !597, file: !367, line: 609, baseType: !261, size: 8)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !368, file: !367, line: 917, baseType: !302, size: 24, offset: 392)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !368, file: !367, line: 918, baseType: !606, size: 32, offset: 416)
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !367, line: 639, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 622, size: 32, elements: !609)
!609 = !{!610, !621}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !608, file: !367, line: 637, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !367, line: 623, size: 32, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !611, file: !367, line: 625, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !611, file: !367, line: 626, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !611, file: !367, line: 627, baseType: !172, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !611, file: !367, line: 629, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !611, file: !367, line: 631, baseType: !172, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !611, file: !367, line: 632, baseType: !172, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !611, file: !367, line: 634, baseType: !172, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !611, file: !367, line: 635, baseType: !172, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !608, file: !367, line: 638, baseType: !172, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !368, file: !367, line: 919, baseType: !623, size: 32, offset: 448)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 32, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 4)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !368, file: !367, line: 920, baseType: !627, size: 16, offset: 480)
!627 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !367, line: 715, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 706, size: 16, elements: !630)
!630 = !{!631, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !629, file: !367, line: 713, baseType: !632, size: 16)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !629, file: !367, line: 707, size: 16, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !632, file: !367, line: 709, baseType: !251, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !632, file: !367, line: 711, baseType: !251, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !629, file: !367, line: 714, baseType: !251, size: 16)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !368, file: !367, line: 921, baseType: !256, size: 16, offset: 496)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !368, file: !367, line: 922, baseType: !639, size: 32, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !367, line: 739, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 729, size: 32, elements: !642)
!642 = !{!643, !649}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !641, file: !367, line: 737, baseType: !644, size: 32)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !641, file: !367, line: 730, size: 32, elements: !645)
!645 = !{!646, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !644, file: !367, line: 732, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !644, file: !367, line: 733, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !644, file: !367, line: 735, baseType: !172, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !641, file: !367, line: 738, baseType: !172, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !368, file: !367, line: 923, baseType: !651, size: 8, offset: 544)
!651 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !367, line: 765, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 756, size: 8, elements: !654)
!654 = !{!655, !661}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !653, file: !367, line: 763, baseType: !656, size: 8)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !653, file: !367, line: 757, size: 8, elements: !657)
!657 = !{!658, !659, !660}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !656, file: !367, line: 759, baseType: !261, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !656, file: !367, line: 761, baseType: !261, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !656, file: !367, line: 762, baseType: !261, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !653, file: !367, line: 764, baseType: !261, size: 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !368, file: !367, line: 924, baseType: !302, size: 24, offset: 552)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !368, file: !367, line: 925, baseType: !664, size: 32, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !367, line: 789, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 781, size: 32, elements: !667)
!667 = !{!668, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !666, file: !367, line: 787, baseType: !669, size: 32)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !666, file: !367, line: 782, size: 32, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !669, file: !367, line: 783, baseType: !172, size: 12, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !669, file: !367, line: 785, baseType: !172, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !666, file: !367, line: 788, baseType: !172, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !368, file: !367, line: 926, baseType: !675, size: 32, offset: 608)
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !367, line: 820, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 805, size: 32, elements: !678)
!678 = !{!679, !689}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !677, file: !367, line: 818, baseType: !680, size: 32)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !367, line: 806, size: 32, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !680, file: !367, line: 807, baseType: !172, size: 2, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !680, file: !367, line: 808, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !680, file: !367, line: 809, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !680, file: !367, line: 810, baseType: !172, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !680, file: !367, line: 812, baseType: !172, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !680, file: !367, line: 814, baseType: !172, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !680, file: !367, line: 816, baseType: !172, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !677, file: !367, line: 819, baseType: !172, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !368, file: !367, line: 927, baseType: !691, size: 8, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !367, line: 881, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 872, size: 8, elements: !695)
!695 = !{!696, !703}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !694, file: !367, line: 879, baseType: !697, size: 8)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !694, file: !367, line: 873, size: 8, elements: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !697, file: !367, line: 874, baseType: !261, size: 1, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !697, file: !367, line: 875, baseType: !261, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !697, file: !367, line: 876, baseType: !261, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !697, file: !367, line: 877, baseType: !261, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !694, file: !367, line: 880, baseType: !261, size: 8)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !707, line: 290, baseType: !708)
!707 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !707, line: 284, size: 96, elements: !709)
!709 = !{!710, !720, !731, !744, !761}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !708, file: !707, line: 285, baseType: !711, size: 8)
!711 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !707, line: 49, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !707, line: 43, size: 8, elements: !714)
!714 = !{!715, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !713, file: !707, line: 47, baseType: !716, size: 8)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !713, file: !707, line: 44, size: 8, elements: !717)
!717 = !{!718}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !716, file: !707, line: 45, baseType: !261, size: 1, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !713, file: !707, line: 48, baseType: !261, size: 8)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !708, file: !707, line: 286, baseType: !721, size: 8, offset: 8)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !707, line: 67, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !707, line: 61, size: 8, elements: !725)
!725 = !{!726, !730}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !724, file: !707, line: 65, baseType: !727, size: 8)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !707, line: 62, size: 8, elements: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !727, file: !707, line: 64, baseType: !261, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !724, file: !707, line: 66, baseType: !261, size: 8)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !708, file: !707, line: 287, baseType: !732, size: 16, offset: 16)
!732 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !707, line: 89, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !707, line: 79, size: 16, elements: !735)
!735 = !{!736, !743}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !734, file: !707, line: 87, baseType: !737, size: 16)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !734, file: !707, line: 80, size: 16, elements: !738)
!738 = !{!739, !740, !741, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !737, file: !707, line: 81, baseType: !251, size: 6, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !737, file: !707, line: 83, baseType: !251, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !737, file: !707, line: 85, baseType: !251, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !737, file: !707, line: 86, baseType: !251, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !734, file: !707, line: 88, baseType: !251, size: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !708, file: !707, line: 288, baseType: !745, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !707, line: 214, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !707, line: 199, size: 32, elements: !748)
!748 = !{!749, !760}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !747, file: !707, line: 212, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !747, file: !707, line: 200, size: 32, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !750, file: !707, line: 201, baseType: !172, size: 4, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !750, file: !707, line: 203, baseType: !172, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !750, file: !707, line: 205, baseType: !172, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !750, file: !707, line: 206, baseType: !172, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !750, file: !707, line: 207, baseType: !172, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !750, file: !707, line: 208, baseType: !172, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !750, file: !707, line: 209, baseType: !172, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !750, file: !707, line: 210, baseType: !172, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !747, file: !707, line: 213, baseType: !172, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !708, file: !707, line: 289, baseType: !762, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !707, line: 268, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !707, line: 260, size: 32, elements: !765)
!765 = !{!766, !771}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !764, file: !707, line: 266, baseType: !767, size: 32)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !764, file: !707, line: 261, size: 32, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !767, file: !707, line: 262, baseType: !172, size: 4, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !767, file: !707, line: 264, baseType: !172, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !764, file: !707, line: 267, baseType: !172, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !774, line: 513, baseType: !775)
!774 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !774, line: 494, size: 480, elements: !776)
!776 = !{!777, !783, !793, !795, !805, !815, !825, !835, !839, !855, !871, !887, !917, !921, !931, !941, !951, !955}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !775, file: !774, line: 495, baseType: !778, size: 8)
!778 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !774, line: 45, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 43, size: 8, elements: !781)
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !780, file: !774, line: 44, baseType: !261, size: 8)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !775, file: !774, line: 496, baseType: !784, size: 8, offset: 8)
!784 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !774, line: 61, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 55, size: 8, elements: !787)
!787 = !{!788, !792}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !786, file: !774, line: 59, baseType: !789, size: 8)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !786, file: !774, line: 56, size: 8, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !789, file: !774, line: 57, baseType: !261, size: 2, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !786, file: !774, line: 60, baseType: !261, size: 8)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !775, file: !774, line: 497, baseType: !794, size: 48, offset: 16)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 48, elements: !181)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !775, file: !774, line: 498, baseType: !796, size: 8, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !774, line: 86, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 80, size: 8, elements: !799)
!799 = !{!800, !804}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !798, file: !774, line: 84, baseType: !801, size: 8)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !798, file: !774, line: 81, size: 8, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !801, file: !774, line: 82, baseType: !261, size: 3, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !798, file: !774, line: 85, baseType: !261, size: 8)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !775, file: !774, line: 499, baseType: !806, size: 8, offset: 72)
!806 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !774, line: 121, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 115, size: 8, elements: !809)
!809 = !{!810, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !808, file: !774, line: 119, baseType: !811, size: 8)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !808, file: !774, line: 116, size: 8, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !811, file: !774, line: 117, baseType: !261, size: 3, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !808, file: !774, line: 120, baseType: !261, size: 8)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !775, file: !774, line: 500, baseType: !816, size: 8, offset: 80)
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !774, line: 156, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 150, size: 8, elements: !819)
!819 = !{!820, !824}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !818, file: !774, line: 154, baseType: !821, size: 8)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !774, line: 151, size: 8, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !821, file: !774, line: 152, baseType: !261, size: 3, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !818, file: !774, line: 155, baseType: !261, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !775, file: !774, line: 501, baseType: !826, size: 8, offset: 88)
!826 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !774, line: 191, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 185, size: 8, elements: !829)
!829 = !{!830, !834}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !828, file: !774, line: 189, baseType: !831, size: 8)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !828, file: !774, line: 186, size: 8, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !831, file: !774, line: 187, baseType: !261, size: 3, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !828, file: !774, line: 190, baseType: !261, size: 8)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !775, file: !774, line: 502, baseType: !836, size: 64, offset: 96)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 64, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 8)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !775, file: !774, line: 503, baseType: !840, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !774, line: 232, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 220, size: 32, elements: !843)
!843 = !{!844, !854}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !842, file: !774, line: 230, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !842, file: !774, line: 221, size: 32, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !845, file: !774, line: 222, baseType: !172, size: 1, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !845, file: !774, line: 223, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !845, file: !774, line: 224, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !845, file: !774, line: 225, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !845, file: !774, line: 226, baseType: !172, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !845, file: !774, line: 227, baseType: !172, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !845, file: !774, line: 228, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !842, file: !774, line: 231, baseType: !172, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !775, file: !774, line: 504, baseType: !856, size: 32, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !774, line: 268, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 256, size: 32, elements: !859)
!859 = !{!860, !870}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !858, file: !774, line: 266, baseType: !861, size: 32)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !858, file: !774, line: 257, size: 32, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !861, file: !774, line: 258, baseType: !172, size: 1, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !861, file: !774, line: 259, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !861, file: !774, line: 260, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !861, file: !774, line: 261, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !861, file: !774, line: 262, baseType: !172, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !861, file: !774, line: 263, baseType: !172, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !861, file: !774, line: 264, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !858, file: !774, line: 267, baseType: !172, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !775, file: !774, line: 505, baseType: !872, size: 32, offset: 224)
!872 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !774, line: 304, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 292, size: 32, elements: !875)
!875 = !{!876, !886}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !874, file: !774, line: 302, baseType: !877, size: 32)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !874, file: !774, line: 293, size: 32, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !877, file: !774, line: 294, baseType: !172, size: 1, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !877, file: !774, line: 295, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !877, file: !774, line: 296, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !877, file: !774, line: 297, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !877, file: !774, line: 298, baseType: !172, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !877, file: !774, line: 299, baseType: !172, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !877, file: !774, line: 300, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !874, file: !774, line: 303, baseType: !172, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !775, file: !774, line: 506, baseType: !888, size: 32, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !774, line: 354, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !774, line: 328, size: 32, elements: !891)
!891 = !{!892, !916}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !890, file: !774, line: 352, baseType: !893, size: 32)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !774, line: 329, size: 32, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !893, file: !774, line: 330, baseType: !172, size: 1, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !893, file: !774, line: 331, baseType: !172, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !893, file: !774, line: 332, baseType: !172, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !893, file: !774, line: 333, baseType: !172, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !893, file: !774, line: 334, baseType: !172, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !893, file: !774, line: 335, baseType: !172, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !893, file: !774, line: 336, baseType: !172, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !893, file: !774, line: 337, baseType: !172, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !893, file: !774, line: 338, baseType: !172, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !893, file: !774, line: 339, baseType: !172, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !893, file: !774, line: 340, baseType: !172, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !893, file: !774, line: 341, baseType: !172, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !893, file: !774, line: 342, baseType: !172, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !893, file: !774, line: 343, baseType: !172, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !893, file: !774, line: 344, baseType: !172, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !893, file: !774, line: 345, baseType: !172, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
