; ModuleID = './Build/eint_edge_falling.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.gpio_backup_restore_t = type { i32, i32 }
%struct.hal_eint_gpio_map_t = type { i32, i32, i32, i32 }
%struct.hal_eint_callback_context_t = type { i8, void (i8*)*, i8* }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_eint_gpio_map_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.__va_list = type { i8* }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !2, file: !3, line: 71, type: !79, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !62, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 121, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!10 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !12, line: 47, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!15 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!16 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!17 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!18 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!19 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!20 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!21 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!22 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!23 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!24 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!25 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!26 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!27 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!28 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!29 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!30 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!31 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!32 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!33 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!34 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!35 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!36 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!37 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!38 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!39 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!40 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!41 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!42 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!43 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!44 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!45 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!46 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!47 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!48 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!49 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!50 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!51 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!52 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!53 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!54 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!55 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!56 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!57 = !{!58, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !6, line: 116, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !12, line: 95, baseType: !11)
!62 = !{!0, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !2, file: !3, line: 67, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !66, line: 111, baseType: !67)
!66 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 109, size: 96, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !67, file: !66, line: 110, baseType: !70, size: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !66, line: 106, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 102, size: 96, elements: !72)
!72 = !{!73, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !71, file: !66, line: 103, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !71, file: !66, line: 104, baseType: !74, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !71, file: !66, line: 105, baseType: !74, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !6, line: 62, baseType: !7)
!81 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!82 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "LISR", scope: !85, file: !86, line: 565, type: !311, isLocal: true, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !87, retainedTypes: !201, globals: !287, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!87 = !{!88, !11, !93, !124}
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 1209, baseType: !7, size: 32, elements: !90)
!89 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!90 = !{!91, !92}
!91 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!92 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 55, baseType: !7, size: 32, elements: !95)
!94 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!96 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!97 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!98 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!99 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!100 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!101 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!102 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!103 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!104 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!105 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!106 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!107 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!108 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!109 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!110 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!111 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!112 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!113 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!114 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!115 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!116 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!117 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!118 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!119 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!120 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!121 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!122 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!123 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 150, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!127 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!128 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!129 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!130 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!131 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!132 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!133 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!134 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!135 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!136 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!137 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!138 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!139 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!140 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!141 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!142 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!143 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!144 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!145 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!146 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!147 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!148 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!149 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!150 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!151 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!152 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!153 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!154 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!155 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!156 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!157 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!158 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!159 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!160 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!161 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!162 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!163 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!164 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!165 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!166 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!167 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!168 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!169 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!170 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!171 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!172 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!173 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!174 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!175 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!176 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!177 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!178 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!179 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!180 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!181 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!182 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!183 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!184 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!185 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!186 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!187 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!188 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!189 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!190 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!191 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!192 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!193 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!194 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!195 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!196 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!197 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!198 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!199 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!200 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!201 = !{!58, !60, !202, !61, !203, !204, !208, !246, !285}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !94, line: 87, baseType: !93)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_PAD_NAME_T", file: !125, line: 225, baseType: !124)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !205, line: 48, baseType: !206)
!205 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !207, line: 79, baseType: !7)
!207 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !210, line: 378, baseType: !211)
!210 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 363, size: 28704, elements: !212)
!212 = !{!213, !218, !222, !223, !224, !225, !226, !227, !228, !229, !233, !241, !245}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !211, file: !210, line: 365, baseType: !214, size: 256)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 256, elements: !216)
!215 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !204)
!216 = !{!217}
!217 = !DISubrange(count: 8)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !211, file: !210, line: 366, baseType: !219, size: 768, offset: 256)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 768, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 24)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !211, file: !210, line: 367, baseType: !214, size: 256, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !211, file: !210, line: 368, baseType: !219, size: 768, offset: 1280)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !211, file: !210, line: 369, baseType: !214, size: 256, offset: 2048)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !211, file: !210, line: 370, baseType: !219, size: 768, offset: 2304)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !211, file: !210, line: 371, baseType: !214, size: 256, offset: 3072)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !211, file: !210, line: 372, baseType: !219, size: 768, offset: 3328)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !211, file: !210, line: 373, baseType: !214, size: 256, offset: 4096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !211, file: !210, line: 374, baseType: !230, size: 1792, offset: 4352)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 1792, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 56)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !211, file: !210, line: 375, baseType: !234, size: 1920, offset: 6144)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 1920, elements: !239)
!235 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !205, line: 24, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !207, line: 43, baseType: !238)
!238 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!239 = !{!240}
!240 = !DISubrange(count: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !211, file: !210, line: 376, baseType: !242, size: 20608, offset: 8064)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 20608, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 644)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !211, file: !210, line: 377, baseType: !215, size: 32, offset: 28672)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !249)
!249 = !{!250, !252, !253, !254, !255, !256, !257, !261, !262, !263, !264, !265, !266, !267, !268, !272, !273, !274, !278, !282, !284}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !248, file: !210, line: 397, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !248, file: !210, line: 398, baseType: !215, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !248, file: !210, line: 399, baseType: !215, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !248, file: !210, line: 400, baseType: !215, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !248, file: !210, line: 401, baseType: !215, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !248, file: !210, line: 402, baseType: !215, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !248, file: !210, line: 403, baseType: !258, size: 96, offset: 192)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 96, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 12)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !248, file: !210, line: 404, baseType: !215, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !248, file: !210, line: 405, baseType: !215, size: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !248, file: !210, line: 406, baseType: !215, size: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !248, file: !210, line: 407, baseType: !215, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !248, file: !210, line: 408, baseType: !215, size: 32, offset: 416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !248, file: !210, line: 409, baseType: !215, size: 32, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !248, file: !210, line: 410, baseType: !215, size: 32, offset: 480)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !248, file: !210, line: 411, baseType: !269, size: 64, offset: 512)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 64, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 2)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !248, file: !210, line: 412, baseType: !251, size: 32, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !248, file: !210, line: 413, baseType: !251, size: 32, offset: 608)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !248, file: !210, line: 414, baseType: !275, size: 128, offset: 640)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 128, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 4)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !248, file: !210, line: 415, baseType: !279, size: 160, offset: 768)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 5)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !248, file: !210, line: 416, baseType: !283, size: 160, offset: 928)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 160, elements: !280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !248, file: !210, line: 417, baseType: !215, size: 32, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !205, line: 44, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !207, line: 77, baseType: !13)
!287 = !{!83, !288, !296}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "eint_dbc_register", scope: !85, file: !86, line: 52, type: !290, isLocal: true, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "EINT_DEBOUCE_REGISTER_T", file: !89, line: 1231, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 1229, size: 128, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_IRQ_SENS", scope: !292, file: !89, line: 1230, baseType: !295, size: 128)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 128, elements: !276)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "eint_con_register", scope: !85, file: !86, line: 51, type: !298, isLocal: true, isDefinition: true)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "EINT_CON_REGISTER_T", file: !89, line: 1224, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 1220, size: 10272, elements: !301)
!301 = !{!302, !306, !310}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_EINT_CON", scope: !300, file: !89, line: 1221, baseType: !303, size: 2112)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 2112, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 66)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !300, file: !89, line: 1222, baseType: !307, size: 8032, offset: 2112)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 8032, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 251)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_IRQ_SENS", scope: !300, file: !89, line: 1223, baseType: !295, size: 128, offset: 10144)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPI_LISR_Struct", file: !89, line: 1250, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 1248, size: 32, elements: !313)
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "gpiLisr_func", scope: !312, file: !89, line: 1249, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPI_LISR_func", file: !89, line: 1216, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 1214, size: 32, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IDX_EINT_WIC_LISR", scope: !316, file: !89, line: 1215, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !202}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "gpio_bakup_table", scope: !324, file: !325, line: 62, type: !360, isLocal: true, isDefinition: true)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !326, retainedTypes: !358, globals: !359, splitDebugInlining: false, nameTableKind: None)
!325 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!326 = !{!93, !327, !332, !336, !340, !344, !348, !88}
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 57, baseType: !7, size: 32, elements: !329)
!328 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!329 = !{!330, !331}
!330 = !DIEnumerator(name: "eDirection_IN", value: 0)
!331 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 69, baseType: !7, size: 32, elements: !333)
!333 = !{!334, !335}
!334 = !DIEnumerator(name: "eEdge_Trigger", value: 0)
!335 = !DIEnumerator(name: "eLevel_Trigger", value: 1)
!336 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 74, baseType: !7, size: 32, elements: !337)
!337 = !{!338, !339}
!338 = !DIEnumerator(name: "eDebounce_Disable", value: 0)
!339 = !DIEnumerator(name: "eDebounce_Enable", value: 1)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 79, baseType: !7, size: 32, elements: !341)
!341 = !{!342, !343}
!342 = !DIEnumerator(name: "eDebounce_Negative_Pol", value: 0)
!343 = !DIEnumerator(name: "eDebounce_Positive_Pol", value: 1)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 84, baseType: !7, size: 32, elements: !345)
!345 = !{!346, !347}
!346 = !DIEnumerator(name: "eDebounce_Dual_No", value: 0)
!347 = !DIEnumerator(name: "eDebounce_Dual_Yes", value: 1)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 89, baseType: !7, size: 32, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357}
!350 = !DIEnumerator(name: "eDebounce_Prescaler_8K", value: 0)
!351 = !DIEnumerator(name: "eDebounce_Prescaler_4K", value: 1)
!352 = !DIEnumerator(name: "eDebounce_Prescaler_2K", value: 2)
!353 = !DIEnumerator(name: "eDebounce_Prescaler_1K", value: 3)
!354 = !DIEnumerator(name: "eDebounce_Prescaler_Dot5K", value: 4)
!355 = !DIEnumerator(name: "eDebounce_Prescaler_Dot25K", value: 5)
!356 = !DIEnumerator(name: "eDebounce_Prescaler_Dot125K", value: 6)
!357 = !DIEnumerator(name: "eDebounce_Prescaler_Dot0625K", value: 7)
!358 = !{!58}
!359 = !{!322}
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 1408, elements: !366)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_backup_restore_t", file: !325, line: 60, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 57, size: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reg_data", scope: !362, file: !325, line: 58, baseType: !204, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reg_addr", scope: !362, file: !325, line: 59, baseType: !204, size: 32, offset: 32)
!366 = !{!367}
!367 = !DISubrange(count: 22)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !370, file: !371, line: 43, type: !204, isLocal: true, isDefinition: true)
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !372, globals: !377, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!372 = !{!373, !80, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!377 = !{!368, !378}
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !370, file: !371, line: 44, type: !204, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !382, file: !383, line: 54, type: !204, isLocal: false, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !384, retainedTypes: !408, globals: !416, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!384 = !{!385, !391}
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !386, line: 71, baseType: !7, size: 32, elements: !387)
!386 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!387 = !{!388, !389, !390}
!388 = !DIEnumerator(name: "UART_PORT0", value: 0)
!389 = !DIEnumerator(name: "UART_PORT1", value: 1)
!390 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!391 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !392, line: 129, baseType: !7, size: 32, elements: !393)
!392 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!394 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!395 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!396 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!397 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!398 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!399 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!400 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!401 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!402 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!403 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!404 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!405 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!406 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!407 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!408 = !{!373, !204, !409, !411, !413, !414, !80}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !6, line: 113, baseType: !412)
!412 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !6, line: 59, baseType: !238)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !413)
!416 = !{!380}
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "eint_gpio_table", scope: !419, file: !420, line: 55, type: !491, isLocal: false, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !421, retainedTypes: !463, globals: !466, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_eint.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!421 = !{!422, !93, !449, !456, !332, !340, !344, !336, !348}
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 605, baseType: !7, size: 32, elements: !424)
!423 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!425 = !DIEnumerator(name: "HAL_EINT_NUMBER_0", value: 0)
!426 = !DIEnumerator(name: "HAL_EINT_NUMBER_1", value: 1)
!427 = !DIEnumerator(name: "HAL_EINT_NUMBER_2", value: 2)
!428 = !DIEnumerator(name: "HAL_EINT_NUMBER_3", value: 3)
!429 = !DIEnumerator(name: "HAL_EINT_NUMBER_4", value: 4)
!430 = !DIEnumerator(name: "HAL_EINT_NUMBER_5", value: 5)
!431 = !DIEnumerator(name: "HAL_EINT_NUMBER_6", value: 6)
!432 = !DIEnumerator(name: "HAL_EINT_NUMBER_19", value: 19)
!433 = !DIEnumerator(name: "HAL_EINT_NUMBER_20", value: 20)
!434 = !DIEnumerator(name: "HAL_EINT_NUMBER_21", value: 21)
!435 = !DIEnumerator(name: "HAL_EINT_NUMBER_22", value: 22)
!436 = !DIEnumerator(name: "HAL_WIC_NUMBER_0", value: 32)
!437 = !DIEnumerator(name: "HAL_WIC_NUMBER_1", value: 33)
!438 = !DIEnumerator(name: "HAL_WIC_NUMBER_2", value: 34)
!439 = !DIEnumerator(name: "HAL_WIC_NUMBER_3", value: 35)
!440 = !DIEnumerator(name: "HAL_WIC_NUMBER_4", value: 36)
!441 = !DIEnumerator(name: "HAL_WIC_NUMBER_5", value: 37)
!442 = !DIEnumerator(name: "HAL_WIC_NUMBER_6", value: 38)
!443 = !DIEnumerator(name: "HAL_WIC_NUMBER_7", value: 39)
!444 = !DIEnumerator(name: "HAL_WIC_NUMBER_8", value: 40)
!445 = !DIEnumerator(name: "HAL_WIC_NUMBER_9", value: 41)
!446 = !DIEnumerator(name: "HAL_WIC_NUMBER_10", value: 42)
!447 = !DIEnumerator(name: "HAL_WIC_NUMBER_11", value: 43)
!448 = !DIEnumerator(name: "HAL_EINT_NUMBER_MAX", value: 44)
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 204, baseType: !13, size: 32, elements: !451)
!450 = !DIFile(filename: "../../../../../driver/chip/inc/hal_eint.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!451 = !{!452, !453, !454, !455}
!452 = !DIEnumerator(name: "HAL_EINT_STATUS_ERROR_EINT_NUMBER", value: -3)
!453 = !DIEnumerator(name: "HAL_EINT_STATUS_INVALID_PARAMETER", value: -2)
!454 = !DIEnumerator(name: "HAL_EINT_STATUS_ERROR", value: -1)
!455 = !DIEnumerator(name: "HAL_EINT_STATUS_OK", value: 0)
!456 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 194, baseType: !7, size: 32, elements: !457)
!457 = !{!458, !459, !460, !461, !462}
!458 = !DIEnumerator(name: "HAL_EINT_LEVEL_LOW", value: 0)
!459 = !DIEnumerator(name: "HAL_EINT_LEVEL_HIGH", value: 1)
!460 = !DIEnumerator(name: "HAL_EINT_EDGE_FALLING", value: 2)
!461 = !DIEnumerator(name: "HAL_EINT_EDGE_RISING", value: 3)
!462 = !DIEnumerator(name: "HAL_EINT_EDGE_FALLING_AND_RISING", value: 4)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DEBOUNCE_PRESCALER_T", file: !328, line: 98, baseType: !348)
!466 = !{!417, !467, !470, !486, !489}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "hal_eint_count_max", scope: !419, file: !420, line: 84, type: !469, isLocal: false, isDefinition: true)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "g_eint_callback_context", scope: !419, file: !420, line: 86, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 2208, elements: !484)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_callback_context_t", file: !420, line: 51, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 47, size: 96, elements: !475)
!475 = !{!476, !478, !483}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !474, file: !420, line: 48, baseType: !477, size: 8)
!477 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !474, file: !420, line: 49, baseType: !479, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_callback_t", file: !450, line: 241, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !464}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !474, file: !420, line: 50, baseType: !464, size: 32, offset: 64)
!484 = !{!485}
!485 = !DISubrange(count: 23)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "is_eint_callback_registered", scope: !419, file: !420, line: 87, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 736, elements: !484)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "is_eint_masked", scope: !419, file: !420, line: 88, type: !488, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 2944, elements: !484)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_gpio_map_t", file: !89, line: 1241, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 1236, size: 128, elements: !495)
!495 = !{!496, !498, !499, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "eint_number", scope: !494, file: !89, line: 1237, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_number_t", file: !423, line: 630, baseType: !422)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_pin", scope: !494, file: !89, line: 1238, baseType: !202, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "irq_number", scope: !494, file: !89, line: 1239, baseType: !204, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "priority_number", scope: !494, file: !89, line: 1240, baseType: !204, size: 32, offset: 96)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !503, file: !504, line: 53, type: !559, isLocal: false, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !505, retainedTypes: !514, globals: !558, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!505 = !{!506, !11}
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !507, line: 152, baseType: !13, size: 32, elements: !508)
!507 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!508 = !{!509, !510, !511, !512, !513}
!509 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!510 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!511 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!512 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!513 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!514 = !{!515, !464, !204, !285, !516, !533}
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !12, line: 97, baseType: !61)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !210, line: 378, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 363, size: 28704, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !518, file: !210, line: 365, baseType: !214, size: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !518, file: !210, line: 366, baseType: !219, size: 768, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !518, file: !210, line: 367, baseType: !214, size: 256, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !518, file: !210, line: 368, baseType: !219, size: 768, offset: 1280)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !518, file: !210, line: 369, baseType: !214, size: 256, offset: 2048)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !518, file: !210, line: 370, baseType: !219, size: 768, offset: 2304)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !518, file: !210, line: 371, baseType: !214, size: 256, offset: 3072)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !518, file: !210, line: 372, baseType: !219, size: 768, offset: 3328)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !518, file: !210, line: 373, baseType: !214, size: 256, offset: 4096)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !518, file: !210, line: 374, baseType: !230, size: 1792, offset: 4352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !518, file: !210, line: 375, baseType: !234, size: 1920, offset: 6144)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !518, file: !210, line: 376, baseType: !242, size: 20608, offset: 8064)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !518, file: !210, line: 377, baseType: !215, size: 32, offset: 28672)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !535, file: !210, line: 397, baseType: !251, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !535, file: !210, line: 398, baseType: !215, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !535, file: !210, line: 399, baseType: !215, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !535, file: !210, line: 400, baseType: !215, size: 32, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !535, file: !210, line: 401, baseType: !215, size: 32, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !535, file: !210, line: 402, baseType: !215, size: 32, offset: 160)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !535, file: !210, line: 403, baseType: !258, size: 96, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !535, file: !210, line: 404, baseType: !215, size: 32, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !535, file: !210, line: 405, baseType: !215, size: 32, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !535, file: !210, line: 406, baseType: !215, size: 32, offset: 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !535, file: !210, line: 407, baseType: !215, size: 32, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !535, file: !210, line: 408, baseType: !215, size: 32, offset: 416)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !535, file: !210, line: 409, baseType: !215, size: 32, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !535, file: !210, line: 410, baseType: !215, size: 32, offset: 480)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !535, file: !210, line: 411, baseType: !269, size: 64, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !535, file: !210, line: 412, baseType: !251, size: 32, offset: 576)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !535, file: !210, line: 413, baseType: !251, size: 32, offset: 608)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !535, file: !210, line: 414, baseType: !275, size: 128, offset: 640)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !535, file: !210, line: 415, baseType: !279, size: 160, offset: 768)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !535, file: !210, line: 416, baseType: !283, size: 160, offset: 928)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !535, file: !210, line: 417, baseType: !215, size: 32, offset: 1088)
!558 = !{!501}
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 6144, elements: !568)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !504, line: 50, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 47, size: 64, elements: !562)
!562 = !{!563, !567}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !561, file: !504, line: 48, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !515}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !561, file: !504, line: 49, baseType: !204, size: 32, offset: 32)
!568 = !{!569}
!569 = !DISubrange(count: 96)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !572, file: !573, line: 61, type: !605, isLocal: true, isDefinition: true)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !574, retainedTypes: !603, globals: !604, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!574 = !{!575, !583, !590, !594, !599}
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !576, line: 387, baseType: !13, size: 32, elements: !577)
!576 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!577 = !{!578, !579, !580, !581, !582}
!578 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!579 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!580 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!581 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!582 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 657, baseType: !7, size: 32, elements: !584)
!584 = !{!585, !586, !587, !588, !589}
!585 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!586 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!587 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!588 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!589 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !576, line: 397, baseType: !7, size: 32, elements: !591)
!591 = !{!592, !593}
!592 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!593 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 666, baseType: !7, size: 32, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!597 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!598 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !576, line: 380, baseType: !7, size: 32, elements: !600)
!600 = !{!601, !602}
!601 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!602 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!603 = !{!464, !204}
!604 = !{!570}
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 640, elements: !280)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !573, line: 55, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 51, size: 128, elements: !608)
!608 = !{!609, !611, !618}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !607, file: !573, line: 52, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !576, line: 400, baseType: !590)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !607, file: !573, line: 53, baseType: !612, size: 64, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !573, line: 49, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 46, size: 64, elements: !614)
!614 = !{!615, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !613, file: !573, line: 47, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !576, line: 371, baseType: !480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !613, file: !573, line: 48, baseType: !464, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !607, file: !573, line: 54, baseType: !477, size: 8, offset: 96)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !621, file: !622, line: 77, type: !687, isLocal: true, isDefinition: true)
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !623, retainedTypes: !673, globals: !675, splitDebugInlining: false, nameTableKind: None)
!622 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!623 = !{!624, !632, !637, !653, !659, !663, !385, !391, !668}
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 345, baseType: !13, size: 32, elements: !626)
!625 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!626 = !{!627, !628, !629, !630, !631}
!627 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!628 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!629 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!630 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!631 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 109, baseType: !7, size: 32, elements: !633)
!633 = !{!634, !635, !636}
!634 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!635 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!636 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 302, baseType: !7, size: 32, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!639 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!640 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!641 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!642 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!643 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!644 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!645 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!646 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!647 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!648 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!649 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!650 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!651 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!652 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 321, baseType: !7, size: 32, elements: !654)
!654 = !{!655, !656, !657, !658}
!655 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!656 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!657 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!658 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!659 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 330, baseType: !7, size: 32, elements: !660)
!660 = !{!661, !662}
!661 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!662 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 337, baseType: !7, size: 32, elements: !664)
!664 = !{!665, !666, !667}
!665 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!666 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!667 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !625, line: 355, baseType: !13, size: 32, elements: !669)
!669 = !{!670, !671, !672}
!670 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!671 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!672 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!673 = !{!7, !464, !238, !674, !236}
!674 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!675 = !{!619, !676}
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "func_tbl", scope: !678, file: !622, line: 536, type: !685, isLocal: true, isDefinition: true)
!678 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !622, file: !622, line: 534, type: !679, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !683)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !392, line: 197, baseType: !74)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !423, line: 113, baseType: !632)
!683 = !{!684}
!684 = !DILocalVariable(name: "uart_port", arg: 1, scope: !678, file: !622, line: 534, type: !682)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 64, elements: !270)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 1024, elements: !270)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !622, line: 75, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !622, line: 68, size: 512, elements: !690)
!690 = !{!691, !692, !704, !705, !716, !717}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !689, file: !622, line: 69, baseType: !477, size: 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !689, file: !622, line: 70, baseType: !693, size: 128, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !625, line: 378, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !625, line: 373, size: 128, elements: !695)
!695 = !{!696, !698, !700, !702}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !694, file: !625, line: 374, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !625, line: 317, baseType: !637)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !694, file: !625, line: 375, baseType: !699, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !625, line: 326, baseType: !653)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !694, file: !625, line: 376, baseType: !701, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !625, line: 333, baseType: !659)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !694, file: !625, line: 377, baseType: !703, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !625, line: 341, baseType: !663)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !689, file: !622, line: 71, baseType: !477, size: 8, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !689, file: !622, line: 72, baseType: !706, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !622, line: 66, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !622, line: 63, size: 64, elements: !708)
!708 = !{!709, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !707, file: !622, line: 64, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !625, line: 410, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !714, !464}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !625, line: 359, baseType: !668)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !707, file: !622, line: 65, baseType: !464, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !689, file: !622, line: 73, baseType: !477, size: 8, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !689, file: !622, line: 74, baseType: !718, size: 224, offset: 288)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !625, line: 390, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !625, line: 382, size: 224, elements: !720)
!720 = !{!721, !723, !724, !725, !726, !727, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !719, file: !625, line: 383, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !719, file: !625, line: 384, baseType: !204, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !719, file: !625, line: 385, baseType: !204, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !719, file: !625, line: 386, baseType: !722, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !719, file: !625, line: 387, baseType: !204, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !719, file: !625, line: 388, baseType: !204, size: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !719, file: !625, line: 389, baseType: !204, size: 32, offset: 192)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !731, file: !732, line: 59, type: !204, isLocal: false, isDefinition: true)
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !733, globals: !796, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/eint_edge_falling/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!733 = !{!734, !742, !767}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !210, line: 656, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 650, size: 128, elements: !737)
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !736, file: !210, line: 652, baseType: !215, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !736, file: !210, line: 653, baseType: !215, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !736, file: !210, line: 654, baseType: !215, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !736, file: !210, line: 655, baseType: !251, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !744, file: !210, line: 397, baseType: !251, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !744, file: !210, line: 398, baseType: !215, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !744, file: !210, line: 399, baseType: !215, size: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !744, file: !210, line: 400, baseType: !215, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !744, file: !210, line: 401, baseType: !215, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !744, file: !210, line: 402, baseType: !215, size: 32, offset: 160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !744, file: !210, line: 403, baseType: !258, size: 96, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !744, file: !210, line: 404, baseType: !215, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !744, file: !210, line: 405, baseType: !215, size: 32, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !744, file: !210, line: 406, baseType: !215, size: 32, offset: 352)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !744, file: !210, line: 407, baseType: !215, size: 32, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !744, file: !210, line: 408, baseType: !215, size: 32, offset: 416)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !744, file: !210, line: 409, baseType: !215, size: 32, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !744, file: !210, line: 410, baseType: !215, size: 32, offset: 480)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !744, file: !210, line: 411, baseType: !269, size: 64, offset: 512)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !744, file: !210, line: 412, baseType: !251, size: 32, offset: 576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !744, file: !210, line: 413, baseType: !251, size: 32, offset: 608)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !744, file: !210, line: 414, baseType: !275, size: 128, offset: 640)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !744, file: !210, line: 415, baseType: !279, size: 160, offset: 768)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !744, file: !210, line: 416, baseType: !283, size: 160, offset: 928)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !744, file: !210, line: 417, baseType: !215, size: 32, offset: 1088)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !769, line: 72, baseType: !770)
!769 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 56, size: 525312, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !786, !787, !791, !795}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !770, file: !769, line: 57, baseType: !215, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !770, file: !769, line: 58, baseType: !215, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !770, file: !769, line: 59, baseType: !215, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !770, file: !769, line: 60, baseType: !215, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !770, file: !769, line: 61, baseType: !215, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !770, file: !769, line: 62, baseType: !215, size: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !770, file: !769, line: 63, baseType: !215, size: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !770, file: !769, line: 64, baseType: !215, size: 32, offset: 224)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !770, file: !769, line: 65, baseType: !215, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !770, file: !769, line: 66, baseType: !215, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !770, file: !769, line: 67, baseType: !783, size: 32, offset: 320)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 32, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 1)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !770, file: !769, line: 68, baseType: !215, size: 32, offset: 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !770, file: !769, line: 69, baseType: !788, size: 523904, offset: 384)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 523904, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 16372)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !770, file: !769, line: 70, baseType: !792, size: 512, offset: 524288)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 512, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 16)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !770, file: !769, line: 71, baseType: !792, size: 512, offset: 524800)
!796 = !{!729, !797}
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !731, file: !732, line: 61, type: !215, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "heap_end", scope: !801, file: !802, line: 66, type: !807, isLocal: true, isDefinition: true)
!801 = distinct !DISubprogram(name: "_sbrk_r", scope: !802, file: !802, line: 63, type: !803, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !999, retainedNodes: !1003)
!802 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/eint_edge_falling/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!803 = !DISubroutineType(types: !804)
!804 = !{!805, !808, !998}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !806, line: 123, baseType: !807)
!806 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !810, line: 377, size: 1920, elements: !811)
!810 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!811 = !{!812, !813, !887, !888, !889, !890, !891, !892, !893, !896, !917, !921, !922, !923, !924, !934, !947, !948, !953, !972, !973, !980, !981, !997}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !809, file: !810, line: 381, baseType: !13, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !809, file: !810, line: 386, baseType: !814, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !810, line: 292, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !810, line: 186, size: 832, elements: !817)
!817 = !{!818, !820, !821, !822, !824, !825, !830, !831, !832, !833, !837, !843, !850, !854, !855, !856, !857, !861, !863, !864, !865, !867, !873, !886}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !816, file: !810, line: 187, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !816, file: !810, line: 188, baseType: !13, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !816, file: !810, line: 189, baseType: !13, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !816, file: !810, line: 190, baseType: !823, size: 16, offset: 96)
!823 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !816, file: !810, line: 191, baseType: !823, size: 16, offset: 112)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !816, file: !810, line: 192, baseType: !826, size: 64, offset: 128)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !810, line: 122, size: 64, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !826, file: !810, line: 123, baseType: !819, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !826, file: !810, line: 124, baseType: !13, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !816, file: !810, line: 193, baseType: !13, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !816, file: !810, line: 196, baseType: !808, size: 32, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !816, file: !810, line: 200, baseType: !464, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !816, file: !810, line: 202, baseType: !834, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{!13, !808, !464, !807, !13}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !816, file: !810, line: 204, baseType: !838, size: 32, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{!13, !808, !464, !841, !13}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !816, file: !810, line: 207, baseType: !844, size: 32, offset: 352)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(types: !846)
!846 = !{!847, !808, !464, !847, !13}
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !848, line: 116, baseType: !849)
!848 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!849 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !816, file: !810, line: 208, baseType: !851, size: 32, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DISubroutineType(types: !853)
!853 = !{!13, !808, !464}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !816, file: !810, line: 211, baseType: !826, size: 64, offset: 416)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !816, file: !810, line: 212, baseType: !819, size: 32, offset: 480)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !816, file: !810, line: 213, baseType: !13, size: 32, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !816, file: !810, line: 216, baseType: !858, size: 24, offset: 544)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 24, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 3)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !816, file: !810, line: 217, baseType: !862, size: 8, offset: 568)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 8, elements: !784)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !816, file: !810, line: 220, baseType: !826, size: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !816, file: !810, line: 223, baseType: !13, size: 32, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !816, file: !810, line: 224, baseType: !866, size: 32, offset: 672)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !848, line: 46, baseType: !849)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !816, file: !810, line: 231, baseType: !868, size: 32, offset: 704)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !810, line: 35, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !870, line: 34, baseType: !871)
!870 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !870, line: 33, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !816, file: !810, line: 233, baseType: !874, size: 64, offset: 736)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !848, line: 170, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !848, line: 162, size: 64, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !875, file: !848, line: 164, baseType: !13, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !875, file: !848, line: 169, baseType: !879, size: 32, offset: 32)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !875, file: !848, line: 165, size: 32, elements: !880)
!880 = !{!881, !884}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !879, file: !848, line: 167, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !883, line: 116, baseType: !13)
!883 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !879, file: !848, line: 168, baseType: !885, size: 32)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 32, elements: !276)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !816, file: !810, line: 234, baseType: !13, size: 32, offset: 800)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !809, file: !810, line: 386, baseType: !814, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !809, file: !810, line: 386, baseType: !814, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !809, file: !810, line: 388, baseType: !13, size: 32, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !809, file: !810, line: 390, baseType: !807, size: 32, offset: 160)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !809, file: !810, line: 392, baseType: !13, size: 32, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !809, file: !810, line: 394, baseType: !13, size: 32, offset: 224)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !809, file: !810, line: 395, baseType: !894, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !810, line: 45, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !809, file: !810, line: 397, baseType: !897, size: 32, offset: 288)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !810, line: 349, size: 128, elements: !899)
!899 = !{!900, !913, !914, !915}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !898, file: !810, line: 352, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !810, line: 52, size: 192, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !902, file: !810, line: 54, baseType: !901, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !902, file: !810, line: 55, baseType: !13, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !902, file: !810, line: 55, baseType: !13, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !902, file: !810, line: 55, baseType: !13, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !902, file: !810, line: 55, baseType: !13, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !902, file: !810, line: 56, baseType: !910, size: 32, offset: 160)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 32, elements: !784)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !810, line: 22, baseType: !912)
!912 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !898, file: !810, line: 353, baseType: !13, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !898, file: !810, line: 354, baseType: !901, size: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !898, file: !810, line: 355, baseType: !916, size: 32, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !809, file: !810, line: 399, baseType: !918, size: 32, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !808}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !809, file: !810, line: 401, baseType: !13, size: 32, offset: 352)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !809, file: !810, line: 404, baseType: !13, size: 32, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !809, file: !810, line: 405, baseType: !807, size: 32, offset: 416)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !809, file: !810, line: 407, baseType: !925, size: 32, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !810, line: 324, size: 192, elements: !927)
!927 = !{!928, !930, !931, !932}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !926, file: !810, line: 325, baseType: !929, size: 48)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 48, elements: !859)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !926, file: !810, line: 326, baseType: !929, size: 48, offset: 48)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !926, file: !810, line: 327, baseType: !412, size: 16, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !926, file: !810, line: 330, baseType: !933, size: 64, offset: 128)
!933 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !809, file: !810, line: 408, baseType: !935, size: 32, offset: 480)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !810, line: 60, size: 288, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945, !946}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !936, file: !810, line: 62, baseType: !13, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !936, file: !810, line: 63, baseType: !13, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !936, file: !810, line: 64, baseType: !13, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !936, file: !810, line: 65, baseType: !13, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !936, file: !810, line: 66, baseType: !13, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !936, file: !810, line: 67, baseType: !13, size: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !936, file: !810, line: 68, baseType: !13, size: 32, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !936, file: !810, line: 69, baseType: !13, size: 32, offset: 224)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !936, file: !810, line: 70, baseType: !13, size: 32, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !809, file: !810, line: 409, baseType: !807, size: 32, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !809, file: !810, line: 412, baseType: !949, size: 32, offset: 544)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !13}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !809, file: !810, line: 416, baseType: !954, size: 32, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !810, line: 90, size: 1120, elements: !956)
!956 = !{!957, !958, !959, !963}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !955, file: !810, line: 91, baseType: !954, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !955, file: !810, line: 92, baseType: !13, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !955, file: !810, line: 93, baseType: !960, size: 1024, offset: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1024, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !955, file: !810, line: 94, baseType: !964, size: 32, offset: 1088)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !810, line: 79, size: 2112, elements: !966)
!966 = !{!967, !969, !970, !971}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !965, file: !810, line: 80, baseType: !968, size: 1024)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 1024, elements: !961)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !965, file: !810, line: 81, baseType: !968, size: 1024, offset: 1024)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !965, file: !810, line: 83, baseType: !911, size: 32, offset: 2048)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !965, file: !810, line: 86, baseType: !911, size: 32, offset: 2080)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !809, file: !810, line: 417, baseType: !955, size: 1120, offset: 608)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !809, file: !810, line: 420, baseType: !974, size: 96, offset: 1728)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !810, line: 296, size: 96, elements: !975)
!975 = !{!976, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !974, file: !810, line: 298, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !974, file: !810, line: 299, baseType: !13, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !974, file: !810, line: 300, baseType: !814, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !809, file: !810, line: 421, baseType: !814, size: 32, offset: 1824)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !809, file: !810, line: 422, baseType: !982, size: 32, offset: 1856)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !810, line: 359, size: 640, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !991, !992, !993, !994, !995, !996}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !983, file: !810, line: 362, baseType: !807, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !983, file: !810, line: 363, baseType: !874, size: 64, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !983, file: !810, line: 364, baseType: !874, size: 64, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !983, file: !810, line: 365, baseType: !874, size: 64, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !983, file: !810, line: 366, baseType: !990, size: 64, offset: 224)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 64, elements: !216)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !983, file: !810, line: 367, baseType: !13, size: 32, offset: 288)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !983, file: !810, line: 368, baseType: !874, size: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !983, file: !810, line: 369, baseType: !874, size: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !983, file: !810, line: 370, baseType: !874, size: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !983, file: !810, line: 371, baseType: !874, size: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !983, file: !810, line: 372, baseType: !874, size: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !809, file: !810, line: 423, baseType: !807, size: 32, offset: 1888)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !883, line: 46, baseType: !7)
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1001, globals: !1002, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!1001 = !{!807, !805}
!1002 = !{!799}
!1003 = !{!1004, !1005, !1006, !1007}
!1004 = !DILocalVariable(name: "r", arg: 1, scope: !801, file: !802, line: 63, type: !808)
!1005 = !DILocalVariable(name: "nbytes", arg: 2, scope: !801, file: !802, line: 63, type: !998)
!1006 = !DILocalVariable(name: "prev_heap_end", scope: !801, file: !802, line: 67, type: !807)
!1007 = !DILocalVariable(name: "stack", scope: !801, file: !802, line: 68, type: !807)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !1010, file: !1015, line: 4, type: !1021, isLocal: false, isDefinition: true)
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1011, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1012, splitDebugInlining: false, nameTableKind: None)
!1011 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC/Build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!1012 = !{!1008, !1013, !1019}
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !1010, file: !1015, line: 5, type: !1016, isLocal: false, isDefinition: true)
!1015 = !DIFile(filename: "Build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 88, elements: !1017)
!1017 = !{!1018}
!1018 = !DISubrange(count: 11)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !1010, file: !1015, line: 6, type: !1016, isLocal: false, isDefinition: true)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 248, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 31)
!1024 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1025, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1026, retainedTypes: !1027, splitDebugInlining: false, nameTableKind: None)
!1025 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!1026 = !{!124}
!1027 = !{!58, !80}
!1028 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1029, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1030, splitDebugInlining: false, nameTableKind: None)
!1029 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/eint_edge_falling/GCC")
!1030 = !{!1031, !1056}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1033, file: !210, line: 397, baseType: !251, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1033, file: !210, line: 398, baseType: !215, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1033, file: !210, line: 399, baseType: !215, size: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1033, file: !210, line: 400, baseType: !215, size: 32, offset: 96)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1033, file: !210, line: 401, baseType: !215, size: 32, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1033, file: !210, line: 402, baseType: !215, size: 32, offset: 160)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1033, file: !210, line: 403, baseType: !258, size: 96, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1033, file: !210, line: 404, baseType: !215, size: 32, offset: 288)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1033, file: !210, line: 405, baseType: !215, size: 32, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1033, file: !210, line: 406, baseType: !215, size: 32, offset: 352)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1033, file: !210, line: 407, baseType: !215, size: 32, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1033, file: !210, line: 408, baseType: !215, size: 32, offset: 416)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !1033, file: !210, line: 409, baseType: !215, size: 32, offset: 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !1033, file: !210, line: 410, baseType: !215, size: 32, offset: 480)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !1033, file: !210, line: 411, baseType: !269, size: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !1033, file: !210, line: 412, baseType: !251, size: 32, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !1033, file: !210, line: 413, baseType: !251, size: 32, offset: 608)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !1033, file: !210, line: 414, baseType: !275, size: 128, offset: 640)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !1033, file: !210, line: 415, baseType: !279, size: 160, offset: 768)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1033, file: !210, line: 416, baseType: !283, size: 160, offset: 928)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !1033, file: !210, line: 417, baseType: !215, size: 32, offset: 1088)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 32)
