; ModuleID = 'build/adafruit_feather_stm32f405/sensor/tmp112/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %struct.k_spinlock, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 94, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5248, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 82)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2624, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 369, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f405xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 360, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 362, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 363, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 364, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 365, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 366, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 367, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 368, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !348, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !334, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !329)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !324}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 192, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, size: 32, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, size: 32, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !320, file: !321, line: 52, baseType: !22, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !325, size: 64, offset: 928)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !325, file: !284, line: 63, baseType: !121, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !325, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!329 = !{!330, !331, !332, !333}
!330 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!331 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!332 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!333 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 96, elements: !346)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !336, line: 52, size: 96, elements: !337)
!336 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!337 = !{!338, !339, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !335, file: !336, line: 53, baseType: !22, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !335, file: !336, line: 54, baseType: !200, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !335, file: !336, line: 55, baseType: !341, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !342, line: 151, baseType: !343)
!342 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 149, size: 32, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !343, file: !342, line: 150, baseType: !121, size: 32)
!346 = !{!347}
!347 = !DISubrange(count: 1)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 96, elements: !346)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !352, file: !385, line: 39, type: !154, isLocal: true, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !354, globals: !384, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!354 = !{!355, !102, !103, !372, !154}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !357, line: 1226, baseType: !358)
!357 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 1213, size: 352, elements: !359)
!359 = !{!360, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !358, file: !357, line: 1215, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !358, file: !357, line: 1216, baseType: !120, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !358, file: !357, line: 1217, baseType: !120, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !358, file: !357, line: 1218, baseType: !120, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !358, file: !357, line: 1219, baseType: !120, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !358, file: !357, line: 1220, baseType: !120, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !358, file: !357, line: 1221, baseType: !120, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !358, file: !357, line: 1222, baseType: !120, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !358, file: !357, line: 1223, baseType: !120, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !358, file: !357, line: 1224, baseType: !120, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !358, file: !357, line: 1225, baseType: !120, size: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !375, line: 27, size: 96, elements: !376)
!375 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !374, file: !375, line: 29, baseType: !121, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !375, line: 31, baseType: !144, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !374, file: !375, line: 37, baseType: !380, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !342, line: 146, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !342, line: 141, size: 32, elements: !382)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !381, file: !342, line: 143, baseType: !121, size: 32)
!384 = !{!350}
!385 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !388, file: !395, line: 21, type: !106, isLocal: true, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !390, globals: !394, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!390 = !{!391, !103, !102}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !393, line: 22, baseType: !103)
!393 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !{!386}
!395 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !398, file: !403, line: 13, type: !420, isLocal: true, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !400, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!400 = !{!401, !396}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "mpu_config", scope: !398, file: !403, line: 37, type: !404, isLocal: false, isDefinition: true)
!403 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !375, line: 41, size: 64, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !405, file: !375, line: 43, baseType: !121, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !405, file: !375, line: 45, baseType: !409, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !375, line: 27, size: 96, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !411, file: !375, line: 29, baseType: !121, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !375, line: 31, baseType: !144, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !411, file: !375, line: 37, baseType: !416, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !342, line: 146, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !342, line: 141, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !417, file: !342, line: 143, baseType: !121, size: 32)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 192, elements: !242)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !423, file: !528, line: 72, type: !612, isLocal: true, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !425, retainedTypes: !514, globals: !525, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!425 = !{!30, !426}
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!428 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!429 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!430 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!431 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!432 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!433 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!434 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!435 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!436 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!437 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!438 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!439 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!440 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!441 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!442 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!443 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!444 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!445 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!446 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!447 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!448 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!449 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!450 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!451 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!452 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!453 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!454 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!455 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!456 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!457 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!458 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!459 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!460 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!461 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!462 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!463 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!464 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!465 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!466 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!467 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!468 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!469 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!470 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!471 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!472 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!473 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!474 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!475 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!476 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!477 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!478 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!479 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!480 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!481 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!482 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!483 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!484 = !DIEnumerator(name: "FSMC_IRQn", value: 48)
!485 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!486 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!487 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!488 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!489 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!490 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!491 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!492 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!493 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!494 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!495 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!496 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!497 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!498 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!499 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!500 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!501 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!502 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!503 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!504 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!505 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!506 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!507 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!508 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!509 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!510 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!511 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!512 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!513 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!514 = !{!200, !103, !102, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 354, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 346, size: 192, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !517, file: !116, line: 348, baseType: !120, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !517, file: !116, line: 349, baseType: !120, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !517, file: !116, line: 350, baseType: !120, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !517, file: !116, line: 351, baseType: !120, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !517, file: !116, line: 352, baseType: !120, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !517, file: !116, line: 353, baseType: !120, size: 32, offset: 160)
!525 = !{!526, !532, !548, !559, !576, !421, !578, !592, !594, !596, !598, !600, !602, !604, !606, !608, !610}
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !423, file: !528, line: 424, type: !529, isLocal: false, isDefinition: true, align: 16)
!528 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 4)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "__device_dts_ord_37", scope: !423, file: !528, line: 424, type: !534, isLocal: false, isDefinition: true, align: 32)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !536)
!536 = !{!537, !538, !539, !540, !546, !547}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !535, file: !141, line: 380, baseType: !144, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !535, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !535, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !535, file: !141, line: 386, baseType: !541, size: 32, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !542, file: !141, line: 359, baseType: !154, size: 8)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !542, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !535, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_37", scope: !423, file: !528, line: 424, type: !550, isLocal: true, isDefinition: true, align: 32)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !552)
!552 = !{!553, !558}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !551, file: !132, line: 60, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DISubroutineType(types: !556)
!556 = !{!103, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !551, file: !132, line: 65, baseType: !557, size: 32, offset: 32)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "exti_data", scope: !423, file: !528, line: 423, type: !561, isLocal: true, isDefinition: true)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !528, line: 107, size: 1472, elements: !562)
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !561, file: !528, line: 109, baseType: !564, size: 1472)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1472, elements: !574)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !528, line: 101, size: 64, elements: !566)
!566 = !{!567, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !565, file: !528, line: 102, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !569, line: 63, baseType: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !103, !102}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !565, file: !528, line: 103, baseType: !102, size: 32, offset: 32)
!574 = !{!575}
!575 = !DISubrange(count: 23)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_37", scope: !423, file: !528, line: 424, type: !542, isLocal: true, isDefinition: true, align: 8)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !580, file: !528, line: 493, type: !585, isLocal: true, isDefinition: true, align: 32)
!580 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !528, file: !528, line: 460, type: !581, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !423, retainedNodes: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !557}
!583 = !{!584}
!584 = !DILocalVariable(name: "dev", arg: 1, scope: !580, file: !528, line: 460, type: !557)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !586)
!586 = !{!587, !589, !590, !591}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !585, file: !10, line: 55, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !585, file: !10, line: 57, baseType: !588, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !585, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !585, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !580, file: !528, line: 497, type: !585, isLocal: true, isDefinition: true, align: 32)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !580, file: !528, line: 507, type: !585, isLocal: true, isDefinition: true, align: 32)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !580, file: !528, line: 512, type: !585, isLocal: true, isDefinition: true, align: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !580, file: !528, line: 516, type: !585, isLocal: true, isDefinition: true, align: 32)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !580, file: !528, line: 523, type: !585, isLocal: true, isDefinition: true, align: 32)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !580, file: !528, line: 527, type: !585, isLocal: true, isDefinition: true, align: 32)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !580, file: !528, line: 581, type: !585, isLocal: true, isDefinition: true, align: 32)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !580, file: !528, line: 586, type: !585, isLocal: true, isDefinition: true, align: 32)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !580, file: !528, line: 591, type: !585, isLocal: true, isDefinition: true, align: 32)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !580, file: !528, line: 595, type: !585, isLocal: true, isDefinition: true, align: 32)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 736, elements: !574)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 155, baseType: !426)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !617, file: !622, line: 24, type: !648, isLocal: false, isDefinition: true, align: 16)
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !619, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!619 = !{!620, !615, !626, !628, !630, !632, !634, !636, !638, !640, !642, !644, !646}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !617, file: !622, line: 19, type: !623, isLocal: false, isDefinition: true, align: 16)
!622 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 224, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 14)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !617, file: !622, line: 31, type: !529, isLocal: false, isDefinition: true, align: 16)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !617, file: !622, line: 38, type: !529, isLocal: false, isDefinition: true, align: 16)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !617, file: !622, line: 45, type: !529, isLocal: false, isDefinition: true, align: 16)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !617, file: !622, line: 52, type: !529, isLocal: false, isDefinition: true, align: 16)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !617, file: !622, line: 59, type: !529, isLocal: false, isDefinition: true, align: 16)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !617, file: !622, line: 66, type: !529, isLocal: false, isDefinition: true, align: 16)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !617, file: !622, line: 73, type: !529, isLocal: false, isDefinition: true, align: 16)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !617, file: !622, line: 80, type: !529, isLocal: false, isDefinition: true, align: 16)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !617, file: !622, line: 87, type: !529, isLocal: false, isDefinition: true, align: 16)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !617, file: !622, line: 94, type: !529, isLocal: false, isDefinition: true, align: 16)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_31", scope: !617, file: !622, line: 101, type: !529, isLocal: false, isDefinition: true, align: 16)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 3)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !653, file: !714, line: 398, type: !747, isLocal: true, isDefinition: true)
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !655, retainedTypes: !668, globals: !711, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!655 = !{!656, !30, !661}
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !657, line: 197, baseType: !32, size: 32, elements: !658)
!657 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = !{!659, !660}
!659 = !DIEnumerator(name: "SUCCESS", value: 0)
!660 = !DIEnumerator(name: "ERROR", value: 1)
!661 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !662, line: 44, baseType: !32, size: 32, elements: !663)
!662 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!663 = !{!664, !665, !666, !667}
!664 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!665 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!666 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!667 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!668 = !{!102, !103, !121, !669, !704, !710}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 532, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 500, size: 1088, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !671, file: !116, line: 502, baseType: !120, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !671, file: !116, line: 503, baseType: !120, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !671, file: !116, line: 504, baseType: !120, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !671, file: !116, line: 505, baseType: !120, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !671, file: !116, line: 506, baseType: !120, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !671, file: !116, line: 507, baseType: !120, size: 32, offset: 160)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !671, file: !116, line: 508, baseType: !120, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !671, file: !116, line: 509, baseType: !121, size: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !671, file: !116, line: 510, baseType: !120, size: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !671, file: !116, line: 511, baseType: !120, size: 32, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !671, file: !116, line: 512, baseType: !684, size: 64, offset: 320)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !671, file: !116, line: 513, baseType: !120, size: 32, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !671, file: !116, line: 514, baseType: !120, size: 32, offset: 416)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !671, file: !116, line: 515, baseType: !120, size: 32, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !671, file: !116, line: 516, baseType: !121, size: 32, offset: 480)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !671, file: !116, line: 517, baseType: !120, size: 32, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !671, file: !116, line: 518, baseType: !120, size: 32, offset: 544)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !671, file: !116, line: 519, baseType: !684, size: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !671, file: !116, line: 520, baseType: !120, size: 32, offset: 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !671, file: !116, line: 521, baseType: !120, size: 32, offset: 672)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !671, file: !116, line: 522, baseType: !120, size: 32, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !671, file: !116, line: 523, baseType: !121, size: 32, offset: 736)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !671, file: !116, line: 524, baseType: !120, size: 32, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !671, file: !116, line: 525, baseType: !120, size: 32, offset: 800)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !671, file: !116, line: 526, baseType: !684, size: 64, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !671, file: !116, line: 527, baseType: !120, size: 32, offset: 896)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !671, file: !116, line: 528, baseType: !120, size: 32, offset: 928)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !671, file: !116, line: 529, baseType: !684, size: 64, offset: 960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !671, file: !116, line: 530, baseType: !120, size: 32, offset: 1024)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !671, file: !116, line: 531, baseType: !120, size: 32, offset: 1056)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !706, line: 343, size: 64, elements: !707)
!706 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !705, file: !706, line: 344, baseType: !121, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !705, file: !706, line: 345, baseType: !121, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!711 = !{!712, !718, !734, !745, !651}
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !653, file: !714, line: 752, type: !715, isLocal: false, isDefinition: true, align: 16)
!714 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 928, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 58)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !653, file: !714, line: 752, type: !720, isLocal: false, isDefinition: true, align: 32)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !722)
!722 = !{!723, !724, !725, !726, !732, !733}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !721, file: !141, line: 380, baseType: !144, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !721, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !721, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !721, file: !141, line: 386, baseType: !727, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !728, file: !141, line: 359, baseType: !154, size: 8)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !728, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !721, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !721, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !653, file: !714, line: 752, type: !736, isLocal: true, isDefinition: true, align: 32)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !738)
!738 = !{!739, !744}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !737, file: !132, line: 60, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DISubroutineType(types: !742)
!742 = !{!103, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !737, file: !132, line: 65, baseType: !743, size: 32, offset: 32)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !653, file: !714, line: 752, type: !728, isLocal: true, isDefinition: true, align: 8)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !662, line: 100, size: 224, elements: !748)
!748 = !{!749, !755, !756, !765, !770, !775, !781}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !747, file: !662, line: 101, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !662, line: 76, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DISubroutineType(types: !753)
!753 = !{!103, !743, !754}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !662, line: 56, baseType: !102)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !747, file: !662, line: 102, baseType: !750, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !747, file: !662, line: 103, baseType: !757, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !662, line: 83, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DISubroutineType(types: !760)
!760 = !{!103, !743, !754, !761, !102}
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !662, line: 72, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !743, !754, !102}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !747, file: !662, line: 104, baseType: !766, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !662, line: 79, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = !DISubroutineType(types: !769)
!769 = !{!103, !743, !754, !710}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !747, file: !662, line: 105, baseType: !771, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !662, line: 88, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{!661, !743, !754}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !747, file: !662, line: 106, baseType: !776, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !662, line: 92, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DISubroutineType(types: !779)
!779 = !{!103, !743, !754, !780}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !662, line: 64, baseType: !102)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !747, file: !662, line: 107, baseType: !782, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !662, line: 96, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DISubroutineType(types: !785)
!785 = !{!103, !743, !754, !102}
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !788, file: !845, line: 603, type: !847, isLocal: true, isDefinition: true, align: 32)
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !790, globals: !842, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!790 = !{!102, !103, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !794, line: 336, size: 160, elements: !795)
!794 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!795 = !{!796, !816, !820, !824, !837}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !793, file: !794, line: 365, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{!103, !800, !815}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !803)
!803 = !{!804, !805, !806, !807, !813, !814}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !802, file: !141, line: 380, baseType: !144, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !802, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !802, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !802, file: !141, line: 386, baseType: !808, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !809, file: !141, line: 359, baseType: !154, size: 8)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !809, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !802, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !802, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !793, file: !794, line: 366, baseType: !817, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !800, !155}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !793, file: !794, line: 374, baseType: !821, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{!103, !800}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !793, file: !794, line: 377, baseType: !825, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{!103, !800, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !794, line: 122, size: 64, elements: !831)
!831 = !{!832, !833, !834, !835, !836}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !830, file: !794, line: 123, baseType: !121, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !830, file: !794, line: 124, baseType: !154, size: 8, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !830, file: !794, line: 125, baseType: !154, size: 8, offset: 40)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !830, file: !794, line: 126, baseType: !154, size: 8, offset: 48)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !830, file: !794, line: 127, baseType: !154, size: 8, offset: 56)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !793, file: !794, line: 379, baseType: !838, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{!103, !800, !841}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!842 = !{!786, !843}
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !788, file: !845, line: 38, type: !846, isLocal: true, isDefinition: true)
!845 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !848, file: !132, line: 60, baseType: !821, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !848, file: !132, line: 65, baseType: !800, size: 32, offset: 32)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !854, file: !1024, line: 762, type: !1143, isLocal: true, isDefinition: true)
!854 = distinct !DICompileUnit(language: DW_LANG_C99, file: !855, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !856, retainedTypes: !874, globals: !1021, splitDebugInlining: false, nameTableKind: None)
!855 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/sensor/tmp112")
!856 = !{!30, !857, !863, !868, !661}
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !858, line: 506, baseType: !32, size: 32, elements: !859)
!858 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !{!860, !861, !862}
!860 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!861 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!862 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !858, line: 512, baseType: !32, size: 32, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!866 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!867 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!868 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !569, line: 43, baseType: !32, size: 32, elements: !869)
!869 = !{!870, !871, !872, !873}
!870 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!871 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!872 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!873 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!874 = !{!102, !103, !875, !945, !950, !910, !863, !857, !955, !956, !121, !970, !925, !980, !981, !982}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !858, line: 523, size: 288, elements: !878)
!878 = !{!879, !900, !906, !911, !915, !916, !917, !921, !941}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !877, file: !858, line: 524, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DISubroutineType(types: !882)
!882 = !{!103, !883, !898, !899}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !886)
!886 = !{!887, !888, !889, !890, !896, !897}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !141, line: 380, baseType: !144, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !885, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !885, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !885, file: !141, line: 386, baseType: !891, size: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !892, file: !141, line: 359, baseType: !154, size: 8)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !892, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !885, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !885, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !858, line: 237, baseType: !154)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !858, line: 257, baseType: !121)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !877, file: !858, line: 530, baseType: !901, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!103, !883, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !858, line: 229, baseType: !121)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !877, file: !858, line: 532, baseType: !907, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{!103, !883, !910, !905}
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !858, line: 216, baseType: !121)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !877, file: !858, line: 535, baseType: !912, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(types: !914)
!914 = !{!103, !883, !910}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !877, file: !858, line: 537, baseType: !912, size: 32, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !877, file: !858, line: 539, baseType: !912, size: 32, offset: 160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !877, file: !858, line: 541, baseType: !918, size: 32, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{!103, !883, !898, !857, !863}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !877, file: !858, line: 544, baseType: !922, size: 32, offset: 224)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!103, !883, !925, !157}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !858, line: 478, size: 96, elements: !927)
!927 = !{!928, !935, !940}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !926, file: !858, line: 482, baseType: !929, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !930, line: 33, baseType: !931)
!930 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !930, line: 29, size: 32, elements: !932)
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !930, line: 30, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !926, file: !858, line: 485, baseType: !936, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !858, line: 464, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !883, !925, !910}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !926, file: !858, line: 493, baseType: !910, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !877, file: !858, line: 547, baseType: !942, size: 32, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DISubroutineType(types: !944)
!944 = !{!121, !883}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !858, line: 428, size: 32, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !947, file: !858, line: 434, baseType: !910, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !858, line: 441, size: 32, elements: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !952, file: !858, line: 447, baseType: !910, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 441, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 430, size: 320, elements: !959)
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !968}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !958, file: !116, line: 432, baseType: !120, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !958, file: !116, line: 433, baseType: !120, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !958, file: !116, line: 434, baseType: !120, size: 32, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !958, file: !116, line: 435, baseType: !120, size: 32, offset: 96)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !958, file: !116, line: 436, baseType: !120, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !958, file: !116, line: 437, baseType: !120, size: 32, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !958, file: !116, line: 438, baseType: !120, size: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !958, file: !116, line: 439, baseType: !120, size: 32, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !958, file: !116, line: 440, baseType: !969, size: 64, offset: 256)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 454, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 447, size: 288, elements: !973)
!973 = !{!974, !975, !976, !978, !979}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !972, file: !116, line: 449, baseType: !120, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !972, file: !116, line: 450, baseType: !120, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !972, file: !116, line: 451, baseType: !977, size: 128, offset: 64)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !530)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !972, file: !116, line: 452, baseType: !684, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !972, file: !116, line: 453, baseType: !120, size: 32, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !662, line: 100, size: 224, elements: !985)
!985 = !{!986, !991, !992, !1001, !1006, !1011, !1016}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !984, file: !662, line: 101, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !662, line: 76, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DISubroutineType(types: !990)
!990 = !{!103, !883, !754}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !984, file: !662, line: 102, baseType: !987, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !984, file: !662, line: 103, baseType: !993, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !662, line: 83, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DISubroutineType(types: !996)
!996 = !{!103, !883, !754, !997, !102}
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !662, line: 72, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !883, !754, !102}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !984, file: !662, line: 104, baseType: !1002, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !662, line: 79, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!103, !883, !754, !710}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !984, file: !662, line: 105, baseType: !1007, size: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !662, line: 88, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!661, !883, !754}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !984, file: !662, line: 106, baseType: !1012, size: 32, offset: 160)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !662, line: 92, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!103, !883, !754, !780}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !984, file: !662, line: 107, baseType: !1017, size: 32, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !662, line: 96, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!103, !883, !754, !102}
!1021 = !{!1022, !1028, !1030, !1040, !1045, !1047, !1049, !1051, !1053, !1055, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1071, !1073, !1075, !1077, !1079, !1081, !1083, !1085, !1087, !1089, !1091, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !852, !1139, !1141, !1154, !1156, !1158, !1160, !1162, !1164, !1166}
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !854, file: !1024, line: 762, type: !1025, isLocal: false, isDefinition: true, align: 16)
!1024 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !1026)
!1026 = !{!1027}
!1027 = !DISubrange(count: 6)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "__device_dts_ord_74", scope: !854, file: !1024, line: 762, type: !884, isLocal: false, isDefinition: true, align: 32)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_74", scope: !854, file: !1024, line: 762, type: !1032, isLocal: true, isDefinition: true, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1034)
!1034 = !{!1035, !1039}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1033, file: !132, line: 60, baseType: !1036, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!103, !883}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1033, file: !132, line: 65, baseType: !883, size: 32, offset: 32)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !854, file: !1024, line: 766, type: !1042, isLocal: false, isDefinition: true, align: 16)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 5)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "__device_dts_ord_67", scope: !854, file: !1024, line: 766, type: !884, isLocal: false, isDefinition: true, align: 32)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_67", scope: !854, file: !1024, line: 766, type: !1032, isLocal: true, isDefinition: true, align: 32)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !854, file: !1024, line: 770, type: !1025, isLocal: false, isDefinition: true, align: 16)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
