; ModuleID = 'build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.osTimerAttr_t = type { i8*, i32, i8*, i32 }
%struct.osMessageQueueAttr_t = type { i8*, i32, i8*, i32, i8*, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.k_mem_slab = type { %union.anon, %struct.k_spinlock, i32, i32, i8*, i8*, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.wdt_sam_dev_cfg = type { %struct._thread_stack_info* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.wdt_driver_api = type { i32 (%struct.device*, i8)*, i32 (%struct.device*)*, i32 (%struct.device*, %struct.wdt_timeout_cfg*)*, i32 (%struct.device*, i32)* }
%struct.wdt_timeout_cfg = type { %struct._thread_arch, void (%struct.device*, i32)*, i8 }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "timer_attr", scope: !27, file: !122, line: 20, type: !147, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !117, globals: !119, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v2/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!29 = !{!30, !42, !47}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 195, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os2.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osError", value: -1)
!36 = !DIEnumerator(name: "osErrorTimeout", value: -2)
!37 = !DIEnumerator(name: "osErrorResource", value: -3)
!38 = !DIEnumerator(name: "osErrorParameter", value: -4)
!39 = !DIEnumerator(name: "osErrorNoMemory", value: -5)
!40 = !DIEnumerator(name: "osErrorISR", value: -6)
!41 = !DIEnumerator(name: "osStatusReserved", value: 2147483647)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 164, baseType: !43, size: 32, elements: !44)
!43 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "osTimerOnce", value: 0)
!46 = !DIEnumerator(name: "osTimerPeriodic", value: 1)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !48, line: 27, baseType: !43, size: 32, elements: !49)
!48 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!50 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!51 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!52 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!53 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!54 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!55 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!56 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!57 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!58 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!59 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!60 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!61 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!62 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!63 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!64 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!65 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!66 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!116 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!117 = !{!118, !32}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!119 = !{!25, !120, !124, !127, !142}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "message_id", scope: !27, file: !122, line: 24, type: !123, isLocal: false, isDefinition: true)
!122 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueId_t", file: !31, line: 226, baseType: !118)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "data", scope: !27, file: !122, line: 26, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !43)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "mem_attrs", scope: !27, file: !122, line: 30, type: !129, isLocal: true, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueAttr_t", file: !31, line: 299, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 292, size: 192, elements: !132)
!132 = !{!133, !137, !138, !139, !140, !141}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !31, line: 293, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !131, file: !31, line: 294, baseType: !126, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !131, file: !31, line: 295, baseType: !118, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !131, file: !31, line: 296, baseType: !126, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mq_mem", scope: !131, file: !31, line: 297, baseType: !118, size: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mq_size", scope: !131, file: !31, line: 298, baseType: !126, size: 32, offset: 160)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "sample_mem", scope: !27, file: !122, line: 28, type: !144, isLocal: true, isDefinition: true, align: 32)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 4)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerAttr_t", file: !31, line: 255, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 250, size: 128, elements: !150)
!150 = !{!151, !152, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !31, line: 251, baseType: !134, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !149, file: !31, line: 252, baseType: !126, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !149, file: !31, line: 253, baseType: !118, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !149, file: !31, line: 254, baseType: !126, size: 32, offset: 96)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "_char_out", scope: !157, file: !161, line: 54, type: !162, isLocal: false, isDefinition: true)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !117, globals: !160, splitDebugInlining: false, nameTableKind: None)
!158 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!159 = !{!47}
!160 = !{!155}
!161 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!32, !32}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !167, file: !232, line: 235, type: !233, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !169, globals: !231, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!169 = !{!118, !32, !170, !181}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !172, line: 46, baseType: !173)
!172 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 41, size: 128, elements: !174)
!174 = !{!175, !177, !178, !180}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !173, file: !172, line: 42, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !173, file: !172, line: 43, baseType: !176, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !173, file: !172, line: 44, baseType: !179, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !173, file: !172, line: 45, baseType: !179, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !183, line: 75, baseType: !184)
!183 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 41, size: 2176, elements: !185)
!185 = !{!186, !187, !188, !189, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !209, !213, !214, !215, !216, !217, !218, !219, !220, !224, !225, !226, !227, !228, !229, !230}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !184, file: !183, line: 42, baseType: !176, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !184, file: !183, line: 43, baseType: !176, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !184, file: !183, line: 44, baseType: !179, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !184, file: !183, line: 45, baseType: !190, size: 32, offset: 96)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 32, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 1)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !184, file: !183, line: 46, baseType: !176, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !184, file: !183, line: 47, baseType: !176, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !184, file: !183, line: 48, baseType: !179, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !184, file: !183, line: 49, baseType: !176, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !184, file: !183, line: 50, baseType: !176, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !184, file: !183, line: 51, baseType: !179, size: 32, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !184, file: !183, line: 52, baseType: !176, size: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !184, file: !183, line: 53, baseType: !190, size: 32, offset: 352)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !184, file: !183, line: 54, baseType: !176, size: 32, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !184, file: !183, line: 55, baseType: !190, size: 32, offset: 416)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !184, file: !183, line: 56, baseType: !176, size: 32, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !184, file: !183, line: 57, baseType: !190, size: 32, offset: 480)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !184, file: !183, line: 58, baseType: !206, size: 96, offset: 512)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 96, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 3)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !184, file: !183, line: 59, baseType: !210, size: 160, offset: 608)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 160, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 5)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !184, file: !183, line: 60, baseType: !176, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !184, file: !183, line: 61, baseType: !176, size: 32, offset: 800)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !184, file: !183, line: 62, baseType: !179, size: 32, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !184, file: !183, line: 63, baseType: !179, size: 32, offset: 864)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !184, file: !183, line: 64, baseType: !176, size: 32, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !184, file: !183, line: 65, baseType: !176, size: 32, offset: 928)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !184, file: !183, line: 66, baseType: !176, size: 32, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !184, file: !183, line: 67, baseType: !221, size: 832, offset: 992)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 832, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 26)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !184, file: !183, line: 68, baseType: !176, size: 32, offset: 1824)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !184, file: !183, line: 69, baseType: !179, size: 32, offset: 1856)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !184, file: !183, line: 70, baseType: !210, size: 160, offset: 1888)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !184, file: !183, line: 71, baseType: !176, size: 32, offset: 2048)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !184, file: !183, line: 72, baseType: !176, size: 32, offset: 2080)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !184, file: !183, line: 73, baseType: !179, size: 32, offset: 2112)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !184, file: !183, line: 74, baseType: !176, size: 32, offset: 2144)
!231 = !{!165}
!232 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !{!237, !265}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !234, file: !235, line: 60, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DISubroutineType(types: !240)
!240 = !{!32, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246, !247, !248, !249, !258, !259}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !244, line: 380, baseType: !134, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !243, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !243, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !243, file: !244, line: 386, baseType: !250, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !252)
!252 = !{!253, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !251, file: !244, line: 359, baseType: !254, size: 8)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !255)
!255 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !251, file: !244, line: 364, baseType: !257, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!257 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !244, line: 388, baseType: !118, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !243, file: !244, line: 396, baseType: !260, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !244, line: 43, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !264)
!264 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !234, file: !235, line: 65, baseType: !241, size: 32, offset: 32)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "static_regions", scope: !268, file: !277, line: 62, type: !439, isLocal: true, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !270, globals: !273, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!270 = !{!271, !32, !126, !118}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !272, line: 214, baseType: !43)
!272 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !{!274, !266}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !276, file: !277, line: 198, type: !427, isLocal: true, isDefinition: true)
!276 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !277, file: !277, line: 175, type: !278, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !268, retainedNodes: !422)
!277 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !DISubroutineType(types: !279)
!279 = !{null, !280}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !282, line: 245, size: 1472, elements: !283)
!282 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !{!284, !353, !366, !367, !368, !373, !385, !386, !390, !391, !397, !417}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !281, file: !282, line: 247, baseType: !285, size: 384)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !282, line: 57, size: 384, elements: !286)
!286 = !{!287, !315, !323, !324, !325, !338, !339, !340}
!287 = !DIDerivedType(tag: DW_TAG_member, scope: !285, file: !282, line: 60, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !285, file: !282, line: 60, size: 64, elements: !289)
!289 = !{!290, !306}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !288, file: !282, line: 61, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !292, line: 49, baseType: !293)
!292 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !292, line: 37, size: 64, elements: !294)
!294 = !{!295, !301}
!295 = !DIDerivedType(tag: DW_TAG_member, scope: !293, file: !292, line: 38, baseType: !296, size: 32)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !292, line: 38, size: 32, elements: !297)
!297 = !{!298, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !296, file: !292, line: 39, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !292, line: 40, baseType: !299, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, scope: !293, file: !292, line: 42, baseType: !302, size: 32, offset: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !292, line: 42, size: 32, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !302, file: !292, line: 43, baseType: !299, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !302, file: !292, line: 44, baseType: !299, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !288, file: !282, line: 62, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !308, line: 49, size: 64, elements: !309)
!308 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !307, file: !308, line: 50, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 64, elements: !313)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!313 = !{!314}
!314 = !DISubrange(count: 2)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !285, file: !282, line: 68, baseType: !316, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !318, line: 233, baseType: !319)
!318 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 231, size: 64, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !319, file: !318, line: 232, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !292, line: 48, baseType: !293)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !285, file: !282, line: 71, baseType: !254, size: 8, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !285, file: !282, line: 74, baseType: !254, size: 8, offset: 104)
!325 = !DIDerivedType(tag: DW_TAG_member, scope: !285, file: !282, line: 90, baseType: !326, size: 16, offset: 112)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !285, file: !282, line: 90, size: 16, elements: !327)
!327 = !{!328, !335}
!328 = !DIDerivedType(tag: DW_TAG_member, scope: !326, file: !282, line: 91, baseType: !329, size: 16)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !282, line: 91, size: 16, elements: !330)
!330 = !{!331, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !329, file: !282, line: 96, baseType: !332, size: 8)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !333)
!333 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !329, file: !282, line: 97, baseType: !254, size: 8, offset: 8)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !326, file: !282, line: 100, baseType: !336, size: 16)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !337)
!337 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !285, file: !282, line: 107, baseType: !126, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !285, file: !282, line: 127, baseType: !118, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !285, file: !282, line: 131, baseType: !341, size: 192, offset: 192)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !318, line: 244, size: 192, elements: !342)
!342 = !{!343, !344, !350}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !341, file: !318, line: 245, baseType: !291, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !341, file: !318, line: 246, baseType: !345, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !318, line: 242, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !341, file: !318, line: 249, baseType: !351, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !352)
!352 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !281, file: !282, line: 250, baseType: !354, size: 288, offset: 384)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !355, line: 25, size: 288, elements: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !354, file: !355, line: 26, baseType: !126, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !354, file: !355, line: 27, baseType: !126, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !354, file: !355, line: 28, baseType: !126, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !354, file: !355, line: 29, baseType: !126, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !354, file: !355, line: 30, baseType: !126, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !354, file: !355, line: 31, baseType: !126, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !354, file: !355, line: 32, baseType: !126, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !354, file: !355, line: 33, baseType: !126, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !354, file: !355, line: 34, baseType: !126, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !281, file: !282, line: 253, baseType: !118, size: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !281, file: !282, line: 256, baseType: !317, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !281, file: !282, line: 259, baseType: !369, size: 16, offset: 768)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !282, line: 236, size: 16, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !369, file: !282, line: 237, baseType: !257, size: 8)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !369, file: !282, line: 238, baseType: !254, size: 8, offset: 8)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !281, file: !282, line: 271, baseType: !374, size: 128, offset: 800)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !282, line: 34, size: 128, elements: !375)
!375 = !{!376, !382, !383, !384}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !374, file: !282, line: 35, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !378, line: 46, baseType: !379)
!378 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !118, !118, !118}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !374, file: !282, line: 36, baseType: !118, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !374, file: !282, line: 37, baseType: !118, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !374, file: !282, line: 38, baseType: !118, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !281, file: !282, line: 274, baseType: !280, size: 32, offset: 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !282, line: 279, baseType: !387, size: 256, offset: 960)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 256, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !281, file: !282, line: 294, baseType: !32, size: 32, offset: 1216)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !281, file: !282, line: 300, baseType: !392, size: 96, offset: 1248)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !282, line: 149, size: 96, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !392, file: !282, line: 153, baseType: !22, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !392, file: !282, line: 162, baseType: !271, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !392, file: !282, line: 168, baseType: !271, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !281, file: !282, line: 325, baseType: !398, size: 32, offset: 1344)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !400, line: 5073, size: 192, elements: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !{!402, !411, !412}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !399, file: !400, line: 5074, baseType: !403, size: 96)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !404, line: 56, size: 96, elements: !405)
!404 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!405 = !{!406, !409, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !403, file: !404, line: 57, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !404, line: 57, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !403, file: !404, line: 58, baseType: !118, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !403, file: !404, line: 59, baseType: !271, size: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !399, file: !400, line: 5075, baseType: !317, size: 64, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !399, file: !400, line: 5076, baseType: !413, size: 32, offset: 160)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !414, line: 43, size: 32, elements: !415)
!414 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !413, file: !414, line: 52, baseType: !22, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !281, file: !282, line: 343, baseType: !418, size: 64, offset: 1376)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !355, line: 60, size: 64, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !418, file: !355, line: 63, baseType: !126, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !418, file: !355, line: 66, baseType: !126, size: 32, offset: 32)
!422 = !{!423, !424, !425, !426}
!423 = !DILocalVariable(name: "thread", arg: 1, scope: !276, file: !277, line: 175, type: !280)
!424 = !DILocalVariable(name: "region_num", scope: !276, file: !277, line: 200, type: !254)
!425 = !DILocalVariable(name: "guard_start", scope: !276, file: !277, line: 265, type: !22)
!426 = !DILocalVariable(name: "guard_size", scope: !276, file: !277, line: 266, type: !271)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 96, elements: !191)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !429, line: 52, size: 96, elements: !430)
!429 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !{!431, !432, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !428, file: !429, line: 53, baseType: !22, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !428, file: !429, line: 54, baseType: !271, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !428, file: !429, line: 55, baseType: !434, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !435, line: 151, baseType: !436)
!435 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 149, size: 32, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !436, file: !435, line: 150, baseType: !126, size: 32)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 96, elements: !191)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !443, file: !475, line: 39, type: !254, isLocal: true, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !445, globals: !474, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!445 = !{!446, !118, !32, !462, !254}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !448, line: 1168, baseType: !449)
!448 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 1155, size: 352, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !449, file: !448, line: 1157, baseType: !179, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !449, file: !448, line: 1158, baseType: !176, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !449, file: !448, line: 1159, baseType: !176, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !449, file: !448, line: 1160, baseType: !176, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !449, file: !448, line: 1161, baseType: !176, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !449, file: !448, line: 1162, baseType: !176, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !449, file: !448, line: 1163, baseType: !176, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !449, file: !448, line: 1164, baseType: !176, size: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !449, file: !448, line: 1165, baseType: !176, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !449, file: !448, line: 1166, baseType: !176, size: 32, offset: 288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !449, file: !448, line: 1167, baseType: !176, size: 32, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !465, line: 27, size: 96, elements: !466)
!465 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !464, file: !465, line: 29, baseType: !126, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !464, file: !465, line: 31, baseType: !134, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !464, file: !465, line: 37, baseType: !470, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !435, line: 146, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !435, line: 141, size: 32, elements: !472)
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !471, file: !435, line: 143, baseType: !126, size: 32)
!474 = !{!441}
!475 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !478, file: !485, line: 21, type: !162, isLocal: true, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !480, globals: !484, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!480 = !{!481, !32, !118}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !483, line: 22, baseType: !32)
!483 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!484 = !{!476}
!485 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !488, file: !493, line: 13, type: !510, isLocal: true, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !490, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!490 = !{!491, !486}
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "mpu_config", scope: !488, file: !493, line: 37, type: !494, isLocal: false, isDefinition: true)
!493 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !465, line: 41, size: 64, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !495, file: !465, line: 43, baseType: !126, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !495, file: !465, line: 45, baseType: !499, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !465, line: 27, size: 96, elements: !502)
!502 = !{!503, !504, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !501, file: !465, line: 29, baseType: !126, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !501, file: !465, line: 31, baseType: !134, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !501, file: !465, line: 37, baseType: !506, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !435, line: 146, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !435, line: 141, size: 32, elements: !508)
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !507, file: !435, line: 143, baseType: !126, size: 32)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 192, elements: !313)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "cv2_timer_slab", scope: !513, file: !590, line: 16, type: !604, isLocal: false, isDefinition: true, align: 32)
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !515, retainedTypes: !516, globals: !587, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!515 = !{!42, !30, !47}
!516 = !{!118, !517, !518, !520, !521, !32, !126, !584, !586}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !519, line: 46, baseType: !351)
!519 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerId_t", file: !31, line: 211, baseType: !118)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_timer", file: !523, line: 28, size: 704, elements: !524)
!523 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/wrapper.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!524 = !{!525, !572, !574, !575, !579, !583}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "z_timer", scope: !522, file: !523, line: 29, baseType: !526, size: 448)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !400, line: 1318, size: 448, elements: !527)
!527 = !{!528, !553, !559, !564, !565, !570, !571}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !526, file: !400, line: 1324, baseType: !529, size: 192)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !318, line: 244, size: 192, elements: !530)
!530 = !{!531, !546, !552}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !529, file: !318, line: 245, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !292, line: 49, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !292, line: 37, size: 64, elements: !534)
!534 = !{!535, !541}
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !292, line: 38, baseType: !536, size: 32)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !292, line: 38, size: 32, elements: !537)
!537 = !{!538, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !536, file: !292, line: 39, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !292, line: 40, baseType: !539, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !292, line: 42, baseType: !542, size: 32, offset: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !292, line: 42, size: 32, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !542, file: !292, line: 43, baseType: !539, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !542, file: !292, line: 44, baseType: !539, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !529, file: !318, line: 246, baseType: !547, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !318, line: 242, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !529, file: !318, line: 249, baseType: !351, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !526, file: !400, line: 1327, baseType: !554, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !318, line: 233, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 231, size: 64, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !555, file: !318, line: 232, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !292, line: 48, baseType: !533)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !526, file: !400, line: 1330, baseType: !560, size: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !526, file: !400, line: 1333, baseType: !560, size: 32, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !526, file: !400, line: 1336, baseType: !566, size: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !519, line: 67, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 65, size: 64, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !567, file: !519, line: 66, baseType: !518, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !526, file: !400, line: 1339, baseType: !126, size: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !526, file: !400, line: 1342, baseType: !118, size: 32, offset: 416)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !522, file: !523, line: 30, baseType: !573, size: 32, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerType_t", file: !31, line: 167, baseType: !42)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !522, file: !523, line: 31, baseType: !126, size: 32, offset: 480)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !522, file: !523, line: 32, baseType: !576, size: 128, offset: 512)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 16)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "callback_function", scope: !522, file: !523, line: 33, baseType: !580, size: 32, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !118}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !522, file: !523, line: 34, baseType: !118, size: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !585)
!585 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!587 = !{!511, !588, !594}
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_timer_slab", scope: !513, file: !590, line: 16, type: !591, isLocal: false, isDefinition: true, align: 32)
!590 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 3520, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 440)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "init_timer_attrs", scope: !513, file: !590, line: 19, type: !596, isLocal: true, isDefinition: true)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerAttr_t", file: !31, line: 255, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 250, size: 128, elements: !599)
!599 = !{!600, !601, !602, !603}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !598, file: !31, line: 251, baseType: !134, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !598, file: !31, line: 252, baseType: !126, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !598, file: !31, line: 253, baseType: !118, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !598, file: !31, line: 254, baseType: !126, size: 32, offset: 96)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !400, line: 4836, size: 256, elements: !605)
!605 = !{!606, !607, !611, !612, !613, !614, !615}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !604, file: !400, line: 4837, baseType: !554, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !604, file: !400, line: 4838, baseType: !608, size: 32, offset: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !414, line: 43, size: 32, elements: !609)
!609 = !{!610}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !608, file: !414, line: 52, baseType: !22, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !604, file: !400, line: 4839, baseType: !126, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !604, file: !400, line: 4840, baseType: !271, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !604, file: !400, line: 4841, baseType: !586, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !604, file: !400, line: 4842, baseType: !586, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !604, file: !400, line: 4843, baseType: !126, size: 32, offset: 224)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "cv2_msgq_slab", scope: !618, file: !666, line: 11, type: !682, isLocal: false, isDefinition: true, align: 32)
!618 = distinct !DICompileUnit(language: DW_LANG_C99, file: !619, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !620, retainedTypes: !621, globals: !663, splitDebugInlining: false, nameTableKind: None)
!619 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/msgq.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!620 = !{!30, !47}
!621 = !{!118, !517, !518, !123, !622, !32, !126, !584}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_msgq", file: !523, line: 55, size: 608, elements: !624)
!624 = !{!625, !660, !661, !662}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "z_msgq", scope: !623, file: !523, line: 56, baseType: !626, size: 416)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !400, line: 4204, size: 416, elements: !627)
!627 = !{!628, !647, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !626, file: !400, line: 4206, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !318, line: 233, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 231, size: 64, elements: !631)
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !630, file: !318, line: 232, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !292, line: 48, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !292, line: 37, size: 64, elements: !635)
!635 = !{!636, !642}
!636 = !DIDerivedType(tag: DW_TAG_member, scope: !634, file: !292, line: 38, baseType: !637, size: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !634, file: !292, line: 38, size: 32, elements: !638)
!638 = !{!639, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !637, file: !292, line: 39, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !292, line: 40, baseType: !640, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, scope: !634, file: !292, line: 42, baseType: !643, size: 32, offset: 32)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !634, file: !292, line: 42, size: 32, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !643, file: !292, line: 43, baseType: !640, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !643, file: !292, line: 44, baseType: !640, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !626, file: !400, line: 4208, baseType: !648, size: 32, offset: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !414, line: 43, size: 32, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !648, file: !414, line: 52, baseType: !22, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !626, file: !400, line: 4210, baseType: !271, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !626, file: !400, line: 4212, baseType: !126, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !626, file: !400, line: 4214, baseType: !586, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !626, file: !400, line: 4216, baseType: !586, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !626, file: !400, line: 4218, baseType: !586, size: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !626, file: !400, line: 4220, baseType: !586, size: 32, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !626, file: !400, line: 4222, baseType: !126, size: 32, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !626, file: !400, line: 4224, baseType: !633, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !626, file: !400, line: 4227, baseType: !254, size: 8, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !623, file: !523, line: 57, baseType: !118, size: 32, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "is_dynamic_allocation", scope: !623, file: !523, line: 58, baseType: !136, size: 8, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !523, line: 59, baseType: !576, size: 128, offset: 456)
!663 = !{!616, !664, !670}
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_msgq_slab", scope: !618, file: !666, line: 11, type: !667, isLocal: false, isDefinition: true, align: 32)
!666 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/msgq.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 3040, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 380)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "init_msgq_attrs", scope: !618, file: !666, line: 14, type: !672, isLocal: true, isDefinition: true)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueAttr_t", file: !31, line: 299, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 292, size: 192, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !31, line: 293, baseType: !134, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !674, file: !31, line: 294, baseType: !126, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !674, file: !31, line: 295, baseType: !118, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !674, file: !31, line: 296, baseType: !126, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mq_mem", scope: !674, file: !31, line: 297, baseType: !118, size: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mq_size", scope: !674, file: !31, line: 298, baseType: !126, size: 32, offset: 160)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !400, line: 4836, size: 256, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !682, file: !400, line: 4837, baseType: !629, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !682, file: !400, line: 4838, baseType: !648, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !682, file: !400, line: 4839, baseType: !126, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !682, file: !400, line: 4840, baseType: !271, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !682, file: !400, line: 4841, baseType: !586, size: 32, offset: 160)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !682, file: !400, line: 4842, baseType: !586, size: 32, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !682, file: !400, line: 4843, baseType: !126, size: 32, offset: 224)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !693, file: !750, line: 603, type: !752, isLocal: true, isDefinition: true, align: 32)
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !695, globals: !747, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!695 = !{!118, !32, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !699, line: 336, size: 160, elements: !700)
!699 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!700 = !{!701, !721, !725, !729, !742}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !698, file: !699, line: 365, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DISubroutineType(types: !704)
!704 = !{!32, !705, !720}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !708)
!708 = !{!709, !710, !711, !712, !718, !719}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !707, file: !244, line: 380, baseType: !134, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !707, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !707, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !707, file: !244, line: 386, baseType: !713, size: 32, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !714, file: !244, line: 359, baseType: !254, size: 8)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !714, file: !244, line: 364, baseType: !257, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !707, file: !244, line: 388, baseType: !118, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !707, file: !244, line: 396, baseType: !260, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !698, file: !699, line: 366, baseType: !722, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !705, !255}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !698, file: !699, line: 374, baseType: !726, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DISubroutineType(types: !728)
!728 = !{!32, !705}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !698, file: !699, line: 377, baseType: !730, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DISubroutineType(types: !732)
!732 = !{!32, !705, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !699, line: 122, size: 64, elements: !736)
!736 = !{!737, !738, !739, !740, !741}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !735, file: !699, line: 123, baseType: !126, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !735, file: !699, line: 124, baseType: !254, size: 8, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !735, file: !699, line: 125, baseType: !254, size: 8, offset: 40)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !735, file: !699, line: 126, baseType: !254, size: 8, offset: 48)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !735, file: !699, line: 127, baseType: !254, size: 8, offset: 56)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !698, file: !699, line: 379, baseType: !743, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DISubroutineType(types: !745)
!745 = !{!32, !705, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!747 = !{!691, !748}
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !693, file: !750, line: 38, type: !751, isLocal: true, isDefinition: true)
!750 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !753, file: !235, line: 60, baseType: !726, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !753, file: !235, line: 65, baseType: !705, size: 32, offset: 32)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !759, file: !764, line: 7, type: !765, isLocal: false, isDefinition: true, align: 16)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !761, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!761 = !{!757, !762}
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !759, file: !764, line: 12, type: !765, isLocal: false, isDefinition: true, align: 16)
!764 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 48, elements: !207)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !768, file: !829, line: 234, type: !865, isLocal: true, isDefinition: true)
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !770, globals: !826, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!770 = !{!771, !126}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !774, line: 134, size: 128, elements: !775)
!774 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!775 = !{!776, !796, !801, !821}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !773, file: !774, line: 135, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !774, line: 113, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DISubroutineType(types: !780)
!780 = !{!32, !781, !254}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !784)
!784 = !{!785, !786, !787, !788, !794, !795}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !244, line: 380, baseType: !134, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !783, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !783, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !783, file: !244, line: 386, baseType: !789, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !790, file: !244, line: 359, baseType: !254, size: 8)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !790, file: !244, line: 364, baseType: !257, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !783, file: !244, line: 388, baseType: !118, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !783, file: !244, line: 396, baseType: !260, size: 32, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !773, file: !774, line: 136, baseType: !797, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !774, line: 119, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{!32, !781}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !773, file: !774, line: 137, baseType: !802, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !774, line: 125, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{!32, !781, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !774, line: 88, size: 128, elements: !809)
!809 = !{!810, !815, !820}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !808, file: !774, line: 90, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !774, line: 72, size: 64, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !811, file: !774, line: 74, baseType: !126, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !811, file: !774, line: 76, baseType: !126, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !808, file: !774, line: 92, baseType: !816, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !774, line: 85, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !781, !32}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !808, file: !774, line: 104, baseType: !254, size: 8, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !773, file: !774, line: 138, baseType: !822, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !774, line: 132, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!32, !781, !32}
!826 = !{!827, !831, !833, !840, !766, !842, !844, !852}
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !768, file: !829, line: 256, type: !830, isLocal: false, isDefinition: true, align: 16)
!829 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 80, elements: !211)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !768, file: !829, line: 256, type: !782, isLocal: false, isDefinition: true, align: 32)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !768, file: !829, line: 256, type: !835, isLocal: true, isDefinition: true, align: 32)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !836, file: !235, line: 60, baseType: !798, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !836, file: !235, line: 65, baseType: !781, size: 32, offset: 32)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !768, file: !829, line: 256, type: !790, isLocal: true, isDefinition: true, align: 8)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !768, file: !829, line: 227, type: !772, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !768, file: !829, line: 45, type: !846, isLocal: true, isDefinition: true)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !829, line: 38, size: 96, elements: !847)
!847 = !{!848, !849, !850, !851}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !846, file: !829, line: 39, baseType: !816, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !846, file: !829, line: 40, baseType: !126, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !846, file: !829, line: 41, baseType: !257, size: 8, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !846, file: !829, line: 42, baseType: !257, size: 8, offset: 72)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !854, file: !829, line: 240, type: !858, isLocal: true, isDefinition: true, align: 32)
!854 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !829, file: !829, line: 238, type: !855, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !768, retainedNodes: !857)
!855 = !DISubroutineType(types: !856)
!856 = !{null}
!857 = !{}
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !859)
!859 = !{!860, !862, !863, !864}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !858, file: !10, line: 55, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !858, file: !10, line: 57, baseType: !861, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !858, file: !10, line: 59, baseType: !118, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !858, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !829, line: 34, size: 32, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !866, file: !829, line: 35, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !871, line: 45, baseType: !872)
!871 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !871, line: 41, size: 96, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !872, file: !871, line: 42, baseType: !176, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !872, file: !871, line: 43, baseType: !176, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !872, file: !871, line: 44, baseType: !179, size: 32, offset: 64)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !879, file: !967, line: 494, type: !1014, isLocal: true, isDefinition: true)
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !881, retainedTypes: !914, globals: !964, splitDebugInlining: false, nameTableKind: None)
!880 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!881 = !{!882, !889, !895, !902, !907}
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !699, line: 47, baseType: !43, size: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888}
!884 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!885 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!886 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!887 = !DIEnumerator(name: "UART_BREAK", value: 8)
!888 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !699, line: 84, baseType: !43, size: 32, elements: !890)
!890 = !{!891, !892, !893, !894}
!891 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!892 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!893 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!894 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !699, line: 92, baseType: !43, size: 32, elements: !896)
!896 = !{!897, !898, !899, !900, !901}
!897 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!898 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!899 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!900 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!901 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !699, line: 107, baseType: !43, size: 32, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!905 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!906 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!907 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !699, line: 75, baseType: !43, size: 32, elements: !908)
!908 = !{!909, !910, !911, !912, !913}
!909 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!910 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!911 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!912 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!913 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!914 = !{!915, !118, !255, !126}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !699, line: 336, size: 160, elements: !918)
!918 = !{!919, !938, !942, !946, !959}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !917, file: !699, line: 365, baseType: !920, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DISubroutineType(types: !922)
!922 = !{!32, !923, !720}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !926)
!926 = !{!927, !928, !929, !930, !936, !937}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !925, file: !244, line: 380, baseType: !134, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !925, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !925, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !925, file: !244, line: 386, baseType: !931, size: 32, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !932, file: !244, line: 359, baseType: !254, size: 8)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !932, file: !244, line: 364, baseType: !257, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !925, file: !244, line: 388, baseType: !118, size: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !925, file: !244, line: 396, baseType: !260, size: 32, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !917, file: !699, line: 366, baseType: !939, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !923, !255}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !917, file: !699, line: 374, baseType: !943, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DISubroutineType(types: !945)
!945 = !{!32, !923}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !917, file: !699, line: 377, baseType: !947, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DISubroutineType(types: !949)
!949 = !{!32, !923, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !699, line: 122, size: 64, elements: !953)
!953 = !{!954, !955, !956, !957, !958}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !952, file: !699, line: 123, baseType: !126, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !952, file: !699, line: 124, baseType: !254, size: 8, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !952, file: !699, line: 125, baseType: !254, size: 8, offset: 40)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !952, file: !699, line: 126, baseType: !254, size: 8, offset: 48)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !952, file: !699, line: 127, baseType: !254, size: 8, offset: 56)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !917, file: !699, line: 379, baseType: !960, size: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{!32, !923, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!964 = !{!965, !971, !973, !980, !982, !984, !877, !989, !1008, !1011}
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !879, file: !967, line: 494, type: !968, isLocal: false, isDefinition: true, align: 16)
!967 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 96, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 6)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !879, file: !967, line: 494, type: !924, isLocal: false, isDefinition: true, align: 32)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !879, file: !967, line: 494, type: !975, isLocal: true, isDefinition: true, align: 32)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !976, file: !235, line: 60, baseType: !943, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !976, file: !235, line: 65, baseType: !923, size: 32, offset: 32)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !879, file: !967, line: 494, type: !932, isLocal: true, isDefinition: true, align: 8)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !879, file: !967, line: 419, type: !916, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !879, file: !967, line: 494, type: !986, isLocal: true, isDefinition: true)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_data", file: !967, line: 38, size: 32, elements: !987)
!987 = !{!988}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !986, file: !967, line: 39, baseType: !126, size: 32)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_21", scope: !879, file: !967, line: 494, type: !991, isLocal: true, isDefinition: true)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !993, line: 60, size: 64, elements: !994)
!993 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!994 = !{!995, !1007}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !992, file: !993, line: 69, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !993, line: 50, size: 64, elements: !999)
!999 = !{!1000, !1005, !1006}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !998, file: !993, line: 52, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !1004, line: 32, baseType: !126)
!1004 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !998, file: !993, line: 54, baseType: !254, size: 8, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !998, file: !993, line: 56, baseType: !254, size: 8, offset: 40)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !992, file: !993, line: 71, baseType: !254, size: 8, offset: 32)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_21", scope: !879, file: !967, line: 494, type: !1010, isLocal: true, isDefinition: true)
