; ModuleID = './build/gdma_transfer_data_interrupt.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }
%struct.GDMA_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PDMA_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32 }
%struct.VDMA_REGISTER_T = type { i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32 }
%struct.gdma_user_callback_t = type { void (i32, i8*)*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !2, file: !3, line: 51, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !53, globals: !89, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!4 = !{!5, !17, !37, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!10 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!11 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!12 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!13 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!14 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!15 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!16 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 186, baseType: !18, size: 32, elements: !19)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!20 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!21 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!22 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!23 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!24 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!25 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!26 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!27 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!28 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!29 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!30 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!31 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!32 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!33 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!34 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!35 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!36 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 176, baseType: !18, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!40 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!41 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!42 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!43 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 98, baseType: !18, size: 32, elements: !46)
!45 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!48 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!49 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!50 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!51 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!52 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!53 = !{!54, !88}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !56, line: 276, baseType: !57)
!56 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 260, size: 525312, elements: !58)
!58 = !{!59, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !79, !83, !87}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !57, file: !56, line: 261, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 79, baseType: !18)
!64 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !57, file: !56, line: 262, baseType: !60, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !57, file: !56, line: 263, baseType: !60, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !57, file: !56, line: 264, baseType: !60, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !57, file: !56, line: 265, baseType: !60, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !57, file: !56, line: 266, baseType: !60, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !57, file: !56, line: 267, baseType: !60, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !57, file: !56, line: 268, baseType: !60, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !57, file: !56, line: 269, baseType: !60, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !57, file: !56, line: 270, baseType: !60, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !57, file: !56, line: 271, baseType: !75, size: 32, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !57, file: !56, line: 272, baseType: !60, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !57, file: !56, line: 273, baseType: !80, size: 523904, offset: 384)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 16372)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !57, file: !56, line: 274, baseType: !84, size: 512, offset: 524288)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !57, file: !56, line: 275, baseType: !84, size: 512, offset: 524800)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!89 = !{!0}
!90 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !94, file: !95, line: 48, type: !341, isLocal: false, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !96, retainedTypes: !263, globals: !278, splitDebugInlining: false, nameTableKind: None)
!95 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!96 = !{!97, !157, !162, !168, !245, !254, !259}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 1170, baseType: !18, size: 32, elements: !99)
!98 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!100 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!101 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!102 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!103 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!104 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!105 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!106 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!107 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!108 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!109 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!110 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!111 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!112 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!113 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!114 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!115 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!116 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!117 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!118 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!119 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!120 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!121 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!122 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!123 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!124 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!125 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!126 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!127 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!128 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!129 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!130 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!131 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!132 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!133 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!134 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!135 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!136 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!137 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!138 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!139 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!140 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!141 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!142 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!143 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!144 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!145 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!146 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!147 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!148 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!149 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!150 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!151 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!152 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!153 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!154 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!155 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!156 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 82, baseType: !18, size: 32, elements: !159)
!158 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!159 = !{!160, !161}
!160 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!161 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 75, baseType: !18, size: 32, elements: !163)
!163 = !{!164, !165, !166, !167}
!164 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!165 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!166 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!167 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !56, line: 44, baseType: !7, size: 32, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!170 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!171 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!172 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!173 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!174 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!175 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!176 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!177 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!178 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!179 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!180 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!181 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!182 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!183 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!184 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!185 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!186 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!187 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!188 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!189 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!190 = !DIEnumerator(name: "KP_IRQn", value: 10)
!191 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!192 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!193 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!194 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!195 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!196 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!197 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!198 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!199 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!200 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!201 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!202 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!203 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!204 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!205 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!206 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!207 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!208 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!209 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!210 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!211 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!212 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!213 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!214 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!215 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!216 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!217 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!218 = !DIEnumerator(name: "SF_IRQn", value: 38)
!219 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!220 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!221 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!222 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!223 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!224 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!225 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!226 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!227 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!228 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!229 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!230 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!231 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!232 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!233 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!234 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!235 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!236 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!237 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!238 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!239 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!240 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!241 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!242 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!243 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!244 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 846, baseType: !18, size: 32, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253}
!247 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!248 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!249 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!250 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!251 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!252 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!253 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 380, baseType: !18, size: 32, elements: !256)
!255 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!256 = !{!257, !258}
!257 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!258 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 397, baseType: !18, size: 32, elements: !260)
!260 = !{!261, !262}
!261 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!262 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!263 = !{!61, !264, !88}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !56, line: 1272, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1262, size: 288, elements: !267)
!267 = !{!268, !269, !270, !271, !273, !274, !275, !276, !277}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !266, file: !56, line: 1263, baseType: !60, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !266, file: !56, line: 1264, baseType: !60, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !266, file: !56, line: 1265, baseType: !60, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !266, file: !56, line: 1266, baseType: !272, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !266, file: !56, line: 1267, baseType: !60, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !266, file: !56, line: 1268, baseType: !60, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !266, file: !56, line: 1269, baseType: !60, size: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !266, file: !56, line: 1270, baseType: !60, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !266, file: !56, line: 1271, baseType: !60, size: 32, offset: 256)
!278 = !{!92, !279, !288, !294, !316, !339}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !94, file: !95, line: 49, type: !281, isLocal: false, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !56, line: 1260, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1256, size: 96, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !283, file: !56, line: 1257, baseType: !272, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !283, file: !56, line: 1258, baseType: !60, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !283, file: !56, line: 1259, baseType: !60, size: 32, offset: 64)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "flag", scope: !290, file: !95, line: 88, type: !91, isLocal: true, isDefinition: true)
!290 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !95, file: !95, line: 86, type: !291, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{null}
!293 = !{}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !94, file: !95, line: 51, type: !296, isLocal: false, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 768, elements: !314)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !158, line: 116, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 111, size: 128, elements: !299)
!299 = !{!300, !302, !312, !313}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !298, file: !158, line: 112, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !255, line: 400, baseType: !259)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !298, file: !158, line: 113, baseType: !303, size: 64, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !158, line: 109, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 106, size: 64, elements: !305)
!305 = !{!306, !311}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !304, file: !158, line: 107, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !255, line: 371, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !88}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !304, file: !158, line: 108, baseType: !88, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !298, file: !158, line: 114, baseType: !91, size: 8, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !298, file: !158, line: 115, baseType: !91, size: 8, offset: 104)
!314 = !{!315}
!315 = !DISubrange(count: 6)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !94, file: !95, line: 52, type: !318, isLocal: false, isDefinition: true)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !158, line: 134, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 125, size: 4256, elements: !320)
!320 = !{!321, !332, !333, !334, !335, !336, !337, !338}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !319, file: !158, line: 126, baseType: !322, size: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 4096, elements: !330)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !158, line: 123, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 118, size: 128, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !324, file: !158, line: 119, baseType: !303, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !324, file: !158, line: 120, baseType: !61, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !324, file: !158, line: 121, baseType: !91, size: 8, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !324, file: !158, line: 122, baseType: !91, size: 8, offset: 104)
!330 = !{!331}
!331 = !DISubrange(count: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !319, file: !158, line: 127, baseType: !61, size: 32, offset: 4096)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !319, file: !158, line: 128, baseType: !61, size: 32, offset: 4128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !319, file: !158, line: 129, baseType: !61, size: 32, offset: 4160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !319, file: !158, line: 130, baseType: !61, size: 32, offset: 4192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !319, file: !158, line: 131, baseType: !91, size: 8, offset: 4224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !319, file: !158, line: 132, baseType: !91, size: 8, offset: 4232)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !319, file: !158, line: 133, baseType: !91, size: 8, offset: 4240)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !94, file: !95, line: 53, type: !61, isLocal: false, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 192, elements: !314)
!342 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "gdma_init_status", scope: !345, file: !346, line: 49, type: !379, isLocal: true, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !347, globals: !378, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gdma.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!347 = !{!348, !355, !359, !168, !364, !370, !374}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 192, baseType: !7, size: 32, elements: !350)
!349 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gdma.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!350 = !{!351, !352, !353, !354}
!351 = !DIEnumerator(name: "HAL_GDMA_STATUS_ERROR", value: -3)
!352 = !DIEnumerator(name: "HAL_GDMA_STATUS_ERROR_CHANNEL", value: -2)
!353 = !DIEnumerator(name: "HAL_GDMA_STATUS_INVALID_PARAMETER", value: -1)
!354 = !DIEnumerator(name: "HAL_GDMA_STATUS_OK", value: 0)
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 915, baseType: !18, size: 32, elements: !356)
!356 = !{!357, !358}
!357 = !DIEnumerator(name: "HAL_GDMA_CHANNEL_0", value: 0)
!358 = !DIEnumerator(name: "HAL_GDMA_CHANNEL_MAX", value: 1)
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 124, baseType: !18, size: 32, elements: !361)
!360 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!361 = !{!362, !363}
!362 = !DIEnumerator(name: "DMA_PD", value: 0)
!363 = !DIEnumerator(name: "DMA_AO", value: 1)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 47, baseType: !18, size: 32, elements: !366)
!365 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!366 = !{!367, !368, !369}
!367 = !DIEnumerator(name: "GDMA_BYTE", value: 0)
!368 = !DIEnumerator(name: "GDMA_HALF_WORD", value: 1)
!369 = !DIEnumerator(name: "GDMA_WORD", value: 2)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 201, baseType: !7, size: 32, elements: !371)
!371 = !{!372, !373}
!372 = !DIEnumerator(name: "HAL_GDMA_EVENT_TRANSACTION_ERROR", value: -1)
!373 = !DIEnumerator(name: "HAL_GDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 208, baseType: !18, size: 32, elements: !375)
!375 = !{!376, !377}
!376 = !DIEnumerator(name: "HAL_GDMA_IDLE", value: 0)
!377 = !DIEnumerator(name: "HAL_GDMA_BUSY", value: 1)
!378 = !{!343}
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 8, elements: !76)
!380 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 43, baseType: !383)
!383 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "gdma", scope: !386, file: !387, line: 46, type: !601, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !455, globals: !456, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_pdma_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!388 = !{!370, !359, !389, !97, !396, !402, !168, !412, !417, !423, !427, !431, !437, !451}
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !390, line: 101, baseType: !7, size: 32, elements: !391)
!390 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!391 = !{!392, !393, !394, !395}
!392 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!393 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!394 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!395 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!396 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 166, baseType: !7, size: 32, elements: !397)
!397 = !{!398, !399, !400, !401}
!398 = !DIEnumerator(name: "PDMA_ERROR", value: -3)
!399 = !DIEnumerator(name: "PDMA_ERROR_CHANNEL", value: -2)
!400 = !DIEnumerator(name: "PDMA_INVALID_PARAMETER", value: -1)
!401 = !DIEnumerator(name: "PDMA_OK", value: 0)
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 137, baseType: !18, size: 32, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411}
!404 = !DIEnumerator(name: "PDMA_START_CHANNEL", value: 1)
!405 = !DIEnumerator(name: "PDMA_MSDC1", value: 1)
!406 = !DIEnumerator(name: "PDMA_MSDC2", value: 2)
!407 = !DIEnumerator(name: "PDMA_I2C0_TX", value: 3)
!408 = !DIEnumerator(name: "PDMA_I2C0_RX", value: 4)
!409 = !DIEnumerator(name: "PDMA_I2C1_TX", value: 5)
!410 = !DIEnumerator(name: "PDMA_I2C1_RX", value: 6)
!411 = !DIEnumerator(name: "PDMA_END_CHANNEL", value: 7)
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 151, baseType: !18, size: 32, elements: !413)
!413 = !{!414, !415, !416}
!414 = !DIEnumerator(name: "PDMA_BYTE", value: 0)
!415 = !DIEnumerator(name: "PDMA_HALF_WORD", value: 1)
!416 = !DIEnumerator(name: "PDMA_WORD", value: 2)
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 180, baseType: !18, size: 32, elements: !418)
!418 = !{!419, !420, !421, !422}
!419 = !DIEnumerator(name: "PDMA_TX", value: 0)
!420 = !DIEnumerator(name: "PDMA_RX", value: 1)
!421 = !DIEnumerator(name: "PDMA_TX_RINGBUFF", value: 2)
!422 = !DIEnumerator(name: "PDMA_RX_RINGBUFF", value: 3)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 174, baseType: !18, size: 32, elements: !424)
!424 = !{!425, !426}
!425 = !DIEnumerator(name: "PDMA_IDLE", value: 0)
!426 = !DIEnumerator(name: "PDMA_BUSY", value: 1)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 159, baseType: !7, size: 32, elements: !428)
!428 = !{!429, !430}
!429 = !DIEnumerator(name: "PDMA_EVENT_TRANSACTION_ERROR", value: -1)
!430 = !DIEnumerator(name: "PDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 206, baseType: !7, size: 32, elements: !432)
!432 = !{!433, !434, !435, !436}
!433 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!434 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!435 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!436 = !DIEnumerator(name: "VDMA_OK", value: 0)
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 189, baseType: !18, size: 32, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!439 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!440 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!441 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!442 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!443 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!444 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!445 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!446 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!447 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!448 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!449 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!450 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 222, baseType: !7, size: 32, elements: !452)
!452 = !{!453, !454}
!453 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!454 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!455 = !{!88}
!456 = !{!384, !457, !465, !483, !491, !494, !519, !527, !535, !538, !551, !575, !580, !588, !593}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "gdma_global", scope: !386, file: !387, line: 49, type: !459, isLocal: false, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 32, elements: !76)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDMA_REGISTER_GLOBAL_T", file: !56, line: 843, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 841, size: 32, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_GLBSTA", scope: !462, file: !56, line: 842, baseType: !60, size: 32)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "pdma", scope: !386, file: !387, line: 52, type: !467, isLocal: false, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 192, elements: !314)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDMA_REGISTER_T", file: !56, line: 859, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 848, size: 320, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !482}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_WPPT", scope: !470, file: !56, line: 849, baseType: !60, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_WPTO", scope: !470, file: !56, line: 850, baseType: !60, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_COUNT", scope: !470, file: !56, line: 851, baseType: !60, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_CON", scope: !470, file: !56, line: 852, baseType: !60, size: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_START", scope: !470, file: !56, line: 853, baseType: !60, size: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_INTSTA", scope: !470, file: !56, line: 854, baseType: !60, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_ACKINT", scope: !470, file: !56, line: 855, baseType: !60, size: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_RLCT", scope: !470, file: !56, line: 856, baseType: !272, size: 32, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DUMMY_OFFSET", scope: !470, file: !56, line: 857, baseType: !481, size: 32, offset: 256)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !76)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_PGMADDR", scope: !470, file: !56, line: 858, baseType: !60, size: 32, offset: 288)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "pdma_global", scope: !386, file: !387, line: 55, type: !485, isLocal: false, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 192, elements: !314)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDMA_REGISTER_GLOBAL_T", file: !56, line: 865, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 863, size: 32, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_GLBSTA", scope: !488, file: !56, line: 864, baseType: !60, size: 32)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "g_pdma_global_running_bit", scope: !386, file: !387, line: 58, type: !493, isLocal: false, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 48, elements: !314)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "vdma", scope: !386, file: !387, line: 64, type: !496, isLocal: false, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 320, elements: !517)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_T", file: !56, line: 885, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 870, size: 448, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !510, !511, !512, !513, !514, !515, !516}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_COUNT", scope: !499, file: !56, line: 871, baseType: !60, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_CON", scope: !499, file: !56, line: 872, baseType: !60, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_START", scope: !499, file: !56, line: 873, baseType: !60, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_INTSTA", scope: !499, file: !56, line: 874, baseType: !60, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_ACKINT", scope: !499, file: !56, line: 875, baseType: !60, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "DUMMY_OFFSET", scope: !499, file: !56, line: 876, baseType: !507, size: 64, offset: 160)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 2)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_PGMADDR", scope: !499, file: !56, line: 877, baseType: !60, size: 32, offset: 224)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_WRPTR", scope: !499, file: !56, line: 878, baseType: !272, size: 32, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_RDPTR", scope: !499, file: !56, line: 879, baseType: !272, size: 32, offset: 288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFCNT", scope: !499, file: !56, line: 880, baseType: !272, size: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFSTA", scope: !499, file: !56, line: 881, baseType: !272, size: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_ALTLEN", scope: !499, file: !56, line: 882, baseType: !60, size: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFSIZE", scope: !499, file: !56, line: 883, baseType: !60, size: 32, offset: 416)
!517 = !{!518}
!518 = !DISubrange(count: 10)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "vdma_port", scope: !386, file: !387, line: 69, type: !521, isLocal: false, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 320, elements: !517)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_PORT_T", file: !56, line: 891, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 889, size: 32, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_PORT", scope: !524, file: !56, line: 890, baseType: !60, size: 32)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "vdma_global", scope: !386, file: !387, line: 75, type: !529, isLocal: false, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 320, elements: !517)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_GLOBAL_T", file: !56, line: 898, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 896, size: 32, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_GLBSTA", scope: !532, file: !56, line: 897, baseType: !60, size: 32)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "g_vdma_global_running_bit", scope: !386, file: !387, line: 80, type: !537, isLocal: false, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 80, elements: !517)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "g_gdma_callback", scope: !386, file: !387, line: 92, type: !540, isLocal: false, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 64, elements: !76)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdma_user_callback_t", file: !387, line: 89, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 86, size: 64, elements: !543)
!543 = !{!544, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !542, file: !387, line: 87, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_callback_t", file: !349, line: 230, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !549, !88}
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_event_t", file: !349, line: 204, baseType: !370)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !542, file: !387, line: 88, baseType: !88, size: 32, offset: 32)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "count", scope: !553, file: !387, line: 1122, type: !61, isLocal: true, isDefinition: true)
!553 = distinct !DISubprogram(name: "pd_domain_dma_interrupt_hander", scope: !387, file: !387, line: 1108, type: !554, scopeLine: 1110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !386, retainedNodes: !558)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !556}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !56, line: 125, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !56, line: 123, baseType: !168)
!558 = !{!559, !560, !561, !562, !568, !574}
!559 = !DILocalVariable(name: "irq_number", arg: 1, scope: !553, file: !387, line: 1108, type: !556)
!560 = !DILocalVariable(name: "global_status", scope: !553, file: !387, line: 1113, type: !60)
!561 = !DILocalVariable(name: "gdma_callback", scope: !553, file: !387, line: 1116, type: !545)
!562 = !DILocalVariable(name: "pdma_callback", scope: !553, file: !387, line: 1117, type: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_callback_t", file: !360, line: 288, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !567, !88}
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_event_t", file: !360, line: 162, baseType: !427)
!568 = !DILocalVariable(name: "vdma_callback", scope: !553, file: !387, line: 1118, type: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_callback_t", file: !360, line: 291, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !573, !88}
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_event_t", file: !360, line: 225, baseType: !451)
!574 = !DILocalVariable(name: "argument", scope: !553, file: !387, line: 1119, type: !88)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "pdma_init_status", scope: !386, file: !387, line: 61, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 56, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 7)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "g_pdma_callback", scope: !386, file: !387, line: 104, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 384, elements: !314)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_user_callback_t", file: !387, line: 101, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 98, size: 64, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !584, file: !387, line: 99, baseType: !563, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !584, file: !387, line: 100, baseType: !88, size: 32, offset: 32)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "vdma_init_status", scope: !386, file: !387, line: 83, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 144, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 18)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "g_vdma_callback", scope: !386, file: !387, line: 120, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 640, elements: !517)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_user_callback_t", file: !387, line: 117, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 114, size: 64, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !597, file: !387, line: 115, baseType: !569, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !597, file: !387, line: 116, baseType: !88, size: 32, offset: 32)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 32, elements: !76)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDMA_REGISTER_T", file: !56, line: 837, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 826, size: 320, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_SRC", scope: !604, file: !56, line: 827, baseType: !60, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_DST", scope: !604, file: !56, line: 828, baseType: !60, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_WPPT", scope: !604, file: !56, line: 829, baseType: !60, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_WPTO", scope: !604, file: !56, line: 830, baseType: !60, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_COUNT", scope: !604, file: !56, line: 831, baseType: !60, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_CON", scope: !604, file: !56, line: 832, baseType: !60, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_START", scope: !604, file: !56, line: 833, baseType: !60, size: 32, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_INTSTA", scope: !604, file: !56, line: 834, baseType: !60, size: 32, offset: 224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_ACKINT", scope: !604, file: !56, line: 835, baseType: !60, size: 32, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_RLCT", scope: !604, file: !56, line: 836, baseType: !272, size: 32, offset: 288)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !618, file: !619, line: 64, type: !719, isLocal: false, isDefinition: true)
!618 = distinct !DICompileUnit(language: DW_LANG_C99, file: !619, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !620, retainedTypes: !714, globals: !718, splitDebugInlining: false, nameTableKind: None)
!619 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!620 = !{!621, !673, !680, !684, !690, !694, !703, !708}
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 339, baseType: !18, size: 32, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!623 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!624 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!625 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!626 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!627 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!628 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!629 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!630 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!631 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!632 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!633 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!634 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!635 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!636 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!637 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!638 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!639 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!640 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!641 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!642 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!643 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!644 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!645 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!646 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!647 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!648 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!649 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!650 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!651 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!652 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!653 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!654 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!655 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!656 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!657 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!658 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!659 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!660 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!661 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!662 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!663 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!664 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!665 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!666 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!667 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!668 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!669 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!670 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!671 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!672 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!673 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 224, baseType: !7, size: 32, elements: !675)
!674 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!675 = !{!676, !677, !678, !679}
!676 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!677 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!678 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!679 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!680 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 210, baseType: !18, size: 32, elements: !681)
!681 = !{!682, !683}
!682 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!683 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 233, baseType: !7, size: 32, elements: !685)
!685 = !{!686, !687, !688, !689}
!686 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!687 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!688 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!689 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 217, baseType: !18, size: 32, elements: !691)
!691 = !{!692, !693}
!692 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!693 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 415, baseType: !18, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702}
!696 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!697 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!698 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!699 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!700 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!701 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!702 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 427, baseType: !18, size: 32, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!706 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!707 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 242, baseType: !18, size: 32, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!711 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!712 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!713 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!714 = !{!88, !715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !674, line: 213, baseType: !680)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !674, line: 220, baseType: !690)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !674, line: 247, baseType: !708)
!718 = !{!616}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !56, line: 1554, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1522, size: 29440, elements: !722)
!722 = !{!723, !735, !739, !748, !749, !758, !759, !768, !769, !779, !780, !789, !790, !799, !800, !809, !810, !819, !823, !832, !833, !842, !843, !852, !861, !862, !871, !875, !884, !885}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !721, file: !56, line: 1523, baseType: !724, size: 256)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 256, elements: !508)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !56, line: 1400, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1395, size: 128, elements: !727)
!727 = !{!728, !729, !730, !731}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !726, file: !56, line: 1396, baseType: !60, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !726, file: !56, line: 1397, baseType: !60, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !726, file: !56, line: 1398, baseType: !60, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !726, file: !56, line: 1399, baseType: !732, size: 32, offset: 96)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 32, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 4)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !721, file: !56, line: 1524, baseType: !736, size: 1792, offset: 256)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 1792, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !721, file: !56, line: 1525, baseType: !740, size: 256, offset: 2048)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 256, elements: !508)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !56, line: 1409, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1404, size: 128, elements: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !742, file: !56, line: 1405, baseType: !60, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !742, file: !56, line: 1406, baseType: !60, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !742, file: !56, line: 1407, baseType: !60, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !742, file: !56, line: 1408, baseType: !732, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !721, file: !56, line: 1526, baseType: !736, size: 1792, offset: 2304)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !721, file: !56, line: 1527, baseType: !750, size: 256, offset: 4096)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 256, elements: !508)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !56, line: 1417, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1412, size: 128, elements: !753)
!753 = !{!754, !755, !756, !757}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !752, file: !56, line: 1413, baseType: !60, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !752, file: !56, line: 1414, baseType: !60, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !752, file: !56, line: 1415, baseType: !60, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !752, file: !56, line: 1416, baseType: !732, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !721, file: !56, line: 1528, baseType: !736, size: 1792, offset: 4352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !721, file: !56, line: 1529, baseType: !760, size: 256, offset: 6144)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 256, elements: !508)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !56, line: 1426, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1421, size: 128, elements: !763)
!763 = !{!764, !765, !766, !767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !762, file: !56, line: 1422, baseType: !60, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !762, file: !56, line: 1423, baseType: !60, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !762, file: !56, line: 1424, baseType: !60, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !762, file: !56, line: 1425, baseType: !732, size: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !721, file: !56, line: 1530, baseType: !736, size: 1792, offset: 6400)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !721, file: !56, line: 1531, baseType: !770, size: 256, offset: 8192)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 256, elements: !508)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !56, line: 1432, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1429, size: 128, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !772, file: !56, line: 1430, baseType: !60, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !772, file: !56, line: 1431, baseType: !776, size: 96, offset: 32)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 96, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 12)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !721, file: !56, line: 1532, baseType: !736, size: 1792, offset: 8448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !721, file: !56, line: 1533, baseType: !781, size: 256, offset: 10240)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 256, elements: !508)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !56, line: 1440, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1435, size: 128, elements: !784)
!784 = !{!785, !786, !787, !788}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !783, file: !56, line: 1436, baseType: !60, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !783, file: !56, line: 1437, baseType: !60, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !783, file: !56, line: 1438, baseType: !60, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !783, file: !56, line: 1439, baseType: !732, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !721, file: !56, line: 1534, baseType: !736, size: 1792, offset: 10496)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !721, file: !56, line: 1535, baseType: !791, size: 256, offset: 12288)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 256, elements: !508)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !56, line: 1448, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1443, size: 128, elements: !794)
!794 = !{!795, !796, !797, !798}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !793, file: !56, line: 1444, baseType: !60, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !793, file: !56, line: 1445, baseType: !60, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !793, file: !56, line: 1446, baseType: !60, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !793, file: !56, line: 1447, baseType: !732, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !721, file: !56, line: 1536, baseType: !736, size: 1792, offset: 12544)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !721, file: !56, line: 1537, baseType: !801, size: 256, offset: 14336)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 256, elements: !508)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !56, line: 1455, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1450, size: 128, elements: !804)
!804 = !{!805, !806, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !803, file: !56, line: 1451, baseType: !60, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !803, file: !56, line: 1452, baseType: !60, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !803, file: !56, line: 1453, baseType: !60, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !803, file: !56, line: 1454, baseType: !732, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !721, file: !56, line: 1538, baseType: !736, size: 1792, offset: 14592)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !721, file: !56, line: 1539, baseType: !811, size: 512, offset: 16384)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 512, elements: !733)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !56, line: 1463, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1458, size: 128, elements: !814)
!814 = !{!815, !816, !817, !818}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !813, file: !56, line: 1459, baseType: !60, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !813, file: !56, line: 1460, baseType: !60, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !813, file: !56, line: 1461, baseType: !60, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !813, file: !56, line: 1462, baseType: !732, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !721, file: !56, line: 1540, baseType: !820, size: 1536, offset: 16896)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 1536, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !721, file: !56, line: 1541, baseType: !824, size: 256, offset: 18432)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 256, elements: !508)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !56, line: 1471, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1466, size: 128, elements: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !826, file: !56, line: 1467, baseType: !60, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !826, file: !56, line: 1468, baseType: !60, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !826, file: !56, line: 1469, baseType: !60, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !826, file: !56, line: 1470, baseType: !732, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !721, file: !56, line: 1542, baseType: !736, size: 1792, offset: 18688)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !721, file: !56, line: 1543, baseType: !834, size: 256, offset: 20480)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 256, elements: !508)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !56, line: 1480, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1475, size: 128, elements: !837)
!837 = !{!838, !839, !840, !841}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !836, file: !56, line: 1476, baseType: !60, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !836, file: !56, line: 1477, baseType: !60, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !836, file: !56, line: 1478, baseType: !60, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !836, file: !56, line: 1479, baseType: !732, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !721, file: !56, line: 1544, baseType: !736, size: 1792, offset: 20736)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !721, file: !56, line: 1545, baseType: !844, size: 256, offset: 22528)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 256, elements: !508)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !56, line: 1489, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1484, size: 128, elements: !847)
!847 = !{!848, !849, !850, !851}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !846, file: !56, line: 1485, baseType: !60, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !846, file: !56, line: 1486, baseType: !60, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !846, file: !56, line: 1487, baseType: !60, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !846, file: !56, line: 1488, baseType: !732, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !721, file: !56, line: 1546, baseType: !853, size: 256, offset: 22784)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 256, elements: !508)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !56, line: 1497, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1492, size: 128, elements: !856)
!856 = !{!857, !858, !859, !860}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !855, file: !56, line: 1493, baseType: !60, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !855, file: !56, line: 1494, baseType: !60, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !855, file: !56, line: 1495, baseType: !60, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !855, file: !56, line: 1496, baseType: !732, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !721, file: !56, line: 1547, baseType: !820, size: 1536, offset: 23040)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !721, file: !56, line: 1548, baseType: !863, size: 896, offset: 24576)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 896, elements: !578)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !56, line: 1505, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1500, size: 128, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !865, file: !56, line: 1501, baseType: !60, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !865, file: !56, line: 1502, baseType: !60, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !865, file: !56, line: 1503, baseType: !60, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !865, file: !56, line: 1504, baseType: !732, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !721, file: !56, line: 1549, baseType: !872, size: 1152, offset: 25472)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 1152, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 144)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !721, file: !56, line: 1550, baseType: !876, size: 512, offset: 26624)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 512, elements: !733)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !56, line: 1513, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1508, size: 128, elements: !879)
!879 = !{!880, !881, !882, !883}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !878, file: !56, line: 1509, baseType: !60, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !878, file: !56, line: 1510, baseType: !60, size: 32, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !878, file: !56, line: 1511, baseType: !60, size: 32, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !878, file: !56, line: 1512, baseType: !732, size: 32, offset: 96)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !721, file: !56, line: 1551, baseType: !820, size: 1536, offset: 27136)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !721, file: !56, line: 1552, baseType: !886, size: 768, offset: 28672)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 768, elements: !314)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !56, line: 1519, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1516, size: 128, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !888, file: !56, line: 1517, baseType: !60, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !888, file: !56, line: 1518, baseType: !776, size: 96, offset: 32)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !894, file: !895, line: 101, type: !1011, isLocal: true, isDefinition: true)
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !896, retainedTypes: !961, globals: !970, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!896 = !{!897, !437, !904, !431, !910, !915, !922, !938, !944, !948, !389, !953, !451}
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 180, baseType: !18, size: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903}
!899 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!900 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!901 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!902 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!903 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 355, baseType: !7, size: 32, elements: !906)
!905 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!906 = !{!907, !908, !909}
!907 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!908 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!909 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !895, line: 65, baseType: !18, size: 32, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!913 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!914 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 345, baseType: !7, size: 32, elements: !916)
!916 = !{!917, !918, !919, !920, !921}
!917 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!918 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!919 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!920 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!921 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 302, baseType: !18, size: 32, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937}
!924 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!925 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!926 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!927 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!928 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!929 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!930 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!931 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!932 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!933 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!934 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!935 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!936 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!937 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 321, baseType: !18, size: 32, elements: !939)
!939 = !{!940, !941, !942, !943}
!940 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!941 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!942 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!943 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 330, baseType: !18, size: 32, elements: !945)
!945 = !{!946, !947}
!946 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!947 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 337, baseType: !18, size: 32, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!951 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!952 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !954, line: 152, baseType: !7, size: 32, elements: !955)
!954 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!955 = !{!956, !957, !958, !959, !960}
!956 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!957 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!958 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!959 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!960 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!961 = !{!88, !61, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !964, line: 96, baseType: !965)
!964 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !964, line: 93, size: 64, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !965, file: !964, line: 94, baseType: !91, size: 8)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !965, file: !964, line: 95, baseType: !969, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !98, line: 186, baseType: !897)
!970 = !{!892, !971, !984, !989, !1003, !1009}
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !894, file: !895, line: 102, type: !973, isLocal: true, isDefinition: true)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 256, elements: !733)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !895, line: 74, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !895, line: 71, size: 64, elements: !976)
!976 = !{!977, !983}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !975, file: !895, line: 72, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !905, line: 410, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !982, !88}
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !905, line: 359, baseType: !904)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !975, file: !895, line: 73, baseType: !88, size: 32, offset: 32)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !894, file: !895, line: 103, type: !986, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 512, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 8)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !894, file: !895, line: 104, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 896, elements: !733)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !905, line: 390, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !905, line: 382, size: 224, elements: !994)
!994 = !{!995, !997, !998, !999, !1000, !1001, !1002}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !993, file: !905, line: 383, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !993, file: !905, line: 384, baseType: !61, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !993, file: !905, line: 385, baseType: !61, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !993, file: !905, line: 386, baseType: !996, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !993, file: !905, line: 387, baseType: !61, size: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !993, file: !905, line: 388, baseType: !61, size: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !993, file: !905, line: 389, baseType: !61, size: 32, offset: 192)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !894, file: !895, line: 105, type: !1005, isLocal: true, isDefinition: true)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 416, elements: !1007)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!1007 = !{!1008}
!1008 = !DISubrange(count: 13)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !894, file: !895, line: 90, type: !91, isLocal: true, isDefinition: true)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 128, elements: !733)
!1012 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !895, line: 69, baseType: !910)
!1014 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !1017, file: !1018, line: 53, type: !1096, isLocal: false, isDefinition: true)
!1017 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1018, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1019, retainedTypes: !1030, globals: !1086, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!1019 = !{!97, !168, !437, !897, !1020}
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !964, line: 46, baseType: !18, size: 32, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1022 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!1023 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!1024 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!1025 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!1026 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!1027 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!1028 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!1029 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!1030 = !{!1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !56, line: 588, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 542, size: 800, elements: !1034)
!1034 = !{!1035, !1041, !1046, !1052, !1053, !1058, !1063, !1064, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !1033, file: !56, line: 547, baseType: !1036, size: 32)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1033, file: !56, line: 543, size: 32, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !1036, file: !56, line: 544, baseType: !272, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !1036, file: !56, line: 545, baseType: !60, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !1036, file: !56, line: 546, baseType: !60, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !1033, file: !56, line: 551, baseType: !1042, size: 32, offset: 32)
!1042 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1033, file: !56, line: 548, size: 32, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !1042, file: !56, line: 549, baseType: !60, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !1042, file: !56, line: 550, baseType: !60, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !1033, file: !56, line: 556, baseType: !1047, size: 32, offset: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1033, file: !56, line: 552, size: 32, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !1047, file: !56, line: 553, baseType: !272, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !1047, file: !56, line: 554, baseType: !60, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !1047, file: !56, line: 555, baseType: !60, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !1033, file: !56, line: 557, baseType: !60, size: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !1033, file: !56, line: 561, baseType: !1054, size: 32, offset: 128)
!1054 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1033, file: !56, line: 558, size: 32, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !1054, file: !56, line: 559, baseType: !60, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !1054, file: !56, line: 560, baseType: !60, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !1033, file: !56, line: 565, baseType: !1059, size: 32, offset: 160)
!1059 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1033, file: !56, line: 562, size: 32, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !1059, file: !56, line: 563, baseType: !272, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !1059, file: !56, line: 564, baseType: !60, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !1033, file: !56, line: 566, baseType: !60, size: 32, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !1033, file: !56, line: 570, baseType: !1065, size: 32, offset: 224)
!1065 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1033, file: !56, line: 567, size: 32, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1065, file: !56, line: 568, baseType: !60, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !1065, file: !56, line: 569, baseType: !60, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !1033, file: !56, line: 571, baseType: !60, size: 32, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !1033, file: !56, line: 572, baseType: !60, size: 32, offset: 288)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !1033, file: !56, line: 573, baseType: !60, size: 32, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !1033, file: !56, line: 574, baseType: !60, size: 32, offset: 352)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !1033, file: !56, line: 575, baseType: !272, size: 32, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !1033, file: !56, line: 576, baseType: !60, size: 32, offset: 416)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !1033, file: !56, line: 577, baseType: !60, size: 32, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !1033, file: !56, line: 578, baseType: !60, size: 32, offset: 480)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !1033, file: !56, line: 579, baseType: !60, size: 32, offset: 512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !1033, file: !56, line: 580, baseType: !60, size: 32, offset: 544)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !1033, file: !56, line: 581, baseType: !60, size: 32, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !1033, file: !56, line: 582, baseType: !60, size: 32, offset: 608)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !1033, file: !56, line: 583, baseType: !60, size: 32, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !1033, file: !56, line: 584, baseType: !60, size: 32, offset: 672)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !1033, file: !56, line: 585, baseType: !60, size: 32, offset: 704)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !1033, file: !56, line: 586, baseType: !272, size: 32, offset: 736)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !1033, file: !56, line: 587, baseType: !60, size: 32, offset: 768)
!1086 = !{!1015, !1087, !1092}
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !1017, file: !1018, line: 54, type: !1089, isLocal: false, isDefinition: true)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 128, elements: !733)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !98, line: 1237, baseType: !97)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !1017, file: !1018, line: 55, type: !1094, isLocal: false, isDefinition: true)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 128, elements: !733)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 128, elements: !733)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1099 = distinct !DIGlobalVariable(name: "priority_set", scope: !1100, file: !1101, line: 128, type: !61, isLocal: true, isDefinition: true)
!1100 = distinct !DISubprogram(name: "hal_nvic_init", scope: !1101, file: !1101, line: 126, type: !1102, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1105, retainedNodes: !1189)
!1101 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!1104}
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_status_t", file: !954, line: 158, baseType: !953)
