; ModuleID = 'build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/timer_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.os_timer_def = type { void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %union.anon.3, i32, i32, i8*, i8*, i8*, i8*, i32, %struct._dnode, i8 }
%struct._wait_q_t = type { %struct._dnode }
%union.anon.3 = type { i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.os_messageQ_def = type { i32, i32, i8*, %struct.k_msgq* }
%struct.os_messageQ_cb = type opaque
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.k_mem_slab = type { %struct._wait_q_t, %union.anon.3, i32, i32, i8*, i8*, i32 }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/timer_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "os_timer_def_myTimer", scope: !27, file: !129, line: 25, type: !198, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !126, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v1/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!29 = !{!30, !49, !53}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 99, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osEventSignal", value: 8)
!36 = !DIEnumerator(name: "osEventMessage", value: 16)
!37 = !DIEnumerator(name: "osEventMail", value: 32)
!38 = !DIEnumerator(name: "osEventTimeout", value: 64)
!39 = !DIEnumerator(name: "osErrorParameter", value: 128)
!40 = !DIEnumerator(name: "osErrorResource", value: 129)
!41 = !DIEnumerator(name: "osErrorTimeoutResource", value: 193)
!42 = !DIEnumerator(name: "osErrorISR", value: 130)
!43 = !DIEnumerator(name: "osErrorISRRecursive", value: 131)
!44 = !DIEnumerator(name: "osErrorPriority", value: 132)
!45 = !DIEnumerator(name: "osErrorNoMemory", value: 133)
!46 = !DIEnumerator(name: "osErrorValue", value: 134)
!47 = !DIEnumerator(name: "osErrorOS", value: 255)
!48 = !DIEnumerator(name: "os_status_reserved", value: 2147483647)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 120, baseType: !32, size: 32, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "osTimerOnce", value: 0)
!52 = !DIEnumerator(name: "osTimerPeriodic", value: 1)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !54, line: 27, baseType: !32, size: 32, elements: !55)
!54 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!56 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!57 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!58 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!59 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!60 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!61 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!62 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!63 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!64 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!65 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!66 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!67 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!68 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!69 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!70 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!71 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!72 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!122 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !{!25, !127, !184, !186, !188, !193}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "os_messageQ_def_messageq", scope: !27, file: !129, line: 27, type: !130, isLocal: false, isDefinition: true)
!129 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v1/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQDef_t", file: !31, line: 213, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_messageQ_def", file: !31, line: 208, size: 128, elements: !133)
!133 = !{!134, !136, !137, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "queue_sz", scope: !132, file: !31, line: 209, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "item_sz", scope: !132, file: !31, line: 210, baseType: !135, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !132, file: !31, line: 211, baseType: !124, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !132, file: !31, line: 212, baseType: !139, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !141, line: 4204, size: 416, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !164, !169, !172, !173, !176, !177, !178, !179, !180, !181}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !140, file: !141, line: 4206, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !145, line: 233, baseType: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 231, size: 64, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !146, file: !145, line: 232, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !150, line: 48, baseType: !151)
!150 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !150, line: 37, size: 64, elements: !152)
!152 = !{!153, !159}
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !150, line: 38, baseType: !154, size: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !150, line: 38, size: 32, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !154, file: !150, line: 39, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !150, line: 40, baseType: !157, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !150, line: 42, baseType: !160, size: 32, offset: 32)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !150, line: 42, size: 32, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !160, file: !150, line: 43, baseType: !157, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !150, line: 44, baseType: !157, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !140, file: !141, line: 4208, baseType: !165, size: 32, offset: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !166, line: 43, size: 32, elements: !167)
!166 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !165, file: !166, line: 52, baseType: !22, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !140, file: !141, line: 4210, baseType: !170, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !171, line: 214, baseType: !32)
!171 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !140, file: !141, line: 4212, baseType: !135, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !140, file: !141, line: 4214, baseType: !174, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !140, file: !141, line: 4216, baseType: !174, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !140, file: !141, line: 4218, baseType: !174, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !140, file: !141, line: 4220, baseType: !174, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !140, file: !141, line: 4222, baseType: !135, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !140, file: !141, line: 4224, baseType: !149, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !140, file: !141, line: 4227, baseType: !182, size: 8, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !183)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "data", scope: !27, file: !129, line: 21, type: !135, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "msgq_messageq", scope: !27, file: !129, line: 27, type: !140, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "buf_messageq", scope: !27, file: !129, line: 27, type: !190, isLocal: true, isDefinition: true, align: 32)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 32, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 4)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "message_id", scope: !27, file: !129, line: 28, type: !195, isLocal: false, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQId", file: !31, line: 157, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "os_messageQ_cb", file: !31, line: 157, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerDef_t", file: !31, line: 184, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_timer_def", file: !31, line: 182, size: 32, elements: !201)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ptimer", scope: !200, file: !31, line: 183, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "os_ptimer", file: !31, line: 131, baseType: !16)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "_char_out", scope: !206, file: !210, line: 54, type: !211, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !123, globals: !209, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!208 = !{!53}
!209 = !{!204}
!210 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{!125, !125}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !216, file: !952, line: 202, type: !953, isLocal: true, isDefinition: true, align: 32)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !218, globals: !951, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!218 = !{!124, !125, !219, !345, !682, !683, !750}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !221, line: 335, baseType: !222)
!221 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 320, size: 288, elements: !223)
!223 = !{!224, !237, !245, !259, !270, !281, !285, !296, !297, !308, !309, !324, !325, !335}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !222, file: !221, line: 321, baseType: !225, size: 16)
!225 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !221, line: 50, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 43, size: 16, elements: !228)
!228 = !{!229, !236}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !227, file: !221, line: 48, baseType: !230, size: 16)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !227, file: !221, line: 44, size: 16, elements: !231)
!231 = !{!232, !235}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !230, file: !221, line: 45, baseType: !233, size: 7, flags: DIFlagBitField, extraData: i64 0)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !234)
!234 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !230, file: !221, line: 47, baseType: !233, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !227, file: !221, line: 49, baseType: !233, size: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !222, file: !221, line: 322, baseType: !238, size: 16, offset: 16)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 16, elements: !243)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !240, line: 52, baseType: !241)
!240 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !182)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !222, file: !221, line: 323, baseType: !246, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !221, line: 107, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 94, size: 32, elements: !249)
!249 = !{!250, !258}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !248, file: !221, line: 105, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !221, line: 95, size: 32, elements: !252)
!252 = !{!253, !254, !255, !256, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !251, file: !221, line: 97, baseType: !135, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !251, file: !221, line: 99, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !251, file: !221, line: 100, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !251, file: !221, line: 102, baseType: !135, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !251, file: !221, line: 103, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !248, file: !221, line: 106, baseType: !135, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !222, file: !221, line: 324, baseType: !260, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !221, line: 155, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 148, size: 32, elements: !263)
!263 = !{!264, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !262, file: !221, line: 153, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !221, line: 149, size: 32, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !265, file: !221, line: 150, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !265, file: !221, line: 151, baseType: !135, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !262, file: !221, line: 154, baseType: !135, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !222, file: !221, line: 325, baseType: !271, size: 8, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !221, line: 194, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 187, size: 8, elements: !274)
!274 = !{!275, !280}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !273, file: !221, line: 192, baseType: !276, size: 8)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !273, file: !221, line: 188, size: 8, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !276, file: !221, line: 189, baseType: !182, size: 1, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !276, file: !221, line: 190, baseType: !182, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !273, file: !221, line: 193, baseType: !182, size: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !222, file: !221, line: 326, baseType: !282, size: 24, offset: 104)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 24, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 3)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !222, file: !221, line: 327, baseType: !286, size: 8, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !221, line: 215, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 208, size: 8, elements: !289)
!289 = !{!290, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !288, file: !221, line: 213, baseType: !291, size: 8)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !221, line: 209, size: 8, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !291, file: !221, line: 210, baseType: !182, size: 1, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !291, file: !221, line: 211, baseType: !182, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !288, file: !221, line: 214, baseType: !182, size: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !222, file: !221, line: 328, baseType: !282, size: 24, offset: 136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !222, file: !221, line: 329, baseType: !298, size: 8, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !221, line: 236, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 229, size: 8, elements: !301)
!301 = !{!302, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !300, file: !221, line: 234, baseType: !303, size: 8)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !221, line: 230, size: 8, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !303, file: !221, line: 231, baseType: !241, size: 1, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !303, file: !221, line: 232, baseType: !241, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !300, file: !221, line: 235, baseType: !182, size: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !222, file: !221, line: 330, baseType: !282, size: 24, offset: 168)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !222, file: !221, line: 331, baseType: !310, size: 16, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !221, line: 262, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 250, size: 16, elements: !313)
!313 = !{!314, !323}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !312, file: !221, line: 260, baseType: !315, size: 16)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !221, line: 251, size: 16, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !315, file: !221, line: 252, baseType: !233, size: 1, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !315, file: !221, line: 253, baseType: !233, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !315, file: !221, line: 254, baseType: !233, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !315, file: !221, line: 255, baseType: !233, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !315, file: !221, line: 256, baseType: !233, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !315, file: !221, line: 258, baseType: !233, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !312, file: !221, line: 261, baseType: !233, size: 16)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !222, file: !221, line: 332, baseType: !238, size: 16, offset: 208)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !222, file: !221, line: 333, baseType: !326, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !221, line: 290, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 284, size: 32, elements: !329)
!329 = !{!330, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !328, file: !221, line: 288, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !221, line: 285, size: 32, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !331, file: !221, line: 286, baseType: !135, size: 22, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !328, file: !221, line: 289, baseType: !135, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !222, file: !221, line: 334, baseType: !336, size: 16, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !221, line: 308, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !221, line: 303, size: 16, elements: !339)
!339 = !{!340, !344}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !338, file: !221, line: 306, baseType: !341, size: 16)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !221, line: 304, size: 16, elements: !342)
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !341, file: !221, line: 305, baseType: !233, size: 16, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !338, file: !221, line: 307, baseType: !233, size: 16)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !347, line: 928, baseType: !348)
!347 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 899, size: 672, elements: !349)
!349 = !{!350, !374, !398, !424, !449, !465, !466, !484, !485, !502, !513, !514, !529, !549, !550, !562, !574, !584, !585, !602, !604, !615, !616, !628, !640, !641, !652, !668}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !348, file: !347, line: 900, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !347, line: 64, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 43, size: 32, elements: !354)
!354 = !{!355, !373}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !353, file: !347, line: 62, baseType: !356, size: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !353, file: !347, line: 44, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !356, file: !347, line: 45, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !356, file: !347, line: 46, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !356, file: !347, line: 47, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !356, file: !347, line: 48, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !356, file: !347, line: 49, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !356, file: !347, line: 50, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !356, file: !347, line: 51, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !356, file: !347, line: 52, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !356, file: !347, line: 53, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !356, file: !347, line: 54, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !356, file: !347, line: 55, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !356, file: !347, line: 56, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !356, file: !347, line: 58, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !356, file: !347, line: 59, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !356, file: !347, line: 60, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !353, file: !347, line: 63, baseType: !135, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !348, file: !347, line: 901, baseType: !375, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !347, line: 125, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 104, size: 32, elements: !378)
!378 = !{!379, !397}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !377, file: !347, line: 123, baseType: !380, size: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !347, line: 105, size: 32, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !380, file: !347, line: 106, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !380, file: !347, line: 107, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !380, file: !347, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !380, file: !347, line: 109, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !380, file: !347, line: 110, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !380, file: !347, line: 111, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !380, file: !347, line: 112, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !380, file: !347, line: 113, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !380, file: !347, line: 114, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !380, file: !347, line: 115, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !380, file: !347, line: 116, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !380, file: !347, line: 117, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !380, file: !347, line: 119, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !380, file: !347, line: 120, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !380, file: !347, line: 121, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !377, file: !347, line: 124, baseType: !135, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !348, file: !347, line: 902, baseType: !399, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !347, line: 186, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 165, size: 32, elements: !402)
!402 = !{!403, !423}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !401, file: !347, line: 184, baseType: !404, size: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !401, file: !347, line: 166, size: 32, elements: !405)
!405 = !{!406, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !404, file: !347, line: 167, baseType: !407, size: 1, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !404, file: !347, line: 168, baseType: !407, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !404, file: !347, line: 169, baseType: !407, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !404, file: !347, line: 170, baseType: !407, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !404, file: !347, line: 171, baseType: !407, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !404, file: !347, line: 172, baseType: !407, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !404, file: !347, line: 173, baseType: !407, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !404, file: !347, line: 174, baseType: !407, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !404, file: !347, line: 175, baseType: !407, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !404, file: !347, line: 176, baseType: !407, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !404, file: !347, line: 177, baseType: !407, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !404, file: !347, line: 178, baseType: !407, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !404, file: !347, line: 180, baseType: !407, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !404, file: !347, line: 181, baseType: !407, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !404, file: !347, line: 182, baseType: !407, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !401, file: !347, line: 185, baseType: !135, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !348, file: !347, line: 903, baseType: !425, size: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !347, line: 247, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 226, size: 32, elements: !429)
!429 = !{!430, !448}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !428, file: !347, line: 245, baseType: !431, size: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !428, file: !347, line: 227, size: 32, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !431, file: !347, line: 228, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !431, file: !347, line: 229, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !431, file: !347, line: 230, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !431, file: !347, line: 231, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !431, file: !347, line: 232, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !431, file: !347, line: 233, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !431, file: !347, line: 234, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !431, file: !347, line: 235, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !431, file: !347, line: 236, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !431, file: !347, line: 237, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !431, file: !347, line: 238, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !431, file: !347, line: 239, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !431, file: !347, line: 241, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !431, file: !347, line: 242, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !431, file: !347, line: 243, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !428, file: !347, line: 246, baseType: !135, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !348, file: !347, line: 904, baseType: !450, size: 16, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !347, line: 300, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 287, size: 16, elements: !453)
!453 = !{!454, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !452, file: !347, line: 298, baseType: !455, size: 16)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !347, line: 288, size: 16, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !455, file: !347, line: 290, baseType: !233, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !455, file: !347, line: 291, baseType: !233, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !455, file: !347, line: 293, baseType: !233, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !455, file: !347, line: 294, baseType: !233, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !455, file: !347, line: 295, baseType: !233, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !455, file: !347, line: 296, baseType: !233, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !455, file: !347, line: 297, baseType: !233, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !452, file: !347, line: 299, baseType: !233, size: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !348, file: !347, line: 905, baseType: !238, size: 16, offset: 144)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !348, file: !347, line: 906, baseType: !467, size: 16, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !347, line: 352, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 336, size: 16, elements: !470)
!470 = !{!471, !483}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !469, file: !347, line: 350, baseType: !472, size: 16)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !347, line: 337, size: 16, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !472, file: !347, line: 339, baseType: !233, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !472, file: !347, line: 340, baseType: !233, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !472, file: !347, line: 341, baseType: !233, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !472, file: !347, line: 342, baseType: !233, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !472, file: !347, line: 343, baseType: !233, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !472, file: !347, line: 344, baseType: !233, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !472, file: !347, line: 345, baseType: !233, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !472, file: !347, line: 346, baseType: !233, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !472, file: !347, line: 348, baseType: !233, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !469, file: !347, line: 351, baseType: !233, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !348, file: !347, line: 907, baseType: !238, size: 16, offset: 176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !348, file: !347, line: 908, baseType: !486, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !347, line: 398, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 381, size: 32, elements: !489)
!489 = !{!490, !501}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !488, file: !347, line: 396, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !347, line: 382, size: 32, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !491, file: !347, line: 384, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !491, file: !347, line: 385, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !491, file: !347, line: 386, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !491, file: !347, line: 388, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !491, file: !347, line: 389, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !491, file: !347, line: 390, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !491, file: !347, line: 392, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !491, file: !347, line: 394, baseType: !135, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !488, file: !347, line: 397, baseType: !135, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !348, file: !347, line: 909, baseType: !503, size: 8, offset: 224)
!503 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !347, line: 433, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 426, size: 8, elements: !506)
!506 = !{!507, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !505, file: !347, line: 431, baseType: !508, size: 8)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !505, file: !347, line: 427, size: 8, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !508, file: !347, line: 428, baseType: !182, size: 5, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !508, file: !347, line: 430, baseType: !182, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !505, file: !347, line: 432, baseType: !182, size: 8)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !348, file: !347, line: 910, baseType: !282, size: 24, offset: 232)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !348, file: !347, line: 911, baseType: !515, size: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !347, line: 462, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 448, size: 32, elements: !518)
!518 = !{!519, !528}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !517, file: !347, line: 460, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !517, file: !347, line: 449, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !520, file: !347, line: 451, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !520, file: !347, line: 453, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !520, file: !347, line: 454, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !520, file: !347, line: 455, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !520, file: !347, line: 457, baseType: !135, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !520, file: !347, line: 459, baseType: !135, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !517, file: !347, line: 461, baseType: !135, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !348, file: !347, line: 912, baseType: !530, size: 16, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !347, line: 520, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 503, size: 16, elements: !533)
!533 = !{!534, !548}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !532, file: !347, line: 518, baseType: !535, size: 16)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !347, line: 504, size: 16, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !535, file: !347, line: 506, baseType: !233, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !535, file: !347, line: 507, baseType: !233, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !535, file: !347, line: 508, baseType: !233, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !535, file: !347, line: 509, baseType: !233, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !535, file: !347, line: 510, baseType: !233, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !535, file: !347, line: 511, baseType: !233, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !535, file: !347, line: 512, baseType: !233, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !535, file: !347, line: 513, baseType: !233, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !535, file: !347, line: 514, baseType: !233, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !535, file: !347, line: 515, baseType: !233, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !535, file: !347, line: 516, baseType: !233, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !532, file: !347, line: 519, baseType: !233, size: 16)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !348, file: !347, line: 913, baseType: !238, size: 16, offset: 304)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !348, file: !347, line: 914, baseType: !551, size: 32, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !347, line: 559, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 552, size: 32, elements: !554)
!554 = !{!555, !561}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !553, file: !347, line: 557, baseType: !556, size: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !347, line: 553, size: 32, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !556, file: !347, line: 554, baseType: !135, size: 10, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !556, file: !347, line: 555, baseType: !135, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !556, file: !347, line: 556, baseType: !135, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !553, file: !347, line: 558, baseType: !135, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !348, file: !347, line: 915, baseType: !563, size: 32, offset: 352)
!563 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !347, line: 585, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 578, size: 32, elements: !566)
!566 = !{!567, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !565, file: !347, line: 583, baseType: !568, size: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !565, file: !347, line: 579, size: 32, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !568, file: !347, line: 580, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !568, file: !347, line: 581, baseType: !135, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !568, file: !347, line: 582, baseType: !135, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !565, file: !347, line: 584, baseType: !135, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !348, file: !347, line: 916, baseType: !575, size: 8, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !347, line: 610, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 604, size: 8, elements: !578)
!578 = !{!579, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !577, file: !347, line: 608, baseType: !580, size: 8)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !347, line: 605, size: 8, elements: !581)
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !580, file: !347, line: 607, baseType: !182, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !577, file: !347, line: 609, baseType: !182, size: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !348, file: !347, line: 917, baseType: !282, size: 24, offset: 392)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !348, file: !347, line: 918, baseType: !586, size: 32, offset: 416)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !347, line: 639, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 622, size: 32, elements: !589)
!589 = !{!590, !601}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !588, file: !347, line: 637, baseType: !591, size: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !347, line: 623, size: 32, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !591, file: !347, line: 625, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !591, file: !347, line: 626, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !591, file: !347, line: 627, baseType: !135, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !591, file: !347, line: 629, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !591, file: !347, line: 631, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !591, file: !347, line: 632, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !591, file: !347, line: 634, baseType: !135, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !591, file: !347, line: 635, baseType: !135, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !588, file: !347, line: 638, baseType: !135, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !348, file: !347, line: 919, baseType: !603, size: 32, offset: 448)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 32, elements: !191)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !348, file: !347, line: 920, baseType: !605, size: 16, offset: 480)
!605 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !347, line: 715, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 706, size: 16, elements: !608)
!608 = !{!609, !614}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !607, file: !347, line: 713, baseType: !610, size: 16)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !607, file: !347, line: 707, size: 16, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !610, file: !347, line: 709, baseType: !233, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !610, file: !347, line: 711, baseType: !233, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !607, file: !347, line: 714, baseType: !233, size: 16)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !348, file: !347, line: 921, baseType: !238, size: 16, offset: 496)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !348, file: !347, line: 922, baseType: !617, size: 32, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !347, line: 739, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 729, size: 32, elements: !620)
!620 = !{!621, !627}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !619, file: !347, line: 737, baseType: !622, size: 32)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !619, file: !347, line: 730, size: 32, elements: !623)
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !622, file: !347, line: 732, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !622, file: !347, line: 733, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !622, file: !347, line: 735, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !619, file: !347, line: 738, baseType: !135, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !348, file: !347, line: 923, baseType: !629, size: 8, offset: 544)
!629 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !347, line: 765, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 756, size: 8, elements: !632)
!632 = !{!633, !639}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !631, file: !347, line: 763, baseType: !634, size: 8)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !631, file: !347, line: 757, size: 8, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !634, file: !347, line: 759, baseType: !182, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !634, file: !347, line: 761, baseType: !182, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !634, file: !347, line: 762, baseType: !182, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !631, file: !347, line: 764, baseType: !182, size: 8)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !348, file: !347, line: 924, baseType: !282, size: 24, offset: 552)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !348, file: !347, line: 925, baseType: !642, size: 32, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !347, line: 789, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 781, size: 32, elements: !645)
!645 = !{!646, !651}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !644, file: !347, line: 787, baseType: !647, size: 32)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !644, file: !347, line: 782, size: 32, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !647, file: !347, line: 783, baseType: !135, size: 12, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !647, file: !347, line: 785, baseType: !135, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !644, file: !347, line: 788, baseType: !135, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !348, file: !347, line: 926, baseType: !653, size: 32, offset: 608)
!653 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !347, line: 820, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 805, size: 32, elements: !656)
!656 = !{!657, !667}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !655, file: !347, line: 818, baseType: !658, size: 32)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !655, file: !347, line: 806, size: 32, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !658, file: !347, line: 807, baseType: !135, size: 2, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !658, file: !347, line: 808, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !658, file: !347, line: 809, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !658, file: !347, line: 810, baseType: !135, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !658, file: !347, line: 812, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !658, file: !347, line: 814, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !658, file: !347, line: 816, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !655, file: !347, line: 819, baseType: !135, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !348, file: !347, line: 927, baseType: !669, size: 8, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !347, line: 881, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 872, size: 8, elements: !673)
!673 = !{!674, !681}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !672, file: !347, line: 879, baseType: !675, size: 8)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !672, file: !347, line: 873, size: 8, elements: !676)
!676 = !{!677, !678, !679, !680}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !675, file: !347, line: 874, baseType: !182, size: 1, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !675, file: !347, line: 875, baseType: !182, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !675, file: !347, line: 876, baseType: !182, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !675, file: !347, line: 877, baseType: !182, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !672, file: !347, line: 880, baseType: !182, size: 8)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !685, line: 290, baseType: !686)
!685 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 284, size: 96, elements: !687)
!687 = !{!688, !698, !709, !722, !739}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !686, file: !685, line: 285, baseType: !689, size: 8)
!689 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !685, line: 49, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !685, line: 43, size: 8, elements: !692)
!692 = !{!693, !697}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !691, file: !685, line: 47, baseType: !694, size: 8)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !685, line: 44, size: 8, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !694, file: !685, line: 45, baseType: !182, size: 1, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !691, file: !685, line: 48, baseType: !182, size: 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !686, file: !685, line: 286, baseType: !699, size: 8, offset: 8)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !685, line: 67, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !685, line: 61, size: 8, elements: !703)
!703 = !{!704, !708}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !702, file: !685, line: 65, baseType: !705, size: 8)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !702, file: !685, line: 62, size: 8, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !705, file: !685, line: 64, baseType: !182, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !702, file: !685, line: 66, baseType: !182, size: 8)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !686, file: !685, line: 287, baseType: !710, size: 16, offset: 16)
!710 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !685, line: 89, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !685, line: 79, size: 16, elements: !713)
!713 = !{!714, !721}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !712, file: !685, line: 87, baseType: !715, size: 16)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !712, file: !685, line: 80, size: 16, elements: !716)
!716 = !{!717, !718, !719, !720}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !715, file: !685, line: 81, baseType: !233, size: 6, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !715, file: !685, line: 83, baseType: !233, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !715, file: !685, line: 85, baseType: !233, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !715, file: !685, line: 86, baseType: !233, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !712, file: !685, line: 88, baseType: !233, size: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !686, file: !685, line: 288, baseType: !723, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !685, line: 214, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !685, line: 199, size: 32, elements: !726)
!726 = !{!727, !738}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !725, file: !685, line: 212, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !685, line: 200, size: 32, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !728, file: !685, line: 201, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !728, file: !685, line: 203, baseType: !135, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !728, file: !685, line: 205, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !728, file: !685, line: 206, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !728, file: !685, line: 207, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !728, file: !685, line: 208, baseType: !135, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !728, file: !685, line: 209, baseType: !135, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !728, file: !685, line: 210, baseType: !135, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !725, file: !685, line: 213, baseType: !135, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !686, file: !685, line: 289, baseType: !740, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !685, line: 268, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !685, line: 260, size: 32, elements: !743)
!743 = !{!744, !749}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !742, file: !685, line: 266, baseType: !745, size: 32)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !685, line: 261, size: 32, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !745, file: !685, line: 262, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !745, file: !685, line: 264, baseType: !135, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !742, file: !685, line: 267, baseType: !135, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !752, line: 513, baseType: !753)
!752 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 494, size: 480, elements: !754)
!754 = !{!755, !761, !771, !775, !785, !795, !805, !815, !819, !835, !851, !867, !897, !901, !911, !921, !931, !935}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !753, file: !752, line: 495, baseType: !756, size: 8)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !752, line: 45, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 43, size: 8, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !752, line: 44, baseType: !182, size: 8)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !753, file: !752, line: 496, baseType: !762, size: 8, offset: 8)
!762 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !752, line: 61, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 55, size: 8, elements: !765)
!765 = !{!766, !770}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !764, file: !752, line: 59, baseType: !767, size: 8)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !764, file: !752, line: 56, size: 8, elements: !768)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !767, file: !752, line: 57, baseType: !182, size: 2, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !764, file: !752, line: 60, baseType: !182, size: 8)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !753, file: !752, line: 497, baseType: !772, size: 48, offset: 16)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 48, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 6)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !753, file: !752, line: 498, baseType: !776, size: 8, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !752, line: 86, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 80, size: 8, elements: !779)
!779 = !{!780, !784}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !778, file: !752, line: 84, baseType: !781, size: 8)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !778, file: !752, line: 81, size: 8, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !781, file: !752, line: 82, baseType: !182, size: 3, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !778, file: !752, line: 85, baseType: !182, size: 8)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !753, file: !752, line: 499, baseType: !786, size: 8, offset: 72)
!786 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !752, line: 121, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 115, size: 8, elements: !789)
!789 = !{!790, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !788, file: !752, line: 119, baseType: !791, size: 8)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !788, file: !752, line: 116, size: 8, elements: !792)
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !791, file: !752, line: 117, baseType: !182, size: 3, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !788, file: !752, line: 120, baseType: !182, size: 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !753, file: !752, line: 500, baseType: !796, size: 8, offset: 80)
!796 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !752, line: 156, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 150, size: 8, elements: !799)
!799 = !{!800, !804}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !798, file: !752, line: 154, baseType: !801, size: 8)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !798, file: !752, line: 151, size: 8, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !801, file: !752, line: 152, baseType: !182, size: 3, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !798, file: !752, line: 155, baseType: !182, size: 8)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !753, file: !752, line: 501, baseType: !806, size: 8, offset: 88)
!806 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !752, line: 191, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 185, size: 8, elements: !809)
!809 = !{!810, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !808, file: !752, line: 189, baseType: !811, size: 8)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !808, file: !752, line: 186, size: 8, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !811, file: !752, line: 187, baseType: !182, size: 3, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !808, file: !752, line: 190, baseType: !182, size: 8)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !753, file: !752, line: 502, baseType: !816, size: 64, offset: 96)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 64, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 8)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !753, file: !752, line: 503, baseType: !820, size: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !752, line: 232, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 220, size: 32, elements: !823)
!823 = !{!824, !834}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !822, file: !752, line: 230, baseType: !825, size: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !822, file: !752, line: 221, size: 32, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !825, file: !752, line: 222, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !825, file: !752, line: 223, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !825, file: !752, line: 224, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !825, file: !752, line: 225, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !825, file: !752, line: 226, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !825, file: !752, line: 227, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !825, file: !752, line: 228, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !822, file: !752, line: 231, baseType: !135, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !753, file: !752, line: 504, baseType: !836, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !752, line: 268, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 256, size: 32, elements: !839)
!839 = !{!840, !850}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !838, file: !752, line: 266, baseType: !841, size: 32)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !838, file: !752, line: 257, size: 32, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !849}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !841, file: !752, line: 258, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !841, file: !752, line: 259, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !841, file: !752, line: 260, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !841, file: !752, line: 261, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !841, file: !752, line: 262, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !841, file: !752, line: 263, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !841, file: !752, line: 264, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !838, file: !752, line: 267, baseType: !135, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !753, file: !752, line: 505, baseType: !852, size: 32, offset: 224)
!852 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !752, line: 304, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 292, size: 32, elements: !855)
!855 = !{!856, !866}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !854, file: !752, line: 302, baseType: !857, size: 32)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !752, line: 293, size: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !857, file: !752, line: 294, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !857, file: !752, line: 295, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !857, file: !752, line: 296, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !857, file: !752, line: 297, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !857, file: !752, line: 298, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !857, file: !752, line: 299, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !857, file: !752, line: 300, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !854, file: !752, line: 303, baseType: !135, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !753, file: !752, line: 506, baseType: !868, size: 32, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !752, line: 354, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !752, line: 328, size: 32, elements: !871)
!871 = !{!872, !896}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !870, file: !752, line: 352, baseType: !873, size: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !870, file: !752, line: 329, size: 32, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !873, file: !752, line: 330, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !873, file: !752, line: 331, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !873, file: !752, line: 332, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !873, file: !752, line: 333, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !873, file: !752, line: 334, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !873, file: !752, line: 335, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !873, file: !752, line: 336, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !873, file: !752, line: 337, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !873, file: !752, line: 338, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !873, file: !752, line: 339, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !873, file: !752, line: 340, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !873, file: !752, line: 341, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !873, file: !752, line: 342, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !873, file: !752, line: 343, baseType: !135, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !873, file: !752, line: 344, baseType: !135, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !873, file: !752, line: 345, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !873, file: !752, line: 346, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !873, file: !752, line: 347, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
