; ModuleID = 'build/arduino_due/subsys/testsuite/pytest/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.ztest_suite_stats, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_test_pytest", scope: !27, file: !111, line: 8, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_test_pytest", scope: !27, file: !111, line: 8, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__test_pytest__test_pytest", scope: !27, file: !111, line: 10, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_test_pytest_test_pytest", scope: !27, file: !111, line: 10, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !218, file: !283, line: 235, type: !284, isLocal: true, isDefinition: true, align: 32)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !220, globals: !282, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!220 = !{!106, !107, !221, !232}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !223, line: 46, baseType: !224)
!223 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 41, size: 128, elements: !225)
!225 = !{!226, !228, !229, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !224, file: !223, line: 42, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !224, file: !223, line: 43, baseType: !227, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !224, file: !223, line: 44, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !224, file: !223, line: 45, baseType: !230, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !234, line: 75, baseType: !235)
!234 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 41, size: 2176, elements: !236)
!236 = !{!237, !238, !239, !240, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !260, !264, !265, !266, !267, !268, !269, !270, !271, !275, !276, !277, !278, !279, !280, !281}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !235, file: !234, line: 42, baseType: !227, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !235, file: !234, line: 43, baseType: !227, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !235, file: !234, line: 44, baseType: !230, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !235, file: !234, line: 45, baseType: !241, size: 32, offset: 96)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 1)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !235, file: !234, line: 46, baseType: !227, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !235, file: !234, line: 47, baseType: !227, size: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !235, file: !234, line: 48, baseType: !230, size: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !235, file: !234, line: 49, baseType: !227, size: 32, offset: 224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !235, file: !234, line: 50, baseType: !227, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !235, file: !234, line: 51, baseType: !230, size: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !235, file: !234, line: 52, baseType: !227, size: 32, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !235, file: !234, line: 53, baseType: !241, size: 32, offset: 352)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !235, file: !234, line: 54, baseType: !227, size: 32, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !235, file: !234, line: 55, baseType: !241, size: 32, offset: 416)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !235, file: !234, line: 56, baseType: !227, size: 32, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !235, file: !234, line: 57, baseType: !241, size: 32, offset: 480)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !235, file: !234, line: 58, baseType: !257, size: 96, offset: 512)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 96, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 3)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !235, file: !234, line: 59, baseType: !261, size: 160, offset: 608)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 160, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 5)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !235, file: !234, line: 60, baseType: !227, size: 32, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !235, file: !234, line: 61, baseType: !227, size: 32, offset: 800)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !235, file: !234, line: 62, baseType: !230, size: 32, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !235, file: !234, line: 63, baseType: !230, size: 32, offset: 864)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !235, file: !234, line: 64, baseType: !227, size: 32, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !235, file: !234, line: 65, baseType: !227, size: 32, offset: 928)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !235, file: !234, line: 66, baseType: !227, size: 32, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !235, file: !234, line: 67, baseType: !272, size: 832, offset: 992)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 832, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 26)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !235, file: !234, line: 68, baseType: !227, size: 32, offset: 1824)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !235, file: !234, line: 69, baseType: !230, size: 32, offset: 1856)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !235, file: !234, line: 70, baseType: !261, size: 160, offset: 1888)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !235, file: !234, line: 71, baseType: !227, size: 32, offset: 2048)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !235, file: !234, line: 72, baseType: !227, size: 32, offset: 2080)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !235, file: !234, line: 73, baseType: !230, size: 32, offset: 2112)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !235, file: !234, line: 74, baseType: !227, size: 32, offset: 2144)
!282 = !{!216}
!283 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !286, line: 51, size: 64, elements: !287)
!286 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!287 = !{!288, !313}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !285, file: !286, line: 60, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{!107, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !295, line: 378, size: 192, elements: !296)
!295 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = !{!297, !298, !299, !300, !306, !307}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !295, line: 380, baseType: !118, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !294, file: !295, line: 382, baseType: !13, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !294, file: !295, line: 384, baseType: !13, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !294, file: !295, line: 386, baseType: !301, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !295, line: 351, size: 16, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !302, file: !295, line: 359, baseType: !195, size: 8)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !302, file: !295, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !295, line: 388, baseType: !106, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !294, file: !295, line: 396, baseType: !308, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !295, line: 43, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !312)
!312 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !285, file: !286, line: 65, baseType: !292, size: 32, offset: 32)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !316, file: !323, line: 17, type: !468, isLocal: false, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !318, globals: !319, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!318 = !{!185, !107, !152, !106}
!319 = !{!314, !320, !464}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !322, file: !323, line: 198, type: !452, isLocal: true, isDefinition: true)
!322 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !323, file: !323, line: 175, type: !324, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !316, retainedNodes: !447)
!323 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = !DISubroutineType(types: !325)
!325 = !{null, !326}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !328, line: 245, size: 1280, elements: !329)
!328 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = !{!330, !396, !409, !410, !411, !415, !416, !422, !442}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !327, file: !328, line: 247, baseType: !331, size: 384)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !328, line: 57, size: 384, elements: !332)
!332 = !{!333, !361, !369, !370, !371, !382, !383, !384}
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !331, file: !328, line: 60, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !328, line: 60, size: 64, elements: !335)
!335 = !{!336, !352}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !334, file: !328, line: 61, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !338, line: 49, baseType: !339)
!338 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !338, line: 37, size: 64, elements: !340)
!340 = !{!341, !347}
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !338, line: 38, baseType: !342, size: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !338, line: 38, size: 32, elements: !343)
!343 = !{!344, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !342, file: !338, line: 39, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !338, line: 40, baseType: !345, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !338, line: 42, baseType: !348, size: 32, offset: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !338, line: 42, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !348, file: !338, line: 43, baseType: !345, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !338, line: 44, baseType: !345, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !334, file: !328, line: 62, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !354, line: 49, size: 64, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !353, file: !354, line: 50, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 64, elements: !359)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!359 = !{!360}
!360 = !DISubrange(count: 2)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !331, file: !328, line: 68, baseType: !362, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !364, line: 233, baseType: !365)
!364 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 231, size: 64, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !365, file: !364, line: 232, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !338, line: 48, baseType: !339)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !331, file: !328, line: 71, baseType: !195, size: 8, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !331, file: !328, line: 74, baseType: !195, size: 8, offset: 104)
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !331, file: !328, line: 90, baseType: !372, size: 16, offset: 112)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !328, line: 90, size: 16, elements: !373)
!373 = !{!374, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, scope: !372, file: !328, line: 91, baseType: !375, size: 16)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !372, file: !328, line: 91, size: 16, elements: !376)
!376 = !{!377, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !375, file: !328, line: 96, baseType: !378, size: 8)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !379)
!379 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !375, file: !328, line: 97, baseType: !195, size: 8, offset: 8)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !372, file: !328, line: 100, baseType: !197, size: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !331, file: !328, line: 107, baseType: !152, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !331, file: !328, line: 127, baseType: !106, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !331, file: !328, line: 131, baseType: !385, size: 192, offset: 192)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !364, line: 244, size: 192, elements: !386)
!386 = !{!387, !388, !394}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !385, file: !364, line: 245, baseType: !337, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !385, file: !364, line: 246, baseType: !389, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !364, line: 242, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !385, file: !364, line: 249, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !191)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !327, file: !328, line: 250, baseType: !397, size: 288, offset: 384)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !398, line: 25, size: 288, elements: !399)
!398 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !397, file: !398, line: 26, baseType: !152, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !397, file: !398, line: 27, baseType: !152, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !397, file: !398, line: 28, baseType: !152, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !397, file: !398, line: 29, baseType: !152, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !397, file: !398, line: 30, baseType: !152, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !397, file: !398, line: 31, baseType: !152, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !397, file: !398, line: 32, baseType: !152, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !397, file: !398, line: 33, baseType: !152, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !397, file: !398, line: 34, baseType: !152, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !327, file: !328, line: 253, baseType: !106, size: 32, offset: 672)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !327, file: !328, line: 256, baseType: !363, size: 64, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !328, line: 279, baseType: !412, size: 256, offset: 768)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !327, file: !328, line: 294, baseType: !107, size: 32, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !327, file: !328, line: 300, baseType: !417, size: 96, offset: 1056)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !328, line: 149, size: 96, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !417, file: !328, line: 153, baseType: !22, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !417, file: !328, line: 162, baseType: !185, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !417, file: !328, line: 168, baseType: !185, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !327, file: !328, line: 325, baseType: !423, size: 32, offset: 1152)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !425, line: 5073, size: 192, elements: !426)
!425 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !{!427, !436, !437}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !424, file: !425, line: 5074, baseType: !428, size: 96)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !429, line: 56, size: 96, elements: !430)
!429 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !{!431, !434, !435}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !428, file: !429, line: 57, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !429, line: 57, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !428, file: !429, line: 58, baseType: !106, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !428, file: !429, line: 59, baseType: !185, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !424, file: !425, line: 5075, baseType: !363, size: 64, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !424, file: !425, line: 5076, baseType: !438, size: 32, offset: 160)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !439, line: 43, size: 32, elements: !440)
!439 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !438, file: !439, line: 52, baseType: !22, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !327, file: !328, line: 343, baseType: !443, size: 64, offset: 1184)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !398, line: 60, size: 64, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !443, file: !398, line: 63, baseType: !152, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !443, file: !398, line: 66, baseType: !152, size: 32, offset: 32)
!447 = !{!448, !449, !450, !451}
!448 = !DILocalVariable(name: "thread", arg: 1, scope: !322, file: !323, line: 175, type: !326)
!449 = !DILocalVariable(name: "region_num", scope: !322, file: !323, line: 200, type: !195)
!450 = !DILocalVariable(name: "guard_start", scope: !322, file: !323, line: 265, type: !22)
!451 = !DILocalVariable(name: "guard_size", scope: !322, file: !323, line: 266, type: !185)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 96, elements: !242)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !454, line: 52, size: 96, elements: !455)
!454 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !453, file: !454, line: 53, baseType: !22, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !453, file: !454, line: 54, baseType: !185, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !453, file: !454, line: 55, baseType: !459, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !460, line: 151, baseType: !461)
!460 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 149, size: 32, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !461, file: !460, line: 150, baseType: !152, size: 32)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "static_regions", scope: !316, file: !323, line: 62, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 96, elements: !242)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !203, line: 17, baseType: !118, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !469, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !475, file: !507, line: 39, type: !195, isLocal: true, isDefinition: true)
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !477, globals: !506, splitDebugInlining: false, nameTableKind: None)
!476 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!477 = !{!478, !106, !107, !494, !195}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !480, line: 1168, baseType: !481)
!480 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 1155, size: 352, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !481, file: !480, line: 1157, baseType: !230, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !481, file: !480, line: 1158, baseType: !227, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !481, file: !480, line: 1159, baseType: !227, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !481, file: !480, line: 1160, baseType: !227, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !481, file: !480, line: 1161, baseType: !227, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !481, file: !480, line: 1162, baseType: !227, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !481, file: !480, line: 1163, baseType: !227, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !481, file: !480, line: 1164, baseType: !227, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !481, file: !480, line: 1165, baseType: !227, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !481, file: !480, line: 1166, baseType: !227, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !481, file: !480, line: 1167, baseType: !227, size: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !497, line: 27, size: 96, elements: !498)
!497 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!498 = !{!499, !500, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !496, file: !497, line: 29, baseType: !152, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !496, file: !497, line: 31, baseType: !118, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !496, file: !497, line: 37, baseType: !502, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !460, line: 146, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !460, line: 141, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !503, file: !460, line: 143, baseType: !152, size: 32)
!506 = !{!473}
!507 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !510, file: !517, line: 21, type: !213, isLocal: true, isDefinition: true)
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !512, globals: !516, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!512 = !{!513, !107, !106}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !515, line: 22, baseType: !107)
!515 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!516 = !{!508}
!517 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !520, file: !525, line: 13, type: !542, isLocal: true, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !522, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!522 = !{!523, !518}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "mpu_config", scope: !520, file: !525, line: 37, type: !526, isLocal: false, isDefinition: true)
!525 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !497, line: 41, size: 64, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !527, file: !497, line: 43, baseType: !152, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !527, file: !497, line: 45, baseType: !531, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !497, line: 27, size: 96, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !533, file: !497, line: 29, baseType: !152, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !497, line: 31, baseType: !118, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !533, file: !497, line: 37, baseType: !538, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !460, line: 146, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !460, line: 141, size: 32, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !539, file: !460, line: 143, baseType: !152, size: 32)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 192, elements: !359)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "phase", scope: !545, file: !549, line: 61, type: !548, isLocal: false, isDefinition: true)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !547, retainedTypes: !574, globals: !584, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!547 = !{!548, !557, !565, !30, !570}
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_phase", file: !549, line: 40, baseType: !32, size: 32, elements: !550)
!549 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!550 = !{!551, !552, !553, !554, !555, !556}
!551 = !DIEnumerator(name: "TEST_PHASE_SETUP", value: 0)
!552 = !DIEnumerator(name: "TEST_PHASE_BEFORE", value: 1)
!553 = !DIEnumerator(name: "TEST_PHASE_TEST", value: 2)
!554 = !DIEnumerator(name: "TEST_PHASE_AFTER", value: 3)
!555 = !DIEnumerator(name: "TEST_PHASE_TEARDOWN", value: 4)
!556 = !DIEnumerator(name: "TEST_PHASE_FRAMEWORK", value: 5)
!557 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_result", file: !549, line: 226, baseType: !32, size: 32, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564}
!559 = !DIEnumerator(name: "ZTEST_RESULT_PENDING", value: 0)
!560 = !DIEnumerator(name: "ZTEST_RESULT_PASS", value: 1)
!561 = !DIEnumerator(name: "ZTEST_RESULT_FAIL", value: 2)
!562 = !DIEnumerator(name: "ZTEST_RESULT_SKIP", value: 3)
!563 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_SKIP", value: 4)
!564 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_FAIL", value: 5)
!565 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_status", file: !549, line: 52, baseType: !32, size: 32, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIEnumerator(name: "ZTEST_STATUS_OK", value: 0)
!568 = !DIEnumerator(name: "ZTEST_STATUS_HAS_FAILURE", value: 1)
!569 = !DIEnumerator(name: "ZTEST_STATUS_CRITICAL_ERROR", value: 2)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_expected_result", file: !114, line: 36, baseType: !32, size: 32, elements: !571)
!571 = !{!572, !573}
!572 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_FAIL", value: 0)
!573 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_SKIP", value: 1)
!574 = !{!106, !107, !185, !575, !580, !152, !582}
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !576, line: 46, baseType: !577)
!576 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !106, !106, !106}
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !581, line: 46, baseType: !395)
!581 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !583)
!583 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!584 = !{!543, !585, !587, !589, !598, !600, !704, !707}
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "test_result", scope: !545, file: !549, line: 234, type: !557, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "current_test_failed_assumption", scope: !545, file: !549, line: 294, type: !145, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "ztest_thread_stack", scope: !545, file: !549, line: 430, type: !591, isLocal: false, isDefinition: true, align: 512)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 8704, elements: !596)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !593, line: 47, size: 8, elements: !594)
!593 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !592, file: !593, line: 48, baseType: !120, size: 8)
!596 = !{!597}
!597 = !DISubrange(count: 1088)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "test_status", scope: !545, file: !549, line: 63, type: !565, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "ztest_thread", scope: !545, file: !549, line: 17, type: !602, isLocal: true, isDefinition: true)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !328, line: 245, size: 1280, elements: !603)
!603 = !{!604, !662, !674, !675, !676, !677, !678, !684, !699}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !602, file: !328, line: 247, baseType: !605, size: 384)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !328, line: 57, size: 384, elements: !606)
!606 = !{!607, !631, !638, !639, !640, !649, !650, !651}
!607 = !DIDerivedType(tag: DW_TAG_member, scope: !605, file: !328, line: 60, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !605, file: !328, line: 60, size: 64, elements: !609)
!609 = !{!610, !625}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !608, file: !328, line: 61, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !338, line: 49, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !338, line: 37, size: 64, elements: !613)
!613 = !{!614, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, scope: !612, file: !338, line: 38, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !338, line: 38, size: 32, elements: !616)
!616 = !{!617, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !615, file: !338, line: 39, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !615, file: !338, line: 40, baseType: !618, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, scope: !612, file: !338, line: 42, baseType: !621, size: 32, offset: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !338, line: 42, size: 32, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !621, file: !338, line: 43, baseType: !618, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !621, file: !338, line: 44, baseType: !618, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !608, file: !328, line: 62, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !354, line: 49, size: 64, elements: !627)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !626, file: !354, line: 50, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 64, elements: !359)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !605, file: !328, line: 68, baseType: !632, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !364, line: 233, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 231, size: 64, elements: !635)
!635 = !{!636}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !634, file: !364, line: 232, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !338, line: 48, baseType: !612)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !605, file: !328, line: 71, baseType: !195, size: 8, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !605, file: !328, line: 74, baseType: !195, size: 8, offset: 104)
!640 = !DIDerivedType(tag: DW_TAG_member, scope: !605, file: !328, line: 90, baseType: !641, size: 16, offset: 112)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !605, file: !328, line: 90, size: 16, elements: !642)
!642 = !{!643, !648}
!643 = !DIDerivedType(tag: DW_TAG_member, scope: !641, file: !328, line: 91, baseType: !644, size: 16)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !641, file: !328, line: 91, size: 16, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !644, file: !328, line: 96, baseType: !378, size: 8)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !644, file: !328, line: 97, baseType: !195, size: 8, offset: 8)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !641, file: !328, line: 100, baseType: !197, size: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !605, file: !328, line: 107, baseType: !152, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !605, file: !328, line: 127, baseType: !106, size: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !605, file: !328, line: 131, baseType: !652, size: 192, offset: 192)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !364, line: 244, size: 192, elements: !653)
!653 = !{!654, !655, !661}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !652, file: !364, line: 245, baseType: !611, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !652, file: !364, line: 246, baseType: !656, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !364, line: 242, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !652, file: !364, line: 249, baseType: !395, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !602, file: !328, line: 250, baseType: !663, size: 288, offset: 384)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !398, line: 25, size: 288, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !672, !673}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !663, file: !398, line: 26, baseType: !152, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !663, file: !398, line: 27, baseType: !152, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !663, file: !398, line: 28, baseType: !152, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !663, file: !398, line: 29, baseType: !152, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !663, file: !398, line: 30, baseType: !152, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !663, file: !398, line: 31, baseType: !152, size: 32, offset: 160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !663, file: !398, line: 32, baseType: !152, size: 32, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !663, file: !398, line: 33, baseType: !152, size: 32, offset: 224)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !663, file: !398, line: 34, baseType: !152, size: 32, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !602, file: !328, line: 253, baseType: !106, size: 32, offset: 672)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !602, file: !328, line: 256, baseType: !633, size: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !328, line: 279, baseType: !412, size: 256, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !602, file: !328, line: 294, baseType: !107, size: 32, offset: 1024)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !602, file: !328, line: 300, baseType: !679, size: 96, offset: 1056)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !328, line: 149, size: 96, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !679, file: !328, line: 153, baseType: !22, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !679, file: !328, line: 162, baseType: !185, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !679, file: !328, line: 168, baseType: !185, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !602, file: !328, line: 325, baseType: !685, size: 32, offset: 1152)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !425, line: 5073, size: 192, elements: !687)
!687 = !{!688, !694, !695}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !686, file: !425, line: 5074, baseType: !689, size: 96)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !429, line: 56, size: 96, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !689, file: !429, line: 57, baseType: !432, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !689, file: !429, line: 58, baseType: !106, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !689, file: !429, line: 59, baseType: !185, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !686, file: !425, line: 5075, baseType: !633, size: 64, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !686, file: !425, line: 5076, baseType: !696, size: 32, offset: 160)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !439, line: 43, size: 32, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !696, file: !439, line: 52, baseType: !22, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !602, file: !328, line: 343, baseType: !700, size: 64, offset: 1184)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !398, line: 60, size: 64, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !700, file: !398, line: 63, baseType: !152, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !700, file: !398, line: 66, baseType: !152, size: 32, offset: 32)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "tc_start_time", scope: !545, file: !706, line: 95, type: !152, isLocal: true, isDefinition: true)
!706 = !DIFile(filename: "zephyr/subsys/testsuite/include/zephyr/tc_util.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "tc_spend_time", scope: !545, file: !706, line: 96, type: !152, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "ztest_api", scope: !712, file: !715, line: 70, type: !716, isLocal: false, isDefinition: true)
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !714, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!714 = !{!710}
!715 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_arch_api", file: !114, line: 499, size: 96, elements: !718)
!718 = !{!719, !720, !741}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "run_all", scope: !717, file: !114, line: 500, baseType: !16, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "should_suite_run", scope: !717, file: !114, line: 501, baseType: !721, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DISubroutineType(types: !723)
!723 = !{!145, !13, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !114, line: 179, baseType: !117, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !725, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !725, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !725, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !725, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !725, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !725, file: !114, line: 197, baseType: !734, size: 32, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !736, file: !114, line: 116, baseType: !152, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !736, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !736, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "should_test_run", scope: !717, file: !114, line: 502, baseType: !742, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DISubroutineType(types: !744)
!744 = !{!145, !118, !118}
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !747, file: !804, line: 603, type: !806, isLocal: true, isDefinition: true, align: 32)
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !749, globals: !801, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!749 = !{!106, !107, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !753, line: 336, size: 160, elements: !754)
!753 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!754 = !{!755, !775, !779, !783, !796}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !752, file: !753, line: 365, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = !DISubroutineType(types: !758)
!758 = !{!107, !759, !774}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !295, line: 378, size: 192, elements: !762)
!762 = !{!763, !764, !765, !766, !772, !773}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !295, line: 380, baseType: !118, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !761, file: !295, line: 382, baseType: !13, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !761, file: !295, line: 384, baseType: !13, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !761, file: !295, line: 386, baseType: !767, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !295, line: 351, size: 16, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !768, file: !295, line: 359, baseType: !195, size: 8)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !768, file: !295, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !761, file: !295, line: 388, baseType: !106, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !761, file: !295, line: 396, baseType: !308, size: 32, offset: 160)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !752, file: !753, line: 366, baseType: !776, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !759, !196}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !752, file: !753, line: 374, baseType: !780, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{!107, !759}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !752, file: !753, line: 377, baseType: !784, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DISubroutineType(types: !786)
!786 = !{!107, !759, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !753, line: 122, size: 64, elements: !790)
!790 = !{!791, !792, !793, !794, !795}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !789, file: !753, line: 123, baseType: !152, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !789, file: !753, line: 124, baseType: !195, size: 8, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !789, file: !753, line: 125, baseType: !195, size: 8, offset: 40)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !789, file: !753, line: 126, baseType: !195, size: 8, offset: 48)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !789, file: !753, line: 127, baseType: !195, size: 8, offset: 56)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !752, file: !753, line: 379, baseType: !797, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{!107, !759, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!801 = !{!745, !802}
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !747, file: !804, line: 38, type: !805, isLocal: true, isDefinition: true)
!804 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !286, line: 51, size: 64, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !807, file: !286, line: 60, baseType: !780, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !807, file: !286, line: 65, baseType: !759, size: 32, offset: 32)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "log_const_wdt_sam", scope: !813, file: !874, line: 28, type: !924, isLocal: false, isDefinition: true)
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !815, globals: !871, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!815 = !{!816, !152}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !819, line: 134, size: 128, elements: !820)
!819 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!820 = !{!821, !841, !846, !866}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !818, file: !819, line: 135, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !819, line: 113, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!107, !826, !195}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !295, line: 378, size: 192, elements: !829)
!829 = !{!830, !831, !832, !833, !839, !840}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !295, line: 380, baseType: !118, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !828, file: !295, line: 382, baseType: !13, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !828, file: !295, line: 384, baseType: !13, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !828, file: !295, line: 386, baseType: !834, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !295, line: 351, size: 16, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !835, file: !295, line: 359, baseType: !195, size: 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !835, file: !295, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !828, file: !295, line: 388, baseType: !106, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !828, file: !295, line: 396, baseType: !308, size: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !818, file: !819, line: 136, baseType: !842, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !819, line: 119, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!107, !826}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !818, file: !819, line: 137, baseType: !847, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !819, line: 125, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DISubroutineType(types: !850)
!850 = !{!107, !826, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !819, line: 88, size: 128, elements: !854)
!854 = !{!855, !860, !865}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !853, file: !819, line: 90, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !819, line: 72, size: 64, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !856, file: !819, line: 74, baseType: !152, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !856, file: !819, line: 76, baseType: !152, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !853, file: !819, line: 92, baseType: !861, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !819, line: 85, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !826, !107}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !853, file: !819, line: 104, baseType: !195, size: 8, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !818, file: !819, line: 138, baseType: !867, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !819, line: 132, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DISubroutineType(types: !870)
!870 = !{!107, !826, !107}
!871 = !{!811, !872, !876, !878, !885, !887, !901, !903, !911}
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !813, file: !874, line: 256, type: !875, isLocal: false, isDefinition: true, align: 16)
!874 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 80, elements: !262)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !813, file: !874, line: 256, type: !827, isLocal: false, isDefinition: true, align: 32)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !813, file: !874, line: 256, type: !880, isLocal: true, isDefinition: true, align: 32)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !286, line: 51, size: 64, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !881, file: !286, line: 60, baseType: !843, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !881, file: !286, line: 65, baseType: !826, size: 32, offset: 32)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !813, file: !874, line: 256, type: !835, isLocal: true, isDefinition: true, align: 8)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !813, file: !874, line: 234, type: !889, isLocal: true, isDefinition: true)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !874, line: 34, size: 32, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !890, file: !874, line: 35, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !895, line: 45, baseType: !896)
!895 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !895, line: 41, size: 96, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !896, file: !895, line: 42, baseType: !227, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !896, file: !895, line: 43, baseType: !227, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !896, file: !895, line: 44, baseType: !230, size: 32, offset: 64)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !813, file: !874, line: 227, type: !817, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !813, file: !874, line: 45, type: !905, isLocal: true, isDefinition: true)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !874, line: 38, size: 96, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !905, file: !874, line: 39, baseType: !861, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !905, file: !874, line: 40, baseType: !152, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !905, file: !874, line: 41, baseType: !145, size: 8, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !905, file: !874, line: 42, baseType: !145, size: 8, offset: 72)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !913, file: !874, line: 240, type: !917, isLocal: true, isDefinition: true, align: 32)
!913 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !874, file: !874, line: 238, type: !914, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !813, retainedNodes: !916)
!914 = !DISubroutineType(types: !915)
!915 = !{null}
!916 = !{}
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !918)
!918 = !{!919, !921, !922, !923}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !917, file: !10, line: 55, baseType: !920, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !917, file: !10, line: 57, baseType: !920, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !917, file: !10, line: 59, baseType: !106, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !917, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !925, file: !203, line: 17, baseType: !118, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !925, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !931, file: !936, line: 7, type: !937, isLocal: false, isDefinition: true, align: 16)
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !933, splitDebugInlining: false, nameTableKind: None)
!932 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!933 = !{!929, !934}
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !931, file: !936, line: 12, type: !937, isLocal: false, isDefinition: true, align: 16)
!936 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 48, elements: !258)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !940, file: !1028, line: 494, type: !1075, isLocal: true, isDefinition: true)
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !942, retainedTypes: !975, globals: !1025, splitDebugInlining: false, nameTableKind: None)
!941 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/testsuite/pytest")
!942 = !{!943, !950, !956, !963, !968}
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !753, line: 47, baseType: !32, size: 32, elements: !944)
!944 = !{!945, !946, !947, !948, !949}
!945 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!946 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!947 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!948 = !DIEnumerator(name: "UART_BREAK", value: 8)
!949 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!950 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !753, line: 84, baseType: !32, size: 32, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!953 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!954 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!955 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!956 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !753, line: 92, baseType: !32, size: 32, elements: !957)
!957 = !{!958, !959, !960, !961, !962}
!958 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!959 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!960 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!961 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!962 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !753, line: 107, baseType: !32, size: 32, elements: !964)
!964 = !{!965, !966, !967}
!965 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!966 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!967 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!968 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !753, line: 75, baseType: !32, size: 32, elements: !969)
!969 = !{!970, !971, !972, !973, !974}
!970 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!971 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!972 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!973 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!974 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!975 = !{!976, !106, !196, !152}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !753, line: 336, size: 160, elements: !979)
!979 = !{!980, !999, !1003, !1007, !1020}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !978, file: !753, line: 365, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{!107, !984, !774}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !295, line: 378, size: 192, elements: !987)
!987 = !{!988, !989, !990, !991, !997, !998}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !295, line: 380, baseType: !118, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !986, file: !295, line: 382, baseType: !13, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !986, file: !295, line: 384, baseType: !13, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !986, file: !295, line: 386, baseType: !992, size: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !295, line: 351, size: 16, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !993, file: !295, line: 359, baseType: !195, size: 8)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !993, file: !295, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !986, file: !295, line: 388, baseType: !106, size: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !986, file: !295, line: 396, baseType: !308, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !978, file: !753, line: 366, baseType: !1000, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !984, !196}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !978, file: !753, line: 374, baseType: !1004, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!107, !984}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !978, file: !753, line: 377, baseType: !1008, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!107, !984, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !753, line: 122, size: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1013, file: !753, line: 123, baseType: !152, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1013, file: !753, line: 124, baseType: !195, size: 8, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1013, file: !753, line: 125, baseType: !195, size: 8, offset: 40)
