; ModuleID = 'build/adafruit_itsybitsy_m4_express/sensor/max30101/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.1, i8*, i32 }
%union.anon.1 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.18 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.1 }
%struct.mpsc_pbuf_buffer_config.19 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.18*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/max30101/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/max30101")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/max30101")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !27, file: !107, line: 18, type: !109, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !37, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/max30101")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !{!22, !38, !24, !39, !41, !43, !47, !49, !50, !51, !53, !55, !56, !57, !60, !62, !74, !58, !75, !85, !44}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 214, baseType: !32)
!48 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !61)
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !64, line: 78, size: 32, elements: !65)
!64 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!65 = !{!66, !73}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !63, file: !64, line: 80, baseType: !67, size: 32)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !64, line: 45, size: 32, elements: !68)
!68 = !{!69, !70, !71, !72}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, file: !64, line: 47, baseType: !58, size: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !67, file: !64, line: 50, baseType: !58, size: 8, offset: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !67, file: !64, line: 53, baseType: !58, size: 8, offset: 16)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !67, file: !64, line: 56, baseType: !58, size: 8, offset: 24)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !63, file: !64, line: 82, baseType: !38, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !77)
!77 = !{!78, !96, !100}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !76, file: !31, line: 89, baseType: !79, size: 96)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !80)
!80 = !{!81, !93, !94}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !79, file: !31, line: 67, baseType: !82, size: 32)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !83)
!83 = !{!84, !86, !87, !88, !89, !90, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !82, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !82, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !82, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !82, file: !31, line: 54, baseType: !85, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !82, file: !31, line: 55, baseType: !85, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !82, file: !31, line: 56, baseType: !85, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !82, file: !31, line: 57, baseType: !85, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !79, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !79, file: !31, line: 76, baseType: !95, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !85)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !76, file: !31, line: 93, baseType: !97, size: 32, offset: 96)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !31, line: 94, baseType: !101, offset: 128)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: -1)
!104 = !{!25, !105}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !107, line: 18, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !111, line: 16, size: 64, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 17, baseType: !44, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !110, file: !111, line: 18, baseType: !58, size: 8, offset: 32)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "_char_out", scope: !117, file: !192, line: 54, type: !193, isLocal: false, isDefinition: true)
!117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !118, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !119, retainedTypes: !190, globals: !191, splitDebugInlining: false, nameTableKind: None)
!118 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/max30101")
!119 = !{!120}
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !121, line: 27, baseType: !32, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!123 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!124 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!125 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!126 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!127 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!128 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!129 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!130 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!131 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!132 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!133 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!134 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!135 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!136 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!137 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!138 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!139 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!140 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!141 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!142 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!143 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!144 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!145 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!146 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!147 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!148 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!149 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!189 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!190 = !{!38, !49}
!191 = !{!115}
!192 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!49, !49}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !198, file: !735, line: 149, type: !736, isLocal: true, isDefinition: true, align: 32)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !119, retainedTypes: !200, globals: !734, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/max30101")
!200 = !{!38, !49, !201, !335, !420}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !203, line: 352, baseType: !204)
!203 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 339, size: 448, elements: !205)
!205 = !{!206, !222, !234, !244, !255, !265, !273, !283, !294, !304, !314, !324}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !204, file: !203, line: 340, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !203, line: 57, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 44, size: 32, elements: !211)
!211 = !{!212, !221}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !210, file: !203, line: 55, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !203, line: 45, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !213, file: !203, line: 47, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !213, file: !203, line: 49, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !213, file: !203, line: 50, baseType: !85, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !213, file: !203, line: 51, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !213, file: !203, line: 52, baseType: !85, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !213, file: !203, line: 53, baseType: !85, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !210, file: !203, line: 56, baseType: !85, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !204, file: !203, line: 341, baseType: !223, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !203, line: 124, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 114, size: 32, elements: !226)
!226 = !{!227, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !225, file: !203, line: 122, baseType: !228, size: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !225, file: !203, line: 115, size: 32, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !228, file: !203, line: 117, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !228, file: !203, line: 118, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !228, file: !203, line: 120, baseType: !85, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !225, file: !203, line: 123, baseType: !85, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !204, file: !203, line: 342, baseType: !235, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !203, line: 161, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 155, size: 32, elements: !238)
!238 = !{!239, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !237, file: !203, line: 159, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !203, line: 156, size: 32, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !240, file: !203, line: 157, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !237, file: !203, line: 160, baseType: !85, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !204, file: !203, line: 343, baseType: !245, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !203, line: 179, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 173, size: 32, elements: !249)
!249 = !{!250, !254}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !248, file: !203, line: 177, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !203, line: 174, size: 32, elements: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !251, file: !203, line: 175, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !248, file: !203, line: 178, baseType: !85, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !204, file: !203, line: 344, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !203, line: 197, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 191, size: 32, elements: !259)
!259 = !{!260, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !258, file: !203, line: 195, baseType: !261, size: 32)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !258, file: !203, line: 192, size: 32, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !261, file: !203, line: 193, baseType: !85, size: 4, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !258, file: !203, line: 196, baseType: !85, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !204, file: !203, line: 345, baseType: !266, size: 96, offset: 160)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 96, elements: !271)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !268, line: 53, baseType: !269)
!268 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!271 = !{!272}
!272 = !DISubrange(count: 12)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !204, file: !203, line: 346, baseType: !274, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !203, line: 216, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 210, size: 32, elements: !277)
!277 = !{!278, !282}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !276, file: !203, line: 214, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !276, file: !203, line: 211, size: 32, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !279, file: !203, line: 212, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !276, file: !203, line: 215, baseType: !85, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !204, file: !203, line: 347, baseType: !284, size: 32, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !203, line: 236, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 228, size: 32, elements: !287)
!287 = !{!288, !293}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !286, file: !203, line: 234, baseType: !289, size: 32)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !203, line: 229, size: 32, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !289, file: !203, line: 231, baseType: !85, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !289, file: !203, line: 233, baseType: !85, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !286, file: !203, line: 235, baseType: !85, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !204, file: !203, line: 348, baseType: !295, size: 32, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !203, line: 266, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 260, size: 32, elements: !298)
!298 = !{!299, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !297, file: !203, line: 264, baseType: !300, size: 32)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !297, file: !203, line: 261, size: 32, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !300, file: !203, line: 262, baseType: !85, size: 2, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !297, file: !203, line: 265, baseType: !85, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !204, file: !203, line: 349, baseType: !305, size: 32, offset: 352)
!305 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !203, line: 291, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 285, size: 32, elements: !308)
!308 = !{!309, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !307, file: !203, line: 289, baseType: !310, size: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !203, line: 286, size: 32, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !310, file: !203, line: 287, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !307, file: !203, line: 290, baseType: !85, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !204, file: !203, line: 350, baseType: !315, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !203, line: 309, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 303, size: 32, elements: !318)
!318 = !{!319, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !317, file: !203, line: 307, baseType: !320, size: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !317, file: !203, line: 304, size: 32, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !320, file: !203, line: 305, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !317, file: !203, line: 308, baseType: !85, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !204, file: !203, line: 351, baseType: !325, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !203, line: 326, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 321, size: 32, elements: !329)
!329 = !{!330, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !328, file: !203, line: 324, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !203, line: 322, size: 32, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !331, file: !203, line: 323, baseType: !85, size: 32, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !328, file: !203, line: 325, baseType: !85, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !337, line: 267, baseType: !338)
!337 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 259, size: 2560, elements: !339)
!339 = !{!340, !350, !354, !381, !385, !403, !407}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !338, file: !337, line: 260, baseType: !341, size: 8)
!341 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !337, line: 50, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !337, line: 44, size: 8, elements: !344)
!344 = !{!345, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !343, file: !337, line: 48, baseType: !346, size: 8)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !337, line: 45, size: 8, elements: !347)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !346, file: !337, line: 46, baseType: !58, size: 1, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !343, file: !337, line: 49, baseType: !58, size: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !338, file: !337, line: 261, baseType: !351, size: 24, offset: 8)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 24, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 3)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !338, file: !337, line: 262, baseType: !355, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !337, line: 86, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !337, line: 62, size: 32, elements: !359)
!359 = !{!360, !376, !380}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !358, file: !337, line: 79, baseType: !361, size: 32)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !337, line: 63, size: 32, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !361, file: !337, line: 64, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !361, file: !337, line: 66, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !361, file: !337, line: 67, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !361, file: !337, line: 68, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !361, file: !337, line: 69, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !361, file: !337, line: 70, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !361, file: !337, line: 71, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !361, file: !337, line: 72, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !361, file: !337, line: 73, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !361, file: !337, line: 74, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !361, file: !337, line: 75, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !361, file: !337, line: 76, baseType: !85, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !361, file: !337, line: 77, baseType: !85, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !358, file: !337, line: 84, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !337, line: 80, size: 32, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !377, file: !337, line: 82, baseType: !85, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !358, file: !337, line: 85, baseType: !85, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !338, file: !337, line: 263, baseType: !382, size: 192, offset: 64)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 192, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 24)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !338, file: !337, line: 264, baseType: !386, size: 384, offset: 256)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 384, elements: !271)
!387 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !337, line: 163, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !337, line: 149, size: 32, elements: !390)
!390 = !{!391, !402}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !389, file: !337, line: 161, baseType: !392, size: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !389, file: !337, line: 150, size: 32, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !392, file: !337, line: 151, baseType: !85, size: 4, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !392, file: !337, line: 153, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !392, file: !337, line: 154, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !392, file: !337, line: 155, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !392, file: !337, line: 156, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !392, file: !337, line: 157, baseType: !85, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !392, file: !337, line: 158, baseType: !85, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !392, file: !337, line: 160, baseType: !85, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !389, file: !337, line: 162, baseType: !85, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !338, file: !337, line: 265, baseType: !404, size: 384, offset: 640)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 384, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 48)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !338, file: !337, line: 266, baseType: !408, size: 1536, offset: 1024)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 1536, elements: !405)
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !337, line: 218, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !337, line: 209, size: 32, elements: !412)
!412 = !{!413, !419}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !411, file: !337, line: 216, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !337, line: 210, size: 32, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !414, file: !337, line: 211, baseType: !85, size: 4, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !414, file: !337, line: 213, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !414, file: !337, line: 214, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !411, file: !337, line: 217, baseType: !85, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !422, line: 788, baseType: !423)
!422 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 771, size: 704, elements: !424)
!424 = !{!425, !440, !441, !472, !503, !536, !571, !595, !607, !608, !625, !626, !638, !650, !663, !664}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !423, file: !422, line: 772, baseType: !426, size: 8)
!426 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !422, line: 55, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 44, size: 8, elements: !429)
!429 = !{!430, !435, !439}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !428, file: !422, line: 49, baseType: !431, size: 8)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !428, file: !422, line: 45, size: 8, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !431, file: !422, line: 46, baseType: !58, size: 1, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !431, file: !422, line: 47, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !428, file: !422, line: 53, baseType: !436, size: 8)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !428, file: !422, line: 50, size: 8, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !436, file: !422, line: 51, baseType: !58, size: 2, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !428, file: !422, line: 54, baseType: !58, size: 8)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !423, file: !422, line: 773, baseType: !351, size: 24, offset: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !423, file: !422, line: 774, baseType: !442, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !422, line: 102, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 72, size: 32, elements: !445)
!445 = !{!446, !466, !471}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !444, file: !422, line: 95, baseType: !447, size: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !444, file: !422, line: 73, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !447, file: !422, line: 74, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !447, file: !422, line: 75, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !447, file: !422, line: 76, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !447, file: !422, line: 77, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !447, file: !422, line: 79, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !447, file: !422, line: 80, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !447, file: !422, line: 81, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !447, file: !422, line: 82, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !447, file: !422, line: 83, baseType: !85, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !447, file: !422, line: 85, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !447, file: !422, line: 86, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !447, file: !422, line: 87, baseType: !85, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !447, file: !422, line: 88, baseType: !85, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !447, file: !422, line: 90, baseType: !85, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !447, file: !422, line: 91, baseType: !85, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !447, file: !422, line: 92, baseType: !85, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !447, file: !422, line: 93, baseType: !85, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !444, file: !422, line: 100, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !444, file: !422, line: 96, size: 32, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !467, file: !422, line: 97, baseType: !85, size: 2, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !467, file: !422, line: 98, baseType: !85, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !444, file: !422, line: 101, baseType: !85, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !423, file: !422, line: 775, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !422, line: 182, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 152, size: 32, elements: !476)
!476 = !{!477, !497, !502}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !475, file: !422, line: 175, baseType: !478, size: 32)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !422, line: 153, size: 32, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !478, file: !422, line: 154, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !478, file: !422, line: 155, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !478, file: !422, line: 156, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !478, file: !422, line: 157, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !478, file: !422, line: 159, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !478, file: !422, line: 160, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !478, file: !422, line: 161, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !478, file: !422, line: 162, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !478, file: !422, line: 163, baseType: !85, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !478, file: !422, line: 165, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !478, file: !422, line: 166, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !478, file: !422, line: 167, baseType: !85, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !478, file: !422, line: 168, baseType: !85, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !478, file: !422, line: 170, baseType: !85, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !478, file: !422, line: 171, baseType: !85, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !478, file: !422, line: 172, baseType: !85, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !478, file: !422, line: 173, baseType: !85, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !475, file: !422, line: 180, baseType: !498, size: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !422, line: 176, size: 32, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !498, file: !422, line: 177, baseType: !85, size: 2, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !498, file: !422, line: 178, baseType: !85, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !475, file: !422, line: 181, baseType: !85, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !423, file: !422, line: 776, baseType: !504, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !422, line: 262, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 232, size: 32, elements: !507)
!507 = !{!508, !530, !535}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !506, file: !422, line: 255, baseType: !509, size: 32)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !506, file: !422, line: 233, size: 32, elements: !510)
!510 = !{!511, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !509, file: !422, line: 234, baseType: !512, size: 1, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !85)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !509, file: !422, line: 235, baseType: !512, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !509, file: !422, line: 236, baseType: !512, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !509, file: !422, line: 237, baseType: !512, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !509, file: !422, line: 239, baseType: !512, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !509, file: !422, line: 240, baseType: !512, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !509, file: !422, line: 241, baseType: !512, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !509, file: !422, line: 242, baseType: !512, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !509, file: !422, line: 243, baseType: !512, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !509, file: !422, line: 245, baseType: !512, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !509, file: !422, line: 246, baseType: !512, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !509, file: !422, line: 247, baseType: !512, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !509, file: !422, line: 248, baseType: !512, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !509, file: !422, line: 250, baseType: !512, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !509, file: !422, line: 251, baseType: !512, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !509, file: !422, line: 252, baseType: !512, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !509, file: !422, line: 253, baseType: !512, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !506, file: !422, line: 260, baseType: !531, size: 32)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !506, file: !422, line: 256, size: 32, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !531, file: !422, line: 257, baseType: !512, size: 2, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !531, file: !422, line: 258, baseType: !512, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !506, file: !422, line: 261, baseType: !85, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !423, file: !422, line: 777, baseType: !537, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !422, line: 345, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 312, size: 32, elements: !541)
!541 = !{!542, !564, !570}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !540, file: !422, line: 337, baseType: !543, size: 32)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !422, line: 313, size: 32, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !543, file: !422, line: 314, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !543, file: !422, line: 315, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !543, file: !422, line: 316, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !543, file: !422, line: 317, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !543, file: !422, line: 318, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !543, file: !422, line: 319, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !543, file: !422, line: 321, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !543, file: !422, line: 322, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !543, file: !422, line: 323, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !543, file: !422, line: 324, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !543, file: !422, line: 325, baseType: !85, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !543, file: !422, line: 327, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !543, file: !422, line: 328, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !543, file: !422, line: 329, baseType: !85, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !543, file: !422, line: 330, baseType: !85, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !543, file: !422, line: 332, baseType: !85, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !543, file: !422, line: 333, baseType: !85, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !543, file: !422, line: 334, baseType: !85, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !543, file: !422, line: 335, baseType: !85, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !540, file: !422, line: 343, baseType: !565, size: 32)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !422, line: 338, size: 32, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !565, file: !422, line: 339, baseType: !85, size: 2, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !565, file: !422, line: 340, baseType: !85, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !565, file: !422, line: 341, baseType: !85, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !540, file: !422, line: 344, baseType: !85, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !423, file: !422, line: 778, baseType: !572, size: 64, offset: 160)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 64, elements: !593)
!573 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !422, line: 422, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 402, size: 32, elements: !576)
!576 = !{!577, !592}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !575, file: !422, line: 420, baseType: !578, size: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !575, file: !422, line: 403, size: 32, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !578, file: !422, line: 405, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !578, file: !422, line: 406, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !578, file: !422, line: 408, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !578, file: !422, line: 409, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !578, file: !422, line: 410, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !578, file: !422, line: 411, baseType: !85, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !578, file: !422, line: 412, baseType: !85, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !578, file: !422, line: 413, baseType: !85, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !578, file: !422, line: 414, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !578, file: !422, line: 415, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !578, file: !422, line: 417, baseType: !85, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !578, file: !422, line: 418, baseType: !85, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !575, file: !422, line: 421, baseType: !85, size: 32)
!593 = !{!594}
!594 = !DISubrange(count: 2)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !423, file: !422, line: 779, baseType: !596, size: 8, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !422, line: 469, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 460, size: 8, elements: !599)
!599 = !{!600, !606}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !598, file: !422, line: 467, baseType: !601, size: 8)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !598, file: !422, line: 461, size: 8, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !601, file: !422, line: 463, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !601, file: !422, line: 465, baseType: !58, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !601, file: !422, line: 466, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !598, file: !422, line: 468, baseType: !58, size: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !423, file: !422, line: 780, baseType: !351, size: 24, offset: 232)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !423, file: !422, line: 781, baseType: !609, size: 8, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !422, line: 497, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 485, size: 8, elements: !612)
!612 = !{!613, !624}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !611, file: !422, line: 495, baseType: !614, size: 8)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !422, line: 486, size: 8, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !614, file: !422, line: 487, baseType: !58, size: 1, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !614, file: !422, line: 488, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !614, file: !422, line: 489, baseType: !58, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !614, file: !422, line: 490, baseType: !58, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !614, file: !422, line: 491, baseType: !58, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !614, file: !422, line: 492, baseType: !58, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !614, file: !422, line: 493, baseType: !58, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !614, file: !422, line: 494, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !611, file: !422, line: 496, baseType: !58, size: 8)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !423, file: !422, line: 782, baseType: !351, size: 24, offset: 264)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !423, file: !422, line: 783, baseType: !627, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !422, line: 531, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 523, size: 32, elements: !630)
!630 = !{!631, !637}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !629, file: !422, line: 529, baseType: !632, size: 32)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !629, file: !422, line: 524, size: 32, elements: !633)
!633 = !{!634, !635, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !632, file: !422, line: 525, baseType: !85, size: 8, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !632, file: !422, line: 527, baseType: !85, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !632, file: !422, line: 528, baseType: !85, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !629, file: !422, line: 530, baseType: !85, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !423, file: !422, line: 784, baseType: !639, size: 32, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !422, line: 558, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 550, size: 32, elements: !642)
!642 = !{!643, !649}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !641, file: !422, line: 556, baseType: !644, size: 32)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !641, file: !422, line: 551, size: 32, elements: !645)
!645 = !{!646, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !644, file: !422, line: 552, baseType: !85, size: 16, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !644, file: !422, line: 553, baseType: !85, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !644, file: !422, line: 555, baseType: !85, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !641, file: !422, line: 557, baseType: !85, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !423, file: !422, line: 785, baseType: !651, size: 8, offset: 352)
!651 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !422, line: 587, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 577, size: 8, elements: !654)
!654 = !{!655, !662}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !653, file: !422, line: 585, baseType: !656, size: 8)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !653, file: !422, line: 578, size: 8, elements: !657)
!657 = !{!658, !659, !660, !661}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !656, file: !422, line: 580, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !656, file: !422, line: 581, baseType: !58, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !656, file: !422, line: 582, baseType: !58, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !656, file: !422, line: 583, baseType: !58, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !653, file: !422, line: 586, baseType: !58, size: 8)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !423, file: !422, line: 786, baseType: !351, size: 24, offset: 360)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !423, file: !422, line: 787, baseType: !665, size: 320, offset: 384)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 320, elements: !593)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !422, line: 766, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 759, size: 160, elements: !668)
!668 = !{!669, !681, !682, !693, !710, !722}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !667, file: !422, line: 760, baseType: !670, size: 8)
!670 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !422, line: 614, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 605, size: 8, elements: !673)
!673 = !{!674, !680}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !672, file: !422, line: 612, baseType: !675, size: 8)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !672, file: !422, line: 606, size: 8, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !675, file: !422, line: 608, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !675, file: !422, line: 610, baseType: !58, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !675, file: !422, line: 611, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !672, file: !422, line: 613, baseType: !58, size: 8)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !667, file: !422, line: 761, baseType: !351, size: 24, offset: 8)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !667, file: !422, line: 762, baseType: !683, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !422, line: 638, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 630, size: 32, elements: !686)
!686 = !{!687, !692}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !685, file: !422, line: 636, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !685, file: !422, line: 631, size: 32, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !688, file: !422, line: 632, baseType: !85, size: 13, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !688, file: !422, line: 634, baseType: !85, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !685, file: !422, line: 637, baseType: !85, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !667, file: !422, line: 763, baseType: !694, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !422, line: 667, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 654, size: 32, elements: !697)
!697 = !{!698, !709}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !696, file: !422, line: 665, baseType: !699, size: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !696, file: !422, line: 655, size: 32, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !699, file: !422, line: 656, baseType: !85, size: 4, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !699, file: !422, line: 657, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !699, file: !422, line: 658, baseType: !85, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !699, file: !422, line: 659, baseType: !85, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !699, file: !422, line: 660, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !699, file: !422, line: 661, baseType: !85, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !699, file: !422, line: 662, baseType: !85, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !699, file: !422, line: 663, baseType: !85, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !696, file: !422, line: 666, baseType: !85, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !667, file: !422, line: 764, baseType: !711, size: 32, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !422, line: 724, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 716, size: 32, elements: !715)
!715 = !{!716, !721}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !422, line: 722, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !422, line: 717, size: 32, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !717, file: !422, line: 719, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !717, file: !422, line: 720, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !422, line: 723, baseType: !85, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !667, file: !422, line: 765, baseType: !723, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !422, line: 745, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 738, size: 32, elements: !727)
!727 = !{!728, !733}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !726, file: !422, line: 743, baseType: !729, size: 32)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !726, file: !422, line: 739, size: 32, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !729, file: !422, line: 740, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !729, file: !422, line: 741, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !726, file: !422, line: 744, baseType: !85, size: 32)
!734 = !{!196}
!735 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !738, line: 51, size: 64, elements: !739)
!738 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !{!740, !766}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !737, file: !738, line: 60, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DISubroutineType(types: !743)
!743 = !{!49, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !747, line: 378, size: 192, elements: !748)
!747 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!748 = !{!749, !750, !751, !752, !759, !760}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !746, file: !747, line: 380, baseType: !44, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !746, file: !747, line: 382, baseType: !13, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !746, file: !747, line: 384, baseType: !13, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !746, file: !747, line: 386, baseType: !753, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !747, line: 351, size: 16, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !754, file: !747, line: 359, baseType: !58, size: 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !754, file: !747, line: 364, baseType: !758, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!758 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !746, file: !747, line: 388, baseType: !38, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !746, file: !747, line: 396, baseType: !761, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !747, line: 43, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !765)
!765 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !737, file: !738, line: 65, baseType: !744, size: 32, offset: 32)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "log_const_log", scope: !769, file: !850, line: 25, type: !1088, isLocal: false, isDefinition: true)
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !771, retainedTypes: !777, globals: !847, splitDebugInlining: false, nameTableKind: None)
!770 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/sensor/max30101")
!771 = !{!772, !30, !120}
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !773, line: 33, baseType: !32, size: 32, elements: !774)
!773 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = !{!775, !776}
!775 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!776 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!777 = !{!47, !49, !38, !778, !74, !789, !58, !790, !85, !811, !22, !24, !838, !841, !843, !845}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !64, line: 78, size: 32, elements: !780)
!780 = !{!781, !788}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !779, file: !64, line: 80, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !64, line: 45, size: 32, elements: !783)
!783 = !{!784, !785, !786, !787}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !782, file: !64, line: 47, baseType: !58, size: 8)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !782, file: !64, line: 50, baseType: !58, size: 8, offset: 8)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !782, file: !64, line: 53, baseType: !58, size: 8, offset: 16)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !782, file: !64, line: 56, baseType: !58, size: 8, offset: 24)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !779, file: !64, line: 82, baseType: !38, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !792)
!792 = !{!793, !809, !810}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !791, file: !31, line: 89, baseType: !794, size: 96)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !795)
!795 = !{!796, !807, !808}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !794, file: !31, line: 67, baseType: !797, size: 32)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !797, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !797, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !797, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !797, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !797, file: !31, line: 54, baseType: !85, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !797, file: !31, line: 55, baseType: !85, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !797, file: !31, line: 56, baseType: !85, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !797, file: !31, line: 57, baseType: !85, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !794, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !794, file: !31, line: 76, baseType: !95, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !791, file: !31, line: 93, baseType: !97, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !791, file: !31, line: 94, baseType: !101, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !813)
!813 = !{!814, !831, !837}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !812, file: !31, line: 112, baseType: !815, size: 32)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !816, line: 49, size: 32, elements: !817)
!816 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!817 = !{!818, !824, !830}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !815, file: !816, line: 50, baseType: !819, size: 32)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !816, line: 37, size: 32, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !819, file: !816, line: 38, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !819, file: !816, line: 38, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !819, file: !816, line: 39, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !815, file: !816, line: 51, baseType: !825, size: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !816, line: 43, size: 32, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !825, file: !816, line: 44, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !825, file: !816, line: 44, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !825, file: !816, line: 45, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !815, file: !816, line: 52, baseType: !85, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !812, file: !31, line: 113, baseType: !832, size: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !832, file: !31, line: 108, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !832, file: !31, line: 108, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !832, file: !31, line: 108, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !812, file: !31, line: 114, baseType: !791, size: 128)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !839, line: 46, baseType: !840)
!839 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !54)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !842)
!842 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!847 = !{!767, !848, !877, !890, !892, !894, !898, !900, !902, !904, !906, !908, !914, !947, !950, !959, !1049, !1076, !1083, !1085, !1093, !1103, !1108, !1123, !1127}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !769, file: !850, line: 93, type: !851, isLocal: false, isDefinition: true, align: 32)
!850 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !852, line: 2909, size: 128, elements: !853)
!852 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !{!854, !875, !876}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !851, file: !852, line: 2910, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !856, line: 233, baseType: !857)
!856 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 231, size: 64, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !857, file: !856, line: 232, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !861, line: 48, baseType: !862)
!861 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !861, line: 37, size: 64, elements: !863)
!863 = !{!864, !870}
!864 = !DIDerivedType(tag: DW_TAG_member, scope: !862, file: !861, line: 38, baseType: !865, size: 32)
!865 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !862, file: !861, line: 38, size: 32, elements: !866)
!866 = !{!867, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !865, file: !861, line: 39, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !865, file: !861, line: 40, baseType: !868, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, scope: !862, file: !861, line: 42, baseType: !871, size: 32, offset: 32)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !862, file: !861, line: 42, size: 32, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !871, file: !861, line: 43, baseType: !868, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !871, file: !861, line: 44, baseType: !868, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !851, file: !852, line: 2911, baseType: !32, size: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !851, file: !852, line: 2912, baseType: !32, size: 32, offset: 96)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !769, file: !850, line: 910, type: !879, isLocal: true, isDefinition: true, align: 32)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !738, line: 51, size: 64, elements: !881)
!881 = !{!882, !889}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !880, file: !738, line: 60, baseType: !883, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!884 = !DISubroutineType(types: !885)
!885 = !{!49, !886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !738, line: 48, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !880, file: !738, line: 65, baseType: !886, size: 32, offset: 32)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "panic_mode", scope: !769, file: !850, line: 96, type: !758, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "backend_attached", scope: !769, file: !850, line: 97, type: !758, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !769, file: !850, line: 98, type: !896, isLocal: true, isDefinition: true)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !897, line: 22, baseType: !52)
!897 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !769, file: !850, line: 99, type: !896, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !769, file: !850, line: 105, type: !85, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !769, file: !850, line: 107, type: !95, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !769, file: !850, line: 108, type: !896, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !769, file: !850, line: 109, type: !841, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !769, file: !850, line: 111, type: !910, isLocal: true, isDefinition: true, align: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !911, line: 29, size: 32, elements: !912)
!911 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !910, file: !911, line: 30, baseType: !811, size: 32)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
