; ModuleID = './Build/fatfs_read_write_file.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.hal_eint_gpio_map_t = type { i32, i32, i32, i32 }
%struct.gpio_backup_restore_t = type { i32, i32 }
%struct.flash_info_t = type { i8*, i8, i32, i32, i32, i8, i8, i8 }
%struct.log_control_block_t = type { i8*, i32, i32, void (i8*, i8*, i32, i32, i8*, ...)*, void (i8*, i8*, i32, i32, i8*, i32, i8*, ...)* }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.hal_spi_master_config_t = type { i32, i32, i32, i32, i32 }
%struct.uart_context_t = type { i8, %struct.hal_eint_gpio_map_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.FATFS = type { i8, i8, i8, i8, i8, i16, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [512 x i8] }
%struct.FIL = type { %struct._FDID, i8, i8, i32, i32, i32, i32, i8*, i32*, [512 x i8] }
%struct._FDID = type { %struct.FATFS*, i16, i8, i8, i32, i32 }

!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "sf_Mutex", scope: !2, file: !3, line: 78, type: !7, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !83, file: !84, line: 71, type: !158, isLocal: false, isDefinition: true)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !85, retainedTypes: !136, globals: !141, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!85 = !{!86, !91}
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 121, baseType: !30, size: 32, elements: !88)
!87 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!90 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !92, line: 47, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "../../../../..//driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!94 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!95 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!96 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!97 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!98 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!99 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!100 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!101 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!102 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!103 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!104 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!105 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!106 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!107 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!108 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!109 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!110 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!111 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!112 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!113 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!114 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!115 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!116 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!117 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!118 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!119 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!120 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!121 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!122 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!123 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!124 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!125 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!126 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!127 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!128 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!129 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!130 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!131 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!132 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!133 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!134 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!135 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!136 = !{!137, !140}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !87, line: 116, baseType: !30)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !92, line: 95, baseType: !91)
!141 = !{!81, !142}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !83, file: !84, line: 67, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !145, line: 111, baseType: !146)
!145 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 109, size: 96, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !146, file: !145, line: 110, baseType: !149, size: 96)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !145, line: 106, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 102, size: 96, elements: !151)
!151 = !{!152, !156, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !150, file: !145, line: 103, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{null}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !150, file: !145, line: 104, baseType: !153, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !150, file: !145, line: 105, baseType: !153, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !87, line: 62, baseType: !30)
!160 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!161 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "LISR", scope: !164, file: !165, line: 565, type: !381, isLocal: true, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !280, globals: !357, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!166 = !{!167, !91, !172, !203}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 1209, baseType: !30, size: 32, elements: !169)
!168 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!169 = !{!170, !171}
!170 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!171 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!172 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !173, line: 55, baseType: !30, size: 32, elements: !174)
!173 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!175 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!176 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!177 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!178 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!179 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!180 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!181 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!182 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!183 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!184 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!185 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!186 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!187 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!188 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!189 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!190 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!191 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!192 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!193 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!194 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!195 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!196 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!197 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!198 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!199 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!200 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!201 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!202 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 150, baseType: !30, size: 32, elements: !205)
!204 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!206 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!207 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!208 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!209 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!210 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!211 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!212 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!213 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!214 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!215 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!216 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!217 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!218 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!219 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!220 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!221 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!222 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!223 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!224 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!225 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!226 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!227 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!228 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!229 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!230 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!231 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!232 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!233 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!234 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!235 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!236 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!237 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!238 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!239 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!240 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!241 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!242 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!243 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!244 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!245 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!246 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!247 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!248 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!249 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!250 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!251 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!252 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!253 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!254 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!255 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!256 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!257 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!258 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!259 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!260 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!261 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!262 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!263 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!264 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!265 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!266 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!267 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!268 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!269 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!270 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!271 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!272 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!273 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!274 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!275 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!276 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!277 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!278 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!279 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!280 = !{!137, !139, !281, !140, !282, !61, !283, !316, !355}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !173, line: 87, baseType: !172)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_PAD_NAME_T", file: !204, line: 225, baseType: !203)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !285, line: 378, baseType: !286)
!285 = !DIFile(filename: "../../../../..//driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 363, size: 28704, elements: !287)
!287 = !{!288, !292, !296, !297, !298, !299, !300, !301, !302, !303, !307, !311, !315}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !286, file: !285, line: 365, baseType: !289, size: 256)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 8)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !286, file: !285, line: 366, baseType: !293, size: 768, offset: 256)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 24)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !286, file: !285, line: 367, baseType: !289, size: 256, offset: 1024)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !286, file: !285, line: 368, baseType: !293, size: 768, offset: 1280)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !286, file: !285, line: 369, baseType: !289, size: 256, offset: 2048)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !286, file: !285, line: 370, baseType: !293, size: 768, offset: 2304)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !286, file: !285, line: 371, baseType: !289, size: 256, offset: 3072)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !286, file: !285, line: 372, baseType: !293, size: 768, offset: 3328)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !286, file: !285, line: 373, baseType: !289, size: 256, offset: 4096)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !286, file: !285, line: 374, baseType: !304, size: 1792, offset: 4352)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1792, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 56)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !286, file: !285, line: 375, baseType: !308, size: 1920, offset: 6144)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1920, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 240)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !286, file: !285, line: 376, baseType: !312, size: 20608, offset: 8064)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 20608, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 644)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !286, file: !285, line: 377, baseType: !60, size: 32, offset: 28672)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !285, line: 418, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 395, size: 1120, elements: !319)
!319 = !{!320, !322, !323, !324, !325, !326, !327, !331, !332, !333, !334, !335, !336, !337, !338, !342, !343, !344, !348, !352, !354}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !318, file: !285, line: 397, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !318, file: !285, line: 398, baseType: !60, size: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !318, file: !285, line: 399, baseType: !60, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !318, file: !285, line: 400, baseType: !60, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !318, file: !285, line: 401, baseType: !60, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !318, file: !285, line: 402, baseType: !60, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !318, file: !285, line: 403, baseType: !328, size: 96, offset: 192)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 12)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !318, file: !285, line: 404, baseType: !60, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !318, file: !285, line: 405, baseType: !60, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !318, file: !285, line: 406, baseType: !60, size: 32, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !318, file: !285, line: 407, baseType: !60, size: 32, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !318, file: !285, line: 408, baseType: !60, size: 32, offset: 416)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !318, file: !285, line: 409, baseType: !60, size: 32, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !318, file: !285, line: 410, baseType: !60, size: 32, offset: 480)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !318, file: !285, line: 411, baseType: !339, size: 64, offset: 512)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 64, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 2)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !318, file: !285, line: 412, baseType: !321, size: 32, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !318, file: !285, line: 413, baseType: !321, size: 32, offset: 608)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !318, file: !285, line: 414, baseType: !345, size: 128, offset: 640)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 128, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 4)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !318, file: !285, line: 415, baseType: !349, size: 160, offset: 768)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 160, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 5)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !318, file: !285, line: 416, baseType: !353, size: 160, offset: 928)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !350)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !318, file: !285, line: 417, baseType: !60, size: 32, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 44, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 77, baseType: !7)
!357 = !{!162, !358, !366}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "eint_dbc_register", scope: !164, file: !165, line: 52, type: !360, isLocal: true, isDefinition: true)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "EINT_DEBOUCE_REGISTER_T", file: !168, line: 1231, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 1229, size: 128, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_IRQ_SENS", scope: !362, file: !168, line: 1230, baseType: !365, size: 128)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !346)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "eint_con_register", scope: !164, file: !165, line: 51, type: !368, isLocal: true, isDefinition: true)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "EINT_CON_REGISTER_T", file: !168, line: 1224, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 1220, size: 10272, elements: !371)
!371 = !{!372, !376, !380}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_EINT_CON", scope: !370, file: !168, line: 1221, baseType: !373, size: 2112)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2112, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 66)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !370, file: !168, line: 1222, baseType: !377, size: 8032, offset: 2112)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8032, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 251)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_IRQ_SENS", scope: !370, file: !168, line: 1223, baseType: !365, size: 128, offset: 10144)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPI_LISR_Struct", file: !168, line: 1250, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 1248, size: 32, elements: !383)
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "gpiLisr_func", scope: !382, file: !168, line: 1249, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPI_LISR_func", file: !168, line: 1216, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 1214, size: 32, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IDX_EINT_WIC_LISR", scope: !386, file: !168, line: 1215, baseType: !389, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !281}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "halspim_isr", scope: !394, file: !395, line: 51, type: !405, isLocal: false, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !396, retainedTypes: !397, globals: !404, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/hal_spim.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!396 = !{!91, !86}
!397 = !{!398, !402, !137, !51, !403, !59}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG", file: !87, line: 68, baseType: !401)
!401 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !87, line: 59, baseType: !58)
!404 = !{!392}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "HALSPIM_ISR", file: !406, line: 45, baseType: !153)
!406 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/hal_spim.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "gpio_bakup_table", scope: !409, file: !410, line: 62, type: !445, isLocal: true, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !411, retainedTypes: !443, globals: !444, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/low_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!411 = !{!172, !412, !417, !421, !425, !429, !433, !167}
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 57, baseType: !30, size: 32, elements: !414)
!413 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!414 = !{!415, !416}
!415 = !DIEnumerator(name: "eDirection_IN", value: 0)
!416 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 69, baseType: !30, size: 32, elements: !418)
!418 = !{!419, !420}
!419 = !DIEnumerator(name: "eEdge_Trigger", value: 0)
!420 = !DIEnumerator(name: "eLevel_Trigger", value: 1)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 74, baseType: !30, size: 32, elements: !422)
!422 = !{!423, !424}
!423 = !DIEnumerator(name: "eDebounce_Disable", value: 0)
!424 = !DIEnumerator(name: "eDebounce_Enable", value: 1)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 79, baseType: !30, size: 32, elements: !426)
!426 = !{!427, !428}
!427 = !DIEnumerator(name: "eDebounce_Negative_Pol", value: 0)
!428 = !DIEnumerator(name: "eDebounce_Positive_Pol", value: 1)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 84, baseType: !30, size: 32, elements: !430)
!430 = !{!431, !432}
!431 = !DIEnumerator(name: "eDebounce_Dual_No", value: 0)
!432 = !DIEnumerator(name: "eDebounce_Dual_Yes", value: 1)
!433 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 89, baseType: !30, size: 32, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442}
!435 = !DIEnumerator(name: "eDebounce_Prescaler_8K", value: 0)
!436 = !DIEnumerator(name: "eDebounce_Prescaler_4K", value: 1)
!437 = !DIEnumerator(name: "eDebounce_Prescaler_2K", value: 2)
!438 = !DIEnumerator(name: "eDebounce_Prescaler_1K", value: 3)
!439 = !DIEnumerator(name: "eDebounce_Prescaler_Dot5K", value: 4)
!440 = !DIEnumerator(name: "eDebounce_Prescaler_Dot25K", value: 5)
!441 = !DIEnumerator(name: "eDebounce_Prescaler_Dot125K", value: 6)
!442 = !DIEnumerator(name: "eDebounce_Prescaler_Dot0625K", value: 7)
!443 = !{!137}
!444 = !{!407}
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 1408, elements: !451)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_backup_restore_t", file: !410, line: 60, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 57, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reg_data", scope: !447, file: !410, line: 58, baseType: !61, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reg_addr", scope: !447, file: !410, line: 59, baseType: !61, size: 32, offset: 32)
!451 = !{!452}
!452 = !DISubrange(count: 22)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "g_sfc_security_enable", scope: !455, file: !456, line: 58, type: !30, isLocal: false, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !457, retainedTypes: !464, globals: !471, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!457 = !{!458}
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 45, baseType: !30, size: 32, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIEnumerator(name: "SF_UNDEF", value: 0)
!461 = !DIEnumerator(name: "SPI", value: 1)
!462 = !DIEnumerator(name: "SPIQ", value: 2)
!463 = !DIEnumerator(name: "QPI", value: 3)
!464 = !{!137, !465, !30, !466, !468, !469}
!465 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!471 = !{!453}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "gSFC_max_data_size", scope: !474, file: !475, line: 67, type: !30, isLocal: false, isDefinition: true)
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !476, retainedTypes: !483, globals: !501, splitDebugInlining: false, nameTableKind: None)
!475 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/spi_flash.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!476 = !{!35, !5, !458, !477}
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 66, baseType: !7, size: 32, elements: !478)
!478 = !{!479, !480, !481, !482}
!479 = !DIEnumerator(name: "FLASH_NOT_READY", value: -1)
!480 = !DIEnumerator(name: "FLASH_READY", value: 0)
!481 = !DIEnumerator(name: "FLASH_PROGRAMMING", value: 1)
!482 = !DIEnumerator(name: "FLASH_ERASING", value: 2)
!483 = !{!484, !401, !486, !30, !51, !500, !61, !139}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chip_info", file: !6, line: 137, size: 192, elements: !489)
!489 = !{!490, !493, !494, !495, !496, !497, !498, !499}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !488, file: !6, line: 138, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !488, file: !6, line: 139, baseType: !58, size: 8, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !488, file: !6, line: 140, baseType: !401, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !488, file: !6, line: 141, baseType: !401, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !488, file: !6, line: 142, baseType: !30, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !488, file: !6, line: 144, baseType: !58, size: 8, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !488, file: !6, line: 145, baseType: !58, size: 8, offset: 168)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !488, file: !6, line: 146, baseType: !58, size: 8, offset: 176)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!501 = !{!472, !502, !505, !508, !513, !516, !518, !521, !523, !525, !527, !529, !531, !533, !535, !537, !539, !541, !543, !548, !550, !552, !554, !557}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_winbond", scope: !474, file: !475, line: 70, type: !504, isLocal: false, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 96, elements: !329)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_winbond", scope: !474, file: !475, line: 73, type: !507, isLocal: false, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 32, elements: !346)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_winbond", scope: !474, file: !475, line: 76, type: !510, isLocal: false, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 72, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 9)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "cmdlist_suspend_winbond", scope: !474, file: !475, line: 79, type: !515, isLocal: false, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !346)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "cmdlist_resume_winbond", scope: !474, file: !475, line: 82, type: !515, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_mxic", scope: !474, file: !475, line: 87, type: !520, isLocal: false, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 64, elements: !290)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_mxic", scope: !474, file: !475, line: 91, type: !520, isLocal: false, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_mxic", scope: !474, file: !475, line: 95, type: !520, isLocal: false, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd", scope: !474, file: !475, line: 100, type: !510, isLocal: false, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd", scope: !474, file: !475, line: 104, type: !510, isLocal: false, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd", scope: !474, file: !475, line: 108, type: !510, isLocal: false, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd25q32c", scope: !474, file: !475, line: 112, type: !520, isLocal: false, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd25q32c", scope: !474, file: !475, line: 115, type: !520, isLocal: false, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd25q32c", scope: !474, file: !475, line: 119, type: !520, isLocal: false, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_micron", scope: !474, file: !475, line: 123, type: !520, isLocal: false, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_micron", scope: !474, file: !475, line: 126, type: !520, isLocal: false, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_micron", scope: !474, file: !475, line: 130, type: !520, isLocal: false, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_spimode", scope: !474, file: !475, line: 135, type: !545, isLocal: false, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 56, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 7)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_qpimode", scope: !474, file: !475, line: 138, type: !545, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "spi_chip_info", scope: !474, file: !475, line: 142, type: !486, isLocal: false, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "gd_write_sr2_1", scope: !474, file: !475, line: 161, type: !7, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "support_flash_id", scope: !474, file: !475, line: 162, type: !556, isLocal: false, isDefinition: true)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_TYPT", file: !6, line: 81, baseType: !35)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "chips_data", scope: !474, file: !475, line: 144, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 2496, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 13)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "spi_ok_cnt", scope: !564, file: !565, line: 51, type: !610, isLocal: true, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !566, retainedTypes: !576, globals: !577, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/spim.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!566 = !{!567, !572}
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 217, baseType: !30, size: 32, elements: !569)
!568 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!569 = !{!570, !571}
!570 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!571 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!572 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 210, baseType: !30, size: 32, elements: !573)
!573 = !{!574, !575}
!574 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!575 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!576 = !{!355, !137}
!577 = !{!578, !592, !594, !562, !608}
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "remainder", scope: !580, file: !565, line: 109, type: !61, isLocal: true, isDefinition: true)
!580 = distinct !DISubprogram(name: "spim_write", scope: !565, file: !565, line: 103, type: !581, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !564, retainedNodes: !584)
!581 = !DISubroutineType(types: !582)
!582 = !{!355, !500, !583}
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!584 = !{!585, !586, !587, !589, !590, !591}
!585 = !DILocalVariable(name: "buf", arg: 1, scope: !580, file: !565, line: 103, type: !500)
!586 = !DILocalVariable(name: "buf_cnt", arg: 2, scope: !580, file: !565, line: 103, type: !583)
!587 = !DILocalVariable(name: "ret", scope: !580, file: !565, line: 105, type: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !87, line: 56, baseType: !7)
!589 = !DILocalVariable(name: "op_addr", scope: !580, file: !565, line: 106, type: !61)
!590 = !DILocalVariable(name: "n_cmd_byte", scope: !580, file: !565, line: 107, type: !61)
!591 = !DILocalVariable(name: "i", scope: !580, file: !565, line: 108, type: !61)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "regVal", scope: !580, file: !565, line: 109, type: !61, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "remainder", scope: !596, file: !565, line: 152, type: !61, isLocal: true, isDefinition: true)
!596 = distinct !DISubprogram(name: "spim_read", scope: !565, file: !565, line: 146, type: !597, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !564, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!355, !583, !583, !500, !583}
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607}
!600 = !DILocalVariable(name: "cmd", arg: 1, scope: !596, file: !565, line: 146, type: !583)
!601 = !DILocalVariable(name: "n_cmd_byte", arg: 2, scope: !596, file: !565, line: 146, type: !583)
!602 = !DILocalVariable(name: "buf", arg: 3, scope: !596, file: !565, line: 146, type: !500)
!603 = !DILocalVariable(name: "buf_cnt", arg: 4, scope: !596, file: !565, line: 146, type: !583)
!604 = !DILocalVariable(name: "ret", scope: !596, file: !565, line: 148, type: !588)
!605 = !DILocalVariable(name: "fake_op", scope: !596, file: !565, line: 149, type: !61)
!606 = !DILocalVariable(name: "fake_cmd_byte", scope: !596, file: !565, line: 150, type: !61)
!607 = !DILocalVariable(name: "i", scope: !596, file: !565, line: 151, type: !61)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "quotient", scope: !564, file: !565, line: 52, type: !61, isLocal: true, isDefinition: true)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !355)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !613, file: !614, line: 43, type: !61, isLocal: true, isDefinition: true)
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !615, globals: !619, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!615 = !{!466, !159, !59, !402, !616, !618}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !87, line: 133, baseType: !30)
!619 = !{!611, !620}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !613, file: !614, line: 44, type: !61, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !624, file: !625, line: 54, type: !61, isLocal: false, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !626, retainedTypes: !650, globals: !657, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!626 = !{!91, !627, !633}
!627 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !628, line: 71, baseType: !30, size: 32, elements: !629)
!628 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!629 = !{!630, !631, !632}
!630 = !DIEnumerator(name: "UART_PORT0", value: 0)
!631 = !DIEnumerator(name: "UART_PORT1", value: 1)
!632 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !634, line: 129, baseType: !30, size: 32, elements: !635)
!634 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!636 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!637 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!638 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!639 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!640 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!641 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!642 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!643 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!644 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!645 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!646 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!647 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!648 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!649 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!650 = !{!466, !61, !651, !653, !403, !655, !159}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !87, line: 113, baseType: !654)
!654 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !403)
!657 = !{!658, !664, !622}
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !624, file: !625, line: 57, type: !660, isLocal: false, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 64, elements: !340)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !624, file: !625, line: 58, type: !666, isLocal: false, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 64, elements: !340)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !92, line: 97, baseType: !140)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "log_control_block_hal", scope: !671, file: !672, line: 127, type: !686, isLocal: false, isDefinition: true)
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, globals: !685, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!673 = !{!674, !679}
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !675, line: 65, baseType: !30, size: 32, elements: !676)
!675 = !DIFile(filename: "../../../../..//kernel/service/inc/syslog.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!676 = !{!677, !678}
!677 = !DIEnumerator(name: "DEBUG_LOG_ON", value: 0)
!678 = !DIEnumerator(name: "DEBUG_LOG_OFF", value: 1)
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !675, line: 74, baseType: !30, size: 32, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIEnumerator(name: "PRINT_LEVEL_DEBUG", value: 0)
!682 = !DIEnumerator(name: "PRINT_LEVEL_INFO", value: 1)
!683 = !DIEnumerator(name: "PRINT_LEVEL_WARNING", value: 2)
!684 = !DIEnumerator(name: "PRINT_LEVEL_ERROR", value: 3)
!685 = !{!669}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_control_block_t", file: !675, line: 95, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 89, size: 160, elements: !688)
!688 = !{!689, !690, !692, !694, !699}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "module_name", scope: !687, file: !675, line: 90, baseType: !662, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "log_switch", scope: !687, file: !675, line: 91, baseType: !691, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_switch_t", file: !675, line: 68, baseType: !674)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "print_level", scope: !687, file: !675, line: 92, baseType: !693, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "print_level_t", file: !675, line: 79, baseType: !679)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "print_handle", scope: !687, file: !675, line: 93, baseType: !695, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_print_t", file: !675, line: 82, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !51, !662, !7, !693, !662, null}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dump_handle", scope: !687, file: !675, line: 94, baseType: !700, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_dump_buffer_t", file: !675, line: 83, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !51, !662, !7, !693, !704, !7, !662, null}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !708, file: !709, line: 51, type: !788, isLocal: false, isDefinition: true)
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !710, retainedTypes: !757, globals: !787, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!710 = !{!711, !722, !741, !748}
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !712, line: 163, baseType: !7, size: 32, elements: !713)
!712 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721}
!714 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!715 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!716 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!717 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!718 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!719 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!720 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!721 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !712, line: 186, baseType: !30, size: 32, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!724 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!725 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!726 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!727 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!728 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!729 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!730 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!731 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!732 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!733 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!734 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!735 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!736 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!737 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!738 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!739 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!740 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !712, line: 176, baseType: !30, size: 32, elements: !742)
!742 = !{!743, !744, !745, !746, !747}
!743 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!744 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!745 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!746 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!747 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !749, line: 99, baseType: !30, size: 32, elements: !750)
!749 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!750 = !{!751, !752, !753, !754, !755, !756}
!751 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!752 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!753 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!754 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!755 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!756 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!757 = !{!758, !51}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !760, line: 72, baseType: !761)
!760 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !760, line: 56, size: 525312, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !777, !778, !782, !786}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !761, file: !760, line: 57, baseType: !60, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !761, file: !760, line: 58, baseType: !60, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !761, file: !760, line: 59, baseType: !60, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !761, file: !760, line: 60, baseType: !60, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !761, file: !760, line: 61, baseType: !60, size: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !761, file: !760, line: 62, baseType: !60, size: 32, offset: 160)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !761, file: !760, line: 63, baseType: !60, size: 32, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !761, file: !760, line: 64, baseType: !60, size: 32, offset: 224)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !761, file: !760, line: 65, baseType: !60, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !761, file: !760, line: 66, baseType: !60, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !761, file: !760, line: 67, baseType: !774, size: 32, offset: 320)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 1)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !761, file: !760, line: 68, baseType: !60, size: 32, offset: 352)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !761, file: !760, line: 69, baseType: !779, size: 523904, offset: 384)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 16372)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !761, file: !760, line: 70, baseType: !783, size: 512, offset: 524288)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 16)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !761, file: !760, line: 71, baseType: !783, size: 512, offset: 524800)
!787 = !{!706}
!788 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "g_cache_con", scope: !791, file: !792, line: 48, type: !826, isLocal: false, isDefinition: true)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !793, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_cache_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!793 = !{!789, !794, !797}
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "g_cache_region_en", scope: !791, file: !792, line: 49, type: !796, isLocal: false, isDefinition: true)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGION_EN_Type", file: !749, line: 66, baseType: !61)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "g_cache_entry", scope: !791, file: !792, line: 50, type: !799, isLocal: false, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 1024, elements: !784)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_Type", file: !749, line: 90, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !749, line: 87, size: 64, elements: !802)
!802 = !{!803, !816}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cache_entry_n", scope: !801, file: !749, line: 88, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_N_Type", file: !749, line: 77, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 68, size: 32, elements: !806)
!806 = !{!807, !815}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !805, file: !749, line: 75, baseType: !808, size: 32)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !805, file: !749, line: 69, size: 32, elements: !809)
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !808, file: !749, line: 70, baseType: !61, size: 5, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ATTR", scope: !808, file: !749, line: 71, baseType: !61, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !808, file: !749, line: 72, baseType: !61, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !808, file: !749, line: 73, baseType: !61, size: 3, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !808, file: !749, line: 74, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !805, file: !749, line: 76, baseType: !61, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cache_end_entry_n", scope: !801, file: !749, line: 89, baseType: !817, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_END_ENTRY_N_Type", file: !749, line: 85, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 79, size: 32, elements: !819)
!819 = !{!820, !825}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !818, file: !749, line: 83, baseType: !821, size: 32)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !749, line: 80, size: 32, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !821, file: !749, line: 81, baseType: !61, size: 12, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !821, file: !749, line: 82, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !818, file: !749, line: 84, baseType: !61, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_CON_Type", file: !749, line: 64, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 51, size: 32, elements: !828)
!828 = !{!829, !841}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !827, file: !749, line: 62, baseType: !830, size: 32)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !827, file: !749, line: 52, size: 32, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "MCEN", scope: !830, file: !749, line: 53, baseType: !61, size: 1, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "MPEN", scope: !830, file: !749, line: 54, baseType: !61, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN0", scope: !830, file: !749, line: 55, baseType: !61, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN1", scope: !830, file: !749, line: 56, baseType: !61, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "MPDEFEN", scope: !830, file: !749, line: 57, baseType: !61, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !830, file: !749, line: 58, baseType: !61, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "MDRF", scope: !830, file: !749, line: 59, baseType: !61, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "CACHESIZE", scope: !830, file: !749, line: 60, baseType: !61, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !830, file: !749, line: 61, baseType: !61, size: 22, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !827, file: !749, line: 63, baseType: !61, size: 32)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !844, file: !845, line: 53, type: !899, isLocal: false, isDefinition: true)
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !846, retainedTypes: !855, globals: !898, splitDebugInlining: false, nameTableKind: None)
!845 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!846 = !{!847, !91}
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !848, line: 152, baseType: !7, size: 32, elements: !849)
!848 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!849 = !{!850, !851, !852, !853, !854}
!850 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!851 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!852 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!853 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!854 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!855 = !{!668, !51, !61, !355, !856, !873}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !285, line: 378, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 363, size: 28704, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !858, file: !285, line: 365, baseType: !289, size: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !858, file: !285, line: 366, baseType: !293, size: 768, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !858, file: !285, line: 367, baseType: !289, size: 256, offset: 1024)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !858, file: !285, line: 368, baseType: !293, size: 768, offset: 1280)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !858, file: !285, line: 369, baseType: !289, size: 256, offset: 2048)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !858, file: !285, line: 370, baseType: !293, size: 768, offset: 2304)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !858, file: !285, line: 371, baseType: !289, size: 256, offset: 3072)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !858, file: !285, line: 372, baseType: !293, size: 768, offset: 3328)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !858, file: !285, line: 373, baseType: !289, size: 256, offset: 4096)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !858, file: !285, line: 374, baseType: !304, size: 1792, offset: 4352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !858, file: !285, line: 375, baseType: !308, size: 1920, offset: 6144)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !858, file: !285, line: 376, baseType: !312, size: 20608, offset: 8064)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !858, file: !285, line: 377, baseType: !60, size: 32, offset: 28672)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !285, line: 418, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 395, size: 1120, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !875, file: !285, line: 397, baseType: !321, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !875, file: !285, line: 398, baseType: !60, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !875, file: !285, line: 399, baseType: !60, size: 32, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !875, file: !285, line: 400, baseType: !60, size: 32, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !875, file: !285, line: 401, baseType: !60, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !875, file: !285, line: 402, baseType: !60, size: 32, offset: 160)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !875, file: !285, line: 403, baseType: !328, size: 96, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !875, file: !285, line: 404, baseType: !60, size: 32, offset: 288)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !875, file: !285, line: 405, baseType: !60, size: 32, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !875, file: !285, line: 406, baseType: !60, size: 32, offset: 352)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !875, file: !285, line: 407, baseType: !60, size: 32, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !875, file: !285, line: 408, baseType: !60, size: 32, offset: 416)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !875, file: !285, line: 409, baseType: !60, size: 32, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !875, file: !285, line: 410, baseType: !60, size: 32, offset: 480)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !875, file: !285, line: 411, baseType: !339, size: 64, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !875, file: !285, line: 412, baseType: !321, size: 32, offset: 576)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !875, file: !285, line: 413, baseType: !321, size: 32, offset: 608)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !875, file: !285, line: 414, baseType: !345, size: 128, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !875, file: !285, line: 415, baseType: !349, size: 160, offset: 768)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !875, file: !285, line: 416, baseType: !353, size: 160, offset: 928)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !875, file: !285, line: 417, baseType: !60, size: 32, offset: 1088)
!898 = !{!842}
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 6144, elements: !908)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !845, line: 50, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !845, line: 47, size: 64, elements: !902)
!902 = !{!903, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !901, file: !845, line: 48, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !668}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !901, file: !845, line: 49, baseType: !61, size: 32, offset: 32)
!908 = !{!909}
!909 = !DISubrange(count: 96)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !912, file: !913, line: 61, type: !932, isLocal: true, isDefinition: true)
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !914, retainedTypes: !930, globals: !931, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!914 = !{!20, !915, !922, !28, !926}
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 657, baseType: !30, size: 32, elements: !916)
!916 = !{!917, !918, !919, !920, !921}
!917 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!918 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!919 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!920 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!921 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 397, baseType: !30, size: 32, elements: !923)
!923 = !{!924, !925}
!924 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!925 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 380, baseType: !30, size: 32, elements: !927)
!927 = !{!928, !929}
!928 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!929 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!930 = !{!51, !61}
!931 = !{!910}
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 640, elements: !350)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !913, line: 55, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !913, line: 51, size: 128, elements: !935)
!935 = !{!936, !938, !948}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !934, file: !913, line: 52, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !21, line: 400, baseType: !922)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !934, file: !913, line: 53, baseType: !939, size: 64, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !913, line: 49, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !913, line: 46, size: 64, elements: !941)
!941 = !{!942, !947}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !940, file: !913, line: 47, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !21, line: 371, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !51}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !940, file: !913, line: 48, baseType: !51, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !934, file: !913, line: 54, baseType: !69, size: 8, offset: 96)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "spim_sleep_handler", scope: !951, file: !952, line: 52, type: !1049, isLocal: false, isDefinition: true)
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !952, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !953, retainedTypes: !1018, globals: !1019, splitDebugInlining: false, nameTableKind: None)
!952 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_spi_master.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!953 = !{!954, !962, !966, !971, !975, !979, !567, !983, !987}
!954 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !955, line: 550, baseType: !7, size: 32, elements: !956)
!955 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_spi_master.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!956 = !{!957, !958, !959, !960, !961}
!957 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_ERROR", value: -4)
!958 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_ERROR_BUSY", value: -3)
!959 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_ERROR_PORT", value: -2)
!960 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_INVALID_PARAMETER", value: -1)
!961 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_OK", value: 0)
!962 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 459, baseType: !30, size: 32, elements: !963)
!963 = !{!964, !965}
!964 = !DIEnumerator(name: "HAL_SPI_MASTER_0", value: 0)
!965 = !DIEnumerator(name: "HAL_SPI_MASTER_MAX", value: 1)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 466, baseType: !30, size: 32, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIEnumerator(name: "HAL_SPI_MASTER_SLAVE_0", value: 0)
!969 = !DIEnumerator(name: "HAL_SPI_MASTER_SLAVE_1", value: 1)
!970 = !DIEnumerator(name: "HAL_SPI_MASTER_SLAVE_MAX", value: 2)
!971 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 487, baseType: !30, size: 32, elements: !972)
!972 = !{!973, !974}
!973 = !DIEnumerator(name: "HAL_SPI_MASTER_LSB_FIRST", value: 0)
!974 = !DIEnumerator(name: "HAL_SPI_MASTER_MSB_FIRST", value: 1)
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 473, baseType: !30, size: 32, elements: !976)
!976 = !{!977, !978}
!977 = !DIEnumerator(name: "HAL_SPI_MASTER_CLOCK_POLARITY0", value: 0)
!978 = !DIEnumerator(name: "HAL_SPI_MASTER_CLOCK_POLARITY1", value: 1)
!979 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 480, baseType: !30, size: 32, elements: !980)
!980 = !{!981, !982}
!981 = !DIEnumerator(name: "HAL_SPI_MASTER_CLOCK_PHASE0", value: 0)
!982 = !DIEnumerator(name: "HAL_SPI_MASTER_CLOCK_PHASE1", value: 1)
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !955, line: 560, baseType: !30, size: 32, elements: !984)
!984 = !{!985, !986}
!985 = !DIEnumerator(name: "HAL_SPI_MASTER_BUSY", value: 0)
!986 = !DIEnumerator(name: "HAL_SPI_MASTER_IDLE", value: 1)
!987 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 249, baseType: !30, size: 32, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!989 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!990 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!991 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!992 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!993 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!994 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!995 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!996 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!997 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!998 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!999 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!1000 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!1001 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!1002 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!1003 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!1004 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!1005 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!1006 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!1007 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!1008 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!1009 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!1010 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!1011 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!1012 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!1013 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!1014 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!1015 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!1016 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!1017 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!1018 = !{!51, !398, !59, !61}
!1019 = !{!949, !1020, !1034, !1036, !1039, !1046}
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "g_spi_master_context", scope: !951, file: !952, line: 49, type: !1022, isLocal: true, isDefinition: true)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_config_t", file: !955, line: 580, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !955, line: 574, size: 160, elements: !1024)
!1024 = !{!1025, !1026, !1028, !1030, !1032}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "clock_frequency", scope: !1023, file: !955, line: 575, baseType: !61, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "slave_port", scope: !1023, file: !955, line: 576, baseType: !1027, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_slave_port_t", file: !29, line: 470, baseType: !966)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "bit_order", scope: !1023, file: !955, line: 577, baseType: !1029, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_bit_order_t", file: !29, line: 490, baseType: !971)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !1023, file: !955, line: 578, baseType: !1031, size: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_clock_polarity_t", file: !29, line: 476, baseType: !975)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !1023, file: !955, line: 579, baseType: !1033, size: 32, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_clock_phase_t", file: !29, line: 483, baseType: !979)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "g_spi_master_status", scope: !951, file: !952, line: 57, type: !53, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "g_spi_master_cs_n", scope: !951, file: !952, line: 58, type: !1038, isLocal: false, isDefinition: true)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_pin_t", file: !29, line: 281, baseType: !987)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "hal_spi_source_clock", scope: !1041, file: !952, line: 96, type: !583, isLocal: true, isDefinition: true)
!1041 = distinct !DISubprogram(name: "hal_spi_master_calc_divisor", scope: !952, file: !952, line: 91, type: !1042, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !951, retainedNodes: !1044)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!61, !61}
!1044 = !{!1045}
!1045 = !DILocalVariable(name: "frequency", arg: 1, scope: !1041, file: !952, line: 91, type: !61)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "spim_lock_sleep_name", scope: !951, file: !952, line: 53, type: !1048, isLocal: true, isDefinition: true)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 32, elements: !775)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8, elements: !775)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !1052, file: !1053, line: 80, type: !1154, isLocal: true, isDefinition: true)
!1052 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1053, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1054, retainedTypes: !1104, globals: !1105, splitDebugInlining: false, nameTableKind: None)
!1053 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!1054 = !{!627, !1055, !1063, !1068, !1084, !1090, !1094, !633, !1099}
!1055 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1056, line: 345, baseType: !7, size: 32, elements: !1057)
!1056 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!1057 = !{!1058, !1059, !1060, !1061, !1062}
!1058 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!1059 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!1060 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!1061 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!1062 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!1063 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 109, baseType: !30, size: 32, elements: !1064)
!1064 = !{!1065, !1066, !1067}
!1065 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!1066 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!1067 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!1068 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1056, line: 302, baseType: !30, size: 32, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1070 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!1071 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!1072 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!1073 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!1074 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!1075 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!1076 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!1077 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!1078 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!1079 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!1080 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!1081 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!1082 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!1083 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!1084 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1056, line: 321, baseType: !30, size: 32, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089}
!1086 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!1087 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!1088 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!1089 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!1090 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1056, line: 330, baseType: !30, size: 32, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!1093 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!1094 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1056, line: 337, baseType: !30, size: 32, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!1097 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!1098 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!1099 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1056, line: 355, baseType: !7, size: 32, elements: !1100)
!1100 = !{!1101, !1102, !1103}
!1101 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!1102 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!1103 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!1104 = !{!491, !30, !51, !58, !492, !54}
!1105 = !{!1106, !1149, !1050, !1152, !1155}
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !1052, file: !1053, line: 77, type: !1108, isLocal: true, isDefinition: true)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 1024, elements: !340)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !1053, line: 75, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1053, line: 68, size: 512, elements: !1111)
!1111 = !{!1112, !1113, !1125, !1126, !1137, !1138}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !1110, file: !1053, line: 69, baseType: !69, size: 8)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !1110, file: !1053, line: 70, baseType: !1114, size: 128, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !1056, line: 378, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1056, line: 373, size: 128, elements: !1116)
!1116 = !{!1117, !1119, !1121, !1123}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1115, file: !1056, line: 374, baseType: !1118, size: 32)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !1056, line: 317, baseType: !1068)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !1115, file: !1056, line: 375, baseType: !1120, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !1056, line: 326, baseType: !1084)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !1115, file: !1056, line: 376, baseType: !1122, size: 32, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !1056, line: 333, baseType: !1090)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1115, file: !1056, line: 377, baseType: !1124, size: 32, offset: 96)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !1056, line: 341, baseType: !1094)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !1110, file: !1053, line: 71, baseType: !69, size: 8, offset: 160)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !1110, file: !1053, line: 72, baseType: !1127, size: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !1053, line: 66, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1053, line: 63, size: 64, elements: !1129)
!1129 = !{!1130, !1136}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1128, file: !1053, line: 64, baseType: !1131, size: 32)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !1056, line: 410, baseType: !1132)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 32)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{null, !1135, !51}
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !1056, line: 359, baseType: !1099)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1128, file: !1053, line: 65, baseType: !51, size: 32, offset: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !1110, file: !1053, line: 73, baseType: !69, size: 8, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !1110, file: !1053, line: 74, baseType: !1139, size: 224, offset: 288)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !1056, line: 390, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1056, line: 382, size: 224, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !1140, file: !1056, line: 383, baseType: !500, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !1140, file: !1056, line: 384, baseType: !61, size: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !1140, file: !1056, line: 385, baseType: !61, size: 32, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !1140, file: !1056, line: 386, baseType: !500, size: 32, offset: 96)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !1140, file: !1056, line: 387, baseType: !61, size: 32, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !1140, file: !1056, line: 388, baseType: !61, size: 32, offset: 160)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !1140, file: !1056, line: 389, baseType: !61, size: 32, offset: 192)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !1052, file: !1053, line: 82, type: !1151, isLocal: true, isDefinition: true)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 16, elements: !340)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !1052, file: !1053, line: 81, type: !1154, isLocal: true, isDefinition: true)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !340)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(name: "func_tbl", scope: !1157, file: !1053, line: 536, type: !1164, isLocal: true, isDefinition: true)
!1157 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !1053, file: !1053, line: 534, type: !1158, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1052, retainedNodes: !1162)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !634, line: 197, baseType: !153)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !29, line: 113, baseType: !1063)
!1162 = !{!1163}
!1163 = !DILocalVariable(name: "uart_port", arg: 1, scope: !1157, file: !1053, line: 534, type: !1161)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 64, elements: !340)
!1165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(name: "DWT_NUMCOMP", scope: !1168, file: !1169, line: 44, type: !7, isLocal: true, isDefinition: true)
!1168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1170, retainedTypes: !1179, globals: !1215, splitDebugInlining: false, nameTableKind: None)
!1169 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_dwt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!1170 = !{!1171}
!1171 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1172, line: 42, baseType: !30, size: 32, elements: !1173)
!1172 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/hal_dwt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/fatfs_read_write_file/GCC")
!1173 = !{!1174, !1175, !1176, !1177, !1178}
!1174 = !DIEnumerator(name: "COMP_DISABLE", value: 0)
!1175 = !DIEnumerator(name: "WDE_INST", value: 4)
!1176 = !DIEnumerator(name: "WDE_DATA_RO", value: 5)
!1177 = !DIEnumerator(name: "WDE_DATA_WO", value: 6)
!1178 = !DIEnumerator(name: "WDE_DATA_RW", value: 7)
!1179 = !{!1180, !1207}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 32)
