; ModuleID = 'build/arduino_due/sensor/mcp9808/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_sam_config = type { %union.anon.1, %struct.Pio*, void (%struct.device*)*, i32 }
%struct.Pio = type { i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, [3 x i32], i32, i32, i32, i32, [4 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32 }
%struct.gpio_driver_api = type { i32 (%struct.device*, i8, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, i32, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i8, i32, i32)*, i32 (%struct.device*, %struct.gpio_callback*, i1)*, i32 (%struct.device*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !111, file: !177, line: 235, type: !178, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !176, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!113 = !{!102, !103, !114, !126}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 41, size: 128, elements: !118)
!118 = !{!119, !122, !123, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !117, file: !116, line: 42, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !117, file: !116, line: 43, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !117, file: !116, line: 44, baseType: !124, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !117, file: !116, line: 45, baseType: !124, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !128, line: 75, baseType: !129)
!128 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 41, size: 2176, elements: !130)
!130 = !{!131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !160, !161, !162, !163, !164, !165, !169, !170, !171, !172, !173, !174, !175}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !129, file: !128, line: 42, baseType: !120, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !129, file: !128, line: 43, baseType: !120, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !129, file: !128, line: 44, baseType: !124, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !129, file: !128, line: 45, baseType: !135, size: 32, offset: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !129, file: !128, line: 46, baseType: !120, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !129, file: !128, line: 47, baseType: !120, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !129, file: !128, line: 48, baseType: !124, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !129, file: !128, line: 49, baseType: !120, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !129, file: !128, line: 50, baseType: !120, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !129, file: !128, line: 51, baseType: !124, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !129, file: !128, line: 52, baseType: !120, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !129, file: !128, line: 53, baseType: !135, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !129, file: !128, line: 54, baseType: !120, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !129, file: !128, line: 55, baseType: !135, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !129, file: !128, line: 56, baseType: !120, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !129, file: !128, line: 57, baseType: !135, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !129, file: !128, line: 58, baseType: !151, size: 96, offset: 512)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !129, file: !128, line: 59, baseType: !155, size: 160, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !129, file: !128, line: 60, baseType: !120, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !129, file: !128, line: 61, baseType: !120, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !129, file: !128, line: 62, baseType: !124, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !129, file: !128, line: 63, baseType: !124, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !129, file: !128, line: 64, baseType: !120, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !129, file: !128, line: 65, baseType: !120, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !129, file: !128, line: 66, baseType: !120, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !129, file: !128, line: 67, baseType: !166, size: 832, offset: 992)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 832, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !129, file: !128, line: 68, baseType: !120, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !129, file: !128, line: 69, baseType: !124, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !129, file: !128, line: 70, baseType: !155, size: 160, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !129, file: !128, line: 71, baseType: !120, size: 32, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !129, file: !128, line: 72, baseType: !120, size: 32, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !129, file: !128, line: 73, baseType: !124, size: 32, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !129, file: !128, line: 74, baseType: !120, size: 32, offset: 2144)
!176 = !{!109}
!177 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!103, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{!191, !195, !196, !197, !206, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 380, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !188, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !189, line: 386, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !200)
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !199, file: !189, line: 359, baseType: !202, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !199, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !188, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !189, line: 43, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !212)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !179, file: !180, line: 65, baseType: !186, size: 32, offset: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "static_regions", scope: !216, file: !225, line: 62, type: !364, isLocal: true, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !218, globals: !221, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!218 = !{!219, !103, !121, !102}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 214, baseType: !32)
!220 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !214}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !224, file: !225, line: 198, type: !352, isLocal: true, isDefinition: true)
!224 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !225, file: !225, line: 175, type: !226, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !347)
!225 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !230, line: 245, size: 1024, elements: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232, !301, !314, !315, !316, !317, !323, !342}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !229, file: !230, line: 247, baseType: !233, size: 384)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !230, line: 57, size: 384, elements: !234)
!234 = !{!235, !263, !271, !272, !273, !286, !287, !288}
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 60, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 60, size: 64, elements: !237)
!237 = !{!238, !254}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !236, file: !230, line: 61, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !240, line: 49, baseType: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !240, line: 37, size: 64, elements: !242)
!242 = !{!243, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 38, baseType: !244, size: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 38, size: 32, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !244, file: !240, line: 39, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !240, line: 40, baseType: !247, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 42, baseType: !250, size: 32, offset: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 42, size: 32, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !250, file: !240, line: 43, baseType: !247, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !250, file: !240, line: 44, baseType: !247, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !236, file: !230, line: 62, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !256, line: 49, size: 64, elements: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !255, file: !256, line: 50, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 64, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !233, file: !230, line: 68, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !266, line: 233, baseType: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 231, size: 64, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !267, file: !266, line: 232, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !240, line: 48, baseType: !241)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !233, file: !230, line: 71, baseType: !202, size: 8, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !233, file: !230, line: 74, baseType: !202, size: 8, offset: 104)
!273 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 90, baseType: !274, size: 16, offset: 112)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 90, size: 16, elements: !275)
!275 = !{!276, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !230, line: 91, baseType: !277, size: 16)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !230, line: 91, size: 16, elements: !278)
!278 = !{!279, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !277, file: !230, line: 96, baseType: !280, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !281)
!281 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !277, file: !230, line: 97, baseType: !202, size: 8, offset: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !274, file: !230, line: 100, baseType: !284, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !285)
!285 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !233, file: !230, line: 107, baseType: !121, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !233, file: !230, line: 127, baseType: !102, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !233, file: !230, line: 131, baseType: !289, size: 192, offset: 192)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !266, line: 244, size: 192, elements: !290)
!290 = !{!291, !292, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !289, file: !266, line: 245, baseType: !239, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !289, file: !266, line: 246, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !266, line: 242, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !289, file: !266, line: 249, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !300)
!300 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !229, file: !230, line: 250, baseType: !302, size: 288, offset: 384)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !303, line: 25, size: 288, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !302, file: !303, line: 26, baseType: !121, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !302, file: !303, line: 27, baseType: !121, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !302, file: !303, line: 28, baseType: !121, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !302, file: !303, line: 29, baseType: !121, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !302, file: !303, line: 30, baseType: !121, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !302, file: !303, line: 31, baseType: !121, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !302, file: !303, line: 32, baseType: !121, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !302, file: !303, line: 33, baseType: !121, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !302, file: !303, line: 34, baseType: !121, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !229, file: !230, line: 253, baseType: !102, size: 32, offset: 672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !229, file: !230, line: 256, baseType: !265, size: 64, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !229, file: !230, line: 294, baseType: !103, size: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !229, file: !230, line: 300, baseType: !318, size: 96, offset: 800)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !230, line: 149, size: 96, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !318, file: !230, line: 153, baseType: !22, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !230, line: 162, baseType: !219, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !318, file: !230, line: 168, baseType: !219, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !229, file: !230, line: 325, baseType: !324, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !326, line: 5073, size: 160, elements: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !{!328, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !325, file: !326, line: 5074, baseType: !329, size: 96)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !330, line: 56, size: 96, elements: !331)
!330 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = !{!332, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !329, file: !330, line: 57, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !330, line: 57, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !329, file: !330, line: 58, baseType: !102, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !329, file: !330, line: 59, baseType: !219, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !325, file: !326, line: 5075, baseType: !265, size: 64, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !325, file: !326, line: 5076, baseType: !339, offset: 160)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !340, line: 43, elements: !341)
!340 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = !{}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !229, file: !230, line: 343, baseType: !343, size: 64, offset: 928)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !303, line: 60, size: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !343, file: !303, line: 63, baseType: !121, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !343, file: !303, line: 66, baseType: !121, size: 32, offset: 32)
!347 = !{!348, !349, !350, !351}
!348 = !DILocalVariable(name: "thread", arg: 1, scope: !224, file: !225, line: 175, type: !228)
!349 = !DILocalVariable(name: "region_num", scope: !224, file: !225, line: 200, type: !202)
!350 = !DILocalVariable(name: "guard_start", scope: !224, file: !225, line: 265, type: !22)
!351 = !DILocalVariable(name: "guard_size", scope: !224, file: !225, line: 266, type: !219)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 96, elements: !136)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !354, line: 52, size: 96, elements: !355)
!354 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !353, file: !354, line: 53, baseType: !22, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !353, file: !354, line: 54, baseType: !219, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !353, file: !354, line: 55, baseType: !359, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !360, line: 151, baseType: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 149, size: 32, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !361, file: !360, line: 150, baseType: !121, size: 32)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 96, elements: !136)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !368, file: !400, line: 39, type: !202, isLocal: true, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !370, globals: !399, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!370 = !{!371, !102, !103, !387, !202}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !373, line: 1168, baseType: !374)
!373 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 1155, size: 352, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !374, file: !373, line: 1157, baseType: !124, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !374, file: !373, line: 1158, baseType: !120, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !374, file: !373, line: 1159, baseType: !120, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !374, file: !373, line: 1160, baseType: !120, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !374, file: !373, line: 1161, baseType: !120, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !374, file: !373, line: 1162, baseType: !120, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !374, file: !373, line: 1163, baseType: !120, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !374, file: !373, line: 1164, baseType: !120, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !374, file: !373, line: 1165, baseType: !120, size: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !374, file: !373, line: 1166, baseType: !120, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !374, file: !373, line: 1167, baseType: !120, size: 32, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !390, line: 27, size: 96, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !389, file: !390, line: 29, baseType: !121, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !390, line: 31, baseType: !192, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !389, file: !390, line: 37, baseType: !395, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !360, line: 146, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !360, line: 141, size: 32, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !396, file: !360, line: 143, baseType: !121, size: 32)
!399 = !{!366}
!400 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !403, file: !410, line: 21, type: !106, isLocal: true, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !405, globals: !409, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!405 = !{!406, !103, !102}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !408, line: 22, baseType: !103)
!408 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !{!401}
!410 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !413, file: !418, line: 13, type: !435, isLocal: true, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !415, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!415 = !{!416, !411}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "mpu_config", scope: !413, file: !418, line: 37, type: !419, isLocal: false, isDefinition: true)
!418 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !390, line: 41, size: 64, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !420, file: !390, line: 43, baseType: !121, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !420, file: !390, line: 45, baseType: !424, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !390, line: 27, size: 96, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !426, file: !390, line: 29, baseType: !121, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !426, file: !390, line: 31, baseType: !192, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !426, file: !390, line: 37, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !360, line: 146, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !360, line: 141, size: 32, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !432, file: !360, line: 143, baseType: !121, size: 32)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 192, elements: !261)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !438, file: !495, line: 603, type: !497, isLocal: true, isDefinition: true, align: 32)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !440, globals: !492, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!440 = !{!102, !103, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !444, line: 336, size: 160, elements: !445)
!444 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!445 = !{!446, !466, !470, !474, !487}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !443, file: !444, line: 365, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DISubroutineType(types: !449)
!449 = !{!103, !450, !465}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !453)
!453 = !{!454, !455, !456, !457, !463, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !189, line: 380, baseType: !192, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !452, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !452, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !452, file: !189, line: 386, baseType: !458, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !459, file: !189, line: 359, baseType: !202, size: 8)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !459, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !452, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !443, file: !444, line: 366, baseType: !467, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !450, !203}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !443, file: !444, line: 374, baseType: !471, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!103, !450}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !443, file: !444, line: 377, baseType: !475, size: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DISubroutineType(types: !477)
!477 = !{!103, !450, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !444, line: 122, size: 64, elements: !481)
!481 = !{!482, !483, !484, !485, !486}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !480, file: !444, line: 123, baseType: !121, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !480, file: !444, line: 124, baseType: !202, size: 8, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !480, file: !444, line: 125, baseType: !202, size: 8, offset: 40)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !480, file: !444, line: 126, baseType: !202, size: 8, offset: 48)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !480, file: !444, line: 127, baseType: !202, size: 8, offset: 56)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !443, file: !444, line: 379, baseType: !488, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DISubroutineType(types: !490)
!490 = !{!103, !450, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!492 = !{!436, !493}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !438, file: !495, line: 38, type: !496, isLocal: true, isDefinition: true)
!495 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !498, file: !180, line: 60, baseType: !471, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !498, file: !180, line: 65, baseType: !450, size: 32, offset: 32)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_29", scope: !504, file: !509, line: 27, type: !510, isLocal: false, isDefinition: true, align: 16)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!506 = !{!507, !511, !513, !515, !502, !517, !519, !521, !523}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !504, file: !509, line: 7, type: !510, isLocal: false, isDefinition: true, align: 16)
!509 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 48, elements: !152)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_31", scope: !504, file: !509, line: 12, type: !510, isLocal: false, isDefinition: true, align: 16)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_30", scope: !504, file: !509, line: 17, type: !510, isLocal: false, isDefinition: true, align: 16)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !504, file: !509, line: 22, type: !510, isLocal: false, isDefinition: true, align: 16)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !504, file: !509, line: 32, type: !510, isLocal: false, isDefinition: true, align: 16)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !504, file: !509, line: 37, type: !510, isLocal: false, isDefinition: true, align: 16)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !504, file: !509, line: 42, type: !510, isLocal: false, isDefinition: true, align: 16)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_12", scope: !504, file: !509, line: 47, type: !510, isLocal: false, isDefinition: true, align: 16)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "port_0_sam_config", scope: !527, file: !627, line: 344, type: !716, isLocal: true, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, retainedTypes: !541, globals: !624, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!529 = !{!30, !530, !536}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !531, line: 506, baseType: !32, size: 32, elements: !532)
!531 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!532 = !{!533, !534, !535}
!533 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!534 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!535 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !531, line: 512, baseType: !32, size: 32, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!539 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!540 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!541 = !{!102, !103, !542, !612, !617, !577, !536, !530, !622, !592, !623}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !531, line: 523, size: 288, elements: !545)
!545 = !{!546, !567, !573, !578, !582, !583, !584, !588, !608}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !544, file: !531, line: 524, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{!103, !550, !565, !566}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !553)
!553 = !{!554, !555, !556, !557, !563, !564}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !552, file: !189, line: 380, baseType: !192, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !552, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !552, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !552, file: !189, line: 386, baseType: !558, size: 32, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !559, file: !189, line: 359, baseType: !202, size: 8)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !559, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !552, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !552, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !531, line: 237, baseType: !202)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !531, line: 257, baseType: !121)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !544, file: !531, line: 530, baseType: !568, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DISubroutineType(types: !570)
!570 = !{!103, !550, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !531, line: 229, baseType: !121)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !544, file: !531, line: 532, baseType: !574, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DISubroutineType(types: !576)
!576 = !{!103, !550, !577, !572}
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !531, line: 216, baseType: !121)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !544, file: !531, line: 535, baseType: !579, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DISubroutineType(types: !581)
!581 = !{!103, !550, !577}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !544, file: !531, line: 537, baseType: !579, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !544, file: !531, line: 539, baseType: !579, size: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !544, file: !531, line: 541, baseType: !585, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{!103, !550, !565, !530, !536}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !544, file: !531, line: 544, baseType: !589, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DISubroutineType(types: !591)
!591 = !{!103, !550, !592, !205}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !531, line: 478, size: 96, elements: !594)
!594 = !{!595, !602, !607}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !593, file: !531, line: 482, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !597, line: 33, baseType: !598)
!597 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !597, line: 29, size: 32, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !597, line: 30, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !593, file: !531, line: 485, baseType: !603, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !531, line: 464, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !550, !592, !577}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !593, file: !531, line: 493, baseType: !577, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !544, file: !531, line: 547, baseType: !609, size: 32, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DISubroutineType(types: !611)
!611 = !{!121, !550}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !531, line: 428, size: 32, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !614, file: !531, line: 434, baseType: !577, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !531, line: 441, size: 32, elements: !620)
!620 = !{!621}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !619, file: !531, line: 447, baseType: !577, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!624 = !{!625, !629, !631, !641, !646, !648, !650, !652, !654, !656, !658, !660, !662, !664, !666, !668, !680, !682, !684, !686, !688, !690, !692, !694, !696, !525, !698, !712, !714, !788, !793, !795, !800, !802, !807, !809}
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_29", scope: !527, file: !627, line: 344, type: !628, isLocal: false, isDefinition: true, align: 16)
!627 = !DIFile(filename: "zephyr/drivers/gpio/gpio_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 80, elements: !156)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__device_dts_ord_29", scope: !527, file: !627, line: 344, type: !551, isLocal: false, isDefinition: true, align: 32)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_29", scope: !527, file: !627, line: 344, type: !633, isLocal: true, isDefinition: true, align: 32)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !635)
!635 = !{!636, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !634, file: !180, line: 60, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DISubroutineType(types: !639)
!639 = !{!103, !550}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !634, file: !180, line: 65, baseType: !550, size: 32, offset: 32)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !527, file: !627, line: 344, type: !643, isLocal: false, isDefinition: true, align: 16)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 6)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !527, file: !627, line: 344, type: !551, isLocal: false, isDefinition: true, align: 32)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !527, file: !627, line: 344, type: !633, isLocal: true, isDefinition: true, align: 32)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_30", scope: !527, file: !627, line: 344, type: !628, isLocal: false, isDefinition: true, align: 16)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "__device_dts_ord_30", scope: !527, file: !627, line: 344, type: !551, isLocal: false, isDefinition: true, align: 32)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_30", scope: !527, file: !627, line: 344, type: !633, isLocal: true, isDefinition: true, align: 32)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_31", scope: !527, file: !627, line: 344, type: !628, isLocal: false, isDefinition: true, align: 16)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "__device_dts_ord_31", scope: !527, file: !627, line: 344, type: !551, isLocal: false, isDefinition: true, align: 32)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_31", scope: !527, file: !627, line: 344, type: !633, isLocal: true, isDefinition: true, align: 32)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !527, file: !627, line: 344, type: !628, isLocal: false, isDefinition: true, align: 16)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !527, file: !627, line: 344, type: !551, isLocal: false, isDefinition: true, align: 32)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !527, file: !627, line: 344, type: !633, isLocal: true, isDefinition: true, align: 32)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "port_0_sam_runtime", scope: !527, file: !627, line: 344, type: !670, isLocal: true, isDefinition: true)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_sam_runtime", file: !627, line: 30, size: 96, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !670, file: !627, line: 32, baseType: !619, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !670, file: !627, line: 33, baseType: !674, size: 64, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !597, line: 40, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !597, line: 35, size: 64, elements: !676)
!676 = !{!677, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !675, file: !597, line: 36, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !675, file: !597, line: 37, baseType: !678, size: 32, offset: 32)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_29", scope: !527, file: !627, line: 344, type: !559, isLocal: true, isDefinition: true, align: 8)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "port_1_sam_runtime", scope: !527, file: !627, line: 344, type: !670, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !527, file: !627, line: 344, type: !559, isLocal: true, isDefinition: true, align: 8)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "port_2_sam_runtime", scope: !527, file: !627, line: 344, type: !670, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_30", scope: !527, file: !627, line: 344, type: !559, isLocal: true, isDefinition: true, align: 8)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "port_3_sam_runtime", scope: !527, file: !627, line: 344, type: !670, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_31", scope: !527, file: !627, line: 344, type: !559, isLocal: true, isDefinition: true, align: 8)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "port_4_sam_runtime", scope: !527, file: !627, line: 344, type: !670, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !527, file: !627, line: 344, type: !559, isLocal: true, isDefinition: true, align: 8)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "__isr_gpio_sam_isr_irq_0", scope: !700, file: !627, line: 344, type: !705, isLocal: true, isDefinition: true, align: 32)
!700 = distinct !DISubprogram(name: "port_0_sam_config_func", scope: !627, file: !627, line: 344, type: !701, scopeLine: 344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !527, retainedNodes: !703)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !550}
!703 = !{!704}
!704 = !DILocalVariable(name: "dev", arg: 1, scope: !700, file: !627, line: 344, type: !550)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !706)
!706 = !{!707, !709, !710, !711}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !705, file: !10, line: 55, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !705, file: !10, line: 57, baseType: !708, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !705, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !705, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "gpio_sam_api", scope: !527, file: !627, line: 293, type: !543, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "port_1_sam_config", scope: !527, file: !627, line: 344, type: !716, isLocal: true, isDefinition: true)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_sam_config", file: !627, line: 22, size: 128, elements: !718)
!718 = !{!719, !720, !784, !787}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !627, line: 24, baseType: !614, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !717, file: !627, line: 25, baseType: !721, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pio", file: !723, line: 96, baseType: !724)
!723 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !723, line: 41, size: 1888, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !757, !758, !759, !760, !761, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PER", scope: !724, file: !723, line: 42, baseType: !120, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDR", scope: !724, file: !723, line: 43, baseType: !120, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PSR", scope: !724, file: !723, line: 44, baseType: !124, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !724, file: !723, line: 45, baseType: !135, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OER", scope: !724, file: !723, line: 46, baseType: !120, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODR", scope: !724, file: !723, line: 47, baseType: !120, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OSR", scope: !724, file: !723, line: 48, baseType: !124, size: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !724, file: !723, line: 49, baseType: !135, size: 32, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFER", scope: !724, file: !723, line: 50, baseType: !120, size: 32, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFDR", scope: !724, file: !723, line: 51, baseType: !120, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFSR", scope: !724, file: !723, line: 52, baseType: !124, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !724, file: !723, line: 53, baseType: !135, size: 32, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SODR", scope: !724, file: !723, line: 54, baseType: !120, size: 32, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_CODR", scope: !724, file: !723, line: 55, baseType: !120, size: 32, offset: 416)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODSR", scope: !724, file: !723, line: 56, baseType: !120, size: 32, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDSR", scope: !724, file: !723, line: 57, baseType: !124, size: 32, offset: 480)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IER", scope: !724, file: !723, line: 58, baseType: !120, size: 32, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IDR", scope: !724, file: !723, line: 59, baseType: !120, size: 32, offset: 544)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IMR", scope: !724, file: !723, line: 60, baseType: !124, size: 32, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ISR", scope: !724, file: !723, line: 61, baseType: !124, size: 32, offset: 608)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDER", scope: !724, file: !723, line: 62, baseType: !120, size: 32, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDDR", scope: !724, file: !723, line: 63, baseType: !120, size: 32, offset: 672)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDSR", scope: !724, file: !723, line: 64, baseType: !124, size: 32, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !724, file: !723, line: 65, baseType: !135, size: 32, offset: 736)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUDR", scope: !724, file: !723, line: 66, baseType: !120, size: 32, offset: 768)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUER", scope: !724, file: !723, line: 67, baseType: !120, size: 32, offset: 800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUSR", scope: !724, file: !723, line: 68, baseType: !124, size: 32, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !724, file: !723, line: 69, baseType: !135, size: 32, offset: 864)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ABSR", scope: !724, file: !723, line: 70, baseType: !120, size: 32, offset: 896)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !724, file: !723, line: 71, baseType: !756, size: 96, offset: 928)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 96, elements: !152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SCIFSR", scope: !724, file: !723, line: 72, baseType: !120, size: 32, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_DIFSR", scope: !724, file: !723, line: 73, baseType: !120, size: 32, offset: 1056)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFDGSR", scope: !724, file: !723, line: 74, baseType: !124, size: 32, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SCDR", scope: !724, file: !723, line: 75, baseType: !120, size: 32, offset: 1120)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !724, file: !723, line: 76, baseType: !762, size: 128, offset: 1152)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 4)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWER", scope: !724, file: !723, line: 77, baseType: !120, size: 32, offset: 1280)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWDR", scope: !724, file: !723, line: 78, baseType: !120, size: 32, offset: 1312)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWSR", scope: !724, file: !723, line: 79, baseType: !124, size: 32, offset: 1344)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !724, file: !723, line: 80, baseType: !135, size: 32, offset: 1376)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMER", scope: !724, file: !723, line: 81, baseType: !120, size: 32, offset: 1408)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMDR", scope: !724, file: !723, line: 82, baseType: !120, size: 32, offset: 1440)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMMR", scope: !724, file: !723, line: 83, baseType: !124, size: 32, offset: 1472)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved9", scope: !724, file: !723, line: 84, baseType: !135, size: 32, offset: 1504)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ESR", scope: !724, file: !723, line: 85, baseType: !120, size: 32, offset: 1536)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_LSR", scope: !724, file: !723, line: 86, baseType: !120, size: 32, offset: 1568)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ELSR", scope: !724, file: !723, line: 87, baseType: !124, size: 32, offset: 1600)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved10", scope: !724, file: !723, line: 88, baseType: !135, size: 32, offset: 1632)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_FELLSR", scope: !724, file: !723, line: 89, baseType: !120, size: 32, offset: 1664)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_REHLSR", scope: !724, file: !723, line: 90, baseType: !120, size: 32, offset: 1696)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_FRLHSR", scope: !724, file: !723, line: 91, baseType: !124, size: 32, offset: 1728)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved11", scope: !724, file: !723, line: 92, baseType: !135, size: 32, offset: 1760)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_LOCKSR", scope: !724, file: !723, line: 93, baseType: !124, size: 32, offset: 1792)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_WPMR", scope: !724, file: !723, line: 94, baseType: !120, size: 32, offset: 1824)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_WPSR", scope: !724, file: !723, line: 95, baseType: !124, size: 32, offset: 1856)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "config_func", scope: !717, file: !627, line: 26, baseType: !785, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_func_t", file: !627, line: 20, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !717, file: !627, line: 27, baseType: !121, size: 32, offset: 96)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "__isr_gpio_sam_isr_irq_1", scope: !790, file: !627, line: 344, type: !705, isLocal: true, isDefinition: true, align: 32)
!790 = distinct !DISubprogram(name: "port_1_sam_config_func", scope: !627, file: !627, line: 344, type: !701, scopeLine: 344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !527, retainedNodes: !791)
!791 = !{!792}
!792 = !DILocalVariable(name: "dev", arg: 1, scope: !790, file: !627, line: 344, type: !550)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "port_2_sam_config", scope: !527, file: !627, line: 344, type: !716, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "__isr_gpio_sam_isr_irq_2", scope: !797, file: !627, line: 344, type: !705, isLocal: true, isDefinition: true, align: 32)
!797 = distinct !DISubprogram(name: "port_2_sam_config_func", scope: !627, file: !627, line: 344, type: !701, scopeLine: 344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !527, retainedNodes: !798)
!798 = !{!799}
!799 = !DILocalVariable(name: "dev", arg: 1, scope: !797, file: !627, line: 344, type: !550)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "port_3_sam_config", scope: !527, file: !627, line: 344, type: !716, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "__isr_gpio_sam_isr_irq_3", scope: !804, file: !627, line: 344, type: !705, isLocal: true, isDefinition: true, align: 32)
!804 = distinct !DISubprogram(name: "port_3_sam_config_func", scope: !627, file: !627, line: 344, type: !701, scopeLine: 344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !527, retainedNodes: !805)
!805 = !{!806}
!806 = !DILocalVariable(name: "dev", arg: 1, scope: !804, file: !627, line: 344, type: !550)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "port_4_sam_config", scope: !527, file: !627, line: 344, type: !716, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "__isr_gpio_sam_isr_irq_4", scope: !811, file: !627, line: 344, type: !705, isLocal: true, isDefinition: true, align: 32)
!811 = distinct !DISubprogram(name: "port_4_sam_config_func", scope: !627, file: !627, line: 344, type: !701, scopeLine: 344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !527, retainedNodes: !812)
!812 = !{!813}
!813 = !DILocalVariable(name: "dev", arg: 1, scope: !811, file: !627, line: 344, type: !550)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "i2c0_sam_config", scope: !816, file: !922, line: 381, type: !1021, isLocal: true, isDefinition: true)
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !818, globals: !919, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/i2c/i2c_sam_twi.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/mcp9808")
!818 = !{!102, !103, !819, !909, !917}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_driver_api", file: !822, line: 234, size: 192, elements: !823)
!822 = !DIFile(filename: "zephyr/include/zephyr/drivers/i2c.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!823 = !{!824, !844, !850, !862, !902, !904}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !821, file: !822, line: 235, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_configure_t", file: !822, line: 212, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DISubroutineType(types: !828)
!828 = !{!103, !829, !121}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !832)
!832 = !{!833, !834, !835, !836, !842, !843}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !831, file: !189, line: 380, baseType: !192, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !831, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !831, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !831, file: !189, line: 386, baseType: !837, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !838, file: !189, line: 359, baseType: !202, size: 8)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !838, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !831, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !831, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "get_config", scope: !821, file: !822, line: 236, baseType: !845, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_get_config_t", file: !822, line: 214, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{!103, !829, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !821, file: !822, line: 237, baseType: !851, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_full_io_t", file: !822, line: 216, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DISubroutineType(types: !854)
!854 = !{!103, !829, !855, !202, !284}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_msg", file: !822, line: 184, size: 96, elements: !857)
!857 = !{!858, !860, !861}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !856, file: !822, line: 186, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !856, file: !822, line: 189, baseType: !121, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !856, file: !822, line: 192, baseType: !202, size: 8, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "target_register", scope: !821, file: !822, line: 238, baseType: !863, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_target_register_t", file: !822, line: 220, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{!103, !829, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_config", file: !822, line: 385, size: 96, elements: !869)
!869 = !{!870, !876, !877, !878}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !868, file: !822, line: 387, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !597, line: 33, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !597, line: 29, size: 32, elements: !873)
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !872, file: !597, line: 30, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !868, file: !822, line: 390, baseType: !202, size: 8, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !868, file: !822, line: 393, baseType: !284, size: 16, offset: 48)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !868, file: !822, line: 396, baseType: !879, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_callbacks", file: !822, line: 366, size: 160, elements: !882)
!882 = !{!883, !888, !893, !898, !900}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "write_requested", scope: !881, file: !822, line: 367, baseType: !884, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_write_requested_cb_t", file: !822, line: 276, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(types: !887)
!887 = !{!103, !867}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "read_requested", scope: !881, file: !822, line: 368, baseType: !889, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_read_requested_cb_t", file: !822, line: 319, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DISubroutineType(types: !892)
!892 = !{!103, !867, !859}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "write_received", scope: !881, file: !822, line: 369, baseType: !894, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_write_received_cb_t", file: !822, line: 297, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DISubroutineType(types: !897)
!897 = !{!103, !867, !202}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "read_processed", scope: !881, file: !822, line: 370, baseType: !899, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_read_processed_cb_t", file: !822, line: 341, baseType: !890)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !881, file: !822, line: 371, baseType: !901, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_stop_cb_t", file: !822, line: 358, baseType: !885)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "target_unregister", scope: !821, file: !822, line: 239, baseType: !903, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_target_unregister_t", file: !822, line: 222, baseType: !864)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "recover_bus", scope: !821, file: !822, line: 243, baseType: !905, size: 32, offset: 160)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_recover_bus_t", file: !822, line: 232, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{!103, !829}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_driver_api", file: !822, line: 249, size: 64, elements: !912)
!912 = !{!913, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "driver_register", scope: !911, file: !822, line: 250, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_api_register_t", file: !822, line: 246, baseType: !906)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "driver_unregister", scope: !911, file: !822, line: 251, baseType: !916, size: 32, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_api_unregister_t", file: !822, line: 247, baseType: !906)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !918, line: 46, baseType: !299)
!918 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!919 = !{!920, !923, !925, !932, !934, !936, !938, !975, !977, !979, !814, !981, !992, !1011, !1014, !1017, !1019, !1063, !1066, !1068, !1070}
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_12", scope: !816, file: !922, line: 381, type: !643, isLocal: false, isDefinition: true, align: 16)
!922 = !DIFile(filename: "zephyr/drivers/i2c/i2c_sam_twi.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "__device_dts_ord_12", scope: !816, file: !922, line: 381, type: !830, isLocal: false, isDefinition: true, align: 32)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_12", scope: !816, file: !922, line: 381, type: !927, isLocal: true, isDefinition: true, align: 32)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !928, file: !180, line: 60, baseType: !906, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !928, file: !180, line: 65, baseType: !829, size: 32, offset: 32)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !816, file: !922, line: 381, type: !643, isLocal: false, isDefinition: true, align: 16)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "__device_dts_ord_14", scope: !816, file: !922, line: 381, type: !830, isLocal: false, isDefinition: true, align: 32)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_14", scope: !816, file: !922, line: 381, type: !927, isLocal: true, isDefinition: true, align: 32)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "i2c0_sam_data", scope: !816, file: !922, line: 381, type: !940, isLocal: true, isDefinition: true)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_sam_twi_dev_data", file: !922, line: 65, size: 416, elements: !941)
!941 = !{!942, !966, !967}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !940, file: !922, line: 66, baseType: !943, size: 128)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !326, line: 2909, size: 128, elements: !944)
!944 = !{!945, !964, !965}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !943, file: !326, line: 2910, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !266, line: 233, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 231, size: 64, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !947, file: !266, line: 232, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !240, line: 48, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !240, line: 37, size: 64, elements: !952)
!952 = !{!953, !959}
!953 = !DIDerivedType(tag: DW_TAG_member, scope: !951, file: !240, line: 38, baseType: !954, size: 32)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !951, file: !240, line: 38, size: 32, elements: !955)
!955 = !{!956, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !954, file: !240, line: 39, baseType: !957, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !954, file: !240, line: 40, baseType: !957, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, scope: !951, file: !240, line: 42, baseType: !960, size: 32, offset: 32)
!960 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !951, file: !240, line: 42, size: 32, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !960, file: !240, line: 43, baseType: !957, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !960, file: !240, line: 44, baseType: !957, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !943, file: !326, line: 2911, baseType: !32, size: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !943, file: !326, line: 2912, baseType: !32, size: 32, offset: 96)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !940, file: !922, line: 67, baseType: !943, size: 128, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !940, file: !922, line: 68, baseType: !968, size: 160, offset: 256)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "twi_msg", file: !922, line: 51, size: 160, elements: !969)
!969 = !{!970, !971, !972, !973, !974}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !968, file: !922, line: 53, baseType: !859, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !968, file: !922, line: 55, baseType: !121, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !968, file: !922, line: 57, baseType: !121, size: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "twi_sr", scope: !968, file: !922, line: 59, baseType: !121, size: 32, offset: 96)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !968, file: !922, line: 61, baseType: !202, size: 8, offset: 128)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_12", scope: !816, file: !922, line: 381, type: !838, isLocal: true, isDefinition: true, align: 8)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "i2c1_sam_data", scope: !816, file: !922, line: 381, type: !940, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_14", scope: !816, file: !922, line: 381, type: !838, isLocal: true, isDefinition: true, align: 8)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
