; ModuleID = './Build/mt2523_bootloader.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.BL_GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_alloc_t = type { i8* (i8*, i32)*, void (i8*, i8*)* }
%struct.bl_fota_header_t = type { i32, i32, [1 x %struct.bl_fota_bin_info_t] }
%struct.bl_fota_bin_info_t = type { i32, i32, i32, i32, i32, i32, i32, [4 x i8] }
%struct.EMI_SETTINGS = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.debug_array = type { i32, i32, i32, i32, i32 }
%struct.I2C_REGISTER_T = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, [2 x i16], i16, i16, i16, i16, i16, i16, i16, i16, [2 x i16], i16, i16, [2 x i16], i16, i16, [2 x i16], i16, i16, [6 x i16], i16, i16, i16, i16, i16, i16, i16, i16, [2 x i16], i16, i16 }
%struct.GFH_CMEM_ID_INFO_v1 = type { %struct.GFH_Header, %struct.CMEMEntryIDList }
%struct.GFH_Header = type { i32, i16, i32 }
%struct.CMEMEntryIDList = type { i32, i32, [5 x %struct.CMEMEntryID] }
%struct.CMEMEntryID = type { i8, i8, [8 x i8] }
%struct.anon = type { i8 }

!11 = !DIEnumerator(name: "LOG_WARN", value: 2)
!12 = !DIEnumerator(name: "LOG_ERROR", value: 3)
!13 = !DIEnumerator(name: "LOG_CRIT", value: 4)
!14 = !DIEnumerator(name: "LOG_NONE", value: 5)
!15 = !{!7, !16, !21}
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !17, line: 44, baseType: !18)
!17 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !19, line: 77, baseType: !20)
!19 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !17, line: 56, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !19, line: 103, baseType: !23)
!23 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!24 = !{!25, !0, !28, !47}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "debug_level", scope: !2, file: !3, line: 52, type: !27, isLocal: true, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "bl_log_level_t", file: !6, line: 63, baseType: !5)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "rev", scope: !30, file: !3, line: 58, type: !44, isLocal: true, isDefinition: true)
!30 = distinct !DISubprogram(name: "bl_itoa", scope: !3, file: !3, line: 54, type: !31, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !38)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33, !36, !36}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 48, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 79, baseType: !7)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DILocalVariable(name: "buf", arg: 1, scope: !30, file: !3, line: 54, type: !33)
!40 = !DILocalVariable(name: "i", arg: 2, scope: !30, file: !3, line: 54, type: !36)
!41 = !DILocalVariable(name: "base", arg: 3, scope: !30, file: !3, line: 54, type: !36)
!42 = !DILocalVariable(name: "s", scope: !30, file: !3, line: 56, type: !34)
!43 = !DILocalVariable(name: "rem", scope: !30, file: !3, line: 57, type: !36)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 168, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 21)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "rev", scope: !49, file: !3, line: 85, type: !44, isLocal: true, isDefinition: true)
!49 = distinct !DISubprogram(name: "bl_itof", scope: !3, file: !3, line: 81, type: !50, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !52)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !33, !16}
!52 = !{!53, !54, !55, !56, !57}
!53 = !DILocalVariable(name: "buf", arg: 1, scope: !49, file: !3, line: 81, type: !33)
!54 = !DILocalVariable(name: "i", arg: 2, scope: !49, file: !3, line: 81, type: !16)
!55 = !DILocalVariable(name: "s", scope: !49, file: !3, line: 83, type: !34)
!56 = !DILocalVariable(name: "rem", scope: !49, file: !3, line: 84, type: !16)
!57 = !DILocalVariable(name: "j", scope: !49, file: !3, line: 84, type: !16)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 4096, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 512)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "gpt_ms", scope: !63, file: !64, line: 38, type: !77, isLocal: false, isDefinition: true)
!63 = distinct !DICompileUnit(language: DW_LANG_C99, file: !64, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !65, retainedTypes: !71, globals: !74, splitDebugInlining: false, nameTableKind: None)
!64 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/bootloader/core/src/bl_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!65 = !{!66}
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 137, baseType: !7, size: 32, elements: !68)
!67 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/bootloader/core/inc/bl_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "BL_GPT_CLOCK_SOURCE_32K", value: 0)
!70 = !DIEnumerator(name: "BL_GPT_CLOCK_SOURCE_1M", value: 1)
!71 = !{!36, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!74 = !{!61, !75, !92, !95}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "gpt_us", scope: !63, file: !64, line: 39, type: !77, isLocal: false, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "BL_GPT_REGISTER_T", file: !67, line: 72, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 62, size: 288, elements: !80)
!80 = !{!81, !83, !84, !85, !87, !88, !89, !90, !91}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !79, file: !67, line: 63, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !79, file: !67, line: 64, baseType: !82, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !79, file: !67, line: 65, baseType: !82, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !79, file: !67, line: 66, baseType: !86, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !79, file: !67, line: 67, baseType: !82, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !79, file: !67, line: 68, baseType: !82, size: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !79, file: !67, line: 69, baseType: !82, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !79, file: !67, line: 70, baseType: !82, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !79, file: !67, line: 71, baseType: !82, size: 32, offset: 256)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "us_init_falg", scope: !63, file: !64, line: 41, type: !94, isLocal: false, isDefinition: true)
!94 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "ms_init_falg", scope: !63, file: !64, line: 42, type: !94, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "g_current_capid", scope: !99, file: !100, line: 74, type: !36, isLocal: false, isDefinition: true)
!99 = distinct !DICompileUnit(language: DW_LANG_C99, file: !100, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!100 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/bootloader/core/src/bl_dcxo_cal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!101 = !{!36, !102, !16}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "BL_P_UINT_32", file: !103, line: 44, baseType: !72)
!103 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/bootloader/core/inc/bl_mtk_bb_reg.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!104 = !{!97, !105}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "abist_fqmtr_register", scope: !99, file: !100, line: 73, type: !107, isLocal: true, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ABIST_FQMTR_REGISTER_T", file: !100, line: 71, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 61, size: 144, elements: !110)
!110 = !{!111, !116, !117, !118, !119, !120, !121, !122, !123}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ABIST_FQMTR_CON0", scope: !109, file: !100, line: 62, baseType: !112, size: 16)
!112 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 36, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 57, baseType: !115)
!115 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !109, file: !100, line: 63, baseType: !112, size: 16, offset: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ABIST_FQMTR_CON1", scope: !109, file: !100, line: 64, baseType: !112, size: 16, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !109, file: !100, line: 65, baseType: !112, size: 16, offset: 48)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ABIST_FQMTR_CON2", scope: !109, file: !100, line: 66, baseType: !112, size: 16, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !109, file: !100, line: 67, baseType: !112, size: 16, offset: 80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ABIST_FQMTR_DATA", scope: !109, file: !100, line: 68, baseType: !112, size: 16, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !109, file: !100, line: 69, baseType: !112, size: 16, offset: 112)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ABIST_FQMTR_DATA_MSB", scope: !109, file: !100, line: 70, baseType: !112, size: 16, offset: 128)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "bl_pmic_vmc_vr_control", scope: !126, file: !127, line: 39, type: !138, isLocal: false, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !128, retainedTypes: !134, globals: !135, splitDebugInlining: false, nameTableKind: None)
!127 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/bootloader/core/src/bl_pmic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!128 = !{!129, !5}
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !130, line: 58, baseType: !7, size: 32, elements: !131)
!130 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_i2c_pmic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!131 = !{!132, !133}
!132 = !DIEnumerator(name: "PMIC_I2C_MASTER", value: 0)
!133 = !DIEnumerator(name: "PMIC_I2C_MASTER_MAX", value: 1)
!134 = !{!72}
!135 = !{!136, !124}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "bl_pmic_vusb_vr_control", scope: !126, file: !127, line: 38, type: !138, isLocal: false, isDefinition: true)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !141}
!141 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "lzma_alloc_count", scope: !144, file: !145, line: 73, type: !20, isLocal: true, isDefinition: true)
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !183, globals: !188, splitDebugInlining: false, nameTableKind: None)
!145 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/bootloader/core/src/bl_fota.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!146 = !{!5, !147, !160, !171, !176}
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 101, baseType: !7, size: 32, elements: !149)
!148 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/bootloader/core/inc/bl_fota.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!150 = !DIEnumerator(name: "BL_FOTA_ERROR_NONE", value: 0)
!151 = !DIEnumerator(name: "BL_FOTA_ERROR_LOADING_HEADER", value: 1)
!152 = !DIEnumerator(name: "BL_FOTA_ERROR_HEADER_FORMAT", value: 2)
!153 = !DIEnumerator(name: "BL_FOTA_ERROR_LOADING_BODY", value: 3)
!154 = !DIEnumerator(name: "BL_FOTA_ERROR_WRITE_TO_PARTITON", value: 4)
!155 = !DIEnumerator(name: "BL_FOTA_ERROR_LOADING_CHECKSUM", value: 5)
!156 = !DIEnumerator(name: "BL_FOTA_ERROR_CHECKSUM_VERIFY", value: 6)
!157 = !DIEnumerator(name: "BL_FOTA_ERROR_LOADING_MARKER", value: 7)
!158 = !DIEnumerator(name: "BL_FOTA_ERROR_ERASE_MARKER", value: 8)
!159 = !DIEnumerator(name: "BL_FOTA_ERROR_FS_OP", value: 9)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !161, line: 110, baseType: !20, size: 32, elements: !162)
!161 = !DIFile(filename: "../../../../../driver/chip/inc/hal_flash.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170}
!163 = !DIEnumerator(name: "HAL_FLASH_STATUS_ERROR_ERASE_FAIL", value: -7)
!164 = !DIEnumerator(name: "HAL_FLASH_STATUS_ERROR_PROG_FAIL", value: -6)
!165 = !DIEnumerator(name: "HAL_FLASH_STATUS_ERROR_NO_INIT", value: -5)
!166 = !DIEnumerator(name: "HAL_FLASH_STATUS_ERROR_NO_SPACE", value: -4)
!167 = !DIEnumerator(name: "HAL_FLASH_STATUS_ERROR_WRONG_ADDRESS", value: -3)
!168 = !DIEnumerator(name: "HAL_FLASH_STATUS_ERROR_LOCKED", value: -2)
!169 = !DIEnumerator(name: "HAL_FLASH_STATUS_ERROR", value: -1)
!170 = !DIEnumerator(name: "HAL_FLASH_STATUS_OK", value: 0)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !161, line: 123, baseType: !7, size: 32, elements: !172)
!172 = !{!173, !174, !175}
!173 = !DIEnumerator(name: "HAL_FLASH_BLOCK_4K", value: 0)
!174 = !DIEnumerator(name: "HAL_FLASH_BLOCK_32K", value: 1)
!175 = !DIEnumerator(name: "HAL_FLASH_BLOCK_64K", value: 2)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 54, baseType: !7, size: 32, elements: !177)
!177 = !{!178, !179, !180, !181, !182}
!178 = !DIEnumerator(name: "INIT_PHASE", value: 0)
!179 = !DIEnumerator(name: "READ_PHASE", value: 1)
!180 = !DIEnumerator(name: "VERIFY_PHASE", value: 2)
!181 = !DIEnumerator(name: "UPDATE_PHASE", value: 3)
!182 = !DIEnumerator(name: "FINISH_PHASE", value: 4)
!183 = !{!184, !187}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 24, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !19, line: 43, baseType: !141)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!188 = !{!189, !208, !225, !228, !253, !258, !260, !265, !142}
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "lzma_alloc", scope: !144, file: !145, line: 120, type: !191, isLocal: false, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_alloc_t", file: !192, line: 69, baseType: !193)
!192 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_lzma_decode_interface.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 66, size: 64, elements: !194)
!194 = !{!195, !204}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Alloc", scope: !193, file: !192, line: 67, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !199, !200}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 40, baseType: !202)
!201 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/strings.h", directory: "/home/mjshen/RTOSExploration")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !203, line: 131, baseType: !7)
!203 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !193, file: !192, line: 68, baseType: !205, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !199, !199}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "last_progress", scope: !210, file: !145, line: 318, type: !36, isLocal: true, isDefinition: true)
!210 = distinct !DISubprogram(name: "bl_fota_update_progress", scope: !145, file: !145, line: 305, type: !211, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !214)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !213, !36}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "bl_fota_progress_phase_t", file: !145, line: 60, baseType: !176)
!214 = !{!215, !216, !217, !222, !223, !224}
!215 = !DILocalVariable(name: "phase", arg: 1, scope: !210, file: !145, line: 305, type: !213)
!216 = !DILocalVariable(name: "progress", arg: 2, scope: !210, file: !145, line: 305, type: !36)
!217 = !DILocalVariable(name: "phase_portion", scope: !210, file: !145, line: 315, type: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 160, elements: !220)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!220 = !{!221}
!221 = !DISubrange(count: 5)
!222 = !DILocalVariable(name: "step", scope: !210, file: !145, line: 316, type: !219)
!223 = !DILocalVariable(name: "total_progress", scope: !210, file: !145, line: 319, type: !36)
!224 = !DILocalVariable(name: "i", scope: !210, file: !145, line: 320, type: !36)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "page_buffer", scope: !144, file: !145, line: 63, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 16384, elements: !59)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "fota_head_buf", scope: !144, file: !145, line: 67, type: !230, isLocal: true, isDefinition: true)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "bl_fota_header_t", file: !148, line: 84, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 80, size: 320, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "m_magic_ver", scope: !231, file: !148, line: 81, baseType: !36, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_num", scope: !231, file: !148, line: 82, baseType: !36, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_info", scope: !231, file: !148, line: 83, baseType: !236, size: 256, offset: 64)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 256, elements: !251)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "bl_fota_bin_info_t", file: !148, line: 78, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 69, size: 256, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_offset", scope: !238, file: !148, line: 70, baseType: !36, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_start_addr", scope: !238, file: !148, line: 71, baseType: !36, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_length", scope: !238, file: !148, line: 72, baseType: !36, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "m_partition_length", scope: !238, file: !148, line: 73, baseType: !36, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "m_sig_offset", scope: !238, file: !148, line: 74, baseType: !36, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "m_sig_length", scope: !238, file: !148, line: 75, baseType: !36, size: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "m_is_compressed", scope: !238, file: !148, line: 76, baseType: !36, size: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_reserved", scope: !238, file: !148, line: 77, baseType: !248, size: 32, offset: 224)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 4)
!251 = !{!252}
!252 = !DISubrange(count: 1)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "lzma_buf_0", scope: !144, file: !145, line: 75, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 131072, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 16384)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "lzma_buf_1", scope: !144, file: !145, line: 76, type: !255, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "lzma_buf_2", scope: !144, file: !145, line: 77, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32768, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 4096)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "lzma_buf_3", scope: !144, file: !145, line: 78, type: !262, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "emi_settings", scope: !269, file: !311, line: 40, type: !312, isLocal: false, isDefinition: true)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !271, retainedTypes: !276, globals: !278, splitDebugInlining: false, nameTableKind: None)
!270 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/emi/src/emi_init.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!271 = !{!5, !272}
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "emi_clock_enum_t", file: !270, line: 408, baseType: !7, size: 32, elements: !273)
!273 = !{!274, !275}
!274 = !DIEnumerator(name: "EMI_CLK_LOW_TO_HIGH", value: 0)
!275 = !DIEnumerator(name: "EMI_CLK_HIGH_TO_LOW", value: 1)
!276 = !{!277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!278 = !{!267, !279, !281, !283, !285, !287, !289, !291, !293, !295, !297, !299, !301, !303, !305, !307, !309}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "__EMI_CurSR0", scope: !269, file: !270, line: 47, type: !36, isLocal: false, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "__EMI_CurSR1", scope: !269, file: !270, line: 48, type: !36, isLocal: false, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "__EMI_CurSR2", scope: !269, file: !270, line: 49, type: !36, isLocal: false, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "EMI_GENA_VAL", scope: !269, file: !270, line: 50, type: !36, isLocal: false, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "EMI_RDCT_VAL", scope: !269, file: !270, line: 51, type: !36, isLocal: false, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "EMI_DSRAM_VAL", scope: !269, file: !270, line: 52, type: !36, isLocal: false, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "EMI_MSRAM_VAL", scope: !269, file: !270, line: 53, type: !36, isLocal: false, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "EMI_IDL_C_VAL", scope: !269, file: !270, line: 54, type: !36, isLocal: false, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "EMI_IDL_D_VAL", scope: !269, file: !270, line: 55, type: !36, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "EMI_IDL_E_VAL", scope: !269, file: !270, line: 56, type: !36, isLocal: false, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "EMI_ODL_C_VAL", scope: !269, file: !270, line: 57, type: !36, isLocal: false, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "EMI_ODL_D_VAL", scope: !269, file: !270, line: 58, type: !36, isLocal: false, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "EMI_ODL_E_VAL", scope: !269, file: !270, line: 59, type: !36, isLocal: false, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "EMI_ODL_F_VAL", scope: !269, file: !270, line: 60, type: !36, isLocal: false, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "EMI_IO_A_VAL", scope: !269, file: !270, line: 61, type: !36, isLocal: false, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "EMI_IO_B_VAL", scope: !269, file: !270, line: 62, type: !36, isLocal: false, isDefinition: true)
!311 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/emi/inc/custom_emi.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 416, elements: !251)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "EMI_SETTINGS", file: !314, line: 54, baseType: !315)
!314 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/emi/inc/emi_init.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 39, size: 416, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_GENA_VAL", scope: !315, file: !314, line: 40, baseType: !36, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_RDCT_VAL", scope: !315, file: !314, line: 41, baseType: !36, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_DSRAM_VAL", scope: !315, file: !314, line: 42, baseType: !36, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_MSRAM_VAL", scope: !315, file: !314, line: 43, baseType: !36, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IDL_C_VAL", scope: !315, file: !314, line: 44, baseType: !36, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IDL_D_VAL", scope: !315, file: !314, line: 45, baseType: !36, size: 32, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IDL_E_VAL", scope: !315, file: !314, line: 46, baseType: !36, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ODL_C_VAL", scope: !315, file: !314, line: 47, baseType: !36, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ODL_D_VAL", scope: !315, file: !314, line: 48, baseType: !36, size: 32, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ODL_E_VAL", scope: !315, file: !314, line: 49, baseType: !36, size: 32, offset: 288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ODL_F_VAL", scope: !315, file: !314, line: 50, baseType: !36, size: 32, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IO_A_VAL", scope: !315, file: !314, line: 51, baseType: !36, size: 32, offset: 352)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IO_B_VAL", scope: !315, file: !314, line: 52, baseType: !36, size: 32, offset: 384)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "debug_node_counter", scope: !332, file: !333, line: 99, type: !7, isLocal: false, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !334, globals: !339, splitDebugInlining: false, nameTableKind: None)
!333 = !DIFile(filename: "../../../../../driver/board/mt25x3_hdk/emi/src/memory_test.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!334 = !{!7, !335, !337, !72}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !141)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !115)
!339 = !{!340, !330, !353}
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "debug_info", scope: !332, file: !333, line: 98, type: !342, isLocal: false, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 3200, elements: !351)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug_array", file: !333, line: 57, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 51, size: 160, elements: !345)
!345 = !{!346, !347, !348, !349, !350}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_num", scope: !344, file: !333, line: 52, baseType: !7, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bit_num", scope: !344, file: !333, line: 53, baseType: !7, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !344, file: !333, line: 54, baseType: !7, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !344, file: !333, line: 55, baseType: !7, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !344, file: !333, line: 56, baseType: !7, size: 32, offset: 128)
!351 = !{!352}
!352 = !DISubrange(count: 20)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "counter", scope: !332, file: !333, line: 100, type: !355, isLocal: false, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, elements: !351)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "i2c_master_register", scope: !358, file: !359, line: 46, type: !482, isLocal: false, isDefinition: true)
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !360, globals: !466, splitDebugInlining: false, nameTableKind: None)
!359 = !DIFile(filename: "../../../../../driver/chip/mt2523//src/hal_i2c_master_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!360 = !{!361, !372, !432, !442, !459}
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !362, line: 137, baseType: !7, size: 32, elements: !363)
!362 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371}
!364 = !DIEnumerator(name: "PDMA_START_CHANNEL", value: 1)
!365 = !DIEnumerator(name: "PDMA_MSDC1", value: 1)
!366 = !DIEnumerator(name: "PDMA_MSDC2", value: 2)
!367 = !DIEnumerator(name: "PDMA_I2C0_TX", value: 3)
!368 = !DIEnumerator(name: "PDMA_I2C0_RX", value: 4)
!369 = !DIEnumerator(name: "PDMA_I2C1_TX", value: 5)
!370 = !DIEnumerator(name: "PDMA_I2C1_RX", value: 6)
!371 = !DIEnumerator(name: "PDMA_END_CHANNEL", value: 7)
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !373, line: 1170, baseType: !7, size: 32, elements: !374)
!373 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431}
!375 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!376 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!377 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!378 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!379 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!380 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!381 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!382 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!383 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!384 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!385 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!386 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!387 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!388 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!389 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!390 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!391 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!392 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!393 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!394 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!395 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!396 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!397 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!398 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!399 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!400 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!401 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!402 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!403 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!404 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!405 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!406 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!407 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!408 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!409 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!410 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!411 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!412 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!413 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!414 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!415 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!416 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!417 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!418 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!419 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!420 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!421 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!422 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!423 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!424 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!425 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!426 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!427 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!428 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!429 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!430 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!431 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !433, line: 132, baseType: !7, size: 32, elements: !434)
!433 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_i2c_master_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!434 = !{!435, !436, !437, !438, !439, !440, !441}
!435 = !DIEnumerator(name: "I2C_FREQUENCY_50K", value: 50)
!436 = !DIEnumerator(name: "I2C_FREQUENCY_100K", value: 100)
!437 = !DIEnumerator(name: "I2C_FREQUENCY_200K", value: 200)
!438 = !DIEnumerator(name: "I2C_FREQUENCY_300K", value: 300)
!439 = !DIEnumerator(name: "I2C_FREQUENCY_400K", value: 400)
!440 = !DIEnumerator(name: "I2C_FREQUENCY_1M", value: 1000)
!441 = !DIEnumerator(name: "I2C_FREQUENCY_MAX", value: 1001)
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !433, line: 142, baseType: !7, size: 32, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!444 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_POLLING", value: 0)
!445 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_DMA", value: 1)
!446 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_POLLING", value: 2)
!447 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_DMA", value: 3)
!448 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_POLLING", value: 4)
!449 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_DMA", value: 5)
!450 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_POLLING", value: 6)
!451 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA", value: 7)
!452 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_POLLING", value: 8)
!453 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA", value: 9)
!454 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_POLLING", value: 10)
!455 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA", value: 11)
!456 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA_EXTEND", value: 12)
!457 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA_EXTEND", value: 13)
!458 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA_EXTEND", value: 14)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !433, line: 162, baseType: !20, size: 32, elements: !460)
!460 = !{!461, !462, !463, !464, !465}
!461 = !DIEnumerator(name: "I2C_TRANSACTION_UNKNOWN_ERROR", value: -4)
!462 = !DIEnumerator(name: "I2C_TRANSACTION_ACK_ERROR", value: -3)
!463 = !DIEnumerator(name: "I2C_TRANSACTION_NACK_ERROR", value: -2)
!464 = !DIEnumerator(name: "I2C_TRANSACTION_TIMEOUT_ERROR", value: -1)
!465 = !DIEnumerator(name: "I2C_TRANSACTION_SUCCESS", value: 0)
!466 = !{!356, !467, !472, !474, !479}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "g_i2c_tx_dma_channel", scope: !358, file: !359, line: 47, type: !469, isLocal: false, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 128, elements: !249)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_channel_t", file: !362, line: 147, baseType: !361)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "g_i2c_rx_dma_channel", scope: !358, file: !359, line: 48, type: !469, isLocal: false, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "g_i2c_pdn_table", scope: !358, file: !359, line: 49, type: !476, isLocal: false, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 128, elements: !249)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !373, line: 1237, baseType: !372)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "g_i2c_source_clock_table", scope: !358, file: !359, line: 52, type: !481, isLocal: false, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !249)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 128, elements: !249)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2C_REGISTER_T", file: !486, line: 1885, baseType: !487)
!486 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 1833, size: 960, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "DATA_PORT", scope: !487, file: !486, line: 1834, baseType: !112, size: 16)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !487, file: !486, line: 1835, baseType: !112, size: 16, offset: 16)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "SLAVE_ADDR", scope: !487, file: !486, line: 1836, baseType: !112, size: 16, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !487, file: !486, line: 1837, baseType: !112, size: 16, offset: 48)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_MASK", scope: !487, file: !486, line: 1838, baseType: !112, size: 16, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !487, file: !486, line: 1839, baseType: !112, size: 16, offset: 80)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_STAT", scope: !487, file: !486, line: 1840, baseType: !112, size: 16, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !487, file: !486, line: 1841, baseType: !112, size: 16, offset: 112)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "CONTROL", scope: !487, file: !486, line: 1842, baseType: !112, size: 16, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !487, file: !486, line: 1843, baseType: !112, size: 16, offset: 144)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN", scope: !487, file: !486, line: 1844, baseType: !112, size: 16, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !487, file: !486, line: 1845, baseType: !112, size: 16, offset: 176)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSAC_LEN", scope: !487, file: !486, line: 1846, baseType: !112, size: 16, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !487, file: !486, line: 1847, baseType: !112, size: 16, offset: 208)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "DELAY_LEN", scope: !487, file: !486, line: 1848, baseType: !112, size: 16, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !487, file: !486, line: 1849, baseType: !112, size: 16, offset: 240)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "TIMING", scope: !487, file: !486, line: 1850, baseType: !112, size: 16, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !487, file: !486, line: 1851, baseType: !112, size: 16, offset: 272)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "START", scope: !487, file: !486, line: 1852, baseType: !112, size: 16, offset: 288)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !487, file: !486, line: 1853, baseType: !112, size: 16, offset: 304)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !487, file: !486, line: 1854, baseType: !510, size: 32, offset: 320)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 32, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 2)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CLOCK_DIV", scope: !487, file: !486, line: 1855, baseType: !112, size: 16, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !487, file: !486, line: 1856, baseType: !112, size: 16, offset: 368)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_STAT", scope: !487, file: !486, line: 1857, baseType: !112, size: 16, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !487, file: !486, line: 1858, baseType: !112, size: 16, offset: 400)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_THRESH", scope: !487, file: !486, line: 1859, baseType: !112, size: 16, offset: 416)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !487, file: !486, line: 1860, baseType: !112, size: 16, offset: 432)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_ADDR_CLR", scope: !487, file: !486, line: 1861, baseType: !112, size: 16, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED15", scope: !487, file: !486, line: 1862, baseType: !112, size: 16, offset: 464)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED16", scope: !487, file: !486, line: 1863, baseType: !510, size: 32, offset: 480)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "IO_CONFIG", scope: !487, file: !486, line: 1864, baseType: !112, size: 16, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED17", scope: !487, file: !486, line: 1865, baseType: !112, size: 16, offset: 528)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED18", scope: !487, file: !486, line: 1866, baseType: !510, size: 32, offset: 544)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "HS", scope: !487, file: !486, line: 1867, baseType: !112, size: 16, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED19", scope: !487, file: !486, line: 1868, baseType: !112, size: 16, offset: 592)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED20", scope: !487, file: !486, line: 1869, baseType: !510, size: 32, offset: 608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "SOFTRESET", scope: !487, file: !486, line: 1870, baseType: !112, size: 16, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED21", scope: !487, file: !486, line: 1871, baseType: !112, size: 16, offset: 656)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED22", scope: !487, file: !486, line: 1872, baseType: !531, size: 96, offset: 672)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 96, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 6)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "SPARE", scope: !487, file: !486, line: 1873, baseType: !112, size: 16, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED23", scope: !487, file: !486, line: 1874, baseType: !112, size: 16, offset: 784)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGSTAT", scope: !487, file: !486, line: 1875, baseType: !112, size: 16, offset: 800)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED24", scope: !487, file: !486, line: 1876, baseType: !112, size: 16, offset: 816)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGCTRL", scope: !487, file: !486, line: 1877, baseType: !112, size: 16, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED25", scope: !487, file: !486, line: 1878, baseType: !112, size: 16, offset: 848)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN_AUX", scope: !487, file: !486, line: 1879, baseType: !112, size: 16, offset: 864)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED26", scope: !487, file: !486, line: 1880, baseType: !112, size: 16, offset: 880)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED27", scope: !487, file: !486, line: 1881, baseType: !510, size: 32, offset: 896)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "TIMEOUT", scope: !487, file: !486, line: 1882, baseType: !112, size: 16, offset: 928)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED28", scope: !487, file: !486, line: 1883, baseType: !112, size: 16, offset: 944)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "DelayResume", scope: !547, file: !548, line: 55, type: !94, isLocal: false, isDefinition: true)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !549, retainedTypes: !563, globals: !593, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "../../../../../driver/chip/mt2523//src/hal_flash_mtd_common.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!549 = !{!550, !558}
!550 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sfi_clock_enum_t", file: !551, line: 51, baseType: !7, size: 32, elements: !552)
!551 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_sfi_release.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!552 = !{!553, !554, !555, !556, !557}
!553 = !DIEnumerator(name: "SFI_CLK_UNKNOWN", value: 0)
!554 = !DIEnumerator(name: "SFI_CLK_78MHZ", value: 78)
!555 = !DIEnumerator(name: "SFI_CLK_104MHZ", value: 104)
!556 = !DIEnumerator(name: "SFI_CLK_130MHZ", value: 130)
!557 = !DIEnumerator(name: "SFI_CLK_166MHZ", value: 166)
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sfi_voltage_enum_t", file: !551, line: 62, baseType: !7, size: 32, elements: !559)
!559 = !{!560, !561, !562}
!560 = !DIEnumerator(name: "SFI_Voltage_UNKNOWN", value: 0)
!561 = !DIEnumerator(name: "SFI_Voltage_18", value: 18)
!562 = !DIEnumerator(name: "SFI_Voltage_30", value: 30)
!563 = !{!564, !586, !184, !36, !7, !187, !72, !592, !335}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_REGISTER_T", file: !486, line: 2777, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 2758, size: 576, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_CTL", scope: !566, file: !486, line: 2759, baseType: !82, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL", scope: !566, file: !486, line: 2760, baseType: !82, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL", scope: !566, file: !486, line: 2761, baseType: !82, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL2", scope: !566, file: !486, line: 2762, baseType: !82, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_OUTL", scope: !566, file: !486, line: 2763, baseType: !82, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_INL", scope: !566, file: !486, line: 2764, baseType: !82, size: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_RESET_CTL", scope: !566, file: !486, line: 2765, baseType: !82, size: 32, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_STA2_CTL", scope: !566, file: !486, line: 2766, baseType: !82, size: 32, offset: 224)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL1", scope: !566, file: !486, line: 2767, baseType: !82, size: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL2", scope: !566, file: !486, line: 2768, baseType: !82, size: 32, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL3", scope: !566, file: !486, line: 2769, baseType: !82, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY1", scope: !566, file: !486, line: 2770, baseType: !82, size: 32, offset: 352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL4", scope: !566, file: !486, line: 2771, baseType: !82, size: 32, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL5", scope: !566, file: !486, line: 2772, baseType: !82, size: 32, offset: 416)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL6", scope: !566, file: !486, line: 2773, baseType: !82, size: 32, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY2", scope: !566, file: !486, line: 2774, baseType: !82, size: 32, offset: 480)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL2", scope: !566, file: !486, line: 2775, baseType: !82, size: 32, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL3", scope: !566, file: !486, line: 2776, baseType: !82, size: 32, offset: 544)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_GPRAM_REGISTER_T", file: !486, line: 2801, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 2798, size: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_GPRAM_DATA", scope: !588, file: !486, line: 2799, baseType: !82, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_GPRAM_DATA_OF_4", scope: !588, file: !486, line: 2800, baseType: !82, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!593 = !{!545}
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "sf_dal_brbusy_wait", scope: !596, file: !597, line: 334, type: !94, isLocal: false, isDefinition: true)
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !598, retainedTypes: !755, globals: !897, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "../../../../../driver/chip/mt2523//src/hal_flash_mtd_dal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!598 = !{!66, !599, !690, !700, !711, !720, !724, !731, !736, !750}
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !600, line: 58, baseType: !20, size: 32, elements: !601)
!600 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_fs_type.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!602 = !DIEnumerator(name: "FS_NO_ERROR", value: 0)
!603 = !DIEnumerator(name: "FS_ERROR_RESERVED", value: -1)
!604 = !DIEnumerator(name: "FS_PARAM_ERROR", value: -2)
!605 = !DIEnumerator(name: "FS_INVALID_FILENAME", value: -3)
!606 = !DIEnumerator(name: "FS_DRIVE_NOT_FOUND", value: -4)
!607 = !DIEnumerator(name: "FS_TOO_MANY_FILES", value: -5)
!608 = !DIEnumerator(name: "FS_NO_MORE_FILES", value: -6)
!609 = !DIEnumerator(name: "FS_WRONG_MEDIA", value: -7)
!610 = !DIEnumerator(name: "FS_INVALID_FILE_SYSTEM", value: -8)
!611 = !DIEnumerator(name: "FS_FILE_NOT_FOUND", value: -9)
!612 = !DIEnumerator(name: "FS_INVALID_FILE_HANDLE", value: -10)
!613 = !DIEnumerator(name: "FS_UNSUPPORTED_DEVICE", value: -11)
!614 = !DIEnumerator(name: "FS_UNSUPPORTED_DRIVER_FUNCTION", value: -12)
!615 = !DIEnumerator(name: "FS_CORRUPTED_PARTITION_TABLE", value: -13)
!616 = !DIEnumerator(name: "FS_TOO_MANY_DRIVES", value: -14)
!617 = !DIEnumerator(name: "FS_INVALID_FILE_POS", value: -15)
!618 = !DIEnumerator(name: "FS_ACCESS_DENIED", value: -16)
!619 = !DIEnumerator(name: "FS_STRING_BUFFER_TOO_SMALL", value: -17)
!620 = !DIEnumerator(name: "FS_GENERAL_FAILURE", value: -18)
!621 = !DIEnumerator(name: "FS_PATH_NOT_FOUND", value: -19)
!622 = !DIEnumerator(name: "FS_FAT_ALLOC_ERROR", value: -20)
!623 = !DIEnumerator(name: "FS_ROOT_DIR_FULL", value: -21)
!624 = !DIEnumerator(name: "FS_DISK_FULL", value: -22)
!625 = !DIEnumerator(name: "FS_TIMEOUT", value: -23)
!626 = !DIEnumerator(name: "FS_BAD_SECTOR", value: -24)
!627 = !DIEnumerator(name: "FS_DATA_ERROR", value: -25)
!628 = !DIEnumerator(name: "FS_MEDIA_CHANGED", value: -26)
!629 = !DIEnumerator(name: "FS_SECTOR_NOT_FOUND", value: -27)
!630 = !DIEnumerator(name: "FS_ADDRESS_MARK_NOT_FOUND", value: -28)
!631 = !DIEnumerator(name: "FS_DRIVE_NOT_READY", value: -29)
!632 = !DIEnumerator(name: "FS_WRITE_PROTECTION", value: -30)
!633 = !DIEnumerator(name: "FS_DMA_OVERRUN", value: -31)
!634 = !DIEnumerator(name: "FS_CRC_ERROR", value: -32)
!635 = !DIEnumerator(name: "FS_DEVICE_RESOURCE_ERROR", value: -33)
!636 = !DIEnumerator(name: "FS_INVALID_SECTOR_SIZE", value: -34)
!637 = !DIEnumerator(name: "FS_OUT_OF_BUFFERS", value: -35)
!638 = !DIEnumerator(name: "FS_FILE_EXISTS", value: -36)
!639 = !DIEnumerator(name: "FS_LONG_FILE_POS", value: -37)
!640 = !DIEnumerator(name: "FS_FILE_TOO_LARGE", value: -38)
!641 = !DIEnumerator(name: "FS_BAD_DIR_ENTRY", value: -39)
!642 = !DIEnumerator(name: "FS_ATTR_CONFLICT", value: -40)
!643 = !DIEnumerator(name: "FS_CHECKDISK_RETRY", value: -41)
!644 = !DIEnumerator(name: "FS_LACK_OF_PROTECTION_SPACE", value: -42)
!645 = !DIEnumerator(name: "FS_SYSTEM_CRASH", value: -43)
!646 = !DIEnumerator(name: "FS_FAIL_GET_MEM", value: -44)
!647 = !DIEnumerator(name: "FS_READ_ONLY_ERROR", value: -45)
!648 = !DIEnumerator(name: "FS_DEVICE_BUSY", value: -46)
!649 = !DIEnumerator(name: "FS_ABORTED_ERROR", value: -47)
!650 = !DIEnumerator(name: "FS_QUOTA_OVER_DISK_SPACE", value: -48)
!651 = !DIEnumerator(name: "FS_PATH_OVER_LEN_ERROR", value: -49)
!652 = !DIEnumerator(name: "FS_APP_QUOTA_FULL", value: -50)
!653 = !DIEnumerator(name: "FS_VF_MAP_ERROR", value: -51)
!654 = !DIEnumerator(name: "FS_DEVICE_EXPORTED_ERROR", value: -52)
!655 = !DIEnumerator(name: "FS_DISK_FRAGMENT", value: -53)
!656 = !DIEnumerator(name: "FS_DIRCACHE_EXPIRED", value: -54)
!657 = !DIEnumerator(name: "FS_QUOTA_USAGE_WARNING", value: -55)
!658 = !DIEnumerator(name: "FS_ERR_DIRDATA_LOCKED", value: -56)
!659 = !DIEnumerator(name: "FS_INVALID_OPERATION", value: -57)
!660 = !DIEnumerator(name: "FS_ERR_VF_PARENT_CLOSED", value: -58)
!661 = !DIEnumerator(name: "FS_ERR_UNSUPPORTED_SERVICE", value: -59)
!662 = !DIEnumerator(name: "FS_ERR_INVALID_JOB_ID", value: -81)
!663 = !DIEnumerator(name: "FS_ERR_ASYNC_JOB_NOT_FOUND", value: -82)
!664 = !DIEnumerator(name: "FS_MSDC_MOUNT_ERROR", value: -100)
!665 = !DIEnumerator(name: "FS_MSDC_READ_SECTOR_ERROR", value: -101)
!666 = !DIEnumerator(name: "FS_MSDC_WRITE_SECTOR_ERROR", value: -102)
!667 = !DIEnumerator(name: "FS_MSDC_DISCARD_SECTOR_ERROR", value: -103)
!668 = !DIEnumerator(name: "FS_MSDC_PRESNET_NOT_READY", value: -104)
!669 = !DIEnumerator(name: "FS_MSDC_NOT_PRESENT", value: -105)
!670 = !DIEnumerator(name: "FS_EXTERNAL_DEVICE_NOT_PRESENT", value: -106)
!671 = !DIEnumerator(name: "FS_HIGH_LEVEL_FORMAT_ERROR", value: -107)
!672 = !DIEnumerator(name: "FS_CARD_BATCHCOUNT_NOT_PRESENT", value: -110)
!673 = !DIEnumerator(name: "FS_FLASH_MOUNT_ERROR", value: -120)
!674 = !DIEnumerator(name: "FS_FLASH_ERASE_BUSY", value: -121)
!675 = !DIEnumerator(name: "FS_NAND_DEVICE_NOT_SUPPORTED", value: -122)
!676 = !DIEnumerator(name: "FS_FLASH_OTP_UNKNOWERR", value: -123)
!677 = !DIEnumerator(name: "FS_FLASH_OTP_OVERSCOPE", value: -124)
!678 = !DIEnumerator(name: "FS_FLASH_OTP_WRITEFAIL", value: -125)
!679 = !DIEnumerator(name: "FS_FDM_VERSION_MISMATCH", value: -126)
!680 = !DIEnumerator(name: "FS_FLASH_OTP_LOCK_ALREADY", value: -127)
!681 = !DIEnumerator(name: "FS_FDM_FORMAT_ERROR", value: -128)
!682 = !DIEnumerator(name: "FS_FDM_USER_DRIVE_BROKEN", value: -129)
!683 = !DIEnumerator(name: "FS_FDM_SYS_DRIVE_BROKEN", value: -130)
!684 = !DIEnumerator(name: "FS_FDM_MULTIPLE_BROKEN", value: -131)
!685 = !DIEnumerator(name: "FS_LOCK_MUTEX_FAIL", value: -141)
!686 = !DIEnumerator(name: "FS_NO_NONBLOCKMODE", value: -142)
!687 = !DIEnumerator(name: "FS_NO_PROTECTIONMODE", value: -143)
!688 = !DIEnumerator(name: "FS_DISK_SIZE_TOO_LARGE", value: -100)
!689 = !DIEnumerator(name: "FS_MINIMUM_ERROR_CODE", value: -65536)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !691, line: 73, baseType: !7, size: 32, elements: !692)
!691 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_sf.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!692 = !{!693, !694, !695, !696, !697, !698, !699}
!693 = !DIEnumerator(name: "SF_MXIC_SR_BUSY", value: 1)
!694 = !DIEnumerator(name: "SF_MXIC_SR_WEL", value: 2)
!695 = !DIEnumerator(name: "SF_MXIC_SR_WSE", value: 8)
!696 = !DIEnumerator(name: "SF_MXIC_SR_WSP", value: 4)
!697 = !DIEnumerator(name: "SF_MXIC_SR_BP", value: 60)
!698 = !DIEnumerator(name: "SF_MXIC_SR_SRWD", value: 128)
!699 = !DIEnumerator(name: "SF_MXIC_SR_ALL", value: 255)
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !691, line: 51, baseType: !7, size: 32, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710}
!702 = !DIEnumerator(name: "SF_SR_BUSY", value: 0)
!703 = !DIEnumerator(name: "SF_SR_WEL", value: 1)
!704 = !DIEnumerator(name: "SF_SR_WSE", value: 2)
!705 = !DIEnumerator(name: "SF_SR_WSP", value: 3)
!706 = !DIEnumerator(name: "SF_SR_BP", value: 4)
!707 = !DIEnumerator(name: "SF_SR_SRWD", value: 5)
!708 = !DIEnumerator(name: "SF_SR_OTPLOCK", value: 6)
!709 = !DIEnumerator(name: "SF_SR_FAIL", value: 7)
!710 = !DIEnumerator(name: "SF_SR_COUNT", value: 8)
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !691, line: 83, baseType: !7, size: 32, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719}
!713 = !DIEnumerator(name: "SF_MXIC_SSR_OTP", value: 1)
!714 = !DIEnumerator(name: "SF_MXIC_SSR_LDSO", value: 2)
!715 = !DIEnumerator(name: "SF_MXIC_SSR_WSP", value: 4)
!716 = !DIEnumerator(name: "SF_MXIC_SSR_WSE", value: 8)
!717 = !DIEnumerator(name: "SF_MXIC_SSR_PFAIL", value: 32)
!718 = !DIEnumerator(name: "SF_MXIC_SSR_EFAIL", value: 64)
!719 = !DIEnumerator(name: "SF_MXIC_SSR_WPSEL", value: 128)
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !691, line: 98, baseType: !7, size: 32, elements: !721)
!721 = !{!722, !723}
!722 = !DIEnumerator(name: "SF_WINBOND_SSR_SUS", value: 128)
!723 = !DIEnumerator(name: "SF_WINBOND_SSR_OTP", value: 60)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !597, line: 298, baseType: !7, size: 32, elements: !725)
!725 = !{!726, !727, !728, !729, !730}
!726 = !DIEnumerator(name: "sf_fix_winbond_cv", value: 1)
!727 = !DIEnumerator(name: "sf_fix_winbond_dw", value: 2)
!728 = !DIEnumerator(name: "sf_fix_mxic_35e", value: 4)
!729 = !DIEnumerator(name: "sf_fix_fidelix_q32a", value: 8)
!730 = !DIEnumerator(name: "sf_fix_gigadevice_b", value: 16)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !732, line: 76, baseType: !7, size: 32, elements: !733)
!732 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_mtd_sf_dal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!733 = !{!734, !735}
!734 = !DIEnumerator(name: "SF_IOCTRL_UNLOCK_BLOCK", value: 0)
!735 = !DIEnumerator(name: "SF_IOCTRL_GET_PROGRAM_FAIL_HANDLE_TYPE", value: 1)
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !732, line: 208, baseType: !7, size: 32, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!738 = !DIEnumerator(name: "SF_DAL_TYPE_NONE", value: 0)
!739 = !DIEnumerator(name: "SF_DAL_TYPE_NUMONYX", value: 32)
!740 = !DIEnumerator(name: "SF_DAL_TYPE_NUMONYX_W", value: 44)
!741 = !DIEnumerator(name: "SF_DAL_TYPE_EON", value: 28)
!742 = !DIEnumerator(name: "SF_DAL_TYPE_SST", value: 191)
!743 = !DIEnumerator(name: "SF_DAL_TYPE_MXIC", value: 194)
!744 = !DIEnumerator(name: "SF_DAL_TYPE_GIGADEVICE", value: 200)
!745 = !DIEnumerator(name: "SF_DAL_TYPE_GIGADEVICE_MD", value: 81)
!746 = !DIEnumerator(name: "SF_DAL_TYPE_WINBOND", value: 239)
!747 = !DIEnumerator(name: "SF_DAL_TYPE_FIDELIX", value: 248)
!748 = !DIEnumerator(name: "SF_DAL_TYPE_ESMT", value: 140)
!749 = !DIEnumerator(name: "SF_DAL_TYPE_COUNT", value: 141)
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !732, line: 81, baseType: !7, size: 32, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIEnumerator(name: "SFDRV_READY", value: 0)
!753 = !DIEnumerator(name: "SFDRV_PROGRAMMING", value: 1)
!754 = !DIEnumerator(name: "SFDRV_ERASING", value: 2)
!755 = !{!199, !184, !36, !756, !762, !784, !786, !141}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_GPRAM_REGISTER_T", file: !486, line: 2801, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 2798, size: 64, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_GPRAM_DATA", scope: !758, file: !486, line: 2799, baseType: !82, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_GPRAM_DATA_OF_4", scope: !758, file: !486, line: 2800, baseType: !82, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_REGISTER_T", file: !486, line: 2777, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 2758, size: 576, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_CTL", scope: !764, file: !486, line: 2759, baseType: !82, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL", scope: !764, file: !486, line: 2760, baseType: !82, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL", scope: !764, file: !486, line: 2761, baseType: !82, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL2", scope: !764, file: !486, line: 2762, baseType: !82, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_OUTL", scope: !764, file: !486, line: 2763, baseType: !82, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_INL", scope: !764, file: !486, line: 2764, baseType: !82, size: 32, offset: 160)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_RESET_CTL", scope: !764, file: !486, line: 2765, baseType: !82, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_STA2_CTL", scope: !764, file: !486, line: 2766, baseType: !82, size: 32, offset: 224)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL1", scope: !764, file: !486, line: 2767, baseType: !82, size: 32, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL2", scope: !764, file: !486, line: 2768, baseType: !82, size: 32, offset: 288)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL3", scope: !764, file: !486, line: 2769, baseType: !82, size: 32, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY1", scope: !764, file: !486, line: 2770, baseType: !82, size: 32, offset: 352)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL4", scope: !764, file: !486, line: 2771, baseType: !82, size: 32, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL5", scope: !764, file: !486, line: 2772, baseType: !82, size: 32, offset: 416)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL6", scope: !764, file: !486, line: 2773, baseType: !82, size: 32, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY2", scope: !764, file: !486, line: 2774, baseType: !82, size: 32, offset: 480)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL2", scope: !764, file: !486, line: 2775, baseType: !82, size: 32, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL3", scope: !764, file: !486, line: 2776, baseType: !82, size: 32, offset: 544)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_MTD_Data", file: !732, line: 193, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !732, line: 134, size: 1824, elements: !789)
!789 = !{!790, !791, !792, !799, !805, !809, !817, !818, !825, !826, !827, !828, !837, !840, !870, !871, !872, !873, !874, !875, !876, !880, !881, !882, !883, !884, !885, !886, !887, !891, !892, !896}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !788, file: !732, line: 136, baseType: !36, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "BaseAddr", scope: !788, file: !732, line: 137, baseType: !184, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceLock", scope: !788, file: !732, line: 138, baseType: !793, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_semid", file: !794, line: 56, baseType: !795)
!794 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_kal_public_defs.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !794, line: 54, size: 8, elements: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !796, file: !794, line: 55, baseType: !185, size: 8)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceLockOwner", scope: !788, file: !732, line: 139, baseType: !800, size: 32, offset: 96)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_taskid", file: !794, line: 46, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !794, line: 44, size: 8, elements: !803)
!803 = !{!804}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !802, file: !794, line: 45, baseType: !185, size: 8)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceLockDepth", scope: !788, file: !732, line: 140, baseType: !806, size: 8, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !17, line: 20, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !19, line: 41, baseType: !808)
!808 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "RegionInfo", scope: !788, file: !732, line: 143, baseType: !810, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlashRegionInfo", file: !812, line: 146, baseType: !813)
!812 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_drvflash.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !812, line: 143, size: 64, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", scope: !813, file: !812, line: 144, baseType: !36, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RegionBlocks", scope: !813, file: !812, line: 145, baseType: !36, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "CurrAddr", scope: !788, file: !732, line: 144, baseType: !184, size: 32, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "BankInfo", scope: !788, file: !732, line: 145, baseType: !819, size: 32, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlashBankInfo", file: !812, line: 152, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !812, line: 149, size: 64, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "BankSize", scope: !821, file: !812, line: 150, baseType: !36, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Banks", scope: !821, file: !812, line: 151, baseType: !36, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "CurrBankAddr", scope: !788, file: !732, line: 146, baseType: !184, size: 32, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "CurrBankSize", scope: !788, file: !732, line: 147, baseType: !36, size: 32, offset: 288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "CurrPollAddr", scope: !788, file: !732, line: 148, baseType: !184, size: 32, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_tbl", scope: !788, file: !732, line: 151, baseType: !829, size: 1024, offset: 352)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 1024, elements: !835)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "NOR_AddrLookup", file: !812, line: 170, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !812, line: 167, size: 64, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "BlockIndex", scope: !831, file: !812, line: 168, baseType: !36, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "BaseAddress", scope: !831, file: !812, line: 169, baseType: !36, size: 32, offset: 32)
!835 = !{!836, !512}
!836 = !DISubrange(count: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "StatusMap", scope: !788, file: !732, line: 155, baseType: !838, size: 32, offset: 1376)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_Status", file: !691, line: 120, baseType: !185)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !788, file: !732, line: 156, baseType: !841, size: 32, offset: 1408)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_MTD_CMD", file: !732, line: 124, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !732, line: 90, size: 200, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "PageProg", scope: !843, file: !732, line: 91, baseType: !185, size: 8)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "WriteEnable", scope: !843, file: !732, line: 92, baseType: !185, size: 8, offset: 8)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Suspend", scope: !843, file: !732, line: 94, baseType: !185, size: 8, offset: 16)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Resume", scope: !843, file: !732, line: 95, baseType: !185, size: 8, offset: 24)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !843, file: !732, line: 96, baseType: !185, size: 8, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Erase", scope: !843, file: !732, line: 98, baseType: !185, size: 8, offset: 40)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Erase4K", scope: !843, file: !732, line: 99, baseType: !185, size: 8, offset: 48)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Erase32K", scope: !843, file: !732, line: 100, baseType: !185, size: 8, offset: 56)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Erase64K", scope: !843, file: !732, line: 101, baseType: !185, size: 8, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ReadID_SPI", scope: !843, file: !732, line: 103, baseType: !185, size: 8, offset: 72)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ReadID_QPI", scope: !843, file: !732, line: 104, baseType: !185, size: 8, offset: 80)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ReadBPReg", scope: !843, file: !732, line: 106, baseType: !185, size: 8, offset: 88)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "WriteBPReg", scope: !843, file: !732, line: 107, baseType: !185, size: 8, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ReadSecurityReg", scope: !843, file: !732, line: 108, baseType: !185, size: 8, offset: 104)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "WriteSecurityReg", scope: !843, file: !732, line: 109, baseType: !185, size: 8, offset: 112)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ReadSuspendReg", scope: !843, file: !732, line: 110, baseType: !185, size: 8, offset: 120)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ReadReadyReg", scope: !843, file: !732, line: 111, baseType: !185, size: 8, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ReadFailReg", scope: !843, file: !732, line: 112, baseType: !185, size: 8, offset: 136)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "EnterDPD", scope: !843, file: !732, line: 114, baseType: !185, size: 8, offset: 144)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "LeaveDPD", scope: !843, file: !732, line: 115, baseType: !185, size: 8, offset: 152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "OTPProg", scope: !843, file: !732, line: 118, baseType: !185, size: 8, offset: 160)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "OTPRead", scope: !843, file: !732, line: 119, baseType: !185, size: 8, offset: 168)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "OTPEnter", scope: !843, file: !732, line: 120, baseType: !185, size: 8, offset: 176)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "OTPExit", scope: !843, file: !732, line: 121, baseType: !185, size: 8, offset: 184)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "OTPLock", scope: !843, file: !732, line: 122, baseType: !185, size: 8, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !788, file: !732, line: 157, baseType: !36, size: 32, offset: 1440)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "BPRBitCount", scope: !788, file: !732, line: 158, baseType: !113, size: 16, offset: 1472)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "UniformBlock", scope: !788, file: !732, line: 159, baseType: !113, size: 16, offset: 1488)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "OTPLength", scope: !788, file: !732, line: 163, baseType: !113, size: 16, offset: 1504)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "OTPBase", scope: !788, file: !732, line: 164, baseType: !113, size: 16, offset: 1520)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "SuspendLatency", scope: !788, file: !732, line: 167, baseType: !185, size: 8, offset: 1536)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "FlashID", scope: !788, file: !732, line: 168, baseType: !877, size: 24, offset: 1544)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 24, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 3)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "DriverStatus", scope: !788, file: !732, line: 169, baseType: !185, size: 8, offset: 1568)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "AddressCycle", scope: !788, file: !732, line: 170, baseType: !185, size: 8, offset: 1576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !788, file: !732, line: 173, baseType: !113, size: 16, offset: 1584)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sf_dal_fix", scope: !788, file: !732, line: 174, baseType: !36, size: 32, offset: 1600)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "CS_Size", scope: !788, file: !732, line: 175, baseType: !36, size: 32, offset: 1632)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "NOR_FLASH_BUSY", scope: !788, file: !732, line: 178, baseType: !94, size: 8, offset: 1664)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "NOR_FLASH_SUSPENDED", scope: !788, file: !732, line: 179, baseType: !94, size: 8, offset: 1672)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "UnlockBlock", scope: !788, file: !732, line: 182, baseType: !888, size: 32, offset: 1696)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DISubroutineType(types: !890)
!890 = !{!20, !199}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "OTPLock", scope: !788, file: !732, line: 186, baseType: !888, size: 32, offset: 1728)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "OTPRead", scope: !788, file: !732, line: 187, baseType: !893, size: 32, offset: 1760)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DISubroutineType(types: !895)
!895 = !{!20, !199, !36, !199, !36}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "OTPWrite", scope: !788, file: !732, line: 188, baseType: !893, size: 32, offset: 1792)
!897 = !{!594, !898, !900, !902}
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "sf_dal_resume_time", scope: !596, file: !597, line: 382, type: !36, isLocal: false, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "sf_dal_flash_return_ready_max", scope: !596, file: !597, line: 383, type: !36, isLocal: false, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "tmp_data_buffer", scope: !596, file: !597, line: 369, type: !904, isLocal: true, isDefinition: true)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 1024, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 128)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "sfi_index", scope: !909, file: !910, line: 99, type: !20, isLocal: false, isDefinition: true)
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !911, retainedTypes: !925, globals: !948, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "../../../../../driver/chip/mt2523//src/hal_flash_custom_sfi.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!911 = !{!912}
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !913, line: 62, baseType: !7, size: 32, elements: !914)
!913 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_custom_sfi.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!915 = !DIEnumerator(name: "SFC_MAC_CTL", value: 0)
!916 = !DIEnumerator(name: "SFC_DR_CTL", value: 1)
!917 = !DIEnumerator(name: "SFC_MISC_CTL", value: 2)
!918 = !DIEnumerator(name: "SFC_MISC_CTL2", value: 3)
!919 = !DIEnumerator(name: "SFC_DLY_CTL2", value: 4)
!920 = !DIEnumerator(name: "SFC_DLY_CTL3", value: 5)
!921 = !DIEnumerator(name: "SFC_Driving", value: 6)
!922 = !DIEnumerator(name: "SFC_Reserved", value: 7)
!923 = !DIEnumerator(name: "SFC_DLY_CTL4", value: 8)
!924 = !DIEnumerator(name: "SFC_DLY_CTL5", value: 9)
!925 = !{!7, !72, !926, !337}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_REGISTER_T", file: !486, line: 2777, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 2758, size: 576, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_CTL", scope: !928, file: !486, line: 2759, baseType: !82, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL", scope: !928, file: !486, line: 2760, baseType: !82, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL", scope: !928, file: !486, line: 2761, baseType: !82, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL2", scope: !928, file: !486, line: 2762, baseType: !82, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_OUTL", scope: !928, file: !486, line: 2763, baseType: !82, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_INL", scope: !928, file: !486, line: 2764, baseType: !82, size: 32, offset: 160)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_RESET_CTL", scope: !928, file: !486, line: 2765, baseType: !82, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_STA2_CTL", scope: !928, file: !486, line: 2766, baseType: !82, size: 32, offset: 224)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL1", scope: !928, file: !486, line: 2767, baseType: !82, size: 32, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL2", scope: !928, file: !486, line: 2768, baseType: !82, size: 32, offset: 288)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL3", scope: !928, file: !486, line: 2769, baseType: !82, size: 32, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY1", scope: !928, file: !486, line: 2770, baseType: !82, size: 32, offset: 352)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL4", scope: !928, file: !486, line: 2771, baseType: !82, size: 32, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL5", scope: !928, file: !486, line: 2772, baseType: !82, size: 32, offset: 416)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL6", scope: !928, file: !486, line: 2773, baseType: !82, size: 32, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY2", scope: !928, file: !486, line: 2774, baseType: !82, size: 32, offset: 480)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL2", scope: !928, file: !486, line: 2775, baseType: !82, size: 32, offset: 512)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL3", scope: !928, file: !486, line: 2776, baseType: !82, size: 32, offset: 544)
!948 = !{!907, !949, !951}
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "CS_COUNT_SFI", scope: !909, file: !910, line: 99, type: !20, isLocal: false, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "combo_mem_hw_list", scope: !909, file: !953, line: 38, type: !954, isLocal: true, isDefinition: true)
!953 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_combo_sfi_config.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMEMEntrySFIList", file: !956, line: 107, baseType: !957)
!956 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_combo_sfi_defs.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !956, line: 102, size: 4352, elements: !958)
!958 = !{!959, !963, !964, !965}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "m_identifier", scope: !957, file: !956, line: 103, baseType: !960, size: 128)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 16)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "m_ver", scope: !957, file: !956, line: 104, baseType: !7, size: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !957, file: !956, line: 105, baseType: !7, size: 32, offset: 160)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !957, file: !956, line: 106, baseType: !966, size: 4160, offset: 192)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 4160, elements: !220)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMEMEntrySFI", file: !956, line: 79, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !956, line: 60, size: 832, elements: !969)
!969 = !{!970, !974, !978}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "HWConf_78M", scope: !968, file: !956, line: 74, baseType: !971, size: 320)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 320, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 10)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "DevInit_78M", scope: !968, file: !956, line: 75, baseType: !975, size: 256, offset: 320)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 256, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "HWConf_26M", scope: !968, file: !956, line: 77, baseType: !979, size: 256, offset: 576)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 256, elements: !980)
!980 = !{!836}
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "combo_mem_id_list", scope: !983, file: !1038, line: 35, type: !1039, isLocal: false, isDefinition: true)
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !985, retainedTypes: !1031, globals: !1032, splitDebugInlining: false, nameTableKind: None)
!984 = !DIFile(filename: "../../../../../driver/chip/mt2523//src/hal_flash_combo_init.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!985 = !{!986}
!986 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !987, line: 77, baseType: !7, size: 32, elements: !988)
!987 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_general_types.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!989 = !DIEnumerator(name: "GFH_FILE_INFO", value: 0)
!990 = !DIEnumerator(name: "GFH_BL_INFO", value: 1)
!991 = !DIEnumerator(name: "GFH_ANTI_CLONE", value: 2)
!992 = !DIEnumerator(name: "GFH_BL_SEC_KEY", value: 3)
!993 = !DIEnumerator(name: "GFH_SCTRL_CERT", value: 4)
!994 = !DIEnumerator(name: "GFH_TOOL_AUTH", value: 5)
!995 = !DIEnumerator(name: "GFH_MTK_RESERVED1", value: 6)
!996 = !DIEnumerator(name: "GFH_BROM_CFG", value: 7)
!997 = !DIEnumerator(name: "GFH_BROM_SEC_CFG", value: 8)
!998 = !DIEnumerator(name: "GFH_MTK_RESERVED2", value: 9)
!999 = !DIEnumerator(name: "GFH_MTK_RESERVED3", value: 10)
!1000 = !DIEnumerator(name: "GFH_ROOT_CERT", value: 11)
!1001 = !DIEnumerator(name: "GFH_EXP_CHK", value: 12)
!1002 = !DIEnumerator(name: "GFH_EPP_PARAM", value: 13)
!1003 = !DIEnumerator(name: "GFH_CHIP_VER", value: 14)
!1004 = !DIEnumerator(name: "GFH_MTK_RESERVED4", value: 15)
!1005 = !DIEnumerator(name: "GFH_MD_SEC_CFG", value: 16)
!1006 = !DIEnumerator(name: "GFH_EPP_INFO", value: 256)
!1007 = !DIEnumerator(name: "GFH_EMI_LIST", value: 257)
!1008 = !DIEnumerator(name: "GFH_CMEM_ID_INFO", value: 258)
!1009 = !DIEnumerator(name: "GFH_CMEM_NOR_INFO", value: 259)
!1010 = !DIEnumerator(name: "GFH_DSP_INFO", value: 260)
!1011 = !DIEnumerator(name: "GFH_MAUI_INFO", value: 512)
!1012 = !DIEnumerator(name: "GFH_MAUI_SEC", value: 513)
!1013 = !DIEnumerator(name: "GFH_MAUI_CODE_KEY", value: 514)
!1014 = !DIEnumerator(name: "GFH_MAUI_SECURE_RO_KEY", value: 515)
!1015 = !DIEnumerator(name: "GFH_MAUI_RESOURCE_KEY", value: 516)
!1016 = !DIEnumerator(name: "GFH_SECURE_RO_INFO", value: 517)
!1017 = !DIEnumerator(name: "GFH_DL_PACKAGE_INFO", value: 518)
!1018 = !DIEnumerator(name: "GFH_FLASH_INFO", value: 519)
!1019 = !DIEnumerator(name: "GFH_MACR_INFO", value: 520)
!1020 = !DIEnumerator(name: "GFH_ARM_BL_INFO", value: 521)
!1021 = !DIEnumerator(name: "GFH_EMMC_BOOTING_INFO", value: 522)
!1022 = !DIEnumerator(name: "GFH_FOTA_INFO", value: 523)
!1023 = !DIEnumerator(name: "GFH_CBR_RECORD_INFO", value: 524)
!1024 = !DIEnumerator(name: "GFH_CONFIDENTIAL_BIN_INFO", value: 525)
!1025 = !DIEnumerator(name: "GFH_CBR_INFO", value: 526)
!1026 = !DIEnumerator(name: "GFH_MBA_INFO", value: 527)
!1027 = !DIEnumerator(name: "GFH_BINARY_LOCATION", value: 528)
!1028 = !DIEnumerator(name: "GFH_BOOT_CERT_CTRL_CONTENT", value: 768)
!1029 = !DIEnumerator(name: "GFH_TYPE_NUM", value: 769)
!1030 = !DIEnumerator(name: "GFH_TYPE_END", value: 65535)
!1031 = !{!199}
!1032 = !{!981, !1033, !1036}
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "cmem_index", scope: !983, file: !984, line: 96, type: !1035, isLocal: true, isDefinition: true)
!1035 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "cmem_emiinit_index", scope: !983, file: !984, line: 94, type: !1035, isLocal: true, isDefinition: true)
!1038 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_combo_id.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFH_CMEM_ID_INFO_v1", file: !984, line: 54, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !984, line: 51, size: 576, elements: !1042)
!1042 = !{!1043, !1053}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "m_gfh_hdr", scope: !1041, file: !984, line: 52, baseType: !1044, size: 96)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFH_Header", file: !987, line: 152, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GFH_Header", file: !987, line: 144, size: 96, elements: !1046)
!1046 = !{!1047, !1049, !1051}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "m_magic_ver", scope: !1045, file: !987, line: 145, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !987, line: 61, baseType: !7)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !1045, file: !987, line: 146, baseType: !1050, size: 16, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "U16", file: !987, line: 62, baseType: !115)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "m_type", scope: !1045, file: !987, line: 150, baseType: !1052, size: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFH_TYPE", file: !987, line: 127, baseType: !986)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "m_data", scope: !1041, file: !984, line: 53, baseType: !1054, size: 480, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMEMEntryIDList", file: !1055, line: 107, baseType: !1056)
!1055 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_combo_defs.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/apps/bootloader/GCC")
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1055, line: 103, size: 480, elements: !1057)
!1057 = !{!1058, !1059, !1060}
