; ModuleID = 'build/arduino_due/subsys/console/getchar/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.tty_serial = type { %struct.device*, %struct.k_sem, i8*, i32, i16, i16, i32, %struct.k_sem, i8*, i32, i16, i16, i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.z_heap_bucket = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %union.anon }
%struct._sflist = type { %struct.z_heap_bucket*, %struct.z_heap_bucket* }
%struct.k_spinlock = type {}
%struct.console_input = type { i32, i8, [128 x i8] }
%struct.wdt_sam_dev_cfg = type { %struct._thread_stack_info* }
%struct._thread_stack_info = type { i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !111, file: !177, line: 235, type: !178, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !176, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!113 = !{!102, !103, !114, !126}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 41, size: 128, elements: !118)
!118 = !{!119, !122, !123, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !117, file: !116, line: 42, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !117, file: !116, line: 43, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !117, file: !116, line: 44, baseType: !124, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !117, file: !116, line: 45, baseType: !124, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !128, line: 75, baseType: !129)
!128 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 41, size: 2176, elements: !130)
!130 = !{!131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !160, !161, !162, !163, !164, !165, !169, !170, !171, !172, !173, !174, !175}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !129, file: !128, line: 42, baseType: !120, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !129, file: !128, line: 43, baseType: !120, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !129, file: !128, line: 44, baseType: !124, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !129, file: !128, line: 45, baseType: !135, size: 32, offset: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !129, file: !128, line: 46, baseType: !120, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !129, file: !128, line: 47, baseType: !120, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !129, file: !128, line: 48, baseType: !124, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !129, file: !128, line: 49, baseType: !120, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !129, file: !128, line: 50, baseType: !120, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !129, file: !128, line: 51, baseType: !124, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !129, file: !128, line: 52, baseType: !120, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !129, file: !128, line: 53, baseType: !135, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !129, file: !128, line: 54, baseType: !120, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !129, file: !128, line: 55, baseType: !135, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !129, file: !128, line: 56, baseType: !120, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !129, file: !128, line: 57, baseType: !135, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !129, file: !128, line: 58, baseType: !151, size: 96, offset: 512)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !129, file: !128, line: 59, baseType: !155, size: 160, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !129, file: !128, line: 60, baseType: !120, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !129, file: !128, line: 61, baseType: !120, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !129, file: !128, line: 62, baseType: !124, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !129, file: !128, line: 63, baseType: !124, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !129, file: !128, line: 64, baseType: !120, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !129, file: !128, line: 65, baseType: !120, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !129, file: !128, line: 66, baseType: !120, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !129, file: !128, line: 67, baseType: !166, size: 832, offset: 992)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 832, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !129, file: !128, line: 68, baseType: !120, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !129, file: !128, line: 69, baseType: !124, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !129, file: !128, line: 70, baseType: !155, size: 160, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !129, file: !128, line: 71, baseType: !120, size: 32, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !129, file: !128, line: 72, baseType: !120, size: 32, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !129, file: !128, line: 73, baseType: !124, size: 32, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !129, file: !128, line: 74, baseType: !120, size: 32, offset: 2144)
!176 = !{!109}
!177 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!103, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{!191, !195, !196, !197, !206, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 380, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !188, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !189, line: 386, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !200)
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !199, file: !189, line: 359, baseType: !202, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !199, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !188, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !189, line: 43, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !212)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !179, file: !180, line: 65, baseType: !186, size: 32, offset: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "console_serial", scope: !216, file: !307, line: 13, type: !313, isLocal: true, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !218, globals: !304, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!218 = !{!219, !102, !103}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !222, line: 336, size: 608, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !244, !248, !252, !265, !270, !276, !282, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !221, file: !222, line: 365, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DISubroutineType(types: !227)
!227 = !{!103, !228, !243}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !231)
!231 = !{!232, !233, !234, !235, !241, !242}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !189, line: 380, baseType: !192, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !230, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !230, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !230, file: !189, line: 386, baseType: !236, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !237, file: !189, line: 359, baseType: !202, size: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !237, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !230, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !221, file: !222, line: 366, baseType: !245, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !228, !203}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !221, file: !222, line: 374, baseType: !249, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{!103, !228}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !221, file: !222, line: 377, baseType: !253, size: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DISubroutineType(types: !255)
!255 = !{!103, !228, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !222, line: 122, size: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !258, file: !222, line: 123, baseType: !121, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !258, file: !222, line: 124, baseType: !202, size: 8, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !258, file: !222, line: 125, baseType: !202, size: 8, offset: 40)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !258, file: !222, line: 126, baseType: !202, size: 8, offset: 48)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !258, file: !222, line: 127, baseType: !202, size: 8, offset: 56)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !221, file: !222, line: 379, baseType: !266, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DISubroutineType(types: !268)
!268 = !{!103, !228, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !221, file: !222, line: 384, baseType: !271, size: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DISubroutineType(types: !273)
!273 = !{!103, !228, !274, !103}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !221, file: !222, line: 393, baseType: !277, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DISubroutineType(types: !279)
!279 = !{!103, !228, !280, !281}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !221, file: !222, line: 402, baseType: !283, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !228}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !221, file: !222, line: 405, baseType: !283, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !221, file: !222, line: 408, baseType: !249, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !221, file: !222, line: 411, baseType: !283, size: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !221, file: !222, line: 414, baseType: !283, size: 32, offset: 352)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !221, file: !222, line: 417, baseType: !249, size: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !221, file: !222, line: 420, baseType: !249, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !221, file: !222, line: 423, baseType: !283, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !221, file: !222, line: 426, baseType: !283, size: 32, offset: 480)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !221, file: !222, line: 429, baseType: !249, size: 32, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !221, file: !222, line: 432, baseType: !249, size: 32, offset: 544)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !221, file: !222, line: 435, baseType: !297, size: 32, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !228, !300, !102}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !222, line: 142, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !228, !102}
!304 = !{!214, !305, !311}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "console_rxbuf", scope: !216, file: !307, line: 15, type: !308, isLocal: true, isDefinition: true)
!307 = !DIFile(filename: "zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 128, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 16)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "console_txbuf", scope: !216, file: !307, line: 16, type: !308, isLocal: true, isDefinition: true)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tty_serial", file: !314, line: 18, size: 544, elements: !315)
!314 = !DIFile(filename: "zephyr/include/zephyr/console/tty.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = !{!316, !317, !344, !345, !346, !349, !350, !352, !353, !354, !355, !356, !357}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "uart_dev", scope: !313, file: !314, line: 19, baseType: !228, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "rx_sem", scope: !313, file: !314, line: 21, baseType: !318, size: 128, offset: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !319, line: 2909, size: 128, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321, !342, !343}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !318, file: !319, line: 2910, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !323, line: 233, baseType: !324)
!323 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 231, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !324, file: !323, line: 232, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !328, line: 48, baseType: !329)
!328 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !328, line: 37, size: 64, elements: !330)
!330 = !{!331, !337}
!331 = !DIDerivedType(tag: DW_TAG_member, scope: !329, file: !328, line: 38, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !329, file: !328, line: 38, size: 32, elements: !333)
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !332, file: !328, line: 39, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !328, line: 40, baseType: !335, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, scope: !329, file: !328, line: 42, baseType: !338, size: 32, offset: 32)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !329, file: !328, line: 42, size: 32, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !338, file: !328, line: 43, baseType: !335, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !338, file: !328, line: 44, baseType: !335, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !318, file: !319, line: 2911, baseType: !32, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !318, file: !319, line: 2912, baseType: !32, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf", scope: !313, file: !314, line: 22, baseType: !280, size: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf_sz", scope: !313, file: !314, line: 23, baseType: !121, size: 32, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rx_get", scope: !313, file: !314, line: 24, baseType: !347, size: 16, offset: 224)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !348)
!348 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rx_put", scope: !313, file: !314, line: 24, baseType: !347, size: 16, offset: 240)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rx_timeout", scope: !313, file: !314, line: 25, baseType: !351, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tx_sem", scope: !313, file: !314, line: 27, baseType: !318, size: 128, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf", scope: !313, file: !314, line: 28, baseType: !280, size: 32, offset: 416)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf_sz", scope: !313, file: !314, line: 29, baseType: !121, size: 32, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tx_get", scope: !313, file: !314, line: 30, baseType: !347, size: 16, offset: 480)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tx_put", scope: !313, file: !314, line: 30, baseType: !347, size: 16, offset: 496)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tx_timeout", scope: !313, file: !314, line: 31, baseType: !351, size: 32, offset: 512)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "static_regions", scope: !360, file: !369, line: 62, type: !503, isLocal: true, isDefinition: true)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !362, globals: !365, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!362 = !{!363, !103, !121, !102}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !364, line: 214, baseType: !32)
!364 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!365 = !{!366, !358}
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !368, file: !369, line: 198, type: !491, isLocal: true, isDefinition: true)
!368 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !369, file: !369, line: 175, type: !370, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !360, retainedNodes: !486)
!369 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !DISubroutineType(types: !371)
!371 = !{null, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !374, line: 245, size: 1024, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !441, !454, !455, !456, !457, !463, !481}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !373, file: !374, line: 247, baseType: !377, size: 384)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !374, line: 57, size: 384, elements: !378)
!378 = !{!379, !406, !413, !414, !415, !426, !427, !428}
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !374, line: 60, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !377, file: !374, line: 60, size: 64, elements: !381)
!381 = !{!382, !397}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !380, file: !374, line: 61, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !328, line: 49, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !328, line: 37, size: 64, elements: !385)
!385 = !{!386, !392}
!386 = !DIDerivedType(tag: DW_TAG_member, scope: !384, file: !328, line: 38, baseType: !387, size: 32)
!387 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !384, file: !328, line: 38, size: 32, elements: !388)
!388 = !{!389, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !387, file: !328, line: 39, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !328, line: 40, baseType: !390, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, scope: !384, file: !328, line: 42, baseType: !393, size: 32, offset: 32)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !384, file: !328, line: 42, size: 32, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !393, file: !328, line: 43, baseType: !390, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !393, file: !328, line: 44, baseType: !390, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !380, file: !374, line: 62, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !399, line: 49, size: 64, elements: !400)
!399 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !398, file: !399, line: 50, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 64, elements: !404)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!404 = !{!405}
!405 = !DISubrange(count: 2)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !377, file: !374, line: 68, baseType: !407, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !323, line: 233, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 231, size: 64, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !409, file: !323, line: 232, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !328, line: 48, baseType: !384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !377, file: !374, line: 71, baseType: !202, size: 8, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !377, file: !374, line: 74, baseType: !202, size: 8, offset: 104)
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !374, line: 90, baseType: !416, size: 16, offset: 112)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !377, file: !374, line: 90, size: 16, elements: !417)
!417 = !{!418, !425}
!418 = !DIDerivedType(tag: DW_TAG_member, scope: !416, file: !374, line: 91, baseType: !419, size: 16)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !416, file: !374, line: 91, size: 16, elements: !420)
!420 = !{!421, !424}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !419, file: !374, line: 96, baseType: !422, size: 8)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !423)
!423 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !419, file: !374, line: 97, baseType: !202, size: 8, offset: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !416, file: !374, line: 100, baseType: !347, size: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !377, file: !374, line: 107, baseType: !121, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !377, file: !374, line: 127, baseType: !102, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !377, file: !374, line: 131, baseType: !429, size: 192, offset: 192)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !323, line: 244, size: 192, elements: !430)
!430 = !{!431, !432, !438}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !429, file: !323, line: 245, baseType: !383, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !429, file: !323, line: 246, baseType: !433, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !323, line: 242, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !429, file: !323, line: 249, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !440)
!440 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !373, file: !374, line: 250, baseType: !442, size: 288, offset: 384)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !443, line: 25, size: 288, elements: !444)
!443 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !442, file: !443, line: 26, baseType: !121, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !442, file: !443, line: 27, baseType: !121, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !442, file: !443, line: 28, baseType: !121, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !442, file: !443, line: 29, baseType: !121, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !442, file: !443, line: 30, baseType: !121, size: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !442, file: !443, line: 31, baseType: !121, size: 32, offset: 160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !442, file: !443, line: 32, baseType: !121, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !442, file: !443, line: 33, baseType: !121, size: 32, offset: 224)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !442, file: !443, line: 34, baseType: !121, size: 32, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !373, file: !374, line: 253, baseType: !102, size: 32, offset: 672)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !373, file: !374, line: 256, baseType: !408, size: 64, offset: 704)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !373, file: !374, line: 294, baseType: !103, size: 32, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !373, file: !374, line: 300, baseType: !458, size: 96, offset: 800)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !374, line: 149, size: 96, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !458, file: !374, line: 153, baseType: !22, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !458, file: !374, line: 162, baseType: !363, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !458, file: !374, line: 168, baseType: !363, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !373, file: !374, line: 325, baseType: !464, size: 32, offset: 896)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !319, line: 5073, size: 160, elements: !466)
!466 = !{!467, !476, !477}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !465, file: !319, line: 5074, baseType: !468, size: 96)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !469, line: 56, size: 96, elements: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !{!471, !474, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !468, file: !469, line: 57, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !469, line: 57, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !468, file: !469, line: 58, baseType: !102, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !468, file: !469, line: 59, baseType: !363, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !465, file: !319, line: 5075, baseType: !408, size: 64, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !465, file: !319, line: 5076, baseType: !478, offset: 160)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !479, line: 43, elements: !480)
!479 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = !{}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !373, file: !374, line: 343, baseType: !482, size: 64, offset: 928)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !443, line: 60, size: 64, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !482, file: !443, line: 63, baseType: !121, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !482, file: !443, line: 66, baseType: !121, size: 32, offset: 32)
!486 = !{!487, !488, !489, !490}
!487 = !DILocalVariable(name: "thread", arg: 1, scope: !368, file: !369, line: 175, type: !372)
!488 = !DILocalVariable(name: "region_num", scope: !368, file: !369, line: 200, type: !202)
!489 = !DILocalVariable(name: "guard_start", scope: !368, file: !369, line: 265, type: !22)
!490 = !DILocalVariable(name: "guard_size", scope: !368, file: !369, line: 266, type: !363)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 96, elements: !136)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !493, line: 52, size: 96, elements: !494)
!493 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!494 = !{!495, !496, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !492, file: !493, line: 53, baseType: !22, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !493, line: 54, baseType: !363, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !492, file: !493, line: 55, baseType: !498, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !499, line: 151, baseType: !500)
!499 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !499, line: 149, size: 32, elements: !501)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !500, file: !499, line: 150, baseType: !121, size: 32)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 96, elements: !136)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !507, file: !539, line: 39, type: !202, isLocal: true, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !509, globals: !538, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!509 = !{!510, !102, !103, !526, !202}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !512, line: 1168, baseType: !513)
!512 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !512, line: 1155, size: 352, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !513, file: !512, line: 1157, baseType: !124, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !513, file: !512, line: 1158, baseType: !120, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !513, file: !512, line: 1159, baseType: !120, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !513, file: !512, line: 1160, baseType: !120, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !513, file: !512, line: 1161, baseType: !120, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !513, file: !512, line: 1162, baseType: !120, size: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !513, file: !512, line: 1163, baseType: !120, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !513, file: !512, line: 1164, baseType: !120, size: 32, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !513, file: !512, line: 1165, baseType: !120, size: 32, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !513, file: !512, line: 1166, baseType: !120, size: 32, offset: 288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !513, file: !512, line: 1167, baseType: !120, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !529, line: 27, size: 96, elements: !530)
!529 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !528, file: !529, line: 29, baseType: !121, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !529, line: 31, baseType: !192, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !528, file: !529, line: 37, baseType: !534, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !499, line: 146, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !499, line: 141, size: 32, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !535, file: !499, line: 143, baseType: !121, size: 32)
!538 = !{!505}
!539 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !542, file: !549, line: 21, type: !106, isLocal: true, isDefinition: true)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !544, globals: !548, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!544 = !{!545, !103, !102}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !547, line: 22, baseType: !103)
!547 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !{!540}
!549 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !552, file: !557, line: 13, type: !574, isLocal: true, isDefinition: true)
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !554, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!554 = !{!555, !550}
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "mpu_config", scope: !552, file: !557, line: 37, type: !558, isLocal: false, isDefinition: true)
!557 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !529, line: 41, size: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !559, file: !529, line: 43, baseType: !121, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !559, file: !529, line: 45, baseType: !563, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !529, line: 27, size: 96, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !565, file: !529, line: 29, baseType: !121, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !529, line: 31, baseType: !192, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !565, file: !529, line: 37, baseType: !570, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !499, line: 146, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !499, line: 141, size: 32, elements: !572)
!572 = !{!573}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !571, file: !499, line: 143, baseType: !121, size: 32)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 192, elements: !404)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "debug_hook_in", scope: !577, file: !581, line: 43, type: !773, isLocal: true, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, retainedTypes: !588, globals: !668, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!579 = !{!30, !580}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 214, baseType: !32, size: 32, elements: !582)
!581 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = !{!583, !584, !585, !586, !587}
!583 = !DIEnumerator(name: "ESC_ESC", value: 0)
!584 = !DIEnumerator(name: "ESC_ANSI", value: 1)
!585 = !DIEnumerator(name: "ESC_ANSI_FIRST", value: 2)
!586 = !DIEnumerator(name: "ESC_ANSI_VAL", value: 3)
!587 = !DIEnumerator(name: "ESC_ANSI_VAL_2", value: 4)
!588 = !{!102, !103, !589, !32, !24}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !222, line: 336, size: 608, elements: !592)
!592 = !{!593, !612, !616, !620, !633, !638, !642, !646, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !591, file: !222, line: 365, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{!103, !597, !243}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !600)
!600 = !{!601, !602, !603, !604, !610, !611}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !189, line: 380, baseType: !192, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !599, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !599, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !599, file: !189, line: 386, baseType: !605, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !606, file: !189, line: 359, baseType: !202, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !606, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !599, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !599, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !591, file: !222, line: 366, baseType: !613, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !597, !203}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !591, file: !222, line: 374, baseType: !617, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{!103, !597}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !591, file: !222, line: 377, baseType: !621, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DISubroutineType(types: !623)
!623 = !{!103, !597, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !222, line: 122, size: 64, elements: !627)
!627 = !{!628, !629, !630, !631, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !626, file: !222, line: 123, baseType: !121, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !626, file: !222, line: 124, baseType: !202, size: 8, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !626, file: !222, line: 125, baseType: !202, size: 8, offset: 40)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !626, file: !222, line: 126, baseType: !202, size: 8, offset: 48)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !626, file: !222, line: 127, baseType: !202, size: 8, offset: 56)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !591, file: !222, line: 379, baseType: !634, size: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{!103, !597, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !591, file: !222, line: 384, baseType: !639, size: 32, offset: 160)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DISubroutineType(types: !641)
!641 = !{!103, !597, !274, !103}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !591, file: !222, line: 393, baseType: !643, size: 32, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DISubroutineType(types: !645)
!645 = !{!103, !597, !280, !281}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !591, file: !222, line: 402, baseType: !647, size: 32, offset: 224)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !597}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !591, file: !222, line: 405, baseType: !647, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !591, file: !222, line: 408, baseType: !617, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !591, file: !222, line: 411, baseType: !647, size: 32, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !591, file: !222, line: 414, baseType: !647, size: 32, offset: 352)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !591, file: !222, line: 417, baseType: !617, size: 32, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !591, file: !222, line: 420, baseType: !617, size: 32, offset: 416)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !591, file: !222, line: 423, baseType: !647, size: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !591, file: !222, line: 426, baseType: !647, size: 32, offset: 480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !591, file: !222, line: 429, baseType: !617, size: 32, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !591, file: !222, line: 432, baseType: !617, size: 32, offset: 544)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !591, file: !222, line: 435, baseType: !661, size: 32, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !597, !664, !102}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !222, line: 142, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !597, !102}
!668 = !{!669, !575, !676, !718, !720, !726, !733, !736, !761, !765, !767, !769, !771}
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !577, file: !581, line: 603, type: !671, isLocal: true, isDefinition: true, align: 32)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !672, file: !180, line: 60, baseType: !617, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !672, file: !180, line: 65, baseType: !597, size: 32, offset: 32)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "avail_queue", scope: !577, file: !581, line: 108, type: !678, isLocal: true, isDefinition: true)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !319, line: 2208, size: 128, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !679, file: !319, line: 2209, baseType: !682, size: 128)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !319, line: 1709, size: 128, elements: !683)
!683 = !{!684, !697, !699}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !682, file: !319, line: 1710, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !686, line: 46, baseType: !687)
!686 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !686, line: 41, size: 64, elements: !688)
!688 = !{!689, !696}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !687, file: !686, line: 42, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !686, line: 39, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !686, line: 35, size: 32, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !692, file: !686, line: 36, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !686, line: 32, baseType: !121)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !687, file: !686, line: 43, baseType: !690, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !682, file: !319, line: 1711, baseType: !698, offset: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !479, line: 43, elements: !480)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !682, file: !319, line: 1712, baseType: !700, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !323, line: 233, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 231, size: 64, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !701, file: !323, line: 232, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !328, line: 48, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !328, line: 37, size: 64, elements: !706)
!706 = !{!707, !713}
!707 = !DIDerivedType(tag: DW_TAG_member, scope: !705, file: !328, line: 38, baseType: !708, size: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !705, file: !328, line: 38, size: 32, elements: !709)
!709 = !{!710, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !708, file: !328, line: 39, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !708, file: !328, line: 40, baseType: !711, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, scope: !705, file: !328, line: 42, baseType: !714, size: 32, offset: 32)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !705, file: !328, line: 42, size: 32, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !714, file: !328, line: 43, baseType: !711, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !714, file: !328, line: 44, baseType: !711, size: 32)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "lines_queue", scope: !577, file: !581, line: 109, type: !678, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "completion_cb", scope: !577, file: !581, line: 110, type: !722, isLocal: true, isDefinition: true)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DISubroutineType(types: !724)
!724 = !{!202, !725, !202}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "debug_hook_out", scope: !577, file: !581, line: 54, type: !728, isLocal: true, isDefinition: true)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_console_out_debug_hook_t", file: !730, line: 40, baseType: !731)
!730 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/uart_console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = !DISubroutineType(types: !732)
!732 = !{!103, !194}
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !577, file: !581, line: 38, type: !735, isLocal: true, isDefinition: true)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "cmd", scope: !738, file: !581, line: 435, type: !749, isLocal: true, isDefinition: true)
!738 = distinct !DISubprogram(name: "uart_console_isr", scope: !581, file: !581, line: 428, type: !666, scopeLine: 429, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !577, retainedNodes: !739)
!739 = !{!740, !741, !742, !744, !745}
!740 = !DILocalVariable(name: "unused", arg: 1, scope: !738, file: !581, line: 428, type: !597)
!741 = !DILocalVariable(name: "user_data", arg: 2, scope: !738, file: !581, line: 428, type: !102)
!742 = !DILocalVariable(name: "byte", scope: !743, file: !581, line: 436, type: !202)
!743 = distinct !DILexicalBlock(scope: !738, file: !581, line: 434, column: 48)
!744 = !DILocalVariable(name: "rx", scope: !743, file: !581, line: 437, type: !103)
!745 = !DILocalVariable(name: "ret", scope: !746, file: !581, line: 461, type: !102)
!746 = distinct !DILexicalBlock(scope: !747, file: !581, line: 461, column: 10)
!747 = distinct !DILexicalBlock(scope: !748, file: !581, line: 460, column: 13)
!748 = distinct !DILexicalBlock(scope: !743, file: !581, line: 460, column: 7)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "console_input", file: !751, line: 21, size: 1088, elements: !752)
!751 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!752 = !{!753, !756, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !750, file: !751, line: 23, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !755)
!755 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "is_mcumgr", scope: !750, file: !751, line: 25, baseType: !202, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !750, file: !751, line: 27, baseType: !758, size: 1024, offset: 40)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1024, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 128)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "esc_state", scope: !577, file: !581, line: 228, type: !763, isLocal: true, isDefinition: true)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !764, line: 22, baseType: !755)
!764 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "ansi_val", scope: !577, file: !581, line: 229, type: !32, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "ansi_val_2", scope: !577, file: !581, line: 229, type: !32, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "cur", scope: !577, file: !581, line: 230, type: !202, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "end", scope: !577, file: !581, line: 230, type: !202, isLocal: true, isDefinition: true)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_console_in_debug_hook_t", file: !730, line: 45, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DISubroutineType(types: !776)
!776 = !{!103, !202}
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !779, file: !784, line: 7, type: !785, isLocal: false, isDefinition: true, align: 16)
!779 = distinct !DICompileUnit(language: DW_LANG_C99, file: !780, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !781, splitDebugInlining: false, nameTableKind: None)
!780 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!781 = !{!777, !782}
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !779, file: !784, line: 12, type: !785, isLocal: false, isDefinition: true, align: 16)
!784 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 48, elements: !152)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !788, file: !849, line: 234, type: !883, isLocal: true, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !790, globals: !846, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!790 = !{!791, !121}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !794, line: 134, size: 128, elements: !795)
!794 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!795 = !{!796, !816, !821, !841}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !793, file: !794, line: 135, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !794, line: 113, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{!103, !801, !202}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !804)
!804 = !{!805, !806, !807, !808, !814, !815}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !803, file: !189, line: 380, baseType: !192, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !803, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !803, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !803, file: !189, line: 386, baseType: !809, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !810, file: !189, line: 359, baseType: !202, size: 8)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !810, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !803, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !803, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !793, file: !794, line: 136, baseType: !817, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !794, line: 119, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!103, !801}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !793, file: !794, line: 137, baseType: !822, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !794, line: 125, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!103, !801, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !794, line: 88, size: 128, elements: !829)
!829 = !{!830, !835, !840}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !828, file: !794, line: 90, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !794, line: 72, size: 64, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !831, file: !794, line: 74, baseType: !121, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !831, file: !794, line: 76, baseType: !121, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !828, file: !794, line: 92, baseType: !836, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !794, line: 85, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !801, !103}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !794, line: 104, baseType: !202, size: 8, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !793, file: !794, line: 138, baseType: !842, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !794, line: 132, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!103, !801, !103}
!846 = !{!847, !851, !853, !860, !786, !862, !864, !872}
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !788, file: !849, line: 256, type: !850, isLocal: false, isDefinition: true, align: 16)
!849 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 80, elements: !156)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !788, file: !849, line: 256, type: !802, isLocal: false, isDefinition: true, align: 32)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !788, file: !849, line: 256, type: !855, isLocal: true, isDefinition: true, align: 32)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !856, file: !180, line: 60, baseType: !818, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !856, file: !180, line: 65, baseType: !801, size: 32, offset: 32)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !788, file: !849, line: 256, type: !810, isLocal: true, isDefinition: true, align: 8)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !788, file: !849, line: 227, type: !792, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !788, file: !849, line: 45, type: !866, isLocal: true, isDefinition: true)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !849, line: 38, size: 96, elements: !867)
!867 = !{!868, !869, !870, !871}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !866, file: !849, line: 39, baseType: !836, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !866, file: !849, line: 40, baseType: !121, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !866, file: !849, line: 41, baseType: !205, size: 8, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !866, file: !849, line: 42, baseType: !205, size: 8, offset: 72)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !874, file: !849, line: 240, type: !877, isLocal: true, isDefinition: true, align: 32)
!874 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !849, file: !849, line: 238, type: !875, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !480)
!875 = !DISubroutineType(types: !876)
!876 = !{null}
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !878)
!878 = !{!879, !880, !881, !882}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !877, file: !10, line: 55, baseType: !351, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !877, file: !10, line: 57, baseType: !351, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !877, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !877, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !849, line: 34, size: 32, elements: !885)
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !884, file: !849, line: 35, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !889, line: 45, baseType: !890)
!889 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !889, line: 41, size: 96, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !890, file: !889, line: 42, baseType: !120, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !890, file: !889, line: 43, baseType: !120, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !890, file: !889, line: 44, baseType: !124, size: 32, offset: 64)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !897, file: !1015, line: 494, type: !1075, isLocal: true, isDefinition: true)
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !899, retainedTypes: !932, globals: !1012, splitDebugInlining: false, nameTableKind: None)
!898 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/console/getchar")
!899 = !{!900, !907, !913, !920, !925}
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !222, line: 47, baseType: !32, size: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906}
!902 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!903 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!904 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!905 = !DIEnumerator(name: "UART_BREAK", value: 8)
!906 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!907 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !222, line: 84, baseType: !32, size: 32, elements: !908)
!908 = !{!909, !910, !911, !912}
!909 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!910 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!911 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!912 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !222, line: 92, baseType: !32, size: 32, elements: !914)
!914 = !{!915, !916, !917, !918, !919}
!915 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!916 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!917 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!918 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!919 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !222, line: 107, baseType: !32, size: 32, elements: !921)
!921 = !{!922, !923, !924}
!922 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!923 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!924 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !222, line: 75, baseType: !32, size: 32, elements: !926)
!926 = !{!927, !928, !929, !930, !931}
!927 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!928 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!929 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!930 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!931 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!932 = !{!933, !102, !203, !121}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !222, line: 336, size: 608, elements: !936)
!936 = !{!937, !956, !960, !964, !977, !982, !986, !990, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !935, file: !222, line: 365, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DISubroutineType(types: !940)
!940 = !{!103, !941, !243}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !944)
!944 = !{!945, !946, !947, !948, !954, !955}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !943, file: !189, line: 380, baseType: !192, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !943, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !943, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !943, file: !189, line: 386, baseType: !949, size: 32, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !950, file: !189, line: 359, baseType: !202, size: 8)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !950, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !943, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !943, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !935, file: !222, line: 366, baseType: !957, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !941, !203}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !935, file: !222, line: 374, baseType: !961, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{!103, !941}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !935, file: !222, line: 377, baseType: !965, size: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{!103, !941, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !222, line: 122, size: 64, elements: !971)
!971 = !{!972, !973, !974, !975, !976}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !970, file: !222, line: 123, baseType: !121, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !970, file: !222, line: 124, baseType: !202, size: 8, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !970, file: !222, line: 125, baseType: !202, size: 8, offset: 40)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !970, file: !222, line: 126, baseType: !202, size: 8, offset: 48)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !970, file: !222, line: 127, baseType: !202, size: 8, offset: 56)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !935, file: !222, line: 379, baseType: !978, size: 32, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{!103, !941, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !935, file: !222, line: 384, baseType: !983, size: 32, offset: 160)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DISubroutineType(types: !985)
!985 = !{!103, !941, !274, !103}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !935, file: !222, line: 393, baseType: !987, size: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DISubroutineType(types: !989)
!989 = !{!103, !941, !280, !281}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !935, file: !222, line: 402, baseType: !991, size: 32, offset: 224)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !941}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !935, file: !222, line: 405, baseType: !991, size: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !935, file: !222, line: 408, baseType: !961, size: 32, offset: 288)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !935, file: !222, line: 411, baseType: !991, size: 32, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !935, file: !222, line: 414, baseType: !991, size: 32, offset: 352)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !935, file: !222, line: 417, baseType: !961, size: 32, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !935, file: !222, line: 420, baseType: !961, size: 32, offset: 416)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !935, file: !222, line: 423, baseType: !991, size: 32, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !935, file: !222, line: 426, baseType: !991, size: 32, offset: 480)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !935, file: !222, line: 429, baseType: !961, size: 32, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !935, file: !222, line: 432, baseType: !961, size: 32, offset: 544)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !935, file: !222, line: 435, baseType: !1005, size: 32, offset: 576)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !941, !1008, !102}
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !222, line: 142, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !941, !102}
!1012 = !{!1013, !1019, !1021, !1028, !1030, !1032, !895, !1039, !1058, !1061, !1064}
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !897, file: !1015, line: 494, type: !1016, isLocal: false, isDefinition: true, align: 16)
!1015 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !1017)
!1017 = !{!1018}
!1018 = !DISubrange(count: 6)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !897, file: !1015, line: 494, type: !942, isLocal: false, isDefinition: true, align: 32)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !897, file: !1015, line: 494, type: !1023, isLocal: true, isDefinition: true, align: 32)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1024, file: !180, line: 60, baseType: !961, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1024, file: !180, line: 65, baseType: !941, size: 32, offset: 32)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !897, file: !1015, line: 494, type: !950, isLocal: true, isDefinition: true, align: 8)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !897, file: !1015, line: 419, type: !934, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
