; ModuleID = 'build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "count_mutex", scope: !27, file: !116, line: 16, type: !262, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/condvar/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !143, !154}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "count_threshold_cv", scope: !27, file: !116, line: 17, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/condvar/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !116, line: 14, type: !109, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 21, type: !145, isLocal: false, isDefinition: true, align: 512)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 26112, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152, !153}
!152 = !DISubrange(count: 3)
!153 = !DISubrange(count: 1088)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 23, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 3840, elements: !261)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !158, line: 245, size: 1280, elements: !159)
!158 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!159 = !{!160, !209, !222, !223, !224, !228, !229, !237, !256}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !157, file: !158, line: 247, baseType: !161, size: 384)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !158, line: 57, size: 384, elements: !162)
!162 = !{!163, !177, !179, !182, !183, !196, !197, !198}
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !158, line: 60, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !158, line: 60, size: 64, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !164, file: !158, line: 61, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !164, file: !158, line: 62, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !170, line: 49, size: 64, elements: !171)
!170 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !169, file: !170, line: 50, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !175)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !161, file: !158, line: 68, baseType: !178, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !161, file: !158, line: 71, baseType: !180, size: 8, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !181)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !161, file: !158, line: 74, baseType: !180, size: 8, offset: 104)
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !158, line: 90, baseType: !184, size: 16, offset: 112)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !158, line: 90, size: 16, elements: !185)
!185 = !{!186, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !184, file: !158, line: 91, baseType: !187, size: 16)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !184, file: !158, line: 91, size: 16, elements: !188)
!188 = !{!189, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !187, file: !158, line: 96, baseType: !190, size: 8)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !191)
!191 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !187, file: !158, line: 97, baseType: !180, size: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !184, file: !158, line: 100, baseType: !194, size: 16)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !195)
!195 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !161, file: !158, line: 107, baseType: !110, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !161, file: !158, line: 127, baseType: !107, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !161, file: !158, line: 131, baseType: !199, size: 192, offset: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !200)
!200 = !{!201, !202, !208}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !122, line: 245, baseType: !167, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !199, file: !122, line: 246, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !199, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !157, file: !158, line: 250, baseType: !210, size: 288, offset: 384)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !211, line: 25, size: 288, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !210, file: !211, line: 26, baseType: !110, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !210, file: !211, line: 27, baseType: !110, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !210, file: !211, line: 28, baseType: !110, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !210, file: !211, line: 29, baseType: !110, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !210, file: !211, line: 30, baseType: !110, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !210, file: !211, line: 31, baseType: !110, size: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !210, file: !211, line: 32, baseType: !110, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !210, file: !211, line: 33, baseType: !110, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !210, file: !211, line: 34, baseType: !110, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !157, file: !158, line: 253, baseType: !107, size: 32, offset: 672)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !157, file: !158, line: 256, baseType: !121, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !158, line: 279, baseType: !225, size: 256, offset: 768)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !157, file: !158, line: 294, baseType: !109, size: 32, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !157, file: !158, line: 300, baseType: !230, size: 96, offset: 1056)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !158, line: 149, size: 96, elements: !231)
!231 = !{!232, !233, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !230, file: !158, line: 153, baseType: !22, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !230, file: !158, line: 162, baseType: !234, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !235, line: 214, baseType: !32)
!235 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !230, file: !158, line: 168, baseType: !234, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !157, file: !158, line: 325, baseType: !238, size: 32, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !240)
!240 = !{!241, !250, !251}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !118, line: 5074, baseType: !242, size: 96)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !243, line: 56, size: 96, elements: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !{!245, !248, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !242, file: !243, line: 57, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !243, line: 57, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !242, file: !243, line: 58, baseType: !107, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !242, file: !243, line: 59, baseType: !234, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !239, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !239, file: !118, line: 5076, baseType: !252, size: 32, offset: 160)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !253, line: 43, size: 32, elements: !254)
!253 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !252, file: !253, line: 52, baseType: !22, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !157, file: !158, line: 343, baseType: !257, size: 64, offset: 1184)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !211, line: 60, size: 64, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !257, file: !211, line: 63, baseType: !110, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !257, file: !211, line: 66, baseType: !110, size: 32, offset: 32)
!261 = !{!152}
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !263)
!263 = !{!264, !265, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !262, file: !118, line: 2722, baseType: !121, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !262, file: !118, line: 2724, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !262, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !262, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !271, file: !288, line: 18, type: !289, isLocal: false, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !273, globals: !287, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar")
!273 = !{!22, !107, !24, !274, !276, !278, !234, !109, !281, !282, !283, !284, !285, !286, !194, !279}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!287 = !{!269}
!288 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !292)
!291 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 17, baseType: !279, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !290, file: !291, line: 18, baseType: !180, size: 8, offset: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_char_out", scope: !297, file: !301, line: 54, type: !302, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !299, globals: !300, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar")
!299 = !{!107, !109}
!300 = !{!295}
!301 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!109, !109}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !307, file: !840, line: 149, type: !841, isLocal: true, isDefinition: true, align: 32)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !309, globals: !839, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar")
!309 = !{!107, !109, !310, !444, !527}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !312, line: 352, baseType: !313)
!312 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 339, size: 448, elements: !314)
!314 = !{!315, !331, !343, !353, !364, !374, !382, !392, !403, !413, !423, !433}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !313, file: !312, line: 340, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !312, line: 57, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 44, size: 32, elements: !320)
!320 = !{!321, !330}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !319, file: !312, line: 55, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !319, file: !312, line: 45, size: 32, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !322, file: !312, line: 47, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !322, file: !312, line: 49, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !322, file: !312, line: 50, baseType: !110, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !322, file: !312, line: 51, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !322, file: !312, line: 52, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !322, file: !312, line: 53, baseType: !110, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !319, file: !312, line: 56, baseType: !110, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !313, file: !312, line: 341, baseType: !332, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !312, line: 124, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 114, size: 32, elements: !335)
!335 = !{!336, !342}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !334, file: !312, line: 122, baseType: !337, size: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !312, line: 115, size: 32, elements: !338)
!338 = !{!339, !340, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !337, file: !312, line: 117, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !337, file: !312, line: 118, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !337, file: !312, line: 120, baseType: !110, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !334, file: !312, line: 123, baseType: !110, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !313, file: !312, line: 342, baseType: !344, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !312, line: 161, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 155, size: 32, elements: !347)
!347 = !{!348, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !346, file: !312, line: 159, baseType: !349, size: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !346, file: !312, line: 156, size: 32, elements: !350)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !349, file: !312, line: 157, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !346, file: !312, line: 160, baseType: !110, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !313, file: !312, line: 343, baseType: !354, size: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !312, line: 179, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 173, size: 32, elements: !358)
!358 = !{!359, !363}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !357, file: !312, line: 177, baseType: !360, size: 32)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !357, file: !312, line: 174, size: 32, elements: !361)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !360, file: !312, line: 175, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !357, file: !312, line: 178, baseType: !110, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !313, file: !312, line: 344, baseType: !365, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !312, line: 197, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 191, size: 32, elements: !368)
!368 = !{!369, !373}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !367, file: !312, line: 195, baseType: !370, size: 32)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !367, file: !312, line: 192, size: 32, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !370, file: !312, line: 193, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !367, file: !312, line: 196, baseType: !110, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !313, file: !312, line: 345, baseType: !375, size: 96, offset: 160)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 96, elements: !380)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !377, line: 53, baseType: !378)
!377 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !180)
!380 = !{!381}
!381 = !DISubrange(count: 12)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !313, file: !312, line: 346, baseType: !383, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !312, line: 216, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 210, size: 32, elements: !386)
!386 = !{!387, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !385, file: !312, line: 214, baseType: !388, size: 32)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !385, file: !312, line: 211, size: 32, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !388, file: !312, line: 212, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !385, file: !312, line: 215, baseType: !110, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !313, file: !312, line: 347, baseType: !393, size: 32, offset: 288)
!393 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !312, line: 236, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 228, size: 32, elements: !396)
!396 = !{!397, !402}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !395, file: !312, line: 234, baseType: !398, size: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !395, file: !312, line: 229, size: 32, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !398, file: !312, line: 231, baseType: !110, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !398, file: !312, line: 233, baseType: !110, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !395, file: !312, line: 235, baseType: !110, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !313, file: !312, line: 348, baseType: !404, size: 32, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !312, line: 266, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 260, size: 32, elements: !407)
!407 = !{!408, !412}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !406, file: !312, line: 264, baseType: !409, size: 32)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !406, file: !312, line: 261, size: 32, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !409, file: !312, line: 262, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !406, file: !312, line: 265, baseType: !110, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !313, file: !312, line: 349, baseType: !414, size: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !312, line: 291, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 285, size: 32, elements: !417)
!417 = !{!418, !422}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !416, file: !312, line: 289, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !416, file: !312, line: 286, size: 32, elements: !420)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !419, file: !312, line: 287, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !416, file: !312, line: 290, baseType: !110, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !313, file: !312, line: 350, baseType: !424, size: 32, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !312, line: 309, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 303, size: 32, elements: !427)
!427 = !{!428, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !426, file: !312, line: 307, baseType: !429, size: 32)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !426, file: !312, line: 304, size: 32, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !429, file: !312, line: 305, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !426, file: !312, line: 308, baseType: !110, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !313, file: !312, line: 351, baseType: !434, size: 32, offset: 416)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !312, line: 326, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !312, line: 321, size: 32, elements: !438)
!438 = !{!439, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !437, file: !312, line: 324, baseType: !440, size: 32)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !437, file: !312, line: 322, size: 32, elements: !441)
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !440, file: !312, line: 323, baseType: !110, size: 32, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !437, file: !312, line: 325, baseType: !110, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !446, line: 267, baseType: !447)
!446 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 259, size: 2560, elements: !448)
!448 = !{!449, !459, !461, !488, !492, !510, !514}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !447, file: !446, line: 260, baseType: !450, size: 8)
!450 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !446, line: 50, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !446, line: 44, size: 8, elements: !453)
!453 = !{!454, !458}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !452, file: !446, line: 48, baseType: !455, size: 8)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !446, line: 45, size: 8, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !455, file: !446, line: 46, baseType: !180, size: 1, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !452, file: !446, line: 49, baseType: !180, size: 8)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !447, file: !446, line: 261, baseType: !460, size: 24, offset: 8)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 24, elements: !261)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !447, file: !446, line: 262, baseType: !462, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !446, line: 86, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !446, line: 62, size: 32, elements: !466)
!466 = !{!467, !483, !487}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !465, file: !446, line: 79, baseType: !468, size: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !465, file: !446, line: 63, size: 32, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !468, file: !446, line: 64, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !468, file: !446, line: 66, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !468, file: !446, line: 67, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !468, file: !446, line: 68, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !468, file: !446, line: 69, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !468, file: !446, line: 70, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !468, file: !446, line: 71, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !468, file: !446, line: 72, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !468, file: !446, line: 73, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !468, file: !446, line: 74, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !468, file: !446, line: 75, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !468, file: !446, line: 76, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !468, file: !446, line: 77, baseType: !110, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !465, file: !446, line: 84, baseType: !484, size: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !465, file: !446, line: 80, size: 32, elements: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !484, file: !446, line: 82, baseType: !110, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !465, file: !446, line: 85, baseType: !110, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !447, file: !446, line: 263, baseType: !489, size: 192, offset: 64)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 192, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 24)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !447, file: !446, line: 264, baseType: !493, size: 384, offset: 256)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 384, elements: !380)
!494 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !446, line: 163, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !446, line: 149, size: 32, elements: !497)
!497 = !{!498, !509}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !496, file: !446, line: 161, baseType: !499, size: 32)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !496, file: !446, line: 150, size: 32, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !499, file: !446, line: 151, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !499, file: !446, line: 153, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !499, file: !446, line: 154, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !499, file: !446, line: 155, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !499, file: !446, line: 156, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !499, file: !446, line: 157, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !499, file: !446, line: 158, baseType: !110, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !499, file: !446, line: 160, baseType: !110, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !496, file: !446, line: 162, baseType: !110, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !447, file: !446, line: 265, baseType: !511, size: 384, offset: 640)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 384, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 48)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !447, file: !446, line: 266, baseType: !515, size: 1536, offset: 1024)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 1536, elements: !512)
!516 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !446, line: 218, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !446, line: 209, size: 32, elements: !519)
!519 = !{!520, !526}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !518, file: !446, line: 216, baseType: !521, size: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !446, line: 210, size: 32, elements: !522)
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !521, file: !446, line: 211, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !521, file: !446, line: 213, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !521, file: !446, line: 214, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !518, file: !446, line: 217, baseType: !110, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !529, line: 788, baseType: !530)
!529 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 771, size: 704, elements: !531)
!531 = !{!532, !547, !548, !579, !610, !643, !678, !700, !712, !713, !730, !731, !743, !755, !768, !769}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !530, file: !529, line: 772, baseType: !533, size: 8)
!533 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !529, line: 55, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 44, size: 8, elements: !536)
!536 = !{!537, !542, !546}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !535, file: !529, line: 49, baseType: !538, size: 8)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !529, line: 45, size: 8, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !538, file: !529, line: 46, baseType: !180, size: 1, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !538, file: !529, line: 47, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !535, file: !529, line: 53, baseType: !543, size: 8)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !529, line: 50, size: 8, elements: !544)
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !543, file: !529, line: 51, baseType: !180, size: 2, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !535, file: !529, line: 54, baseType: !180, size: 8)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !530, file: !529, line: 773, baseType: !460, size: 24, offset: 8)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !530, file: !529, line: 774, baseType: !549, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !529, line: 102, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 72, size: 32, elements: !552)
!552 = !{!553, !573, !578}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !551, file: !529, line: 95, baseType: !554, size: 32)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !529, line: 73, size: 32, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !554, file: !529, line: 74, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !554, file: !529, line: 75, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !554, file: !529, line: 76, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !554, file: !529, line: 77, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !554, file: !529, line: 79, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !554, file: !529, line: 80, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !554, file: !529, line: 81, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !554, file: !529, line: 82, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !554, file: !529, line: 83, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !554, file: !529, line: 85, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !554, file: !529, line: 86, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !554, file: !529, line: 87, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !554, file: !529, line: 88, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !554, file: !529, line: 90, baseType: !110, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !554, file: !529, line: 91, baseType: !110, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !554, file: !529, line: 92, baseType: !110, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !554, file: !529, line: 93, baseType: !110, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !551, file: !529, line: 100, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !529, line: 96, size: 32, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !574, file: !529, line: 97, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !574, file: !529, line: 98, baseType: !110, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !551, file: !529, line: 101, baseType: !110, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !530, file: !529, line: 775, baseType: !580, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !529, line: 182, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 152, size: 32, elements: !583)
!583 = !{!584, !604, !609}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !582, file: !529, line: 175, baseType: !585, size: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !582, file: !529, line: 153, size: 32, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !585, file: !529, line: 154, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !585, file: !529, line: 155, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !585, file: !529, line: 156, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !585, file: !529, line: 157, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !585, file: !529, line: 159, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !585, file: !529, line: 160, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !585, file: !529, line: 161, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !585, file: !529, line: 162, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !585, file: !529, line: 163, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !585, file: !529, line: 165, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !585, file: !529, line: 166, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !585, file: !529, line: 167, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !585, file: !529, line: 168, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !585, file: !529, line: 170, baseType: !110, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !585, file: !529, line: 171, baseType: !110, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !585, file: !529, line: 172, baseType: !110, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !585, file: !529, line: 173, baseType: !110, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !582, file: !529, line: 180, baseType: !605, size: 32)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !582, file: !529, line: 176, size: 32, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !605, file: !529, line: 177, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !605, file: !529, line: 178, baseType: !110, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !582, file: !529, line: 181, baseType: !110, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !530, file: !529, line: 776, baseType: !611, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !529, line: 262, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 232, size: 32, elements: !614)
!614 = !{!615, !637, !642}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !613, file: !529, line: 255, baseType: !616, size: 32)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !613, file: !529, line: 233, size: 32, elements: !617)
!617 = !{!618, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !616, file: !529, line: 234, baseType: !619, size: 1, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !616, file: !529, line: 235, baseType: !619, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !616, file: !529, line: 236, baseType: !619, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !616, file: !529, line: 237, baseType: !619, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !616, file: !529, line: 239, baseType: !619, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !616, file: !529, line: 240, baseType: !619, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !616, file: !529, line: 241, baseType: !619, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !616, file: !529, line: 242, baseType: !619, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !616, file: !529, line: 243, baseType: !619, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !616, file: !529, line: 245, baseType: !619, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !616, file: !529, line: 246, baseType: !619, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !616, file: !529, line: 247, baseType: !619, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !616, file: !529, line: 248, baseType: !619, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !616, file: !529, line: 250, baseType: !619, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !616, file: !529, line: 251, baseType: !619, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !616, file: !529, line: 252, baseType: !619, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !616, file: !529, line: 253, baseType: !619, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !613, file: !529, line: 260, baseType: !638, size: 32)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !613, file: !529, line: 256, size: 32, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !638, file: !529, line: 257, baseType: !619, size: 2, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !638, file: !529, line: 258, baseType: !619, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !613, file: !529, line: 261, baseType: !110, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !530, file: !529, line: 777, baseType: !644, size: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !529, line: 345, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 312, size: 32, elements: !648)
!648 = !{!649, !671, !677}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !647, file: !529, line: 337, baseType: !650, size: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !529, line: 313, size: 32, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !650, file: !529, line: 314, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !650, file: !529, line: 315, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !650, file: !529, line: 316, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !650, file: !529, line: 317, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !650, file: !529, line: 318, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !650, file: !529, line: 319, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !650, file: !529, line: 321, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !650, file: !529, line: 322, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !650, file: !529, line: 323, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !650, file: !529, line: 324, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !650, file: !529, line: 325, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !650, file: !529, line: 327, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !650, file: !529, line: 328, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !650, file: !529, line: 329, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !650, file: !529, line: 330, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !650, file: !529, line: 332, baseType: !110, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !650, file: !529, line: 333, baseType: !110, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !650, file: !529, line: 334, baseType: !110, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !650, file: !529, line: 335, baseType: !110, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !647, file: !529, line: 343, baseType: !672, size: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !529, line: 338, size: 32, elements: !673)
!673 = !{!674, !675, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !672, file: !529, line: 339, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !672, file: !529, line: 340, baseType: !110, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !672, file: !529, line: 341, baseType: !110, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !647, file: !529, line: 344, baseType: !110, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !530, file: !529, line: 778, baseType: !679, size: 64, offset: 160)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 64, elements: !175)
!680 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !529, line: 422, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 402, size: 32, elements: !683)
!683 = !{!684, !699}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !682, file: !529, line: 420, baseType: !685, size: 32)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !682, file: !529, line: 403, size: 32, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !685, file: !529, line: 405, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !685, file: !529, line: 406, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !685, file: !529, line: 408, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !685, file: !529, line: 409, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !685, file: !529, line: 410, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !685, file: !529, line: 411, baseType: !110, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !685, file: !529, line: 412, baseType: !110, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !685, file: !529, line: 413, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !685, file: !529, line: 414, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !685, file: !529, line: 415, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !685, file: !529, line: 417, baseType: !110, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !685, file: !529, line: 418, baseType: !110, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !682, file: !529, line: 421, baseType: !110, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !530, file: !529, line: 779, baseType: !701, size: 8, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !529, line: 469, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 460, size: 8, elements: !704)
!704 = !{!705, !711}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !703, file: !529, line: 467, baseType: !706, size: 8)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !703, file: !529, line: 461, size: 8, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !706, file: !529, line: 463, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !706, file: !529, line: 465, baseType: !180, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !706, file: !529, line: 466, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !703, file: !529, line: 468, baseType: !180, size: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !530, file: !529, line: 780, baseType: !460, size: 24, offset: 232)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !530, file: !529, line: 781, baseType: !714, size: 8, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !529, line: 497, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 485, size: 8, elements: !717)
!717 = !{!718, !729}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !716, file: !529, line: 495, baseType: !719, size: 8)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !716, file: !529, line: 486, size: 8, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !719, file: !529, line: 487, baseType: !180, size: 1, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !719, file: !529, line: 488, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !719, file: !529, line: 489, baseType: !180, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !719, file: !529, line: 490, baseType: !180, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !719, file: !529, line: 491, baseType: !180, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !719, file: !529, line: 492, baseType: !180, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !719, file: !529, line: 493, baseType: !180, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !719, file: !529, line: 494, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !716, file: !529, line: 496, baseType: !180, size: 8)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !530, file: !529, line: 782, baseType: !460, size: 24, offset: 264)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !530, file: !529, line: 783, baseType: !732, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !529, line: 531, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 523, size: 32, elements: !735)
!735 = !{!736, !742}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !734, file: !529, line: 529, baseType: !737, size: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !734, file: !529, line: 524, size: 32, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !737, file: !529, line: 525, baseType: !110, size: 8, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !737, file: !529, line: 527, baseType: !110, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !737, file: !529, line: 528, baseType: !110, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !734, file: !529, line: 530, baseType: !110, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !530, file: !529, line: 784, baseType: !744, size: 32, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !529, line: 558, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 550, size: 32, elements: !747)
!747 = !{!748, !754}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !746, file: !529, line: 556, baseType: !749, size: 32)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !746, file: !529, line: 551, size: 32, elements: !750)
!750 = !{!751, !752, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !749, file: !529, line: 552, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !749, file: !529, line: 553, baseType: !110, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !749, file: !529, line: 555, baseType: !110, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !746, file: !529, line: 557, baseType: !110, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !530, file: !529, line: 785, baseType: !756, size: 8, offset: 352)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !529, line: 587, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 577, size: 8, elements: !759)
!759 = !{!760, !767}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !758, file: !529, line: 585, baseType: !761, size: 8)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !529, line: 578, size: 8, elements: !762)
!762 = !{!763, !764, !765, !766}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !761, file: !529, line: 580, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !761, file: !529, line: 581, baseType: !180, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !761, file: !529, line: 582, baseType: !180, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !761, file: !529, line: 583, baseType: !180, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !529, line: 586, baseType: !180, size: 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !530, file: !529, line: 786, baseType: !460, size: 24, offset: 360)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !530, file: !529, line: 787, baseType: !770, size: 320, offset: 384)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 320, elements: !175)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !529, line: 766, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 759, size: 160, elements: !773)
!773 = !{!774, !786, !787, !798, !815, !827}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !772, file: !529, line: 760, baseType: !775, size: 8)
!775 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !529, line: 614, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 605, size: 8, elements: !778)
!778 = !{!779, !785}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !777, file: !529, line: 612, baseType: !780, size: 8)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !777, file: !529, line: 606, size: 8, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !780, file: !529, line: 608, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !780, file: !529, line: 610, baseType: !180, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !780, file: !529, line: 611, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !777, file: !529, line: 613, baseType: !180, size: 8)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !772, file: !529, line: 761, baseType: !460, size: 24, offset: 8)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !772, file: !529, line: 762, baseType: !788, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !529, line: 638, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 630, size: 32, elements: !791)
!791 = !{!792, !797}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !790, file: !529, line: 636, baseType: !793, size: 32)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !790, file: !529, line: 631, size: 32, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !793, file: !529, line: 632, baseType: !110, size: 13, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !793, file: !529, line: 634, baseType: !110, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !790, file: !529, line: 637, baseType: !110, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !772, file: !529, line: 763, baseType: !799, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !529, line: 667, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 654, size: 32, elements: !802)
!802 = !{!803, !814}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !801, file: !529, line: 665, baseType: !804, size: 32)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !801, file: !529, line: 655, size: 32, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !804, file: !529, line: 656, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !804, file: !529, line: 657, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !804, file: !529, line: 658, baseType: !110, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !804, file: !529, line: 659, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !804, file: !529, line: 660, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !804, file: !529, line: 661, baseType: !110, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !804, file: !529, line: 662, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !804, file: !529, line: 663, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !801, file: !529, line: 666, baseType: !110, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !772, file: !529, line: 764, baseType: !816, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !529, line: 724, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 716, size: 32, elements: !820)
!820 = !{!821, !826}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !819, file: !529, line: 722, baseType: !822, size: 32)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !819, file: !529, line: 717, size: 32, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !822, file: !529, line: 719, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !822, file: !529, line: 720, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !819, file: !529, line: 723, baseType: !110, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !772, file: !529, line: 765, baseType: !828, size: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !529, line: 745, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 738, size: 32, elements: !832)
!832 = !{!833, !838}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !831, file: !529, line: 743, baseType: !834, size: 32)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !831, file: !529, line: 739, size: 32, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !834, file: !529, line: 740, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !834, file: !529, line: 741, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !831, file: !529, line: 744, baseType: !110, size: 32)
!839 = !{!305}
!840 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !843, line: 51, size: 64, elements: !844)
!843 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!844 = !{!845, !871}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !842, file: !843, line: 60, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{!109, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !852, line: 378, size: 192, elements: !853)
!852 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !{!854, !855, !856, !857, !864, !865}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !852, line: 380, baseType: !279, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !851, file: !852, line: 382, baseType: !13, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !851, file: !852, line: 384, baseType: !13, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !851, file: !852, line: 386, baseType: !858, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !852, line: 351, size: 16, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !859, file: !852, line: 359, baseType: !180, size: 8)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !859, file: !852, line: 364, baseType: !863, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!863 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !851, file: !852, line: 388, baseType: !107, size: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !851, file: !852, line: 396, baseType: !866, size: 32, offset: 160)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !852, line: 43, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !870)
!870 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !842, file: !843, line: 65, baseType: !849, size: 32, offset: 32)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !874, file: !881, line: 17, type: !1010, isLocal: false, isDefinition: true)
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !876, globals: !877, splitDebugInlining: false, nameTableKind: None)
!875 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/kernel/condition_variables/condvar")
!876 = !{!234, !109, !110, !107}
!877 = !{!872, !878, !1006}
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !880, file: !881, line: 198, type: !992, isLocal: true, isDefinition: true)
!880 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !881, file: !881, line: 175, type: !882, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !874, retainedNodes: !987)
!881 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = !DISubroutineType(types: !883)
!883 = !{null, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !158, line: 245, size: 1280, elements: !886)
!886 = !{!887, !945, !957, !958, !959, !960, !961, !967, !982}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !885, file: !158, line: 247, baseType: !888, size: 384)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !158, line: 57, size: 384, elements: !889)
!889 = !{!890, !914, !921, !922, !923, !932, !933, !934}
!890 = !DIDerivedType(tag: DW_TAG_member, scope: !888, file: !158, line: 60, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !158, line: 60, size: 64, elements: !892)
!892 = !{!893, !908}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !891, file: !158, line: 61, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !896)
!896 = !{!897, !903}
!897 = !DIDerivedType(tag: DW_TAG_member, scope: !895, file: !127, line: 38, baseType: !898, size: 32)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !895, file: !127, line: 38, size: 32, elements: !899)
!899 = !{!900, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !898, file: !127, line: 39, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !898, file: !127, line: 40, baseType: !901, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, scope: !895, file: !127, line: 42, baseType: !904, size: 32, offset: 32)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !895, file: !127, line: 42, size: 32, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !904, file: !127, line: 43, baseType: !901, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !904, file: !127, line: 44, baseType: !901, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !891, file: !158, line: 62, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !170, line: 49, size: 64, elements: !910)
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !909, file: !170, line: 50, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 64, elements: !175)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !888, file: !158, line: 68, baseType: !915, size: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
