; ModuleID = './build/wdt_feed_watchdog.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct._IOT_WDT_TypeDef = type { i32, i32, i32, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.hal_wdt_config_t = type { i32, i32 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !2, file: !3, line: 71, type: !79, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !62, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 121, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!10 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !12, line: 47, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!15 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!16 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!17 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!18 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!19 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!20 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!21 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!22 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!23 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!24 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!25 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!26 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!27 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!28 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!29 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!30 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!31 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!32 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!33 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!34 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!35 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!36 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!37 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!38 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!39 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!40 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!41 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!42 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!43 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!44 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!45 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!46 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!47 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!48 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!49 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!50 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!51 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!52 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!53 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!54 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!55 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!56 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!57 = !{!58, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !6, line: 116, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !12, line: 95, baseType: !11)
!62 = !{!0, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !2, file: !3, line: 67, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !66, line: 111, baseType: !67)
!66 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 109, size: 96, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !67, file: !66, line: 110, baseType: !70, size: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !66, line: 106, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 102, size: 96, elements: !72)
!72 = !{!73, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !71, file: !66, line: 103, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !71, file: !66, line: 104, baseType: !74, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !71, file: !66, line: 105, baseType: !74, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !6, line: 62, baseType: !7)
!81 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!82 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !85, file: !86, line: 43, type: !92, isLocal: true, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !87, globals: !97, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!87 = !{!88, !80, !90, !96}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 48, baseType: !94)
!93 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !95, line: 79, baseType: !7)
!95 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!97 = !{!83, !98}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !85, file: !86, line: 44, type: !92, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !102, file: !103, line: 54, type: !92, isLocal: false, isDefinition: true)
!102 = distinct !DICompileUnit(language: DW_LANG_C99, file: !103, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !128, globals: !137, splitDebugInlining: false, nameTableKind: None)
!103 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!104 = !{!105, !111}
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 71, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!107 = !{!108, !109, !110}
!108 = !DIEnumerator(name: "UART_PORT0", value: 0)
!109 = !DIEnumerator(name: "UART_PORT1", value: 1)
!110 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 129, baseType: !7, size: 32, elements: !113)
!112 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!114 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!115 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!116 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!117 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!118 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!119 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!120 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!121 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!122 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!123 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!124 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!125 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!126 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!127 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!128 = !{!88, !92, !129, !131, !133, !135, !80}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !6, line: 113, baseType: !132)
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !6, line: 59, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!137 = !{!100}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !140, file: !141, line: 53, type: !232, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !151, globals: !231, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!142 = !{!143, !11}
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 152, baseType: !13, size: 32, elements: !145)
!144 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!145 = !{!146, !147, !148, !149, !150}
!146 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!147 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!148 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!149 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!150 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!151 = !{!152, !153, !92, !154, !156, !192}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !12, line: 97, baseType: !61)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !93, line: 44, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !95, line: 77, baseType: !13)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !158, line: 378, baseType: !159)
!158 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 363, size: 28704, elements: !160)
!160 = !{!161, !165, !169, !170, !171, !172, !173, !174, !175, !176, !180, !187, !191}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !159, file: !158, line: 365, baseType: !162, size: 256)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 8)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !159, file: !158, line: 366, baseType: !166, size: 768, offset: 256)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 768, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 24)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !159, file: !158, line: 367, baseType: !162, size: 256, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !159, file: !158, line: 368, baseType: !166, size: 768, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !159, file: !158, line: 369, baseType: !162, size: 256, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !159, file: !158, line: 370, baseType: !166, size: 768, offset: 2304)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !159, file: !158, line: 371, baseType: !162, size: 256, offset: 3072)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !159, file: !158, line: 372, baseType: !166, size: 768, offset: 3328)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !159, file: !158, line: 373, baseType: !162, size: 256, offset: 4096)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !159, file: !158, line: 374, baseType: !177, size: 1792, offset: 4352)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1792, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 56)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !159, file: !158, line: 375, baseType: !181, size: 1920, offset: 6144)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 1920, elements: !185)
!182 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !93, line: 24, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !95, line: 43, baseType: !134)
!185 = !{!186}
!186 = !DISubrange(count: 240)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !159, file: !158, line: 376, baseType: !188, size: 20608, offset: 8064)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 20608, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 644)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !159, file: !158, line: 377, baseType: !91, size: 32, offset: 28672)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !158, line: 418, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 395, size: 1120, elements: !195)
!195 = !{!196, !198, !199, !200, !201, !202, !203, !207, !208, !209, !210, !211, !212, !213, !214, !218, !219, !220, !224, !228, !230}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !194, file: !158, line: 397, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !194, file: !158, line: 398, baseType: !91, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !194, file: !158, line: 399, baseType: !91, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !194, file: !158, line: 400, baseType: !91, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !194, file: !158, line: 401, baseType: !91, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !194, file: !158, line: 402, baseType: !91, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !194, file: !158, line: 403, baseType: !204, size: 96, offset: 192)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 96, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 12)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !194, file: !158, line: 404, baseType: !91, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !194, file: !158, line: 405, baseType: !91, size: 32, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !194, file: !158, line: 406, baseType: !91, size: 32, offset: 352)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !194, file: !158, line: 407, baseType: !91, size: 32, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !194, file: !158, line: 408, baseType: !91, size: 32, offset: 416)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !194, file: !158, line: 409, baseType: !91, size: 32, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !194, file: !158, line: 410, baseType: !91, size: 32, offset: 480)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !194, file: !158, line: 411, baseType: !215, size: 64, offset: 512)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !194, file: !158, line: 412, baseType: !197, size: 32, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !194, file: !158, line: 413, baseType: !197, size: 32, offset: 608)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !194, file: !158, line: 414, baseType: !221, size: 128, offset: 640)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 4)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !194, file: !158, line: 415, baseType: !225, size: 160, offset: 768)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 160, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 5)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !194, file: !158, line: 416, baseType: !229, size: 160, offset: 928)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 160, elements: !226)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !194, file: !158, line: 417, baseType: !91, size: 32, offset: 1088)
!231 = !{!138}
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 6144, elements: !241)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !141, line: 50, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 47, size: 64, elements: !235)
!235 = !{!236, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !234, file: !141, line: 48, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !152}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !234, file: !141, line: 49, baseType: !92, size: 32, offset: 32)
!241 = !{!242}
!242 = !DISubrange(count: 96)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !245, file: !246, line: 61, type: !279, isLocal: true, isDefinition: true)
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !247, retainedTypes: !277, globals: !278, splitDebugInlining: false, nameTableKind: None)
!246 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!247 = !{!248, !256, !264, !268, !273}
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 387, baseType: !13, size: 32, elements: !250)
!249 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!250 = !{!251, !252, !253, !254, !255}
!251 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!252 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!253 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!254 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!255 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 657, baseType: !7, size: 32, elements: !258)
!257 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!260 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!261 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!262 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!263 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 397, baseType: !7, size: 32, elements: !265)
!265 = !{!266, !267}
!266 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!267 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 666, baseType: !7, size: 32, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!271 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!272 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 380, baseType: !7, size: 32, elements: !274)
!274 = !{!275, !276}
!275 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!276 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!277 = !{!153, !92}
!278 = !{!243}
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 640, elements: !226)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !246, line: 55, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 51, size: 128, elements: !282)
!282 = !{!283, !285, !295}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !281, file: !246, line: 52, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !249, line: 400, baseType: !264)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !281, file: !246, line: 53, baseType: !286, size: 64, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !246, line: 49, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 46, size: 64, elements: !288)
!288 = !{!289, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !287, file: !246, line: 47, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !249, line: 371, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !153}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !287, file: !246, line: 48, baseType: !153, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !281, file: !246, line: 54, baseType: !296, size: 8, offset: 96)
!296 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !299, file: !300, line: 77, type: !365, isLocal: true, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !301, retainedTypes: !351, globals: !353, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!301 = !{!302, !310, !315, !331, !337, !341, !105, !111, !346}
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 345, baseType: !13, size: 32, elements: !304)
!303 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!304 = !{!305, !306, !307, !308, !309}
!305 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!306 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!307 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!308 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!309 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 109, baseType: !7, size: 32, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!313 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!314 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 302, baseType: !7, size: 32, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!317 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!318 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!319 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!320 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!321 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!322 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!323 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!324 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!325 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!326 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!327 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!328 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!329 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!330 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 321, baseType: !7, size: 32, elements: !332)
!332 = !{!333, !334, !335, !336}
!333 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!334 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!335 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!336 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 330, baseType: !7, size: 32, elements: !338)
!338 = !{!339, !340}
!339 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!340 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 337, baseType: !7, size: 32, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!344 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!345 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 355, baseType: !13, size: 32, elements: !347)
!347 = !{!348, !349, !350}
!348 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!349 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!350 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!351 = !{!7, !153, !134, !352, !183}
!352 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!353 = !{!297, !354}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "func_tbl", scope: !356, file: !300, line: 536, type: !363, isLocal: true, isDefinition: true)
!356 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !300, file: !300, line: 534, type: !357, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !299, retainedNodes: !361)
!357 = !DISubroutineType(types: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !112, line: 197, baseType: !74)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !257, line: 113, baseType: !310)
!361 = !{!362}
!362 = !DILocalVariable(name: "uart_port", arg: 1, scope: !356, file: !300, line: 534, type: !360)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, elements: !216)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 1024, elements: !216)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !300, line: 75, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 68, size: 512, elements: !368)
!368 = !{!369, !370, !382, !383, !394, !395}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !367, file: !300, line: 69, baseType: !296, size: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !367, file: !300, line: 70, baseType: !371, size: 128, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !303, line: 378, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 373, size: 128, elements: !373)
!373 = !{!374, !376, !378, !380}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !372, file: !303, line: 374, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !303, line: 317, baseType: !315)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !372, file: !303, line: 375, baseType: !377, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !303, line: 326, baseType: !331)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !372, file: !303, line: 376, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !303, line: 333, baseType: !337)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !372, file: !303, line: 377, baseType: !381, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !303, line: 341, baseType: !341)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !367, file: !300, line: 71, baseType: !296, size: 8, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !367, file: !300, line: 72, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !300, line: 66, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 63, size: 64, elements: !386)
!386 = !{!387, !393}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !385, file: !300, line: 64, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !303, line: 410, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392, !153}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !303, line: 359, baseType: !346)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !385, file: !300, line: 65, baseType: !153, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !367, file: !300, line: 73, baseType: !296, size: 8, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !367, file: !300, line: 74, baseType: !396, size: 224, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !303, line: 390, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 382, size: 224, elements: !398)
!398 = !{!399, !401, !402, !403, !404, !405, !406}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !397, file: !303, line: 383, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !397, file: !303, line: 384, baseType: !92, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !397, file: !303, line: 385, baseType: !92, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !397, file: !303, line: 386, baseType: !400, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !397, file: !303, line: 387, baseType: !92, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !397, file: !303, line: 388, baseType: !92, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !397, file: !303, line: 389, baseType: !92, size: 32, offset: 192)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "s_hal_mode", scope: !409, file: !410, line: 44, type: !438, isLocal: true, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !411, retainedTypes: !427, globals: !428, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_wdt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!411 = !{!412, !418, !422, !11}
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 194, baseType: !13, size: 32, elements: !414)
!413 = !DIFile(filename: "../../../../../driver/chip/inc/hal_wdt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!414 = !{!415, !416, !417}
!415 = !DIEnumerator(name: "HAL_WDT_STATUS_INVALID_PARAMETER", value: -2)
!416 = !DIEnumerator(name: "HAL_WDT_STATUS_INVALID_MAGIC", value: -1)
!417 = !DIEnumerator(name: "HAL_WDT_STATUS_OK", value: 0)
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 210, baseType: !7, size: 32, elements: !419)
!419 = !{!420, !421}
!420 = !DIEnumerator(name: "HAL_WDT_MODE_RESET", value: 0)
!421 = !DIEnumerator(name: "HAL_WDT_MODE_INTERRUPT", value: 1)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !413, line: 202, baseType: !7, size: 32, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIEnumerator(name: "HAL_WDT_TIMEOUT_RESET", value: 0)
!425 = !DIEnumerator(name: "HAL_WDT_SOFTWARE_RESET", value: 1)
!426 = !DIEnumerator(name: "HAL_WDT_NONE_RESET", value: 2)
!427 = !{!61, !92}
!428 = !{!429, !436, !407}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "s_hal_wdt_callback", scope: !409, file: !410, line: 42, type: !431, isLocal: true, isDefinition: true)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_wdt_callback_t", file: !413, line: 246, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !435}
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_wdt_reset_status_t", file: !413, line: 206, baseType: !422)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "s_hal_enable", scope: !409, file: !410, line: 43, type: !296, isLocal: true, isDefinition: true)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_wdt_mode_t", file: !413, line: 213, baseType: !418)
!439 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !442, file: !443, line: 59, type: !92, isLocal: false, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !444, globals: !507, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/wdt_feed_watchdog/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!444 = !{!445, !453, !478}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !158, line: 656, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 650, size: 128, elements: !448)
!448 = !{!449, !450, !451, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !447, file: !158, line: 652, baseType: !91, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !447, file: !158, line: 653, baseType: !91, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !447, file: !158, line: 654, baseType: !91, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !447, file: !158, line: 655, baseType: !197, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !158, line: 418, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 395, size: 1120, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !455, file: !158, line: 397, baseType: !197, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !455, file: !158, line: 398, baseType: !91, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !455, file: !158, line: 399, baseType: !91, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !455, file: !158, line: 400, baseType: !91, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !455, file: !158, line: 401, baseType: !91, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !455, file: !158, line: 402, baseType: !91, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !455, file: !158, line: 403, baseType: !204, size: 96, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !455, file: !158, line: 404, baseType: !91, size: 32, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !455, file: !158, line: 405, baseType: !91, size: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !455, file: !158, line: 406, baseType: !91, size: 32, offset: 352)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !455, file: !158, line: 407, baseType: !91, size: 32, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !455, file: !158, line: 408, baseType: !91, size: 32, offset: 416)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !455, file: !158, line: 409, baseType: !91, size: 32, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !455, file: !158, line: 410, baseType: !91, size: 32, offset: 480)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !455, file: !158, line: 411, baseType: !215, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !455, file: !158, line: 412, baseType: !197, size: 32, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !455, file: !158, line: 413, baseType: !197, size: 32, offset: 608)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !455, file: !158, line: 414, baseType: !221, size: 128, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !455, file: !158, line: 415, baseType: !225, size: 160, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !455, file: !158, line: 416, baseType: !229, size: 160, offset: 928)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !455, file: !158, line: 417, baseType: !91, size: 32, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !480, line: 72, baseType: !481)
!480 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 56, size: 525312, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !497, !498, !502, !506}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !481, file: !480, line: 57, baseType: !91, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !481, file: !480, line: 58, baseType: !91, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !481, file: !480, line: 59, baseType: !91, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !481, file: !480, line: 60, baseType: !91, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !481, file: !480, line: 61, baseType: !91, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !481, file: !480, line: 62, baseType: !91, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !481, file: !480, line: 63, baseType: !91, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !481, file: !480, line: 64, baseType: !91, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !481, file: !480, line: 65, baseType: !91, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !481, file: !480, line: 66, baseType: !91, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !481, file: !480, line: 67, baseType: !494, size: 32, offset: 320)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 1)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !481, file: !480, line: 68, baseType: !91, size: 32, offset: 352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !481, file: !480, line: 69, baseType: !499, size: 523904, offset: 384)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 523904, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 16372)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !481, file: !480, line: 70, baseType: !503, size: 512, offset: 524288)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 512, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !481, file: !480, line: 71, baseType: !503, size: 512, offset: 524800)
!507 = !{!440, !508}
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !442, file: !443, line: 61, type: !91, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "heap_end", scope: !512, file: !513, line: 66, type: !518, isLocal: true, isDefinition: true)
!512 = distinct !DISubprogram(name: "_sbrk_r", scope: !513, file: !513, line: 63, type: !514, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !710, retainedNodes: !714)
!513 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !519, !709}
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !517, line: 123, baseType: !518)
!517 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !521, line: 377, size: 1920, elements: !522)
!521 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!522 = !{!523, !524, !598, !599, !600, !601, !602, !603, !604, !607, !628, !632, !633, !634, !635, !645, !658, !659, !664, !683, !684, !691, !692, !708}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !520, file: !521, line: 381, baseType: !13, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !520, file: !521, line: 386, baseType: !525, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !521, line: 292, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !521, line: 186, size: 832, elements: !528)
!528 = !{!529, !531, !532, !533, !535, !536, !541, !542, !543, !544, !548, !554, !561, !565, !566, !567, !568, !572, !574, !575, !576, !578, !584, !597}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !527, file: !521, line: 187, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !527, file: !521, line: 188, baseType: !13, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !527, file: !521, line: 189, baseType: !13, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !527, file: !521, line: 190, baseType: !534, size: 16, offset: 96)
!534 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !527, file: !521, line: 191, baseType: !534, size: 16, offset: 112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !527, file: !521, line: 192, baseType: !537, size: 64, offset: 128)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !521, line: 122, size: 64, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !537, file: !521, line: 123, baseType: !530, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !537, file: !521, line: 124, baseType: !13, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !527, file: !521, line: 193, baseType: !13, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !527, file: !521, line: 196, baseType: !519, size: 32, offset: 224)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !527, file: !521, line: 200, baseType: !153, size: 32, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !527, file: !521, line: 202, baseType: !545, size: 32, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DISubroutineType(types: !547)
!547 = !{!13, !519, !153, !518, !13}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !527, file: !521, line: 204, baseType: !549, size: 32, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DISubroutineType(types: !551)
!551 = !{!13, !519, !153, !552, !13}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !527, file: !521, line: 207, baseType: !555, size: 32, offset: 352)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DISubroutineType(types: !557)
!557 = !{!558, !519, !153, !558, !13}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !559, line: 116, baseType: !560)
!559 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!560 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !527, file: !521, line: 208, baseType: !562, size: 32, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DISubroutineType(types: !564)
!564 = !{!13, !519, !153}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !527, file: !521, line: 211, baseType: !537, size: 64, offset: 416)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !527, file: !521, line: 212, baseType: !530, size: 32, offset: 480)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !527, file: !521, line: 213, baseType: !13, size: 32, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !527, file: !521, line: 216, baseType: !569, size: 24, offset: 544)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 24, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 3)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !527, file: !521, line: 217, baseType: !573, size: 8, offset: 568)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8, elements: !495)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !527, file: !521, line: 220, baseType: !537, size: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !527, file: !521, line: 223, baseType: !13, size: 32, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !527, file: !521, line: 224, baseType: !577, size: 32, offset: 672)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !559, line: 46, baseType: !560)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !527, file: !521, line: 231, baseType: !579, size: 32, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !521, line: 35, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !581, line: 34, baseType: !582)
!581 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !581, line: 33, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !527, file: !521, line: 233, baseType: !585, size: 64, offset: 736)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !559, line: 170, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 162, size: 64, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !586, file: !559, line: 164, baseType: !13, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !586, file: !559, line: 169, baseType: !590, size: 32, offset: 32)
!590 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !586, file: !559, line: 165, size: 32, elements: !591)
!591 = !{!592, !595}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !590, file: !559, line: 167, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !594, line: 116, baseType: !13)
!594 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !590, file: !559, line: 168, baseType: !596, size: 32)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !222)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !527, file: !521, line: 234, baseType: !13, size: 32, offset: 800)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !520, file: !521, line: 386, baseType: !525, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !520, file: !521, line: 386, baseType: !525, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !520, file: !521, line: 388, baseType: !13, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !520, file: !521, line: 390, baseType: !518, size: 32, offset: 160)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !520, file: !521, line: 392, baseType: !13, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !520, file: !521, line: 394, baseType: !13, size: 32, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !520, file: !521, line: 395, baseType: !605, size: 32, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !521, line: 45, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !520, file: !521, line: 397, baseType: !608, size: 32, offset: 288)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !521, line: 349, size: 128, elements: !610)
!610 = !{!611, !624, !625, !626}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !609, file: !521, line: 352, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !521, line: 52, size: 192, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !613, file: !521, line: 54, baseType: !612, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !613, file: !521, line: 55, baseType: !13, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !613, file: !521, line: 55, baseType: !13, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !613, file: !521, line: 55, baseType: !13, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !613, file: !521, line: 55, baseType: !13, size: 32, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !613, file: !521, line: 56, baseType: !621, size: 32, offset: 160)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 32, elements: !495)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !521, line: 22, baseType: !623)
!623 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !609, file: !521, line: 353, baseType: !13, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !609, file: !521, line: 354, baseType: !612, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !609, file: !521, line: 355, baseType: !627, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !520, file: !521, line: 399, baseType: !629, size: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !519}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !520, file: !521, line: 401, baseType: !13, size: 32, offset: 352)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !520, file: !521, line: 404, baseType: !13, size: 32, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !520, file: !521, line: 405, baseType: !518, size: 32, offset: 416)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !520, file: !521, line: 407, baseType: !636, size: 32, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !521, line: 324, size: 192, elements: !638)
!638 = !{!639, !641, !642, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !637, file: !521, line: 325, baseType: !640, size: 48)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 48, elements: !570)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !637, file: !521, line: 326, baseType: !640, size: 48, offset: 48)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !637, file: !521, line: 327, baseType: !132, size: 16, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !637, file: !521, line: 330, baseType: !644, size: 64, offset: 128)
!644 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !520, file: !521, line: 408, baseType: !646, size: 32, offset: 480)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !521, line: 60, size: 288, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !647, file: !521, line: 62, baseType: !13, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !647, file: !521, line: 63, baseType: !13, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !647, file: !521, line: 64, baseType: !13, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !647, file: !521, line: 65, baseType: !13, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !647, file: !521, line: 66, baseType: !13, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !647, file: !521, line: 67, baseType: !13, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !647, file: !521, line: 68, baseType: !13, size: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !647, file: !521, line: 69, baseType: !13, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !647, file: !521, line: 70, baseType: !13, size: 32, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !520, file: !521, line: 409, baseType: !518, size: 32, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !520, file: !521, line: 412, baseType: !660, size: 32, offset: 544)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !13}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !520, file: !521, line: 416, baseType: !665, size: 32, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !521, line: 90, size: 1120, elements: !667)
!667 = !{!668, !669, !670, !674}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !666, file: !521, line: 91, baseType: !665, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !666, file: !521, line: 92, baseType: !13, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !666, file: !521, line: 93, baseType: !671, size: 1024, offset: 64)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1024, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !666, file: !521, line: 94, baseType: !675, size: 32, offset: 1088)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !521, line: 79, size: 2112, elements: !677)
!677 = !{!678, !680, !681, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !676, file: !521, line: 80, baseType: !679, size: 1024)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 1024, elements: !672)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !676, file: !521, line: 81, baseType: !679, size: 1024, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !676, file: !521, line: 83, baseType: !622, size: 32, offset: 2048)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !676, file: !521, line: 86, baseType: !622, size: 32, offset: 2080)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !520, file: !521, line: 417, baseType: !666, size: 1120, offset: 608)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !520, file: !521, line: 420, baseType: !685, size: 96, offset: 1728)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !521, line: 296, size: 96, elements: !686)
!686 = !{!687, !689, !690}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !685, file: !521, line: 298, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !685, file: !521, line: 299, baseType: !13, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !685, file: !521, line: 300, baseType: !525, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !520, file: !521, line: 421, baseType: !525, size: 32, offset: 1824)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !520, file: !521, line: 422, baseType: !693, size: 32, offset: 1856)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !521, line: 359, size: 640, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !702, !703, !704, !705, !706, !707}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !694, file: !521, line: 362, baseType: !518, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !694, file: !521, line: 363, baseType: !585, size: 64, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !694, file: !521, line: 364, baseType: !585, size: 64, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !694, file: !521, line: 365, baseType: !585, size: 64, offset: 160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !694, file: !521, line: 366, baseType: !701, size: 64, offset: 224)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 64, elements: !163)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !694, file: !521, line: 367, baseType: !13, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !694, file: !521, line: 368, baseType: !585, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !694, file: !521, line: 369, baseType: !585, size: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !694, file: !521, line: 370, baseType: !585, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !694, file: !521, line: 371, baseType: !585, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !694, file: !521, line: 372, baseType: !585, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !520, file: !521, line: 423, baseType: !518, size: 32, offset: 1888)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !594, line: 46, baseType: !7)
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !712, globals: !713, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!712 = !{!518, !516}
!713 = !{!510}
!714 = !{!715, !716, !717, !718}
!715 = !DILocalVariable(name: "r", arg: 1, scope: !512, file: !513, line: 63, type: !519)
!716 = !DILocalVariable(name: "nbytes", arg: 2, scope: !512, file: !513, line: 63, type: !709)
!717 = !DILocalVariable(name: "prev_heap_end", scope: !512, file: !513, line: 67, type: !518)
!718 = !DILocalVariable(name: "stack", scope: !512, file: !513, line: 68, type: !518)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !721, file: !726, line: 4, type: !732, isLocal: false, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !723, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!723 = !{!719, !724, !730}
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !721, file: !726, line: 5, type: !727, isLocal: false, isDefinition: true)
!726 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 88, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 11)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !721, file: !726, line: 6, type: !727, isLocal: false, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 248, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 31)
!735 = distinct !DICompileUnit(language: DW_LANG_C99, file: !736, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !737, retainedTypes: !743, splitDebugInlining: false, nameTableKind: None)
!736 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!737 = !{!738}
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !739, line: 1209, baseType: !7, size: 32, elements: !740)
!739 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!740 = !{!741, !742}
!741 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!742 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!743 = !{!58, !60}
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !746, retainedTypes: !824, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!746 = !{!747}
!747 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !748, line: 150, baseType: !7, size: 32, elements: !749)
!748 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!750 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!751 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!752 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!753 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!754 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!755 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!756 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!757 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!758 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!759 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!760 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!761 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!762 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!763 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!764 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!765 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!766 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!767 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!768 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!769 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!770 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!771 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!772 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!773 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!774 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!775 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!776 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!777 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!778 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!779 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!780 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!781 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!782 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!783 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!784 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!785 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!786 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!787 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!788 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!789 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!790 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!791 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!792 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!793 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!794 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!795 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!796 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!797 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!798 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!799 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!800 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!801 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!802 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!803 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!804 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!805 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!806 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!807 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!808 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!809 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!810 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!811 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!812 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!813 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!814 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!815 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!816 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!817 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!818 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!819 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!820 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!821 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!822 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!823 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!824 = !{!58, !80}
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !827, retainedTypes: !828, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_wdt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!827 = !{!11}
!828 = !{!88, !829, !80, !61, !58, !92, !840, !857, !154}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "P_IOT_WDT_TypeDef", file: !830, line: 849, baseType: !831)
!830 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687_cm4_hw_memmap.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_WDT_TypeDef", file: !830, line: 842, size: 192, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !839}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MODE", scope: !832, file: !830, line: 843, baseType: !79, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_LENGTH", scope: !832, file: !830, line: 844, baseType: !79, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_RESTART", scope: !832, file: !830, line: 845, baseType: !79, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_STA", scope: !832, file: !830, line: 846, baseType: !79, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_INTERVAL", scope: !832, file: !830, line: 847, baseType: !79, size: 32, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SWRST", scope: !832, file: !830, line: 848, baseType: !79, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !158, line: 378, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 363, size: 28704, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !842, file: !158, line: 365, baseType: !162, size: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !842, file: !158, line: 366, baseType: !166, size: 768, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !842, file: !158, line: 367, baseType: !162, size: 256, offset: 1024)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !842, file: !158, line: 368, baseType: !166, size: 768, offset: 1280)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !842, file: !158, line: 369, baseType: !162, size: 256, offset: 2048)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !842, file: !158, line: 370, baseType: !166, size: 768, offset: 2304)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !842, file: !158, line: 371, baseType: !162, size: 256, offset: 3072)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !842, file: !158, line: 372, baseType: !166, size: 768, offset: 3328)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !842, file: !158, line: 373, baseType: !162, size: 256, offset: 4096)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !842, file: !158, line: 374, baseType: !177, size: 1792, offset: 4352)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !842, file: !158, line: 375, baseType: !181, size: 1920, offset: 6144)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !842, file: !158, line: 376, baseType: !188, size: 20608, offset: 8064)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !842, file: !158, line: 377, baseType: !91, size: 32, offset: 28672)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !158, line: 418, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 395, size: 1120, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !859, file: !158, line: 397, baseType: !197, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !859, file: !158, line: 398, baseType: !91, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !859, file: !158, line: 399, baseType: !91, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !859, file: !158, line: 400, baseType: !91, size: 32, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !859, file: !158, line: 401, baseType: !91, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !859, file: !158, line: 402, baseType: !91, size: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !859, file: !158, line: 403, baseType: !204, size: 96, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !859, file: !158, line: 404, baseType: !91, size: 32, offset: 288)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !859, file: !158, line: 405, baseType: !91, size: 32, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !859, file: !158, line: 406, baseType: !91, size: 32, offset: 352)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !859, file: !158, line: 407, baseType: !91, size: 32, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !859, file: !158, line: 408, baseType: !91, size: 32, offset: 416)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !859, file: !158, line: 409, baseType: !91, size: 32, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !859, file: !158, line: 410, baseType: !91, size: 32, offset: 480)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !859, file: !158, line: 411, baseType: !215, size: 64, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !859, file: !158, line: 412, baseType: !197, size: 32, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !859, file: !158, line: 413, baseType: !197, size: 32, offset: 608)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !859, file: !158, line: 414, baseType: !221, size: 128, offset: 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !859, file: !158, line: 415, baseType: !225, size: 160, offset: 768)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !859, file: !158, line: 416, baseType: !229, size: 160, offset: 928)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !859, file: !158, line: 417, baseType: !91, size: 32, offset: 1088)
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !884, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!884 = !{!885, !910}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !158, line: 418, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 395, size: 1120, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !887, file: !158, line: 397, baseType: !197, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !887, file: !158, line: 398, baseType: !91, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !887, file: !158, line: 399, baseType: !91, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !887, file: !158, line: 400, baseType: !91, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !887, file: !158, line: 401, baseType: !91, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !887, file: !158, line: 402, baseType: !91, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !887, file: !158, line: 403, baseType: !204, size: 96, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !887, file: !158, line: 404, baseType: !91, size: 32, offset: 288)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !887, file: !158, line: 405, baseType: !91, size: 32, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !887, file: !158, line: 406, baseType: !91, size: 32, offset: 352)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !887, file: !158, line: 407, baseType: !91, size: 32, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !887, file: !158, line: 408, baseType: !91, size: 32, offset: 416)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !887, file: !158, line: 409, baseType: !91, size: 32, offset: 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !887, file: !158, line: 410, baseType: !91, size: 32, offset: 480)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !887, file: !158, line: 411, baseType: !215, size: 64, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !887, file: !158, line: 412, baseType: !197, size: 32, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !887, file: !158, line: 413, baseType: !197, size: 32, offset: 608)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !887, file: !158, line: 414, baseType: !221, size: 128, offset: 640)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !887, file: !158, line: 415, baseType: !225, size: 160, offset: 768)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !887, file: !158, line: 416, baseType: !229, size: 160, offset: 928)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !887, file: !158, line: 417, baseType: !91, size: 32, offset: 1088)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !158, line: 378, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 363, size: 28704, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !912, file: !158, line: 365, baseType: !162, size: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !912, file: !158, line: 366, baseType: !166, size: 768, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !912, file: !158, line: 367, baseType: !162, size: 256, offset: 1024)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !912, file: !158, line: 368, baseType: !166, size: 768, offset: 1280)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !912, file: !158, line: 369, baseType: !162, size: 256, offset: 2048)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !912, file: !158, line: 370, baseType: !166, size: 768, offset: 2304)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !912, file: !158, line: 371, baseType: !162, size: 256, offset: 3072)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !912, file: !158, line: 372, baseType: !166, size: 768, offset: 3328)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !912, file: !158, line: 373, baseType: !162, size: 256, offset: 4096)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !912, file: !158, line: 374, baseType: !177, size: 1792, offset: 4352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !912, file: !158, line: 375, baseType: !181, size: 1920, offset: 6144)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !912, file: !158, line: 376, baseType: !188, size: 20608, offset: 8064)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !912, file: !158, line: 377, baseType: !91, size: 32, offset: 28672)
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !929, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!929 = !{!930, !747}
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !931, line: 55, baseType: !7, size: 32, elements: !932)
!931 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!933 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!934 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!935 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!936 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!937 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!938 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!939 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!940 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!941 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!942 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!943 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!944 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!945 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!946 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!947 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!948 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!949 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!950 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!951 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!952 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!953 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!954 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!955 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!956 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!957 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!958 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!959 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!960 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !963, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/timer.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!963 = !{!560, !58}
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!965 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !968, retainedTypes: !1032, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!968 = !{!969, !976, !930, !1007, !1013, !1017, !1021, !1027}
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 233, baseType: !13, size: 32, elements: !971)
!970 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!971 = !{!972, !973, !974, !975}
!972 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!973 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!974 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!975 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!976 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 249, baseType: !7, size: 32, elements: !977)
!977 = !{!978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!978 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!979 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!980 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!981 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!982 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!983 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!984 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!985 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!986 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!987 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!988 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!989 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!990 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!991 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!992 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!993 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!994 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!995 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!996 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!997 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!998 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!999 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!1000 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!1001 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!1002 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!1003 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!1004 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!1005 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!1006 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 224, baseType: !13, size: 32, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012}
!1009 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!1010 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!1011 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!1012 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!1013 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 217, baseType: !7, size: 32, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!1016 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!1017 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 210, baseType: !7, size: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!1020 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!1021 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 242, baseType: !7, size: 32, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026}
!1023 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!1024 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!1025 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!1026 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!1027 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1028, line: 57, baseType: !7, size: 32, elements: !1029)
!1028 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/wdt_feed_watchdog/GCC")
!1029 = !{!1030, !1031}
!1030 = !DIEnumerator(name: "eDirection_IN", value: 0)
!1031 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!1032 = !{!1033, !153, !1034, !183, !1035, !1036}
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !931, line: 87, baseType: !930)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !970, line: 220, baseType: !1013)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !970, line: 247, baseType: !1021)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !1028, line: 60, baseType: !1027)
!1037 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1038, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1039, splitDebugInlining: false, nameTableKind: None)
