; ModuleID = 'build/96b_meerkat96/bme280/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.1, i8*, i32 }
%union.anon.1 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.16 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.1 }
%struct.mpsc_pbuf_buffer_config.17 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.16*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/bme280/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/bme280")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/bme280")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !27, file: !107, line: 18, type: !109, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !37, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/bme280")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !{!22, !38, !24, !39, !41, !43, !47, !49, !50, !51, !53, !55, !56, !57, !60, !62, !74, !58, !75, !85, !44}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 214, baseType: !32)
!48 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !61)
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !64, line: 78, size: 32, elements: !65)
!64 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!65 = !{!66, !73}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !63, file: !64, line: 80, baseType: !67, size: 32)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !64, line: 45, size: 32, elements: !68)
!68 = !{!69, !70, !71, !72}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, file: !64, line: 47, baseType: !58, size: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !67, file: !64, line: 50, baseType: !58, size: 8, offset: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !67, file: !64, line: 53, baseType: !58, size: 8, offset: 16)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !67, file: !64, line: 56, baseType: !58, size: 8, offset: 24)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !63, file: !64, line: 82, baseType: !38, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !77)
!77 = !{!78, !96, !100}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !76, file: !31, line: 89, baseType: !79, size: 96)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !80)
!80 = !{!81, !93, !94}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !79, file: !31, line: 67, baseType: !82, size: 32)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !83)
!83 = !{!84, !86, !87, !88, !89, !90, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !82, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !82, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !82, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !82, file: !31, line: 54, baseType: !85, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !82, file: !31, line: 55, baseType: !85, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !82, file: !31, line: 56, baseType: !85, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !82, file: !31, line: 57, baseType: !85, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !79, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !79, file: !31, line: 76, baseType: !95, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !85)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !76, file: !31, line: 93, baseType: !97, size: 32, offset: 96)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !31, line: 94, baseType: !101, offset: 128)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: -1)
!104 = !{!25, !105}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !107, line: 18, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !111, line: 16, size: 64, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 17, baseType: !44, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !110, file: !111, line: 18, baseType: !58, size: 8, offset: 32)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "_char_out", scope: !117, file: !192, line: 54, type: !193, isLocal: false, isDefinition: true)
!117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !118, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !119, retainedTypes: !190, globals: !191, splitDebugInlining: false, nameTableKind: None)
!118 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/bme280")
!119 = !{!120}
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !121, line: 27, baseType: !32, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!123 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!124 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!125 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!126 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!127 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!128 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!129 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!130 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!131 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!132 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!133 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!134 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!135 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!136 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!137 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!138 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!139 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!140 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!141 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!142 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!143 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!144 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!145 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!146 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!147 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!148 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!149 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!189 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!190 = !{!38, !49}
!191 = !{!115}
!192 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!49, !49}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !198, file: !612, line: 258, type: !613, isLocal: true, isDefinition: true, align: 32)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !483, globals: !611, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/bme280")
!200 = !{!201, !233, !243, !292, !298, !419, !454}
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !202, line: 54, baseType: !32, size: 32, elements: !203)
!202 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!204 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!205 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!206 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!207 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!208 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!209 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!210 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!211 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!212 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!213 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!214 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!215 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!216 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!217 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!218 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!219 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!220 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!221 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!222 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!223 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!224 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!225 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!226 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!227 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!228 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!229 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!230 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!231 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!232 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !202, line: 224, baseType: !32, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242}
!235 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!236 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!237 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!238 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!239 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!240 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!241 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!242 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !202, line: 275, baseType: !32, size: 32, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!245 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!246 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!247 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!248 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!249 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!250 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!251 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!252 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!253 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!254 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!255 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!256 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!257 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!258 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!259 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!260 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!261 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!262 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!263 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!264 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!265 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!266 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!267 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!268 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!269 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!270 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!271 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!272 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!273 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!274 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!275 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!276 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!277 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!278 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!279 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!280 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!281 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!282 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!283 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!284 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!285 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!286 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!287 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!288 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!289 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!290 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!291 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !202, line: 327, baseType: !32, size: 32, elements: !293)
!293 = !{!294, !295, !296, !297}
!294 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!295 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!296 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!297 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !299, line: 76, baseType: !32, size: 32, elements: !300)
!299 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!301 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!302 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!303 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!304 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!305 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!306 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!307 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!308 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!309 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!310 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!311 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!312 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!313 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!314 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!315 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!316 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!317 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!318 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!319 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!320 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!321 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!322 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!323 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!324 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!325 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!326 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!327 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!328 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!329 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!330 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!331 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!332 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!333 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!334 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!335 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!336 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!337 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!338 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!339 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!340 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!341 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!342 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!343 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!344 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!345 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!346 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!347 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!348 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!349 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!350 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!351 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!352 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!353 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!354 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!355 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!356 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!357 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!358 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!359 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!360 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!361 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!362 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!363 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!364 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!365 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!366 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!367 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!368 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!369 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!370 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!371 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!372 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!373 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!374 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!375 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!376 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!377 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!378 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!379 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!380 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!381 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!382 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!383 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!384 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!385 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!386 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!387 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!388 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!389 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!390 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!391 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!392 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!393 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!394 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!395 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!396 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!397 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!398 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!399 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!400 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!401 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!402 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!403 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!404 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!405 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!406 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!407 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!408 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!409 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!410 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!411 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!412 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!413 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!414 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!415 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!416 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!417 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!418 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !202, line: 237, baseType: !32, size: 32, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!421 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!422 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!423 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!424 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!425 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!426 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!427 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!428 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!429 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!430 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!431 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!432 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!433 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!434 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!435 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!436 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!437 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!438 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!439 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!440 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!441 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!442 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!443 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!444 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!445 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!446 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!447 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!448 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!449 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!450 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!451 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!452 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!453 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !299, line: 44, baseType: !32, size: 32, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482}
!456 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!457 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!458 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!459 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!460 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!461 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!462 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!463 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!464 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!465 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!466 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!467 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!468 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!469 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!470 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!471 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!472 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!473 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!474 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!475 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!476 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!477 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!478 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!479 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!480 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!481 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!482 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!483 = !{!484, !556, !599, !610, !85}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !486, line: 4575, baseType: !487)
!486 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 4532, size: 390144, elements: !488)
!488 = !{!489, !491, !492, !493, !494, !498, !508, !512, !522, !526}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !487, file: !486, line: 4533, baseType: !490, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !85)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !487, file: !486, line: 4534, baseType: !490, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !487, file: !486, line: 4535, baseType: !490, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !487, file: !486, line: 4536, baseType: !490, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !487, file: !486, line: 4537, baseType: !495, size: 16256, offset: 128)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16256, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 2032)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !487, file: !486, line: 4543, baseType: !499, size: 4224, offset: 16384)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 4224, elements: !506)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !486, line: 4538, size: 128, elements: !501)
!501 = !{!502, !503, !504, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !500, file: !486, line: 4539, baseType: !490, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !500, file: !486, line: 4540, baseType: !490, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !500, file: !486, line: 4541, baseType: !490, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !500, file: !486, line: 4542, baseType: !490, size: 32, offset: 96)
!506 = !{!507}
!507 = !DISubrange(count: 33)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !487, file: !486, line: 4544, baseType: !509, size: 110464, offset: 20608)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 110464, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 13808)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !487, file: !486, line: 4550, baseType: !513, size: 24448, offset: 131072)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 24448, elements: !520)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !486, line: 4545, size: 128, elements: !515)
!515 = !{!516, !517, !518, !519}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !514, file: !486, line: 4546, baseType: !490, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !514, file: !486, line: 4547, baseType: !490, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !514, file: !486, line: 4548, baseType: !490, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !514, file: !486, line: 4549, baseType: !490, size: 32, offset: 96)
!520 = !{!521}
!521 = !DISubrange(count: 191)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !487, file: !486, line: 4551, baseType: !523, size: 106624, offset: 155520)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 106624, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 13328)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !487, file: !486, line: 4574, baseType: !527, size: 128000, offset: 262144)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 128000, elements: !554)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !486, line: 4552, size: 1024, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !550, !551, !552, !553}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !528, file: !486, line: 4553, baseType: !490, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !528, file: !486, line: 4554, baseType: !490, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !528, file: !486, line: 4555, baseType: !490, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !528, file: !486, line: 4556, baseType: !490, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !528, file: !486, line: 4557, baseType: !490, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !528, file: !486, line: 4558, baseType: !490, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !528, file: !486, line: 4559, baseType: !490, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !528, file: !486, line: 4560, baseType: !490, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !528, file: !486, line: 4561, baseType: !490, size: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !528, file: !486, line: 4562, baseType: !490, size: 32, offset: 288)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !528, file: !486, line: 4563, baseType: !490, size: 32, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !528, file: !486, line: 4564, baseType: !490, size: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !528, file: !486, line: 4565, baseType: !490, size: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !528, file: !486, line: 4566, baseType: !490, size: 32, offset: 416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !528, file: !486, line: 4567, baseType: !490, size: 32, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !528, file: !486, line: 4568, baseType: !490, size: 32, offset: 480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !528, file: !486, line: 4569, baseType: !547, size: 384, offset: 512)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 384, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 48)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !528, file: !486, line: 4570, baseType: !490, size: 32, offset: 896)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !528, file: !486, line: 4571, baseType: !490, size: 32, offset: 928)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !528, file: !486, line: 4572, baseType: !490, size: 32, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !528, file: !486, line: 4573, baseType: !490, size: 32, offset: 992)
!554 = !{!555}
!555 = !DISubrange(count: 125)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !486, line: 38320, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 38303, size: 23040, elements: !559)
!559 = !{!560, !562, !566, !567, !568, !569, !573, !577, !581, !585, !589}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !558, file: !486, line: 38304, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !558, file: !486, line: 38305, baseType: !563, size: 256, offset: 32)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 256, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !558, file: !486, line: 38306, baseType: !490, size: 32, offset: 288)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !558, file: !486, line: 38307, baseType: !490, size: 32, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !558, file: !486, line: 38308, baseType: !490, size: 32, offset: 352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !558, file: !486, line: 38309, baseType: !570, size: 3712, offset: 384)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 3712, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 464)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !558, file: !486, line: 38310, baseType: !574, size: 864, offset: 4096)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 864, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 27)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !558, file: !486, line: 38311, baseType: !578, size: 3232, offset: 4960)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 3232, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 404)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !558, file: !486, line: 38312, baseType: !582, size: 3776, offset: 8192)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 3776, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 118)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !558, file: !486, line: 38313, baseType: !586, size: 4416, offset: 11968)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 4416, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 552)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !558, file: !486, line: 38319, baseType: !590, size: 6656, offset: 16384)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 6656, elements: !597)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !558, file: !486, line: 38314, size: 128, elements: !592)
!592 = !{!593, !594, !595, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !591, file: !486, line: 38315, baseType: !490, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !591, file: !486, line: 38316, baseType: !490, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !591, file: !486, line: 38317, baseType: !490, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !591, file: !486, line: 38318, baseType: !490, size: 32, offset: 96)
!597 = !{!598}
!598 = !DISubrange(count: 52)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !486, line: 43319, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 43313, size: 80, elements: !602)
!602 = !{!603, !605, !606, !608, !609}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !601, file: !486, line: 43314, baseType: !604, size: 16)
!604 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !601, file: !486, line: 43315, baseType: !604, size: 16, offset: 16)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !601, file: !486, line: 43316, baseType: !607, size: 16, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !601, file: !486, line: 43317, baseType: !604, size: 16, offset: 48)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !601, file: !486, line: 43318, baseType: !604, size: 16, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!611 = !{!196}
!612 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !615, line: 51, size: 64, elements: !616)
!615 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !{!617, !624}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !614, file: !615, line: 60, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DISubroutineType(types: !620)
!620 = !{!49, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !615, line: 48, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !614, file: !615, line: 65, baseType: !621, size: 32, offset: 32)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "log_const_log", scope: !627, file: !708, line: 25, type: !937, isLocal: false, isDefinition: true)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !635, globals: !705, splitDebugInlining: false, nameTableKind: None)
!628 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/bme280")
!629 = !{!630, !30, !120}
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !631, line: 33, baseType: !32, size: 32, elements: !632)
!631 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = !{!633, !634}
!633 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!634 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!635 = !{!47, !49, !38, !636, !74, !647, !58, !648, !85, !669, !22, !24, !696, !699, !701, !703}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !64, line: 78, size: 32, elements: !638)
!638 = !{!639, !646}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !637, file: !64, line: 80, baseType: !640, size: 32)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !64, line: 45, size: 32, elements: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !640, file: !64, line: 47, baseType: !58, size: 8)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !640, file: !64, line: 50, baseType: !58, size: 8, offset: 8)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !640, file: !64, line: 53, baseType: !58, size: 8, offset: 16)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !640, file: !64, line: 56, baseType: !58, size: 8, offset: 24)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !637, file: !64, line: 82, baseType: !38, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !650)
!650 = !{!651, !667, !668}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !649, file: !31, line: 89, baseType: !652, size: 96)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !653)
!653 = !{!654, !665, !666}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !652, file: !31, line: 67, baseType: !655, size: 32)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !655, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !655, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !655, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !655, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !655, file: !31, line: 54, baseType: !85, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !655, file: !31, line: 55, baseType: !85, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !655, file: !31, line: 56, baseType: !85, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !655, file: !31, line: 57, baseType: !85, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !652, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !652, file: !31, line: 76, baseType: !95, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !649, file: !31, line: 93, baseType: !97, size: 32, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !649, file: !31, line: 94, baseType: !101, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !671)
!671 = !{!672, !689, !695}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !670, file: !31, line: 112, baseType: !673, size: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !674, line: 49, size: 32, elements: !675)
!674 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = !{!676, !682, !688}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !673, file: !674, line: 50, baseType: !677, size: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !674, line: 37, size: 32, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !677, file: !674, line: 38, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !677, file: !674, line: 38, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !677, file: !674, line: 39, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !673, file: !674, line: 51, baseType: !683, size: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !674, line: 43, size: 32, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !683, file: !674, line: 44, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !683, file: !674, line: 44, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !683, file: !674, line: 45, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !673, file: !674, line: 52, baseType: !85, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !670, file: !31, line: 113, baseType: !690, size: 32)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !690, file: !31, line: 108, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !690, file: !31, line: 108, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !31, line: 108, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !670, file: !31, line: 114, baseType: !649, size: 128)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !697, line: 46, baseType: !698)
!697 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !54)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !700)
!700 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!705 = !{!625, !706, !735, !742, !745, !747, !751, !753, !755, !757, !759, !761, !767, !800, !803, !812, !898, !925, !932, !934, !942, !952, !957, !972, !976}
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !627, file: !708, line: 93, type: !709, isLocal: false, isDefinition: true, align: 32)
!708 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !710, line: 2909, size: 128, elements: !711)
!710 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !{!712, !733, !734}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !709, file: !710, line: 2910, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !714, line: 233, baseType: !715)
!714 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 231, size: 64, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !715, file: !714, line: 232, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !719, line: 48, baseType: !720)
!719 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !719, line: 37, size: 64, elements: !721)
!721 = !{!722, !728}
!722 = !DIDerivedType(tag: DW_TAG_member, scope: !720, file: !719, line: 38, baseType: !723, size: 32)
!723 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !720, file: !719, line: 38, size: 32, elements: !724)
!724 = !{!725, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !723, file: !719, line: 39, baseType: !726, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !719, line: 40, baseType: !726, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, scope: !720, file: !719, line: 42, baseType: !729, size: 32, offset: 32)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !720, file: !719, line: 42, size: 32, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !729, file: !719, line: 43, baseType: !726, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !729, file: !719, line: 44, baseType: !726, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !709, file: !710, line: 2911, baseType: !32, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !709, file: !710, line: 2912, baseType: !32, size: 32, offset: 96)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !627, file: !708, line: 910, type: !737, isLocal: true, isDefinition: true, align: 32)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !615, line: 51, size: 64, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !738, file: !615, line: 60, baseType: !618, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !738, file: !615, line: 65, baseType: !621, size: 32, offset: 32)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "panic_mode", scope: !627, file: !708, line: 96, type: !744, isLocal: true, isDefinition: true)
!744 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "backend_attached", scope: !627, file: !708, line: 97, type: !744, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !627, file: !708, line: 98, type: !749, isLocal: true, isDefinition: true)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !750, line: 22, baseType: !52)
!750 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !627, file: !708, line: 99, type: !749, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !627, file: !708, line: 105, type: !85, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !627, file: !708, line: 107, type: !95, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !627, file: !708, line: 108, type: !749, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !627, file: !708, line: 109, type: !699, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !627, file: !708, line: 111, type: !763, isLocal: true, isDefinition: true, align: 32)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !764, line: 29, size: 32, elements: !765)
!764 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!765 = !{!766}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !763, file: !764, line: 30, baseType: !669, size: 32)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "log_buffer", scope: !627, file: !708, line: 112, type: !769, isLocal: true, isDefinition: true, align: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !770, line: 87, size: 448, elements: !771)
!770 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !{!772, !773, !774, !775, !776, !777, !781, !790, !795, !797, !798, !799}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !769, file: !770, line: 89, baseType: !85, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !769, file: !770, line: 92, baseType: !85, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !769, file: !770, line: 95, baseType: !85, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !769, file: !770, line: 98, baseType: !85, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !769, file: !770, line: 101, baseType: !85, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !769, file: !770, line: 104, baseType: !778, offset: 160)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !779, line: 43, elements: !780)
!779 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!780 = !{}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !769, file: !770, line: 110, baseType: !782, size: 32, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !770, line: 83, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !786, !788}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !769, file: !770, line: 113, baseType: !791, size: 32, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !770, line: 75, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DISubroutineType(types: !794)
!794 = !{!85, !788}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !769, file: !770, line: 116, baseType: !796, size: 32, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !769, file: !770, line: 119, baseType: !85, size: 32, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !769, file: !770, line: 122, baseType: !85, size: 32, offset: 288)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !769, file: !770, line: 124, baseType: !709, size: 128, offset: 320)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !627, file: !708, line: 113, type: !802, isLocal: true, isDefinition: true)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "logging_stack", scope: !627, file: !708, line: 884, type: !805, isLocal: false, isDefinition: true, align: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 6144, elements: !810)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !807, line: 47, size: 8, elements: !808)
!807 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !806, file: !807, line: 48, baseType: !46, size: 8)
!810 = !{!811}
!811 = !DISubrange(count: 768)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "logging_thread", scope: !627, file: !708, line: 885, type: !814, isLocal: false, isDefinition: true)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !815, line: 245, size: 896, elements: !816)
!815 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !{!817, !862, !875, !876, !877, !878, !893}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !814, file: !815, line: 247, baseType: !818, size: 384)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !815, line: 57, size: 384, elements: !819)
!819 = !{!820, !834, !836, !837, !838, !849, !850, !851}
!820 = !DIDerivedType(tag: DW_TAG_member, scope: !818, file: !815, line: 60, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !818, file: !815, line: 60, size: 64, elements: !822)
!822 = !{!823, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !821, file: !815, line: 61, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !719, line: 49, baseType: !720)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !821, file: !815, line: 62, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !827, line: 49, size: 64, elements: !828)
!827 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !826, file: !827, line: 50, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 64, elements: !832)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!832 = !{!833}
!833 = !DISubrange(count: 2)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !818, file: !815, line: 68, baseType: !835, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !818, file: !815, line: 71, baseType: !58, size: 8, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !818, file: !815, line: 74, baseType: !58, size: 8, offset: 104)
!838 = !DIDerivedType(tag: DW_TAG_member, scope: !818, file: !815, line: 90, baseType: !839, size: 16, offset: 112)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !818, file: !815, line: 90, size: 16, elements: !840)
!840 = !{!841, !848}
!841 = !DIDerivedType(tag: DW_TAG_member, scope: !839, file: !815, line: 91, baseType: !842, size: 16)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !815, line: 91, size: 16, elements: !843)
!843 = !{!844, !847}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !842, file: !815, line: 96, baseType: !845, size: 8)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !846)
!846 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !842, file: !815, line: 97, baseType: !58, size: 8, offset: 8)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !839, file: !815, line: 100, baseType: !60, size: 16)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !818, file: !815, line: 107, baseType: !85, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !818, file: !815, line: 127, baseType: !38, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !818, file: !815, line: 131, baseType: !852, size: 192, offset: 192)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !714, line: 244, size: 192, elements: !853)
!853 = !{!854, !855, !861}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !852, file: !714, line: 245, baseType: !824, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !852, file: !714, line: 246, baseType: !856, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !714, line: 242, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !852, file: !714, line: 249, baseType: !698, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !814, file: !815, line: 250, baseType: !863, size: 288, offset: 384)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !864, line: 25, size: 288, elements: !865)
!864 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !863, file: !864, line: 26, baseType: !85, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !863, file: !864, line: 27, baseType: !85, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !863, file: !864, line: 28, baseType: !85, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !863, file: !864, line: 29, baseType: !85, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !863, file: !864, line: 30, baseType: !85, size: 32, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !863, file: !864, line: 31, baseType: !85, size: 32, offset: 160)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !863, file: !864, line: 32, baseType: !85, size: 32, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !863, file: !864, line: 33, baseType: !85, size: 32, offset: 224)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !863, file: !864, line: 34, baseType: !85, size: 32, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !814, file: !815, line: 253, baseType: !38, size: 32, offset: 672)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !814, file: !815, line: 256, baseType: !713, size: 64, offset: 704)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !814, file: !815, line: 294, baseType: !49, size: 32, offset: 768)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !814, file: !815, line: 325, baseType: !879, size: 32, offset: 800)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !710, line: 5073, size: 160, elements: !881)
!881 = !{!882, !891, !892}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !880, file: !710, line: 5074, baseType: !883, size: 96)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !884, line: 56, size: 96, elements: !885)
!884 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!885 = !{!886, !889, !890}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !883, file: !884, line: 57, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !884, line: 57, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !883, file: !884, line: 58, baseType: !38, size: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !883, file: !884, line: 59, baseType: !47, size: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !880, file: !710, line: 5075, baseType: !713, size: 64, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !880, file: !710, line: 5076, baseType: !778, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !814, file: !815, line: 343, baseType: !894, size: 64, offset: 832)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !864, line: 60, size: 64, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !894, file: !864, line: 63, baseType: !85, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !894, file: !864, line: 66, baseType: !85, size: 32, offset: 32)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "format_table", scope: !627, file: !708, line: 72, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 128, elements: !98)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !903, line: 105, baseType: !904)
!903 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !907, !648, !85}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !903, line: 89, size: 128, elements: !910)
!910 = !{!911, !916, !923, !924}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !909, file: !903, line: 90, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !903, line: 79, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{!49, !57, !47, !38}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !909, file: !903, line: 91, baseType: !917, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !903, line: 82, size: 96, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !918, file: !903, line: 83, baseType: !749, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !918, file: !903, line: 84, baseType: !38, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !918, file: !903, line: 85, baseType: !44, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !909, file: !903, line: 92, baseType: !57, size: 32, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !909, file: !903, line: 93, baseType: !47, size: 32, offset: 96)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !627, file: !708, line: 104, type: !927, isLocal: true, isDefinition: true)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !928, line: 33, baseType: !929)
!928 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{!95}
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "initialized", scope: !627, file: !708, line: 95, type: !749, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !627, file: !708, line: 25, type: !936, isLocal: true, isDefinition: true)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !111, line: 16, size: 64, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !111, line: 17, baseType: !44, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !938, file: !111, line: 18, baseType: !58, size: 8, offset: 32)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !627, file: !708, line: 121, type: !944, isLocal: true, isDefinition: true)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !770, line: 128, size: 160, elements: !946)
!946 = !{!947, !948, !949, !950, !951}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !945, file: !770, line: 130, baseType: !796, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !945, file: !770, line: 133, baseType: !85, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !945, file: !770, line: 136, baseType: !782, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !945, file: !770, line: 137, baseType: !791, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !945, file: !770, line: 140, baseType: !85, size: 32, offset: 128)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "buf32", scope: !627, file: !708, line: 116, type: !954, isLocal: true, isDefinition: true, align: 64)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8192, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 256)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "process_lock", scope: !959, file: !708, line: 157, type: !778, isLocal: true, isDefinition: true)
!959 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !708, file: !708, line: 152, type: !960, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !627, retainedNodes: !962)
!960 = !DISubroutineType(types: !961)
!961 = !{null}
!962 = !{!963, !965}
!963 = !DILocalVariable(name: "cnt", scope: !959, file: !708, line: 154, type: !964)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !750, line: 23, baseType: !749)
!965 = !DILocalVariable(name: "key", scope: !966, file: !708, line: 158, type: !968)
!966 = distinct !DILexicalBlock(scope: !967, file: !708, line: 156, column: 18)
!967 = distinct !DILexicalBlock(scope: !959, file: !708, line: 156, column: 6)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !779, line: 106, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !779, line: 32, size: 32, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !969, file: !779, line: 33, baseType: !49, size: 32)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "proc_tid", scope: !627, file: !708, line: 100, type: !974, isLocal: true, isDefinition: true)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !815, line: 347, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !627, file: !708, line: 101, type: !978, isLocal: true, isDefinition: true)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !710, line: 1318, size: 448, elements: !979)
!979 = !{!980, !981, !982, !987, !988, !993, !994}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !978, file: !710, line: 1324, baseType: !852, size: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !978, file: !710, line: 1327, baseType: !713, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !978, file: !710, line: 1330, baseType: !983, size: 32, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !978, file: !710, line: 1333, baseType: !983, size: 32, offset: 288)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !978, file: !710, line: 1336, baseType: !989, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !697, line: 67, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 65, size: 64, elements: !991)
!991 = !{!992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !990, file: !697, line: 66, baseType: !696, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !978, file: !710, line: 1339, baseType: !85, size: 32, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !978, file: !710, line: 1342, baseType: !38, size: 32, offset: 416)
!995 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!996 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !999, file: !1008, line: 14, type: !1241, isLocal: false, isDefinition: true)
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1001, retainedTypes: !1002, globals: !1005, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/bme280")
!1001 = !{!630, !120}
!1002 = !{!38, !49, !1003, !57, !44, !22}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!1005 = !{!997, !1006, !1034, !1218, !1220, !1232, !1234, !1239}
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "sname_cache", scope: !999, file: !1008, line: 44, type: !1009, isLocal: true, isDefinition: true)
!1008 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !1010, line: 30, size: 256, elements: !1011)
!1010 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1011 = !{!1012, !1025, !1026, !1031, !1032, !1033}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1009, file: !1010, line: 31, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !1014, line: 40, baseType: !1015)
!1014 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !1014, line: 35, size: 64, elements: !1016)
!1016 = !{!1017, !1024}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1015, file: !1014, line: 36, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1014, line: 33, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1014, line: 29, size: 32, elements: !1021)
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1020, file: !1014, line: 30, baseType: !1023, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1015, file: !1014, line: 37, baseType: !1018, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !1009, file: !1010, line: 32, baseType: !1013, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !1009, file: !1010, line: 33, baseType: !1027, size: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !1010, line: 21, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!744, !22, !22}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !1009, file: !1010, line: 34, baseType: !85, size: 32, offset: 160)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !1009, file: !1010, line: 35, baseType: !85, size: 32, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !1009, file: !1010, line: 36, baseType: !47, size: 32, offset: 224)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !1036, file: !1008, line: 261, type: !44, isLocal: true, isDefinition: true)
!1036 = distinct !DISubprogram(name: "link_domain_name_get", scope: !1008, file: !1008, line: 256, type: !1037, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !999, retainedNodes: !1039)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!44, !58}
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1047, !1217}
!1040 = !DILocalVariable(name: "domain_id", arg: 1, scope: !1036, file: !1008, line: 256, type: !58)
!1041 = !DILocalVariable(name: "cached", scope: !1036, file: !1008, line: 258, type: !57)
!1042 = !DILocalVariable(name: "cache_size", scope: !1036, file: !1008, line: 259, type: !47)
!1043 = !DILocalVariable(name: "id", scope: !1036, file: !1008, line: 260, type: !22)
!1044 = !DILocalVariable(name: "rel_domain_id", scope: !1045, file: !1008, line: 265, type: !58)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !1008, line: 264, column: 49)
!1046 = distinct !DILexicalBlock(scope: !1036, file: !1008, line: 264, column: 6)
!1047 = !DILocalVariable(name: "link", scope: !1045, file: !1008, line: 266, type: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !1051, line: 61, size: 192, elements: !1052)
!1051 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1052 = !{!1053, !1142, !1143, !1154, !1155, !1207}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1050, file: !1051, line: 62, baseType: !1054, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !1051, line: 38, size: 192, elements: !1057)
!1057 = !{!1058, !1121, !1125, !1130, !1134, !1138}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !1056, file: !1051, line: 39, baseType: !1059, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!49, !1048, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 32)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !1051, line: 33, size: 64, elements: !1064)
!1064 = !{!1065, !1116}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !1063, file: !1051, line: 34, baseType: !1066, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !1051, line: 27, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 32)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !1048, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 32)
!1071 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !1072)
!1072 = !{!1073, !1089, !1095}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1071, file: !31, line: 112, baseType: !1074, size: 32)
!1074 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !674, line: 49, size: 32, elements: !1075)
!1075 = !{!1076, !1082, !1088}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1074, file: !674, line: 50, baseType: !1077, size: 32)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !674, line: 37, size: 32, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1077, file: !674, line: 38, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !1077, file: !674, line: 38, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1077, file: !674, line: 39, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !1074, file: !674, line: 51, baseType: !1083, size: 32)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !674, line: 43, size: 32, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1083, file: !674, line: 44, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !1083, file: !674, line: 44, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1083, file: !674, line: 45, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1074, file: !674, line: 52, baseType: !85, size: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !1071, file: !31, line: 113, baseType: !1090, size: 32)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1090, file: !31, line: 108, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !1090, file: !31, line: 108, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1090, file: !31, line: 108, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1071, file: !31, line: 114, baseType: !1096, size: 128)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !1097)
!1097 = !{!1098, !1114, !1115}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1096, file: !31, line: 89, baseType: !1099, size: 96)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !1100)
!1100 = !{!1101, !1112, !1113}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !1099, file: !31, line: 67, baseType: !1102, size: 32)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1102, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !1102, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1102, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !1102, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
