; ModuleID = 'build/96b_nitrogen/getline/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %union.anon }
%struct._sflist = type { %struct.z_heap_bucket*, %struct.z_heap_bucket* }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.console_input = type { i32, i8, [128 x i8] }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "free_queue", scope: !111, file: !221, line: 17, type: !222, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !218, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!113 = !{!102, !114, !118, !103, !120}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !117)
!117 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !119, line: 214, baseType: !32)
!119 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !123, line: 336, size: 608, elements: !124)
!123 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = !{!125, !157, !161, !165, !179, !184, !190, !196, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !122, file: !123, line: 365, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DISubroutineType(types: !128)
!128 = !{!103, !129, !156}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !132, line: 378, size: 192, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !138, !139, !140, !149, !150}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !132, line: 380, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !131, file: !132, line: 382, baseType: !13, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !131, file: !132, line: 384, baseType: !13, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !131, file: !132, line: 386, baseType: !141, size: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !132, line: 351, size: 16, elements: !143)
!143 = !{!144, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !142, file: !132, line: 359, baseType: !145, size: 8)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !146)
!146 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !142, file: !132, line: 364, baseType: !148, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!148 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !132, line: 388, baseType: !102, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !131, file: !132, line: 396, baseType: !151, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !132, line: 43, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !155)
!155 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !122, file: !123, line: 366, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !129, !146}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !122, file: !123, line: 374, baseType: !162, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!103, !129}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !122, file: !123, line: 377, baseType: !166, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !129, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !123, line: 122, size: 64, elements: !172)
!172 = !{!173, !175, !176, !177, !178}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !171, file: !123, line: 123, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !171, file: !123, line: 124, baseType: !145, size: 8, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !171, file: !123, line: 125, baseType: !145, size: 8, offset: 40)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !171, file: !123, line: 126, baseType: !145, size: 8, offset: 48)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !171, file: !123, line: 127, baseType: !145, size: 8, offset: 56)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !122, file: !123, line: 379, baseType: !180, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{!103, !129, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !122, file: !123, line: 384, baseType: !185, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{!103, !129, !188, !103}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !122, file: !123, line: 393, baseType: !191, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{!103, !129, !194, !195}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !122, file: !123, line: 402, baseType: !197, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !129}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !122, file: !123, line: 405, baseType: !197, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !122, file: !123, line: 408, baseType: !162, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !122, file: !123, line: 411, baseType: !197, size: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !122, file: !123, line: 414, baseType: !197, size: 32, offset: 352)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !122, file: !123, line: 417, baseType: !162, size: 32, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !122, file: !123, line: 420, baseType: !162, size: 32, offset: 416)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !122, file: !123, line: 423, baseType: !197, size: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !122, file: !123, line: 426, baseType: !197, size: 32, offset: 480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !122, file: !123, line: 429, baseType: !162, size: 32, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !122, file: !123, line: 432, baseType: !162, size: 32, offset: 544)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !122, file: !123, line: 435, baseType: !211, size: 32, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !129, !214, !102}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !123, line: 142, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !129, !102}
!218 = !{!109, !219, !266, !287}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "used_queue", scope: !111, file: !221, line: 18, type: !222, isLocal: true, isDefinition: true, align: 32)
!221 = !DIFile(filename: "zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !223, line: 2208, size: 128, elements: !224)
!223 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !222, file: !223, line: 2209, baseType: !226, size: 128)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !223, line: 1709, size: 128, elements: !227)
!227 = !{!228, !241, !245}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !226, file: !223, line: 1710, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !230, line: 46, baseType: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !230, line: 41, size: 64, elements: !232)
!232 = !{!233, !240}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !231, file: !230, line: 42, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !230, line: 39, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !230, line: 35, size: 32, elements: !237)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !236, file: !230, line: 36, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !230, line: 32, baseType: !174)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !230, line: 43, baseType: !234, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !226, file: !223, line: 1711, baseType: !242, offset: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 43, elements: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !{}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !226, file: !223, line: 1712, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !252, line: 48, baseType: !253)
!252 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !252, line: 37, size: 64, elements: !254)
!254 = !{!255, !261}
!255 = !DIDerivedType(tag: DW_TAG_member, scope: !253, file: !252, line: 38, baseType: !256, size: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 38, size: 32, elements: !257)
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !256, file: !252, line: 39, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !252, line: 40, baseType: !259, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, scope: !253, file: !252, line: 42, baseType: !262, size: 32, offset: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 42, size: 32, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !262, file: !252, line: 43, baseType: !259, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !262, file: !252, line: 44, baseType: !259, size: 32)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "cmd", scope: !268, file: !221, line: 22, type: !275, isLocal: true, isDefinition: true)
!268 = distinct !DISubprogram(name: "console_getline", scope: !221, file: !221, line: 20, type: !269, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !272)
!269 = !DISubroutineType(types: !270)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!272 = !{!273}
!273 = !DILocalVariable(name: "ret", scope: !274, file: !221, line: 29, type: !102)
!274 = distinct !DILexicalBlock(scope: !268, file: !221, line: 29, column: 8)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "console_input", file: !277, line: 21, size: 1088, elements: !278)
!277 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !{!279, !282, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !276, file: !277, line: 23, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !281)
!281 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "is_mcumgr", scope: !276, file: !277, line: 25, baseType: !145, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !276, file: !277, line: 27, baseType: !284, size: 1024, offset: 40)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 1024, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 128)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "line_bufs", scope: !111, file: !221, line: 15, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 2176, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 2)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !294, file: !330, line: 27, type: !355, isLocal: true, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, retainedTypes: !308, globals: !327, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!296 = !{!297, !30}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !298, line: 27, baseType: !32, size: 32, elements: !299)
!298 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307}
!300 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!301 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!302 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!303 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!304 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!305 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!306 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!307 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!308 = !{!102, !114, !103, !24, !309, !271, !174, !325}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !311, line: 54, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !320, !324}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !310, file: !311, line: 55, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !315, line: 33, baseType: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !315, line: 29, size: 32, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !315, line: 30, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !310, file: !311, line: 60, baseType: !321, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !297}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !310, file: !311, line: 65, baseType: !321, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !326)
!326 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!327 = !{!292, !328, !332, !334, !345, !347}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !294, file: !330, line: 44, type: !331, isLocal: true, isDefinition: true)
!330 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 43, elements: !244)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !294, file: !330, line: 49, type: !331, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !294, file: !330, line: 36, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 128, elements: !343)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !298, line: 114, size: 128, elements: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !337, file: !298, line: 115, baseType: !297, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !337, file: !298, line: 141, baseType: !145, size: 8, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !337, file: !298, line: 149, baseType: !174, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !337, file: !298, line: 156, baseType: !174, size: 32, offset: 96)
!343 = !{!344}
!344 = !DISubrange(count: 1)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !294, file: !330, line: 40, type: !336, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !294, file: !330, line: 28, type: !349, isLocal: true, isDefinition: true)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !315, line: 40, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !315, line: 35, size: 64, elements: !351)
!351 = !{!352, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !350, file: !315, line: 36, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !350, file: !315, line: 37, baseType: !353, size: 32, offset: 32)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 32, elements: !343)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !357, line: 22, baseType: !281)
!357 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!359 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !362, file: !389, line: 50, type: !376, isLocal: true, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, retainedTypes: !364, globals: !386, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!364 = !{!154, !114, !118, !103, !102, !174, !325, !365, !271, !376, !377}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !367, line: 45, size: 64, elements: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = !{!369, !375}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !366, file: !367, line: 46, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !315, line: 33, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !315, line: 29, size: 32, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !315, line: 30, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !366, file: !367, line: 48, baseType: !174, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !367, line: 38, size: 64, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !378, file: !367, line: 39, baseType: !370, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !378, file: !367, line: 41, baseType: !382, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !367, line: 35, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !376}
!386 = !{!387, !391, !399, !360, !401, !411}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "latency_lock", scope: !362, file: !389, line: 44, type: !390, isLocal: true, isDefinition: true)
!389 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 43, elements: !244)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !362, file: !389, line: 46, type: !393, isLocal: true, isDefinition: true)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !315, line: 40, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !315, line: 35, size: 64, elements: !395)
!395 = !{!396, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !394, file: !315, line: 36, baseType: !397, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !394, file: !315, line: 37, baseType: !397, size: 32, offset: 32)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "latency_subs", scope: !362, file: !389, line: 52, type: !393, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !362, file: !389, line: 39, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, elements: !409)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 35, size: 96, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !389, line: 36, baseType: !297, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !404, file: !389, line: 37, baseType: !145, size: 8, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !404, file: !389, line: 38, baseType: !356, size: 32, offset: 64)
!409 = !{!410}
!410 = !DISubrange(count: 0)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !362, file: !389, line: 48, type: !376, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !415, file: !422, line: 47, type: !435, isLocal: true, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !417, retainedTypes: !418, globals: !419, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!417 = !{!297}
!418 = !{!118, !103}
!419 = !{!420, !413, !432}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "cpus_states", scope: !415, file: !422, line: 50, type: !423, isLocal: true, isDefinition: true)
!422 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 32, elements: !343)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !298, line: 114, size: 128, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !426, file: !298, line: 115, baseType: !297, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !426, file: !298, line: 141, baseType: !145, size: 8, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !426, file: !298, line: 149, baseType: !174, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !426, file: !298, line: 156, baseType: !174, size: 32, offset: 96)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !415, file: !422, line: 55, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8, elements: !343)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, elements: !409)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "static_regions", scope: !438, file: !445, line: 62, type: !573, isLocal: true, isDefinition: true)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !440, globals: !441, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!440 = !{!118, !103, !174, !102}
!441 = !{!442, !436}
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !444, file: !445, line: 198, type: !561, isLocal: true, isDefinition: true)
!444 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !445, file: !445, line: 175, type: !446, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !438, retainedNodes: !558)
!445 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !DISubroutineType(types: !447)
!447 = !{null, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !450, line: 245, size: 1024, elements: !451)
!450 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !{!452, !515, !528, !529, !530, !531, !537, !553}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !449, file: !450, line: 247, baseType: !453, size: 384)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !450, line: 57, size: 384, elements: !454)
!454 = !{!455, !480, !487, !488, !489, !502, !503, !504}
!455 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !450, line: 60, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !450, line: 60, size: 64, elements: !457)
!457 = !{!458, !473}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !456, file: !450, line: 61, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !252, line: 49, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !252, line: 37, size: 64, elements: !461)
!461 = !{!462, !468}
!462 = !DIDerivedType(tag: DW_TAG_member, scope: !460, file: !252, line: 38, baseType: !463, size: 32)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !460, file: !252, line: 38, size: 32, elements: !464)
!464 = !{!465, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !463, file: !252, line: 39, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !252, line: 40, baseType: !466, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !460, file: !252, line: 42, baseType: !469, size: 32, offset: 32)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !460, file: !252, line: 42, size: 32, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !469, file: !252, line: 43, baseType: !466, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !469, file: !252, line: 44, baseType: !466, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !456, file: !450, line: 62, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !475, line: 49, size: 64, elements: !476)
!475 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !474, file: !475, line: 50, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 64, elements: !290)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !453, file: !450, line: 68, baseType: !481, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !484)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !483, file: !247, line: 232, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !252, line: 48, baseType: !460)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !453, file: !450, line: 71, baseType: !145, size: 8, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !453, file: !450, line: 74, baseType: !145, size: 8, offset: 104)
!489 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !450, line: 90, baseType: !490, size: 16, offset: 112)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !450, line: 90, size: 16, elements: !491)
!491 = !{!492, !499}
!492 = !DIDerivedType(tag: DW_TAG_member, scope: !490, file: !450, line: 91, baseType: !493, size: 16)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !490, file: !450, line: 91, size: 16, elements: !494)
!494 = !{!495, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !493, file: !450, line: 96, baseType: !496, size: 8)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !497)
!497 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !493, file: !450, line: 97, baseType: !145, size: 8, offset: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !490, file: !450, line: 100, baseType: !500, size: 16)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !501)
!501 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !453, file: !450, line: 107, baseType: !174, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !453, file: !450, line: 127, baseType: !102, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !453, file: !450, line: 131, baseType: !505, size: 192, offset: 192)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !506)
!506 = !{!507, !508, !514}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !505, file: !247, line: 245, baseType: !459, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !505, file: !247, line: 246, baseType: !509, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !505, file: !247, line: 249, baseType: !116, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !449, file: !450, line: 250, baseType: !516, size: 288, offset: 384)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !517, line: 25, size: 288, elements: !518)
!517 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !516, file: !517, line: 26, baseType: !174, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !516, file: !517, line: 27, baseType: !174, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !516, file: !517, line: 28, baseType: !174, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !516, file: !517, line: 29, baseType: !174, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !516, file: !517, line: 30, baseType: !174, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !516, file: !517, line: 31, baseType: !174, size: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !516, file: !517, line: 32, baseType: !174, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !516, file: !517, line: 33, baseType: !174, size: 32, offset: 224)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !516, file: !517, line: 34, baseType: !174, size: 32, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !449, file: !450, line: 253, baseType: !102, size: 32, offset: 672)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !449, file: !450, line: 256, baseType: !482, size: 64, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !449, file: !450, line: 294, baseType: !103, size: 32, offset: 768)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !449, file: !450, line: 300, baseType: !532, size: 96, offset: 800)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !450, line: 149, size: 96, elements: !533)
!533 = !{!534, !535, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !532, file: !450, line: 153, baseType: !22, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !532, file: !450, line: 162, baseType: !118, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !532, file: !450, line: 168, baseType: !118, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !449, file: !450, line: 325, baseType: !538, size: 32, offset: 896)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !223, line: 5073, size: 160, elements: !540)
!540 = !{!541, !550, !551}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !539, file: !223, line: 5074, baseType: !542, size: 96)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !543, line: 56, size: 96, elements: !544)
!543 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!544 = !{!545, !548, !549}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !542, file: !543, line: 57, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !543, line: 57, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !542, file: !543, line: 58, baseType: !102, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !542, file: !543, line: 59, baseType: !118, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !539, file: !223, line: 5075, baseType: !482, size: 64, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !539, file: !223, line: 5076, baseType: !552, offset: 160)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 43, elements: !244)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !449, file: !450, line: 343, baseType: !554, size: 64, offset: 928)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !517, line: 60, size: 64, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !554, file: !517, line: 63, baseType: !174, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !554, file: !517, line: 66, baseType: !174, size: 32, offset: 32)
!558 = !{!559, !560}
!559 = !DILocalVariable(name: "thread", arg: 1, scope: !444, file: !445, line: 175, type: !448)
!560 = !DILocalVariable(name: "region_num", scope: !444, file: !445, line: 200, type: !145)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, elements: !409)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !563, line: 52, size: 96, elements: !564)
!563 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!564 = !{!565, !566, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !562, file: !563, line: 53, baseType: !22, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !562, file: !563, line: 54, baseType: !118, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !562, file: !563, line: 55, baseType: !568, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !569, line: 151, baseType: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 149, size: 32, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !570, file: !569, line: 150, baseType: !174, size: 32)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 96, elements: !343)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !577, file: !611, line: 39, type: !145, isLocal: true, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !579, globals: !610, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!579 = !{!580, !102, !103, !598, !145}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !582, line: 1226, baseType: !583)
!582 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 1213, size: 352, elements: !584)
!584 = !{!585, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !583, file: !582, line: 1215, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !174)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !583, file: !582, line: 1216, baseType: !587, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !583, file: !582, line: 1217, baseType: !587, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !583, file: !582, line: 1218, baseType: !587, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !583, file: !582, line: 1219, baseType: !587, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !583, file: !582, line: 1220, baseType: !587, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !583, file: !582, line: 1221, baseType: !587, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !583, file: !582, line: 1222, baseType: !587, size: 32, offset: 224)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !583, file: !582, line: 1223, baseType: !587, size: 32, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !583, file: !582, line: 1224, baseType: !587, size: 32, offset: 288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !583, file: !582, line: 1225, baseType: !587, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !601, line: 27, size: 96, elements: !602)
!601 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !600, file: !601, line: 29, baseType: !174, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !601, line: 31, baseType: !135, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !600, file: !601, line: 37, baseType: !606, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !569, line: 146, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !569, line: 141, size: 32, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !607, file: !569, line: 143, baseType: !174, size: 32)
!610 = !{!575}
!611 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !614, file: !621, line: 21, type: !106, isLocal: true, isDefinition: true)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !616, globals: !620, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!616 = !{!617, !103, !102}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !619, line: 22, baseType: !103)
!619 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!620 = !{!612}
!621 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !624, file: !629, line: 13, type: !646, isLocal: true, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !626, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!626 = !{!627, !622}
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "mpu_config", scope: !624, file: !629, line: 37, type: !630, isLocal: false, isDefinition: true)
!629 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !601, line: 41, size: 64, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !631, file: !601, line: 43, baseType: !174, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !631, file: !601, line: 45, baseType: !635, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !601, line: 27, size: 96, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !637, file: !601, line: 29, baseType: !174, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !601, line: 31, baseType: !135, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !637, file: !601, line: 37, baseType: !642, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !569, line: 146, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !569, line: 141, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !643, file: !569, line: 143, baseType: !174, size: 32)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 192, elements: !290)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !649, file: !809, line: 93, type: !810, isLocal: true, isDefinition: true, align: 32)
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !651, globals: !804, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!651 = !{!652, !145, !102, !103, !726, !174, !727, !763, !774}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !654, line: 882, baseType: !655)
!654 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 850, size: 19456, elements: !656)
!656 = !{!657, !661, !662, !663, !667, !668, !670, !671, !672, !676, !677, !678, !682, !683, !687, !688, !692, !693, !697, !698, !699, !700, !701, !702, !706, !707, !711, !712, !716}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !655, file: !654, line: 851, baseType: !658, size: 960)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 960, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 30)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !655, file: !654, line: 852, baseType: !587, size: 32, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !655, file: !654, line: 853, baseType: !587, size: 32, offset: 992)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !655, file: !654, line: 854, baseType: !664, size: 1088, offset: 1024)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 1088, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 34)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !655, file: !654, line: 855, baseType: !587, size: 32, offset: 2112)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !655, file: !654, line: 856, baseType: !669, size: 64, offset: 2144)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 64, elements: !290)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !655, file: !654, line: 857, baseType: !587, size: 32, offset: 2208)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !655, file: !654, line: 858, baseType: !587, size: 32, offset: 2240)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !655, file: !654, line: 859, baseType: !673, size: 3904, offset: 2272)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 3904, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 122)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !655, file: !654, line: 860, baseType: !587, size: 32, offset: 6176)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !655, file: !654, line: 861, baseType: !587, size: 32, offset: 6208)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !655, file: !654, line: 862, baseType: !679, size: 1952, offset: 6240)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 1952, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 61)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !655, file: !654, line: 863, baseType: !587, size: 32, offset: 8192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !655, file: !654, line: 864, baseType: !684, size: 288, offset: 8224)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 288, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 9)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !655, file: !654, line: 865, baseType: !586, size: 32, offset: 8512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !655, file: !654, line: 866, baseType: !689, size: 1696, offset: 8544)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 1696, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 53)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !655, file: !654, line: 867, baseType: !587, size: 32, offset: 10240)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !655, file: !654, line: 868, baseType: !694, size: 96, offset: 10272)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 96, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 3)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !655, file: !654, line: 869, baseType: !587, size: 32, offset: 10368)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !655, file: !654, line: 870, baseType: !669, size: 64, offset: 10400)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !655, file: !654, line: 871, baseType: !587, size: 32, offset: 10464)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !655, file: !654, line: 872, baseType: !587, size: 32, offset: 10496)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !655, file: !654, line: 873, baseType: !587, size: 32, offset: 10528)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !655, file: !654, line: 875, baseType: !703, size: 352, offset: 10560)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 352, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 11)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !655, file: !654, line: 876, baseType: !587, size: 32, offset: 10912)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !655, file: !654, line: 878, baseType: !708, size: 256, offset: 10944)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 256, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 8)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !655, file: !654, line: 879, baseType: !587, size: 32, offset: 11200)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !655, file: !654, line: 880, baseType: !713, size: 7200, offset: 11232)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 7200, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 225)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !655, file: !654, line: 881, baseType: !717, size: 1024, offset: 18432)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 1024, elements: !709)
!718 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !654, line: 258, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 252, size: 128, elements: !721)
!721 = !{!722, !723, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !720, file: !654, line: 253, baseType: !587, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !720, file: !654, line: 254, baseType: !587, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !720, file: !654, line: 255, baseType: !587, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !720, file: !654, line: 257, baseType: !586, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !582, line: 468, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 445, size: 1120, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !756, !760, !762}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !729, file: !582, line: 447, baseType: !586, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !729, file: !582, line: 448, baseType: !587, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !729, file: !582, line: 449, baseType: !587, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !729, file: !582, line: 450, baseType: !587, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !729, file: !582, line: 451, baseType: !587, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !729, file: !582, line: 452, baseType: !587, size: 32, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !729, file: !582, line: 453, baseType: !738, size: 96, offset: 192)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 96, elements: !740)
!739 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !145)
!740 = !{!741}
!741 = !DISubrange(count: 12)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !729, file: !582, line: 454, baseType: !587, size: 32, offset: 288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !729, file: !582, line: 455, baseType: !587, size: 32, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !729, file: !582, line: 456, baseType: !587, size: 32, offset: 352)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !729, file: !582, line: 457, baseType: !587, size: 32, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !729, file: !582, line: 458, baseType: !587, size: 32, offset: 416)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !729, file: !582, line: 459, baseType: !587, size: 32, offset: 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !729, file: !582, line: 460, baseType: !587, size: 32, offset: 480)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !729, file: !582, line: 461, baseType: !669, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !729, file: !582, line: 462, baseType: !586, size: 32, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !729, file: !582, line: 463, baseType: !586, size: 32, offset: 608)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !729, file: !582, line: 464, baseType: !753, size: 128, offset: 640)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 128, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 4)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !729, file: !582, line: 465, baseType: !757, size: 160, offset: 768)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 160, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 5)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !729, file: !582, line: 466, baseType: !761, size: 160, offset: 928)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 160, elements: !758)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !729, file: !582, line: 467, baseType: !587, size: 32, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !765, file: !764, line: 167, baseType: !773)
!764 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!765 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !764, file: !764, line: 134, type: !766, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !649, retainedNodes: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !174}
!768 = !{!769, !770, !772}
!769 = !DILocalVariable(name: "time_us", arg: 1, scope: !765, file: !764, line: 134, type: !174)
!770 = !DILocalVariable(name: "delay_cycles", scope: !765, file: !764, line: 168, type: !771)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!772 = !DILocalVariable(name: "cycles", scope: !765, file: !764, line: 171, type: !174)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !654, line: 2140, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 2119, size: 10880, elements: !777)
!777 = !{!778, !782, !783, !787, !788, !793, !794, !795, !796, !800, !801, !802, !803}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !776, file: !654, line: 2120, baseType: !779, size: 8192)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 8192, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !776, file: !654, line: 2121, baseType: !586, size: 32, offset: 8192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !776, file: !654, line: 2122, baseType: !784, size: 2048, offset: 8224)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 2048, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !776, file: !654, line: 2123, baseType: !587, size: 32, offset: 10272)
!788 = !DIDerivedType(tag: DW_TAG_member, scope: !776, file: !654, line: 2125, baseType: !789, size: 32, offset: 10304)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !776, file: !654, line: 2125, size: 32, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !789, file: !654, line: 2126, baseType: !587, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !789, file: !654, line: 2127, baseType: !587, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !776, file: !654, line: 2130, baseType: !587, size: 32, offset: 10336)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !776, file: !654, line: 2131, baseType: !587, size: 32, offset: 10368)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !776, file: !654, line: 2133, baseType: !587, size: 32, offset: 10400)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !776, file: !654, line: 2135, baseType: !797, size: 320, offset: 10432)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 320, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 10)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !776, file: !654, line: 2136, baseType: !587, size: 32, offset: 10752)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !776, file: !654, line: 2137, baseType: !586, size: 32, offset: 10784)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !776, file: !654, line: 2138, baseType: !587, size: 32, offset: 10816)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !776, file: !654, line: 2139, baseType: !587, size: 32, offset: 10848)
!804 = !{!647, !805}
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !765, file: !764, line: 161, type: !807, isLocal: true, isDefinition: true, align: 128)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 48, elements: !695)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!809 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !812, line: 51, size: 64, elements: !813)
!812 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!813 = !{!814, !821}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !811, file: !812, line: 60, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DISubroutineType(types: !817)
!817 = !{!103, !818}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !812, line: 48, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !811, file: !812, line: 65, baseType: !818, size: 32, offset: 32)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "__device_dts_ord_34", scope: !824, file: !1047, line: 733, type: !1148, isLocal: false, isDefinition: true, align: 32)
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !826, retainedTypes: !959, globals: !1043, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/getline")
!826 = !{!827, !833, !30, !838, !843, !850, !856, !862, !871, !875, !924, !931, !950}
!827 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !828, line: 23, baseType: !32, size: 32, elements: !829)
!828 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = !{!830, !831, !832}
!830 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!831 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!832 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !828, line: 48, baseType: !32, size: 32, elements: !834)
!834 = !{!835, !836, !837}
!835 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!836 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!837 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 167, baseType: !32, size: 32, elements: !840)
!839 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!840 = !{!841, !842}
!841 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!842 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 107, baseType: !32, size: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849}
!845 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!846 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!847 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!848 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!849 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 208, baseType: !32, size: 32, elements: !851)
!851 = !{!852, !853, !854, !855}
!852 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!853 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!854 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!855 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 261, baseType: !32, size: 32, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!859 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!860 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!861 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 237, baseType: !32, size: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870}
!864 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!865 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!866 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!867 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!868 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!869 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!870 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!871 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 152, baseType: !32, size: 32, elements: !872)
!872 = !{!873, !874}
!873 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!874 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !654, line: 71, baseType: !103, size: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923}
!877 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!878 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!879 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!880 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!881 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!882 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!883 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!884 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!885 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!886 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!887 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!888 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!889 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!890 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!891 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!892 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!893 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!894 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!895 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!896 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!897 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!898 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!899 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!900 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!901 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!902 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!903 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!904 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!905 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!906 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!907 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!908 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!909 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!910 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!911 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!912 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!913 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!914 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!915 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!916 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!917 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!918 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!919 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!920 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!921 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!922 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!923 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !925, line: 44, baseType: !32, size: 32, elements: !926)
!925 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = !{!927, !928, !929, !930}
!927 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!928 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!929 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!930 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !932, line: 54, baseType: !32, size: 32, elements: !933)
!932 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949}
!934 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!935 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!936 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!937 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!938 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!939 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!940 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!941 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!942 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!943 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!944 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!945 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!946 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!947 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!948 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!949 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!950 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !951, line: 53, baseType: !32, size: 32, elements: !952)
!951 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!952 = !{!953, !954, !955, !956, !957, !958}
!953 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!954 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!955 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!956 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!957 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!958 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!959 = !{!827, !102, !103, !960, !1008, !1009, !1010, !1011, !114, !174, !325, !148, !726, !194, !376, !1012, !1042, !118}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !654, line: 837, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 804, size: 11008, elements: !963)
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !975, !976, !977, !978, !979, !980, !984, !985, !986, !990, !991, !992, !993, !994, !995, !996, !1000, !1001, !1005, !1006, !1007}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !962, file: !654, line: 805, baseType: !587, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !962, file: !654, line: 806, baseType: !587, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !962, file: !654, line: 807, baseType: !587, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !962, file: !654, line: 808, baseType: !587, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !962, file: !654, line: 809, baseType: !587, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !962, file: !654, line: 810, baseType: !587, size: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !962, file: !654, line: 811, baseType: !587, size: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !962, file: !654, line: 812, baseType: !972, size: 1824, offset: 224)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 1824, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 57)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !962, file: !654, line: 813, baseType: !587, size: 32, offset: 2048)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !962, file: !654, line: 814, baseType: !587, size: 32, offset: 2080)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !962, file: !654, line: 815, baseType: !586, size: 32, offset: 2112)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !962, file: !654, line: 816, baseType: !587, size: 32, offset: 2144)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !962, file: !654, line: 817, baseType: !587, size: 32, offset: 2176)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !962, file: !654, line: 818, baseType: !981, size: 3968, offset: 2208)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 3968, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 124)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !962, file: !654, line: 819, baseType: !587, size: 32, offset: 6176)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !962, file: !654, line: 820, baseType: !587, size: 32, offset: 6208)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !962, file: !654, line: 821, baseType: !987, size: 2016, offset: 6240)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 2016, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 63)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !962, file: !654, line: 822, baseType: !586, size: 32, offset: 8256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !962, file: !654, line: 824, baseType: !586, size: 32, offset: 8288)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !962, file: !654, line: 825, baseType: !586, size: 32, offset: 8320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !962, file: !654, line: 826, baseType: !586, size: 32, offset: 8352)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !962, file: !654, line: 828, baseType: !586, size: 32, offset: 8384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !962, file: !654, line: 829, baseType: !586, size: 32, offset: 8416)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !962, file: !654, line: 831, baseType: !997, size: 1984, offset: 8448)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 1984, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 62)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !962, file: !654, line: 832, baseType: !587, size: 32, offset: 10432)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !962, file: !654, line: 833, baseType: !1002, size: 224, offset: 10464)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 224, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 7)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !962, file: !654, line: 834, baseType: !587, size: 32, offset: 10688)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !962, file: !654, line: 835, baseType: !708, size: 256, offset: 10720)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !962, file: !654, line: 836, baseType: !587, size: 32, offset: 10976)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !839, line: 146, baseType: !843)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !839, line: 164, baseType: !871)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !582, line: 426, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 411, size: 28704, elements: !1015)
!1015 = !{!1016, !1018, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1033, !1037, !1041}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1014, file: !582, line: 413, baseType: !1017, size: 256)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 256, elements: !709)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1014, file: !582, line: 414, baseType: !1019, size: 768, offset: 256)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 768, elements: !1020)
!1020 = !{!1021}
!1021 = !DISubrange(count: 24)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1014, file: !582, line: 415, baseType: !1017, size: 256, offset: 1024)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1014, file: !582, line: 416, baseType: !1019, size: 768, offset: 1280)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1014, file: !582, line: 417, baseType: !1017, size: 256, offset: 2048)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1014, file: !582, line: 418, baseType: !1019, size: 768, offset: 2304)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1014, file: !582, line: 419, baseType: !1017, size: 256, offset: 3072)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1014, file: !582, line: 420, baseType: !1019, size: 768, offset: 3328)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1014, file: !582, line: 421, baseType: !1017, size: 256, offset: 4096)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1014, file: !582, line: 422, baseType: !1030, size: 1792, offset: 4352)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 1792, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 56)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !1014, file: !582, line: 423, baseType: !1034, size: 1920, offset: 6144)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 1920, elements: !1035)
!1035 = !{!1036}
!1036 = !DISubrange(count: 240)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1014, file: !582, line: 424, baseType: !1038, size: 20608, offset: 8064)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 20608, elements: !1039)
!1039 = !{!1040}
!1040 = !DISubrange(count: 644)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1014, file: !582, line: 425, baseType: !587, size: 32, offset: 28672)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !925, line: 56, baseType: !102)
!1043 = !{!1044, !1094, !1135, !822, !1138, !1163, !1165, !1182, !1184, !1194, !1197, !1212, !1215, !1253, !1267}
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "on", scope: !1046, file: !1047, line: 549, type: !356, isLocal: true, isDefinition: true)
!1046 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !1047, file: !1047, line: 547, type: !1048, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !824, retainedNodes: !1050)
!1047 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !833}
!1050 = !{!1051, !1052, !1055}
!1051 = !DILocalVariable(name: "start_mode", arg: 1, scope: !1046, file: !1047, line: 547, type: !833)
!1052 = !DILocalVariable(name: "err", scope: !1053, file: !1047, line: 553, type: !103)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !1047, line: 552, column: 31)
!1054 = distinct !DILexicalBlock(scope: !1046, file: !1047, line: 552, column: 6)
!1055 = !DILocalVariable(name: "mgr", scope: !1053, file: !1047, line: 554, type: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 32)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !1058, line: 154, size: 224, elements: !1059)
!1058 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1059 = !{!1060, !1072, !1073, !1089, !1091, !1092, !1093}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !1057, file: !1058, line: 158, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !315, line: 40, baseType: !1062)
