; ModuleID = 'build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.anon.11 = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.ztest_suite_stats, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_test_pytest", scope: !27, file: !111, line: 8, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_test_pytest", scope: !27, file: !111, line: 8, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__test_pytest__test_pytest", scope: !27, file: !111, line: 10, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_test_pytest_test_pytest", scope: !27, file: !111, line: 10, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !218, file: !755, line: 149, type: !756, isLocal: true, isDefinition: true, align: 32)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !220, globals: !754, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest")
!220 = !{!106, !107, !221, !355, !440}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !223, line: 352, baseType: !224)
!223 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 339, size: 448, elements: !225)
!225 = !{!226, !242, !254, !264, !275, !285, !293, !303, !314, !324, !334, !344}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !224, file: !223, line: 340, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !223, line: 57, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 44, size: 32, elements: !231)
!231 = !{!232, !241}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !230, file: !223, line: 55, baseType: !233, size: 32)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !230, file: !223, line: 45, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !233, file: !223, line: 47, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !233, file: !223, line: 49, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !233, file: !223, line: 50, baseType: !152, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !233, file: !223, line: 51, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !233, file: !223, line: 52, baseType: !152, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !233, file: !223, line: 53, baseType: !152, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !230, file: !223, line: 56, baseType: !152, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !224, file: !223, line: 341, baseType: !243, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !223, line: 124, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 114, size: 32, elements: !246)
!246 = !{!247, !253}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !245, file: !223, line: 122, baseType: !248, size: 32)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !245, file: !223, line: 115, size: 32, elements: !249)
!249 = !{!250, !251, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !248, file: !223, line: 117, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !248, file: !223, line: 118, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !248, file: !223, line: 120, baseType: !152, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !245, file: !223, line: 123, baseType: !152, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !224, file: !223, line: 342, baseType: !255, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !223, line: 161, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 155, size: 32, elements: !258)
!258 = !{!259, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !257, file: !223, line: 159, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !223, line: 156, size: 32, elements: !261)
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !260, file: !223, line: 157, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !257, file: !223, line: 160, baseType: !152, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !224, file: !223, line: 343, baseType: !265, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !223, line: 179, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 173, size: 32, elements: !269)
!269 = !{!270, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !268, file: !223, line: 177, baseType: !271, size: 32)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !223, line: 174, size: 32, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !271, file: !223, line: 175, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !268, file: !223, line: 178, baseType: !152, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !224, file: !223, line: 344, baseType: !276, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !223, line: 197, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 191, size: 32, elements: !279)
!279 = !{!280, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !278, file: !223, line: 195, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !278, file: !223, line: 192, size: 32, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !281, file: !223, line: 193, baseType: !152, size: 4, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !278, file: !223, line: 196, baseType: !152, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !224, file: !223, line: 345, baseType: !286, size: 96, offset: 160)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 96, elements: !291)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !288, line: 53, baseType: !289)
!288 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !195)
!291 = !{!292}
!292 = !DISubrange(count: 12)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !224, file: !223, line: 346, baseType: !294, size: 32, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !223, line: 216, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 210, size: 32, elements: !297)
!297 = !{!298, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !296, file: !223, line: 214, baseType: !299, size: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !296, file: !223, line: 211, size: 32, elements: !300)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !299, file: !223, line: 212, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !296, file: !223, line: 215, baseType: !152, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !224, file: !223, line: 347, baseType: !304, size: 32, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !223, line: 236, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 228, size: 32, elements: !307)
!307 = !{!308, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !306, file: !223, line: 234, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !223, line: 229, size: 32, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !309, file: !223, line: 231, baseType: !152, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !309, file: !223, line: 233, baseType: !152, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !306, file: !223, line: 235, baseType: !152, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !224, file: !223, line: 348, baseType: !315, size: 32, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !223, line: 266, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 260, size: 32, elements: !318)
!318 = !{!319, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !317, file: !223, line: 264, baseType: !320, size: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !317, file: !223, line: 261, size: 32, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !320, file: !223, line: 262, baseType: !152, size: 2, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !317, file: !223, line: 265, baseType: !152, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !224, file: !223, line: 349, baseType: !325, size: 32, offset: 352)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !223, line: 291, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 285, size: 32, elements: !328)
!328 = !{!329, !333}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !327, file: !223, line: 289, baseType: !330, size: 32)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !223, line: 286, size: 32, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !330, file: !223, line: 287, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !327, file: !223, line: 290, baseType: !152, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !224, file: !223, line: 350, baseType: !335, size: 32, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !223, line: 309, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 303, size: 32, elements: !338)
!338 = !{!339, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !337, file: !223, line: 307, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !223, line: 304, size: 32, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !340, file: !223, line: 305, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !337, file: !223, line: 308, baseType: !152, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !224, file: !223, line: 351, baseType: !345, size: 32, offset: 416)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !223, line: 326, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 321, size: 32, elements: !349)
!349 = !{!350, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !348, file: !223, line: 324, baseType: !351, size: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !223, line: 322, size: 32, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !351, file: !223, line: 323, baseType: !152, size: 32, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !348, file: !223, line: 325, baseType: !152, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !357, line: 267, baseType: !358)
!357 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 259, size: 2560, elements: !359)
!359 = !{!360, !370, !374, !401, !405, !423, !427}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !358, file: !357, line: 260, baseType: !361, size: 8)
!361 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !357, line: 50, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !357, line: 44, size: 8, elements: !364)
!364 = !{!365, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !363, file: !357, line: 48, baseType: !366, size: 8)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !357, line: 45, size: 8, elements: !367)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !366, file: !357, line: 46, baseType: !195, size: 1, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !363, file: !357, line: 49, baseType: !195, size: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !358, file: !357, line: 261, baseType: !371, size: 24, offset: 8)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 24, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 3)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !358, file: !357, line: 262, baseType: !375, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !357, line: 86, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !357, line: 62, size: 32, elements: !379)
!379 = !{!380, !396, !400}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !378, file: !357, line: 79, baseType: !381, size: 32)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !378, file: !357, line: 63, size: 32, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !381, file: !357, line: 64, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !381, file: !357, line: 66, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !381, file: !357, line: 67, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !381, file: !357, line: 68, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !381, file: !357, line: 69, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !381, file: !357, line: 70, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !381, file: !357, line: 71, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !381, file: !357, line: 72, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !381, file: !357, line: 73, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !381, file: !357, line: 74, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !381, file: !357, line: 75, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !381, file: !357, line: 76, baseType: !152, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !381, file: !357, line: 77, baseType: !152, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !378, file: !357, line: 84, baseType: !397, size: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !378, file: !357, line: 80, size: 32, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !397, file: !357, line: 82, baseType: !152, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !378, file: !357, line: 85, baseType: !152, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !358, file: !357, line: 263, baseType: !402, size: 192, offset: 64)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 192, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 24)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !358, file: !357, line: 264, baseType: !406, size: 384, offset: 256)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 384, elements: !291)
!407 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !357, line: 163, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !357, line: 149, size: 32, elements: !410)
!410 = !{!411, !422}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !409, file: !357, line: 161, baseType: !412, size: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !357, line: 150, size: 32, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !412, file: !357, line: 151, baseType: !152, size: 4, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !412, file: !357, line: 153, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !412, file: !357, line: 154, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !412, file: !357, line: 155, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !412, file: !357, line: 156, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !412, file: !357, line: 157, baseType: !152, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !412, file: !357, line: 158, baseType: !152, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !412, file: !357, line: 160, baseType: !152, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !409, file: !357, line: 162, baseType: !152, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !358, file: !357, line: 265, baseType: !424, size: 384, offset: 640)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 384, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 48)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !358, file: !357, line: 266, baseType: !428, size: 1536, offset: 1024)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 1536, elements: !425)
!429 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !357, line: 218, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !357, line: 209, size: 32, elements: !432)
!432 = !{!433, !439}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !431, file: !357, line: 216, baseType: !434, size: 32)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !431, file: !357, line: 210, size: 32, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !434, file: !357, line: 211, baseType: !152, size: 4, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !434, file: !357, line: 213, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !434, file: !357, line: 214, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !431, file: !357, line: 217, baseType: !152, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !442, line: 788, baseType: !443)
!442 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 771, size: 704, elements: !444)
!444 = !{!445, !460, !461, !492, !523, !556, !591, !615, !627, !628, !645, !646, !658, !670, !683, !684}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !443, file: !442, line: 772, baseType: !446, size: 8)
!446 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !442, line: 55, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 44, size: 8, elements: !449)
!449 = !{!450, !455, !459}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !448, file: !442, line: 49, baseType: !451, size: 8)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !442, line: 45, size: 8, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !451, file: !442, line: 46, baseType: !195, size: 1, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !451, file: !442, line: 47, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !448, file: !442, line: 53, baseType: !456, size: 8)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !442, line: 50, size: 8, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !456, file: !442, line: 51, baseType: !195, size: 2, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !448, file: !442, line: 54, baseType: !195, size: 8)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !443, file: !442, line: 773, baseType: !371, size: 24, offset: 8)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !443, file: !442, line: 774, baseType: !462, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !442, line: 102, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 72, size: 32, elements: !465)
!465 = !{!466, !486, !491}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !464, file: !442, line: 95, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !464, file: !442, line: 73, size: 32, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !467, file: !442, line: 74, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !467, file: !442, line: 75, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !467, file: !442, line: 76, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !467, file: !442, line: 77, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !467, file: !442, line: 79, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !467, file: !442, line: 80, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !467, file: !442, line: 81, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !467, file: !442, line: 82, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !467, file: !442, line: 83, baseType: !152, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !467, file: !442, line: 85, baseType: !152, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !467, file: !442, line: 86, baseType: !152, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !467, file: !442, line: 87, baseType: !152, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !467, file: !442, line: 88, baseType: !152, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !467, file: !442, line: 90, baseType: !152, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !467, file: !442, line: 91, baseType: !152, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !467, file: !442, line: 92, baseType: !152, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !467, file: !442, line: 93, baseType: !152, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !464, file: !442, line: 100, baseType: !487, size: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !464, file: !442, line: 96, size: 32, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !487, file: !442, line: 97, baseType: !152, size: 2, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !487, file: !442, line: 98, baseType: !152, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !464, file: !442, line: 101, baseType: !152, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !443, file: !442, line: 775, baseType: !493, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !442, line: 182, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 152, size: 32, elements: !496)
!496 = !{!497, !517, !522}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !495, file: !442, line: 175, baseType: !498, size: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !495, file: !442, line: 153, size: 32, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !498, file: !442, line: 154, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !498, file: !442, line: 155, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !498, file: !442, line: 156, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !498, file: !442, line: 157, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !498, file: !442, line: 159, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !498, file: !442, line: 160, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !498, file: !442, line: 161, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !498, file: !442, line: 162, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !498, file: !442, line: 163, baseType: !152, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !498, file: !442, line: 165, baseType: !152, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !498, file: !442, line: 166, baseType: !152, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !498, file: !442, line: 167, baseType: !152, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !498, file: !442, line: 168, baseType: !152, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !498, file: !442, line: 170, baseType: !152, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !498, file: !442, line: 171, baseType: !152, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !498, file: !442, line: 172, baseType: !152, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !498, file: !442, line: 173, baseType: !152, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !495, file: !442, line: 180, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !495, file: !442, line: 176, size: 32, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !518, file: !442, line: 177, baseType: !152, size: 2, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !518, file: !442, line: 178, baseType: !152, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !495, file: !442, line: 181, baseType: !152, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !443, file: !442, line: 776, baseType: !524, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !442, line: 262, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 232, size: 32, elements: !527)
!527 = !{!528, !550, !555}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !526, file: !442, line: 255, baseType: !529, size: 32)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !442, line: 233, size: 32, elements: !530)
!530 = !{!531, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !529, file: !442, line: 234, baseType: !532, size: 1, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !529, file: !442, line: 235, baseType: !532, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !529, file: !442, line: 236, baseType: !532, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !529, file: !442, line: 237, baseType: !532, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !529, file: !442, line: 239, baseType: !532, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !529, file: !442, line: 240, baseType: !532, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !529, file: !442, line: 241, baseType: !532, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !529, file: !442, line: 242, baseType: !532, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !529, file: !442, line: 243, baseType: !532, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !529, file: !442, line: 245, baseType: !532, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !529, file: !442, line: 246, baseType: !532, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !529, file: !442, line: 247, baseType: !532, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !529, file: !442, line: 248, baseType: !532, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !529, file: !442, line: 250, baseType: !532, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !529, file: !442, line: 251, baseType: !532, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !529, file: !442, line: 252, baseType: !532, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !529, file: !442, line: 253, baseType: !532, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !526, file: !442, line: 260, baseType: !551, size: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !442, line: 256, size: 32, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !551, file: !442, line: 257, baseType: !532, size: 2, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !551, file: !442, line: 258, baseType: !532, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !526, file: !442, line: 261, baseType: !152, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !443, file: !442, line: 777, baseType: !557, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !442, line: 345, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 312, size: 32, elements: !561)
!561 = !{!562, !584, !590}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !560, file: !442, line: 337, baseType: !563, size: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !442, line: 313, size: 32, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !563, file: !442, line: 314, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !563, file: !442, line: 315, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !563, file: !442, line: 316, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !563, file: !442, line: 317, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !563, file: !442, line: 318, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !563, file: !442, line: 319, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !563, file: !442, line: 321, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !563, file: !442, line: 322, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !563, file: !442, line: 323, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !563, file: !442, line: 324, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !563, file: !442, line: 325, baseType: !152, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !563, file: !442, line: 327, baseType: !152, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !563, file: !442, line: 328, baseType: !152, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !563, file: !442, line: 329, baseType: !152, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !563, file: !442, line: 330, baseType: !152, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !563, file: !442, line: 332, baseType: !152, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !563, file: !442, line: 333, baseType: !152, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !563, file: !442, line: 334, baseType: !152, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !563, file: !442, line: 335, baseType: !152, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !560, file: !442, line: 343, baseType: !585, size: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !442, line: 338, size: 32, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !585, file: !442, line: 339, baseType: !152, size: 2, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !585, file: !442, line: 340, baseType: !152, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !585, file: !442, line: 341, baseType: !152, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !560, file: !442, line: 344, baseType: !152, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !443, file: !442, line: 778, baseType: !592, size: 64, offset: 160)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 64, elements: !613)
!593 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !442, line: 422, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 402, size: 32, elements: !596)
!596 = !{!597, !612}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !595, file: !442, line: 420, baseType: !598, size: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !595, file: !442, line: 403, size: 32, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !598, file: !442, line: 405, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !598, file: !442, line: 406, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !598, file: !442, line: 408, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !598, file: !442, line: 409, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !598, file: !442, line: 410, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !598, file: !442, line: 411, baseType: !152, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !598, file: !442, line: 412, baseType: !152, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !598, file: !442, line: 413, baseType: !152, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !598, file: !442, line: 414, baseType: !152, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !598, file: !442, line: 415, baseType: !152, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !598, file: !442, line: 417, baseType: !152, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !598, file: !442, line: 418, baseType: !152, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !595, file: !442, line: 421, baseType: !152, size: 32)
!613 = !{!614}
!614 = !DISubrange(count: 2)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !443, file: !442, line: 779, baseType: !616, size: 8, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !442, line: 469, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 460, size: 8, elements: !619)
!619 = !{!620, !626}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !618, file: !442, line: 467, baseType: !621, size: 8)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !618, file: !442, line: 461, size: 8, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !621, file: !442, line: 463, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !621, file: !442, line: 465, baseType: !195, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !621, file: !442, line: 466, baseType: !195, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !618, file: !442, line: 468, baseType: !195, size: 8)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !443, file: !442, line: 780, baseType: !371, size: 24, offset: 232)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !443, file: !442, line: 781, baseType: !629, size: 8, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !442, line: 497, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 485, size: 8, elements: !632)
!632 = !{!633, !644}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !631, file: !442, line: 495, baseType: !634, size: 8)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !631, file: !442, line: 486, size: 8, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !634, file: !442, line: 487, baseType: !195, size: 1, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !634, file: !442, line: 488, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !634, file: !442, line: 489, baseType: !195, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !634, file: !442, line: 490, baseType: !195, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !634, file: !442, line: 491, baseType: !195, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !634, file: !442, line: 492, baseType: !195, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !634, file: !442, line: 493, baseType: !195, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !634, file: !442, line: 494, baseType: !195, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !631, file: !442, line: 496, baseType: !195, size: 8)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !443, file: !442, line: 782, baseType: !371, size: 24, offset: 264)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !443, file: !442, line: 783, baseType: !647, size: 32, offset: 288)
!647 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !442, line: 531, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 523, size: 32, elements: !650)
!650 = !{!651, !657}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !649, file: !442, line: 529, baseType: !652, size: 32)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !442, line: 524, size: 32, elements: !653)
!653 = !{!654, !655, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !652, file: !442, line: 525, baseType: !152, size: 8, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !652, file: !442, line: 527, baseType: !152, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !652, file: !442, line: 528, baseType: !152, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !649, file: !442, line: 530, baseType: !152, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !443, file: !442, line: 784, baseType: !659, size: 32, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !442, line: 558, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 550, size: 32, elements: !662)
!662 = !{!663, !669}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !661, file: !442, line: 556, baseType: !664, size: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !661, file: !442, line: 551, size: 32, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !664, file: !442, line: 552, baseType: !152, size: 16, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !664, file: !442, line: 553, baseType: !152, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !664, file: !442, line: 555, baseType: !152, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !661, file: !442, line: 557, baseType: !152, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !443, file: !442, line: 785, baseType: !671, size: 8, offset: 352)
!671 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !442, line: 587, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 577, size: 8, elements: !674)
!674 = !{!675, !682}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !673, file: !442, line: 585, baseType: !676, size: 8)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !673, file: !442, line: 578, size: 8, elements: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !676, file: !442, line: 580, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !676, file: !442, line: 581, baseType: !195, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !676, file: !442, line: 582, baseType: !195, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !676, file: !442, line: 583, baseType: !195, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !673, file: !442, line: 586, baseType: !195, size: 8)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !443, file: !442, line: 786, baseType: !371, size: 24, offset: 360)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !443, file: !442, line: 787, baseType: !685, size: 320, offset: 384)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 320, elements: !613)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !442, line: 766, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 759, size: 160, elements: !688)
!688 = !{!689, !701, !702, !713, !730, !742}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !687, file: !442, line: 760, baseType: !690, size: 8)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !442, line: 614, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 605, size: 8, elements: !693)
!693 = !{!694, !700}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !692, file: !442, line: 612, baseType: !695, size: 8)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !442, line: 606, size: 8, elements: !696)
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !695, file: !442, line: 608, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !695, file: !442, line: 610, baseType: !195, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !695, file: !442, line: 611, baseType: !195, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !692, file: !442, line: 613, baseType: !195, size: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !687, file: !442, line: 761, baseType: !371, size: 24, offset: 8)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !687, file: !442, line: 762, baseType: !703, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !442, line: 638, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 630, size: 32, elements: !706)
!706 = !{!707, !712}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !705, file: !442, line: 636, baseType: !708, size: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !442, line: 631, size: 32, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !708, file: !442, line: 632, baseType: !152, size: 13, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !708, file: !442, line: 634, baseType: !152, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !705, file: !442, line: 637, baseType: !152, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !687, file: !442, line: 763, baseType: !714, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !442, line: 667, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 654, size: 32, elements: !717)
!717 = !{!718, !729}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !716, file: !442, line: 665, baseType: !719, size: 32)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !716, file: !442, line: 655, size: 32, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !719, file: !442, line: 656, baseType: !152, size: 4, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !719, file: !442, line: 657, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !719, file: !442, line: 658, baseType: !152, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !719, file: !442, line: 659, baseType: !152, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !719, file: !442, line: 660, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !719, file: !442, line: 661, baseType: !152, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !719, file: !442, line: 662, baseType: !152, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !719, file: !442, line: 663, baseType: !152, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !716, file: !442, line: 666, baseType: !152, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !687, file: !442, line: 764, baseType: !731, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !442, line: 724, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 716, size: 32, elements: !735)
!735 = !{!736, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !734, file: !442, line: 722, baseType: !737, size: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !734, file: !442, line: 717, size: 32, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !737, file: !442, line: 719, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !737, file: !442, line: 720, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !734, file: !442, line: 723, baseType: !152, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !687, file: !442, line: 765, baseType: !743, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !442, line: 745, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !442, line: 738, size: 32, elements: !747)
!747 = !{!748, !753}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !746, file: !442, line: 743, baseType: !749, size: 32)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !746, file: !442, line: 739, size: 32, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !749, file: !442, line: 740, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !749, file: !442, line: 741, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !746, file: !442, line: 744, baseType: !152, size: 32)
!754 = !{!216}
!755 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !758, line: 51, size: 64, elements: !759)
!758 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!759 = !{!760, !785}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !757, file: !758, line: 60, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!107, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !767, line: 378, size: 192, elements: !768)
!767 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!768 = !{!769, !770, !771, !772, !778, !779}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !766, file: !767, line: 380, baseType: !118, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !766, file: !767, line: 382, baseType: !13, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !766, file: !767, line: 384, baseType: !13, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !766, file: !767, line: 386, baseType: !773, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !767, line: 351, size: 16, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !774, file: !767, line: 359, baseType: !195, size: 8)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !774, file: !767, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !766, file: !767, line: 388, baseType: !106, size: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !766, file: !767, line: 396, baseType: !780, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !767, line: 43, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !784)
!784 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !757, file: !758, line: 65, baseType: !764, size: 32, offset: 32)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !788, file: !795, line: 17, type: !940, isLocal: false, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !790, globals: !791, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/testsuite/pytest")
!790 = !{!185, !107, !152, !106}
!791 = !{!786, !792, !936}
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !794, file: !795, line: 198, type: !922, isLocal: true, isDefinition: true)
!794 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !795, file: !795, line: 175, type: !796, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !917)
!795 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = !DISubroutineType(types: !797)
!797 = !{null, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !800, line: 245, size: 1280, elements: !801)
!800 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!801 = !{!802, !866, !879, !880, !881, !885, !886, !892, !912}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !799, file: !800, line: 247, baseType: !803, size: 384)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !800, line: 57, size: 384, elements: !804)
!804 = !{!805, !831, !839, !840, !841, !852, !853, !854}
!805 = !DIDerivedType(tag: DW_TAG_member, scope: !803, file: !800, line: 60, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !800, line: 60, size: 64, elements: !807)
!807 = !{!808, !824}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !806, file: !800, line: 61, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !810, line: 49, baseType: !811)
!810 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !810, line: 37, size: 64, elements: !812)
!812 = !{!813, !819}
!813 = !DIDerivedType(tag: DW_TAG_member, scope: !811, file: !810, line: 38, baseType: !814, size: 32)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !811, file: !810, line: 38, size: 32, elements: !815)
!815 = !{!816, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !814, file: !810, line: 39, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !814, file: !810, line: 40, baseType: !817, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, scope: !811, file: !810, line: 42, baseType: !820, size: 32, offset: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !811, file: !810, line: 42, size: 32, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !820, file: !810, line: 43, baseType: !817, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !820, file: !810, line: 44, baseType: !817, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !806, file: !800, line: 62, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !826, line: 49, size: 64, elements: !827)
!826 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !825, file: !826, line: 50, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 64, elements: !613)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !803, file: !800, line: 68, baseType: !832, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !834, line: 233, baseType: !835)
!834 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !834, line: 231, size: 64, elements: !836)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !835, file: !834, line: 232, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !810, line: 48, baseType: !811)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !803, file: !800, line: 71, baseType: !195, size: 8, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !803, file: !800, line: 74, baseType: !195, size: 8, offset: 104)
!841 = !DIDerivedType(tag: DW_TAG_member, scope: !803, file: !800, line: 90, baseType: !842, size: 16, offset: 112)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !800, line: 90, size: 16, elements: !843)
!843 = !{!844, !851}
!844 = !DIDerivedType(tag: DW_TAG_member, scope: !842, file: !800, line: 91, baseType: !845, size: 16)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !842, file: !800, line: 91, size: 16, elements: !846)
!846 = !{!847, !850}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !845, file: !800, line: 96, baseType: !848, size: 8)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !849)
!849 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !845, file: !800, line: 97, baseType: !195, size: 8, offset: 8)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !842, file: !800, line: 100, baseType: !197, size: 16)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !803, file: !800, line: 107, baseType: !152, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !803, file: !800, line: 127, baseType: !106, size: 32, offset: 160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !803, file: !800, line: 131, baseType: !855, size: 192, offset: 192)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !834, line: 244, size: 192, elements: !856)
!856 = !{!857, !858, !864}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !855, file: !834, line: 245, baseType: !809, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !855, file: !834, line: 246, baseType: !859, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !834, line: 242, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !855, file: !834, line: 249, baseType: !865, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !191)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !799, file: !800, line: 250, baseType: !867, size: 288, offset: 384)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !868, line: 25, size: 288, elements: !869)
!868 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !867, file: !868, line: 26, baseType: !152, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !867, file: !868, line: 27, baseType: !152, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !867, file: !868, line: 28, baseType: !152, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !867, file: !868, line: 29, baseType: !152, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !867, file: !868, line: 30, baseType: !152, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !867, file: !868, line: 31, baseType: !152, size: 32, offset: 160)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !867, file: !868, line: 32, baseType: !152, size: 32, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !867, file: !868, line: 33, baseType: !152, size: 32, offset: 224)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !867, file: !868, line: 34, baseType: !152, size: 32, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !799, file: !800, line: 253, baseType: !106, size: 32, offset: 672)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !799, file: !800, line: 256, baseType: !833, size: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !799, file: !800, line: 279, baseType: !882, size: 256, offset: 768)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !799, file: !800, line: 294, baseType: !107, size: 32, offset: 1024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !799, file: !800, line: 300, baseType: !887, size: 96, offset: 1056)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !800, line: 149, size: 96, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !887, file: !800, line: 153, baseType: !22, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !887, file: !800, line: 162, baseType: !185, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !887, file: !800, line: 168, baseType: !185, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !799, file: !800, line: 325, baseType: !893, size: 32, offset: 1152)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !895, line: 5073, size: 192, elements: !896)
!895 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!896 = !{!897, !906, !907}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !894, file: !895, line: 5074, baseType: !898, size: 96)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !899, line: 56, size: 96, elements: !900)
!899 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!900 = !{!901, !904, !905}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !898, file: !899, line: 57, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !899, line: 57, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !898, file: !899, line: 58, baseType: !106, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !898, file: !899, line: 59, baseType: !185, size: 32, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !894, file: !895, line: 5075, baseType: !833, size: 64, offset: 96)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !894, file: !895, line: 5076, baseType: !908, size: 32, offset: 160)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !909, line: 43, size: 32, elements: !910)
!909 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !908, file: !909, line: 52, baseType: !22, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !799, file: !800, line: 343, baseType: !913, size: 64, offset: 1184)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !868, line: 60, size: 64, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !913, file: !868, line: 63, baseType: !152, size: 32)
