; ModuleID = './build/trng_generate_random_data.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }
%struct.TRNG_REGISTER_T = type { i32, i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !2, file: !3, line: 51, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !53, globals: !89, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!4 = !{!5, !17, !37, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!10 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!11 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!12 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!13 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!14 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!15 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!16 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 186, baseType: !18, size: 32, elements: !19)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!20 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!21 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!22 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!23 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!24 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!25 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!26 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!27 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!28 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!29 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!30 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!31 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!32 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!33 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!34 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!35 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!36 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 176, baseType: !18, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!40 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!41 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!42 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!43 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 98, baseType: !18, size: 32, elements: !46)
!45 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!48 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!49 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!50 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!51 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!52 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!53 = !{!54, !88}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !56, line: 276, baseType: !57)
!56 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 260, size: 525312, elements: !58)
!58 = !{!59, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !79, !83, !87}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !57, file: !56, line: 261, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 79, baseType: !18)
!64 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !57, file: !56, line: 262, baseType: !60, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !57, file: !56, line: 263, baseType: !60, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !57, file: !56, line: 264, baseType: !60, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !57, file: !56, line: 265, baseType: !60, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !57, file: !56, line: 266, baseType: !60, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !57, file: !56, line: 267, baseType: !60, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !57, file: !56, line: 268, baseType: !60, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !57, file: !56, line: 269, baseType: !60, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !57, file: !56, line: 270, baseType: !60, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !57, file: !56, line: 271, baseType: !75, size: 32, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !57, file: !56, line: 272, baseType: !60, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !57, file: !56, line: 273, baseType: !80, size: 523904, offset: 384)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 16372)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !57, file: !56, line: 274, baseType: !84, size: 512, offset: 524288)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !57, file: !56, line: 275, baseType: !84, size: 512, offset: 524800)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!89 = !{!0}
!90 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !94, file: !95, line: 48, type: !341, isLocal: false, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !96, retainedTypes: !263, globals: !278, splitDebugInlining: false, nameTableKind: None)
!95 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!96 = !{!97, !157, !162, !168, !245, !254, !259}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 1170, baseType: !18, size: 32, elements: !99)
!98 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!100 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!101 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!102 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!103 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!104 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!105 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!106 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!107 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!108 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!109 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!110 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!111 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!112 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!113 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!114 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!115 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!116 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!117 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!118 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!119 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!120 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!121 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!122 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!123 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!124 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!125 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!126 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!127 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!128 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!129 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!130 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!131 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!132 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!133 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!134 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!135 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!136 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!137 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!138 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!139 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!140 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!141 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!142 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!143 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!144 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!145 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!146 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!147 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!148 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!149 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!150 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!151 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!152 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!153 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!154 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!155 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!156 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 82, baseType: !18, size: 32, elements: !159)
!158 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!159 = !{!160, !161}
!160 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!161 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 75, baseType: !18, size: 32, elements: !163)
!163 = !{!164, !165, !166, !167}
!164 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!165 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!166 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!167 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !56, line: 44, baseType: !7, size: 32, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!170 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!171 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!172 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!173 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!174 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!175 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!176 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!177 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!178 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!179 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!180 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!181 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!182 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!183 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!184 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!185 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!186 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!187 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!188 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!189 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!190 = !DIEnumerator(name: "KP_IRQn", value: 10)
!191 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!192 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!193 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!194 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!195 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!196 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!197 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!198 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!199 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!200 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!201 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!202 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!203 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!204 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!205 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!206 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!207 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!208 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!209 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!210 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!211 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!212 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!213 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!214 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!215 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!216 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!217 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!218 = !DIEnumerator(name: "SF_IRQn", value: 38)
!219 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!220 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!221 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!222 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!223 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!224 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!225 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!226 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!227 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!228 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!229 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!230 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!231 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!232 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!233 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!234 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!235 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!236 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!237 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!238 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!239 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!240 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!241 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!242 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!243 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!244 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 846, baseType: !18, size: 32, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253}
!247 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!248 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!249 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!250 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!251 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!252 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!253 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 380, baseType: !18, size: 32, elements: !256)
!255 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!256 = !{!257, !258}
!257 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!258 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 397, baseType: !18, size: 32, elements: !260)
!260 = !{!261, !262}
!261 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!262 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!263 = !{!61, !264, !88}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !56, line: 1272, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1262, size: 288, elements: !267)
!267 = !{!268, !269, !270, !271, !273, !274, !275, !276, !277}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !266, file: !56, line: 1263, baseType: !60, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !266, file: !56, line: 1264, baseType: !60, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !266, file: !56, line: 1265, baseType: !60, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !266, file: !56, line: 1266, baseType: !272, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !266, file: !56, line: 1267, baseType: !60, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !266, file: !56, line: 1268, baseType: !60, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !266, file: !56, line: 1269, baseType: !60, size: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !266, file: !56, line: 1270, baseType: !60, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !266, file: !56, line: 1271, baseType: !60, size: 32, offset: 256)
!278 = !{!92, !279, !288, !294, !316, !339}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !94, file: !95, line: 49, type: !281, isLocal: false, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !56, line: 1260, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1256, size: 96, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !283, file: !56, line: 1257, baseType: !272, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !283, file: !56, line: 1258, baseType: !60, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !283, file: !56, line: 1259, baseType: !60, size: 32, offset: 64)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "flag", scope: !290, file: !95, line: 88, type: !91, isLocal: true, isDefinition: true)
!290 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !95, file: !95, line: 86, type: !291, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{null}
!293 = !{}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !94, file: !95, line: 51, type: !296, isLocal: false, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 768, elements: !314)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !158, line: 116, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 111, size: 128, elements: !299)
!299 = !{!300, !302, !312, !313}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !298, file: !158, line: 112, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !255, line: 400, baseType: !259)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !298, file: !158, line: 113, baseType: !303, size: 64, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !158, line: 109, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 106, size: 64, elements: !305)
!305 = !{!306, !311}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !304, file: !158, line: 107, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !255, line: 371, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !88}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !304, file: !158, line: 108, baseType: !88, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !298, file: !158, line: 114, baseType: !91, size: 8, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !298, file: !158, line: 115, baseType: !91, size: 8, offset: 104)
!314 = !{!315}
!315 = !DISubrange(count: 6)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !94, file: !95, line: 52, type: !318, isLocal: false, isDefinition: true)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !158, line: 134, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 125, size: 4256, elements: !320)
!320 = !{!321, !332, !333, !334, !335, !336, !337, !338}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !319, file: !158, line: 126, baseType: !322, size: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 4096, elements: !330)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !158, line: 123, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 118, size: 128, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !324, file: !158, line: 119, baseType: !303, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !324, file: !158, line: 120, baseType: !61, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !324, file: !158, line: 121, baseType: !91, size: 8, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !324, file: !158, line: 122, baseType: !91, size: 8, offset: 104)
!330 = !{!331}
!331 = !DISubrange(count: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !319, file: !158, line: 127, baseType: !61, size: 32, offset: 4096)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !319, file: !158, line: 128, baseType: !61, size: 32, offset: 4128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !319, file: !158, line: 129, baseType: !61, size: 32, offset: 4160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !319, file: !158, line: 130, baseType: !61, size: 32, offset: 4192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !319, file: !158, line: 131, baseType: !91, size: 8, offset: 4224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !319, file: !158, line: 132, baseType: !91, size: 8, offset: 4232)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !319, file: !158, line: 133, baseType: !91, size: 8, offset: 4240)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !94, file: !95, line: 53, type: !61, isLocal: false, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 192, elements: !314)
!342 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "trng_init_status", scope: !345, file: !346, line: 41, type: !355, isLocal: true, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !347, globals: !354, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_trng.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!347 = !{!348}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 92, baseType: !7, size: 32, elements: !350)
!349 = !DIFile(filename: "../../../../../driver/chip/inc/hal_trng.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!350 = !{!351, !352, !353}
!351 = !DIEnumerator(name: "HAL_TRNG_STATUS_ERROR", value: -2)
!352 = !DIEnumerator(name: "HAL_TRNG_STATUS_INVALID_PARAMETER", value: -1)
!353 = !DIEnumerator(name: "HAL_TRNG_STATUS_OK", value: 0)
!354 = !{!343}
!355 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 43, baseType: !358)
!358 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "trng", scope: !361, file: !362, line: 41, type: !371, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !363, globals: !370, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_trng_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!363 = !{!97, !364}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 49, baseType: !7, size: 32, elements: !366)
!365 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_trng_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!366 = !{!367, !368, !369}
!367 = !DIEnumerator(name: "TRNG_GEN_TIMEOUT", value: -1)
!368 = !DIEnumerator(name: "TRNG_GEN_FAIL", value: -2)
!369 = !DIEnumerator(name: "TRNG_GEN_SUCCESS", value: 0)
!370 = !{!359}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRNG_REGISTER_T", file: !56, line: 1206, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1199, size: 192, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "TRNG_CTRL", scope: !373, file: !56, line: 1200, baseType: !60, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "TRNG_TIME", scope: !373, file: !56, line: 1201, baseType: !60, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "TRNG_DATA", scope: !373, file: !56, line: 1202, baseType: !272, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "TRNG_CONF", scope: !373, file: !56, line: 1203, baseType: !60, size: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "TRNG_INT_SET", scope: !373, file: !56, line: 1204, baseType: !272, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "TRNG_INT_CLR", scope: !373, file: !56, line: 1205, baseType: !60, size: 32, offset: 160)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !383, file: !384, line: 64, type: !484, isLocal: false, isDefinition: true)
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !385, retainedTypes: !479, globals: !483, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!385 = !{!386, !438, !445, !449, !455, !459, !468, !473}
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 339, baseType: !18, size: 32, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!388 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!389 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!390 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!391 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!392 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!393 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!394 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!395 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!396 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!397 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!398 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!399 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!400 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!401 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!402 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!403 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!404 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!405 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!406 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!407 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!408 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!409 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!410 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!411 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!412 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!413 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!414 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!415 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!416 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!417 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!418 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!419 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!420 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!421 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!422 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!423 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!424 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!425 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!426 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!427 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!428 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!429 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!430 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!431 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!432 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!433 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!434 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!435 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!436 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!437 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!438 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !439, line: 224, baseType: !7, size: 32, elements: !440)
!439 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!440 = !{!441, !442, !443, !444}
!441 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!442 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!443 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!444 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !439, line: 210, baseType: !18, size: 32, elements: !446)
!446 = !{!447, !448}
!447 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!448 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !439, line: 233, baseType: !7, size: 32, elements: !450)
!450 = !{!451, !452, !453, !454}
!451 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!452 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!453 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!454 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !439, line: 217, baseType: !18, size: 32, elements: !456)
!456 = !{!457, !458}
!457 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!458 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 415, baseType: !18, size: 32, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467}
!461 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!462 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!463 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!464 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!465 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!466 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!467 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 427, baseType: !18, size: 32, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!471 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!472 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !439, line: 242, baseType: !18, size: 32, elements: !474)
!474 = !{!475, !476, !477, !478}
!475 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!476 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!477 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!478 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!479 = !{!88, !480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !439, line: 213, baseType: !445)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !439, line: 220, baseType: !455)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !439, line: 247, baseType: !473)
!483 = !{!381}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !56, line: 1554, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1522, size: 29440, elements: !487)
!487 = !{!488, !502, !506, !515, !516, !525, !526, !535, !536, !546, !547, !556, !557, !566, !567, !576, !577, !586, !590, !599, !600, !609, !610, !619, !628, !629, !640, !644, !653, !654}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !486, file: !56, line: 1523, baseType: !489, size: 256)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 256, elements: !500)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !56, line: 1400, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1395, size: 128, elements: !492)
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !491, file: !56, line: 1396, baseType: !60, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !491, file: !56, line: 1397, baseType: !60, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !491, file: !56, line: 1398, baseType: !60, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !491, file: !56, line: 1399, baseType: !497, size: 32, offset: 96)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 32, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 4)
!500 = !{!501}
!501 = !DISubrange(count: 2)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !486, file: !56, line: 1524, baseType: !503, size: 1792, offset: 256)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 1792, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !486, file: !56, line: 1525, baseType: !507, size: 256, offset: 2048)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 256, elements: !500)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !56, line: 1409, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1404, size: 128, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !509, file: !56, line: 1405, baseType: !60, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !509, file: !56, line: 1406, baseType: !60, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !509, file: !56, line: 1407, baseType: !60, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !509, file: !56, line: 1408, baseType: !497, size: 32, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !486, file: !56, line: 1526, baseType: !503, size: 1792, offset: 2304)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !486, file: !56, line: 1527, baseType: !517, size: 256, offset: 4096)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 256, elements: !500)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !56, line: 1417, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1412, size: 128, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !519, file: !56, line: 1413, baseType: !60, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !519, file: !56, line: 1414, baseType: !60, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !519, file: !56, line: 1415, baseType: !60, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !519, file: !56, line: 1416, baseType: !497, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !486, file: !56, line: 1528, baseType: !503, size: 1792, offset: 4352)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !486, file: !56, line: 1529, baseType: !527, size: 256, offset: 6144)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 256, elements: !500)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !56, line: 1426, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1421, size: 128, elements: !530)
!530 = !{!531, !532, !533, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !529, file: !56, line: 1422, baseType: !60, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !529, file: !56, line: 1423, baseType: !60, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !529, file: !56, line: 1424, baseType: !60, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !529, file: !56, line: 1425, baseType: !497, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !486, file: !56, line: 1530, baseType: !503, size: 1792, offset: 6400)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !486, file: !56, line: 1531, baseType: !537, size: 256, offset: 8192)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 256, elements: !500)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !56, line: 1432, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1429, size: 128, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !539, file: !56, line: 1430, baseType: !60, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !539, file: !56, line: 1431, baseType: !543, size: 96, offset: 32)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 96, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 12)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !486, file: !56, line: 1532, baseType: !503, size: 1792, offset: 8448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !486, file: !56, line: 1533, baseType: !548, size: 256, offset: 10240)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 256, elements: !500)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !56, line: 1440, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1435, size: 128, elements: !551)
!551 = !{!552, !553, !554, !555}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !550, file: !56, line: 1436, baseType: !60, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !550, file: !56, line: 1437, baseType: !60, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !550, file: !56, line: 1438, baseType: !60, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !550, file: !56, line: 1439, baseType: !497, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !486, file: !56, line: 1534, baseType: !503, size: 1792, offset: 10496)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !486, file: !56, line: 1535, baseType: !558, size: 256, offset: 12288)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 256, elements: !500)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !56, line: 1448, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1443, size: 128, elements: !561)
!561 = !{!562, !563, !564, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !560, file: !56, line: 1444, baseType: !60, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !560, file: !56, line: 1445, baseType: !60, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !560, file: !56, line: 1446, baseType: !60, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !560, file: !56, line: 1447, baseType: !497, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !486, file: !56, line: 1536, baseType: !503, size: 1792, offset: 12544)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !486, file: !56, line: 1537, baseType: !568, size: 256, offset: 14336)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 256, elements: !500)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !56, line: 1455, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1450, size: 128, elements: !571)
!571 = !{!572, !573, !574, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !570, file: !56, line: 1451, baseType: !60, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !570, file: !56, line: 1452, baseType: !60, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !570, file: !56, line: 1453, baseType: !60, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !570, file: !56, line: 1454, baseType: !497, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !486, file: !56, line: 1538, baseType: !503, size: 1792, offset: 14592)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !486, file: !56, line: 1539, baseType: !578, size: 512, offset: 16384)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 512, elements: !498)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !56, line: 1463, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1458, size: 128, elements: !581)
!581 = !{!582, !583, !584, !585}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !580, file: !56, line: 1459, baseType: !60, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !580, file: !56, line: 1460, baseType: !60, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !580, file: !56, line: 1461, baseType: !60, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !580, file: !56, line: 1462, baseType: !497, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !486, file: !56, line: 1540, baseType: !587, size: 1536, offset: 16896)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 1536, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !486, file: !56, line: 1541, baseType: !591, size: 256, offset: 18432)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 256, elements: !500)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !56, line: 1471, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1466, size: 128, elements: !594)
!594 = !{!595, !596, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !593, file: !56, line: 1467, baseType: !60, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !593, file: !56, line: 1468, baseType: !60, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !593, file: !56, line: 1469, baseType: !60, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !593, file: !56, line: 1470, baseType: !497, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !486, file: !56, line: 1542, baseType: !503, size: 1792, offset: 18688)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !486, file: !56, line: 1543, baseType: !601, size: 256, offset: 20480)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 256, elements: !500)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !56, line: 1480, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1475, size: 128, elements: !604)
!604 = !{!605, !606, !607, !608}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !603, file: !56, line: 1476, baseType: !60, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !603, file: !56, line: 1477, baseType: !60, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !603, file: !56, line: 1478, baseType: !60, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !603, file: !56, line: 1479, baseType: !497, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !486, file: !56, line: 1544, baseType: !503, size: 1792, offset: 20736)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !486, file: !56, line: 1545, baseType: !611, size: 256, offset: 22528)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 256, elements: !500)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !56, line: 1489, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1484, size: 128, elements: !614)
!614 = !{!615, !616, !617, !618}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !613, file: !56, line: 1485, baseType: !60, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !613, file: !56, line: 1486, baseType: !60, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !613, file: !56, line: 1487, baseType: !60, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !613, file: !56, line: 1488, baseType: !497, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !486, file: !56, line: 1546, baseType: !620, size: 256, offset: 22784)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 256, elements: !500)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !56, line: 1497, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1492, size: 128, elements: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !622, file: !56, line: 1493, baseType: !60, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !622, file: !56, line: 1494, baseType: !60, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !622, file: !56, line: 1495, baseType: !60, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !622, file: !56, line: 1496, baseType: !497, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !486, file: !56, line: 1547, baseType: !587, size: 1536, offset: 23040)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !486, file: !56, line: 1548, baseType: !630, size: 896, offset: 24576)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 896, elements: !638)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !56, line: 1505, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1500, size: 128, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !632, file: !56, line: 1501, baseType: !60, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !632, file: !56, line: 1502, baseType: !60, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !632, file: !56, line: 1503, baseType: !60, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !632, file: !56, line: 1504, baseType: !497, size: 32, offset: 96)
!638 = !{!639}
!639 = !DISubrange(count: 7)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !486, file: !56, line: 1549, baseType: !641, size: 1152, offset: 25472)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 1152, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 144)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !486, file: !56, line: 1550, baseType: !645, size: 512, offset: 26624)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 512, elements: !498)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !56, line: 1513, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1508, size: 128, elements: !648)
!648 = !{!649, !650, !651, !652}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !647, file: !56, line: 1509, baseType: !60, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !647, file: !56, line: 1510, baseType: !60, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !647, file: !56, line: 1511, baseType: !60, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !647, file: !56, line: 1512, baseType: !497, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !486, file: !56, line: 1551, baseType: !587, size: 1536, offset: 27136)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !486, file: !56, line: 1552, baseType: !655, size: 768, offset: 28672)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 768, elements: !314)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !56, line: 1519, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1516, size: 128, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !657, file: !56, line: 1517, baseType: !60, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !657, file: !56, line: 1518, baseType: !543, size: 96, offset: 32)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !663, file: !664, line: 101, type: !812, isLocal: true, isDefinition: true)
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !665, retainedTypes: !762, globals: !771, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!665 = !{!666, !673, !688, !694, !700, !705, !712, !728, !734, !738, !743, !750, !758}
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 180, baseType: !18, size: 32, elements: !667)
!667 = !{!668, !669, !670, !671, !672}
!668 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!669 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!670 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!671 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!672 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!673 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 189, baseType: !18, size: 32, elements: !675)
!674 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!676 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!677 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!678 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!679 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!680 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!681 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!682 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!683 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!684 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!685 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!686 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!687 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 355, baseType: !7, size: 32, elements: !690)
!689 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!690 = !{!691, !692, !693}
!691 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!692 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!693 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 206, baseType: !7, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!697 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!698 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!699 = !DIEnumerator(name: "VDMA_OK", value: 0)
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !664, line: 65, baseType: !18, size: 32, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!703 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!704 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 345, baseType: !7, size: 32, elements: !706)
!706 = !{!707, !708, !709, !710, !711}
!707 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!708 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!709 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!710 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!711 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 302, baseType: !18, size: 32, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!714 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!715 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!716 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!717 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!718 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!719 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!720 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!721 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!722 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!723 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!724 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!725 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!726 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!727 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!728 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 321, baseType: !18, size: 32, elements: !729)
!729 = !{!730, !731, !732, !733}
!730 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!731 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!732 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!733 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 330, baseType: !18, size: 32, elements: !735)
!735 = !{!736, !737}
!736 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!737 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 337, baseType: !18, size: 32, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!741 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!742 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !744, line: 101, baseType: !7, size: 32, elements: !745)
!744 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!745 = !{!746, !747, !748, !749}
!746 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!747 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!748 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!749 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !751, line: 152, baseType: !7, size: 32, elements: !752)
!751 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!752 = !{!753, !754, !755, !756, !757}
!753 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!754 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!755 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!756 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!757 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!758 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 222, baseType: !7, size: 32, elements: !759)
!759 = !{!760, !761}
!760 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!761 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!762 = !{!88, !61, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !765, line: 96, baseType: !766)
!765 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !765, line: 93, size: 64, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !766, file: !765, line: 94, baseType: !91, size: 8)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !766, file: !765, line: 95, baseType: !770, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !98, line: 186, baseType: !666)
!771 = !{!661, !772, !785, !790, !804, !810}
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !663, file: !664, line: 102, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 256, elements: !498)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !664, line: 74, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 71, size: 64, elements: !777)
!777 = !{!778, !784}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !776, file: !664, line: 72, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !689, line: 410, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !783, !88}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !689, line: 359, baseType: !688)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !776, file: !664, line: 73, baseType: !88, size: 32, offset: 32)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !663, file: !664, line: 103, type: !787, isLocal: true, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 512, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 8)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !663, file: !664, line: 104, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 896, elements: !498)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !689, line: 390, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 382, size: 224, elements: !795)
!795 = !{!796, !798, !799, !800, !801, !802, !803}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !794, file: !689, line: 383, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !794, file: !689, line: 384, baseType: !61, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !794, file: !689, line: 385, baseType: !61, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !794, file: !689, line: 386, baseType: !797, size: 32, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !794, file: !689, line: 387, baseType: !61, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !794, file: !689, line: 388, baseType: !61, size: 32, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !794, file: !689, line: 389, baseType: !61, size: 32, offset: 192)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !663, file: !664, line: 105, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 416, elements: !808)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!808 = !{!809}
!809 = !DISubrange(count: 13)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !663, file: !664, line: 90, type: !91, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 128, elements: !498)
!813 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !664, line: 69, baseType: !700)
!815 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !818, file: !819, line: 53, type: !899, isLocal: false, isDefinition: true)
!818 = distinct !DICompileUnit(language: DW_LANG_C99, file: !819, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !820, retainedTypes: !831, globals: !887, splitDebugInlining: false, nameTableKind: None)
!819 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!820 = !{!97, !168, !673, !666, !821}
!821 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !765, line: 46, baseType: !18, size: 32, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830}
!823 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!824 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!825 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!826 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!827 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!828 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!829 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!830 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !56, line: 588, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 542, size: 800, elements: !835)
!835 = !{!836, !842, !847, !853, !854, !859, !864, !865, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !834, file: !56, line: 547, baseType: !837, size: 32)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !834, file: !56, line: 543, size: 32, elements: !838)
!838 = !{!839, !840, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !837, file: !56, line: 544, baseType: !272, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !837, file: !56, line: 545, baseType: !60, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !837, file: !56, line: 546, baseType: !60, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !834, file: !56, line: 551, baseType: !843, size: 32, offset: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !834, file: !56, line: 548, size: 32, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !843, file: !56, line: 549, baseType: !60, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !843, file: !56, line: 550, baseType: !60, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !834, file: !56, line: 556, baseType: !848, size: 32, offset: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !834, file: !56, line: 552, size: 32, elements: !849)
!849 = !{!850, !851, !852}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !848, file: !56, line: 553, baseType: !272, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !848, file: !56, line: 554, baseType: !60, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !848, file: !56, line: 555, baseType: !60, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !834, file: !56, line: 557, baseType: !60, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !834, file: !56, line: 561, baseType: !855, size: 32, offset: 128)
!855 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !834, file: !56, line: 558, size: 32, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !855, file: !56, line: 559, baseType: !60, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !855, file: !56, line: 560, baseType: !60, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !834, file: !56, line: 565, baseType: !860, size: 32, offset: 160)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !834, file: !56, line: 562, size: 32, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !860, file: !56, line: 563, baseType: !272, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !860, file: !56, line: 564, baseType: !60, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !834, file: !56, line: 566, baseType: !60, size: 32, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !834, file: !56, line: 570, baseType: !866, size: 32, offset: 224)
!866 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !834, file: !56, line: 567, size: 32, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !866, file: !56, line: 568, baseType: !60, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !866, file: !56, line: 569, baseType: !60, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !834, file: !56, line: 571, baseType: !60, size: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !834, file: !56, line: 572, baseType: !60, size: 32, offset: 288)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !834, file: !56, line: 573, baseType: !60, size: 32, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !834, file: !56, line: 574, baseType: !60, size: 32, offset: 352)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !834, file: !56, line: 575, baseType: !272, size: 32, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !834, file: !56, line: 576, baseType: !60, size: 32, offset: 416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !834, file: !56, line: 577, baseType: !60, size: 32, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !834, file: !56, line: 578, baseType: !60, size: 32, offset: 480)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !834, file: !56, line: 579, baseType: !60, size: 32, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !834, file: !56, line: 580, baseType: !60, size: 32, offset: 544)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !834, file: !56, line: 581, baseType: !60, size: 32, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !834, file: !56, line: 582, baseType: !60, size: 32, offset: 608)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !834, file: !56, line: 583, baseType: !60, size: 32, offset: 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !834, file: !56, line: 584, baseType: !60, size: 32, offset: 672)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !834, file: !56, line: 585, baseType: !60, size: 32, offset: 704)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !834, file: !56, line: 586, baseType: !272, size: 32, offset: 736)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !834, file: !56, line: 587, baseType: !60, size: 32, offset: 768)
!887 = !{!816, !888, !893}
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !818, file: !819, line: 54, type: !890, isLocal: false, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 128, elements: !498)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !98, line: 1237, baseType: !97)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !818, file: !819, line: 55, type: !895, isLocal: false, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 128, elements: !498)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !56, line: 125, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !56, line: 123, baseType: !168)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 128, elements: !498)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!902 = distinct !DIGlobalVariable(name: "priority_set", scope: !903, file: !904, line: 128, type: !61, isLocal: true, isDefinition: true)
!903 = distinct !DISubprogram(name: "hal_nvic_init", scope: !904, file: !904, line: 126, type: !905, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !908, retainedNodes: !994)
!904 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!905 = !DISubroutineType(types: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_status_t", file: !751, line: 158, baseType: !750)
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !909, retainedTypes: !910, globals: !976, splitDebugInlining: false, nameTableKind: None)
!909 = !{!750, !168}
!910 = !{!897, !911, !61, !944, !974}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !913, line: 418, baseType: !914)
!913 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !913, line: 395, size: 1120, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922, !924, !925, !926, !927, !928, !929, !930, !931, !933, !934, !935, !937, !941, !943}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !914, file: !913, line: 397, baseType: !272, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !914, file: !913, line: 398, baseType: !60, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !914, file: !913, line: 399, baseType: !60, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !914, file: !913, line: 400, baseType: !60, size: 32, offset: 96)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !914, file: !913, line: 401, baseType: !60, size: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !914, file: !913, line: 402, baseType: !60, size: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !914, file: !913, line: 403, baseType: !923, size: 96, offset: 192)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 96, elements: !544)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !914, file: !913, line: 404, baseType: !60, size: 32, offset: 288)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !914, file: !913, line: 405, baseType: !60, size: 32, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !914, file: !913, line: 406, baseType: !60, size: 32, offset: 352)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !914, file: !913, line: 407, baseType: !60, size: 32, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !914, file: !913, line: 408, baseType: !60, size: 32, offset: 416)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !914, file: !913, line: 409, baseType: !60, size: 32, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !914, file: !913, line: 410, baseType: !60, size: 32, offset: 480)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !914, file: !913, line: 411, baseType: !932, size: 64, offset: 512)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 64, elements: !500)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !914, file: !913, line: 412, baseType: !272, size: 32, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !914, file: !913, line: 413, baseType: !272, size: 32, offset: 608)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !914, file: !913, line: 414, baseType: !936, size: 128, offset: 640)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 128, elements: !498)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !914, file: !913, line: 415, baseType: !938, size: 160, offset: 768)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 160, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 5)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !914, file: !913, line: 416, baseType: !942, size: 160, offset: 928)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !939)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !914, file: !913, line: 417, baseType: !60, size: 32, offset: 1088)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !913, line: 378, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !913, line: 363, size: 28704, elements: !947)
!947 = !{!948, !950, !954, !955, !956, !957, !958, !959, !960, !961, !965, !969, !973}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !946, file: !913, line: 365, baseType: !949, size: 256)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, elements: !788)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !946, file: !913, line: 366, baseType: !951, size: 768, offset: 256)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 24)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !946, file: !913, line: 367, baseType: !949, size: 256, offset: 1024)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !946, file: !913, line: 368, baseType: !951, size: 768, offset: 1280)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !946, file: !913, line: 369, baseType: !949, size: 256, offset: 2048)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !946, file: !913, line: 370, baseType: !951, size: 768, offset: 2304)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !946, file: !913, line: 371, baseType: !949, size: 256, offset: 3072)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !946, file: !913, line: 372, baseType: !951, size: 768, offset: 3328)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !946, file: !913, line: 373, baseType: !949, size: 256, offset: 4096)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !946, file: !913, line: 374, baseType: !962, size: 1792, offset: 4352)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1792, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 56)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !946, file: !913, line: 375, baseType: !966, size: 1920, offset: 6144)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 1920, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 240)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !946, file: !913, line: 376, baseType: !970, size: 20608, offset: 8064)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 20608, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 644)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !946, file: !913, line: 377, baseType: !60, size: 32, offset: 28672)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !62, line: 44, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !64, line: 77, baseType: !7)
!976 = !{!977, !978, !991}
!977 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !908, file: !904, line: 119, type: !980, isLocal: false, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 4096, elements: !989)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !904, line: 50, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !904, line: 47, size: 64, elements: !983)
!983 = !{!984, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !982, file: !904, line: 48, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !897}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !982, file: !904, line: 49, baseType: !61, size: 32, offset: 32)
!989 = !{!990}
!990 = !DISubrange(count: 64)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "defualt_irq_priority", scope: !908, file: !904, line: 52, type: !993, isLocal: true, isDefinition: true)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 2048, elements: !989)
!994 = !{!995}
!995 = !DILocalVariable(name: "i", scope: !903, file: !904, line: 129, type: !61)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "DelayResume", scope: !998, file: !999, line: 55, type: !91, isLocal: false, isDefinition: true)
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !999, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1000, retainedTypes: !1035, globals: !1074, splitDebugInlining: false, nameTableKind: None)
!999 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_flash_mtd_common.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!1000 = !{!1001, !1009, !1014}
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sfi_clock_enum_t", file: !1002, line: 51, baseType: !18, size: 32, elements: !1003)
!1002 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_flash_sfi_release.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!1003 = !{!1004, !1005, !1006, !1007, !1008}
!1004 = !DIEnumerator(name: "SFI_CLK_UNKNOWN", value: 0)
!1005 = !DIEnumerator(name: "SFI_CLK_78MHZ", value: 78)
!1006 = !DIEnumerator(name: "SFI_CLK_104MHZ", value: 104)
!1007 = !DIEnumerator(name: "SFI_CLK_130MHZ", value: 130)
!1008 = !DIEnumerator(name: "SFI_CLK_166MHZ", value: 166)
!1009 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sfi_voltage_enum_t", file: !1002, line: 62, baseType: !18, size: 32, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIEnumerator(name: "SFI_Voltage_UNKNOWN", value: 0)
!1012 = !DIEnumerator(name: "SFI_Voltage_18", value: 18)
!1013 = !DIEnumerator(name: "SFI_Voltage_30", value: 30)
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1015, line: 228, baseType: !18, size: 32, elements: !1016)
!1015 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_clock_platform_mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/trng_generate_random_data/GCC")
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1017 = !DIEnumerator(name: "BUS_MUX_SEL", value: 0)
!1018 = !DIEnumerator(name: "CM_MUX_SEL", value: 1)
!1019 = !DIEnumerator(name: "SFC_MUX_SEL", value: 2)
!1020 = !DIEnumerator(name: "SLCD_MUX_SEL", value: 3)
!1021 = !DIEnumerator(name: "BSI_MUX_SEL", value: 4)
!1022 = !DIEnumerator(name: "DSP_MUX_SEL", value: 5)
!1023 = !DIEnumerator(name: "CAM_MUX_SEL", value: 6)
!1024 = !DIEnumerator(name: "USB_MUX_SEL", value: 7)
!1025 = !DIEnumerator(name: "DISP_PWM_MUX_SEL", value: 8)
!1026 = !DIEnumerator(name: "MSDC0_MUX_SEL", value: 9)
!1027 = !DIEnumerator(name: "MSDC1_MUX_SEL", value: 10)
!1028 = !DIEnumerator(name: "LP_CLKSQ_MUX_SEL", value: 11)
!1029 = !DIEnumerator(name: "LP_LFOSC_MUX_SEL", value: 12)
!1030 = !DIEnumerator(name: "RG_SLCD_CK_SEL", value: 13)
!1031 = !DIEnumerator(name: "GP_F26M_GFMUX_SEL", value: 14)
!1032 = !DIEnumerator(name: "LP_F26M_GFMUX_SEL", value: 15)
!1033 = !DIEnumerator(name: "NR_MUXS", value: 16)
!1034 = !DIEnumerator(name: "CLK_MUX_SEL_NONE", value: 17)
!1035 = !{!1036, !1037, !1059, !797, !61, !18, !1065, !1067, !1071, !1073}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_REGISTER_T", file: !56, line: 2777, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 2758, size: 576, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_CTL", scope: !1039, file: !56, line: 2759, baseType: !60, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL", scope: !1039, file: !56, line: 2760, baseType: !60, size: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL", scope: !1039, file: !56, line: 2761, baseType: !60, size: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL2", scope: !1039, file: !56, line: 2762, baseType: !60, size: 32, offset: 96)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_OUTL", scope: !1039, file: !56, line: 2763, baseType: !60, size: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MAC_INL", scope: !1039, file: !56, line: 2764, baseType: !60, size: 32, offset: 160)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_RESET_CTL", scope: !1039, file: !56, line: 2765, baseType: !60, size: 32, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_STA2_CTL", scope: !1039, file: !56, line: 2766, baseType: !60, size: 32, offset: 224)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL1", scope: !1039, file: !56, line: 2767, baseType: !60, size: 32, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL2", scope: !1039, file: !56, line: 2768, baseType: !60, size: 32, offset: 288)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL3", scope: !1039, file: !56, line: 2769, baseType: !60, size: 32, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY1", scope: !1039, file: !56, line: 2770, baseType: !60, size: 32, offset: 352)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL4", scope: !1039, file: !56, line: 2771, baseType: !60, size: 32, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL5", scope: !1039, file: !56, line: 2772, baseType: !60, size: 32, offset: 416)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DLY_CTL6", scope: !1039, file: !56, line: 2773, baseType: !60, size: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DUMMY2", scope: !1039, file: !56, line: 2774, baseType: !60, size: 32, offset: 480)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_DIRECT_CTL2", scope: !1039, file: !56, line: 2775, baseType: !60, size: 32, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_MISC_CTL3", scope: !1039, file: !56, line: 2776, baseType: !60, size: 32, offset: 544)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFC_GPRAM_REGISTER_T", file: !56, line: 2801, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 2798, size: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_GPRAM_DATA", scope: !1061, file: !56, line: 2799, baseType: !60, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "RW_SF_GPRAM_DATA_OF_4", scope: !1061, file: !56, line: 2800, baseType: !60, size: 32, offset: 32)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !62, line: 36, baseType: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !64, line: 57, baseType: !1070)
!1070 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !358)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!1074 = !{!996, !1075, !1077, !1079, !1081, !1083, !1085, !1087, !1089, !1091, !1093}
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "NOR_FLASH_LeaveDPDCmd", scope: !998, file: !999, line: 604, type: !356, isLocal: false, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "NOR_FLASH_FATStartAddr", scope: !998, file: !999, line: 605, type: !61, isLocal: false, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "NOR_FLASH_FATStartValue", scope: !998, file: !999, line: 606, type: !61, isLocal: false, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "SFI_MAC_CTL_BACKUP", scope: !998, file: !999, line: 607, type: !61, isLocal: false, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(name: "SFI_DIRECT_CTL_BACKUP", scope: !998, file: !999, line: 608, type: !61, isLocal: false, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "SFI_MISC_CTL_BACKUP", scope: !998, file: !999, line: 609, type: !61, isLocal: false, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "SFI_MISC_CTL2_BACKUP", scope: !998, file: !999, line: 610, type: !61, isLocal: false, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(name: "SFI_DLY_CTL_3_BACKUP", scope: !998, file: !999, line: 611, type: !61, isLocal: false, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(name: "SFI_CLK_SWITCH_MISC_CTL_BACKUP", scope: !998, file: !999, line: 665, type: !61, isLocal: false, isDefinition: true)
