; ModuleID = 'build/adafruit_feather_m0_lora/boards/stm32/backup_sram/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }
%struct.SercomUsart = type { %union.PORT_DIR_Type, %union.PORT_DIR_Type, [4 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_PMUX_Type, [5 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_DIR_Type, [8 x i8], %union.SERCOM_USART_BAUD_Type, [6 x i8], %union.PORT_PMUX_Type }
%union.PORT_DIR_Type = type { %union.anon.1 }
%union.anon.1 = type { i32 }
%union.SERCOM_USART_BAUD_Type = type { %union.anon.2 }
%union.anon.2 = type { i16 }
%union.PORT_PMUX_Type = type { %struct.anon.10 }
%struct.pinctrl_dev_config = type { %struct.pinctrl_state*, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/boards/stm32/backup_sram/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/boards/stm32/backup_sram")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/boards/stm32/backup_sram")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "backup_value", scope: !27, file: !105, line: 11, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/boards/stm32/backup_sram")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "_char_out", scope: !109, file: !112, line: 54, type: !113, isLocal: false, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !110, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!110 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/boards/stm32/backup_sram")
!111 = !{!107}
!112 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DISubroutineType(types: !115)
!115 = !{!103, !103}
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !118, file: !858, line: 202, type: !859, isLocal: true, isDefinition: true, align: 32)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !120, globals: !857, splitDebugInlining: false, nameTableKind: None)
!119 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/boards/stm32/backup_sram")
!120 = !{!102, !103, !121, !249, !588, !589, !656}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !123, line: 335, baseType: !124)
!123 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 320, size: 288, elements: !125)
!125 = !{!126, !139, !149, !163, !174, !185, !189, !200, !201, !212, !213, !228, !229, !239}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !124, file: !123, line: 321, baseType: !127, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !123, line: 50, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 43, size: 16, elements: !130)
!130 = !{!131, !138}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !129, file: !123, line: 48, baseType: !132, size: 16)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !129, file: !123, line: 44, size: 16, elements: !133)
!133 = !{!134, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !132, file: !123, line: 45, baseType: !135, size: 7, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !136)
!136 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !132, file: !123, line: 47, baseType: !135, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !129, file: !123, line: 49, baseType: !135, size: 16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !124, file: !123, line: 322, baseType: !140, size: 16, offset: 16)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 16, elements: !147)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !142, line: 52, baseType: !143)
!142 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !146)
!146 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !{!148}
!148 = !DISubrange(count: 2)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !124, file: !123, line: 323, baseType: !150, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !123, line: 107, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 94, size: 32, elements: !153)
!153 = !{!154, !162}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !152, file: !123, line: 105, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !123, line: 95, size: 32, elements: !156)
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !155, file: !123, line: 97, baseType: !106, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !155, file: !123, line: 99, baseType: !106, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !155, file: !123, line: 100, baseType: !106, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !155, file: !123, line: 102, baseType: !106, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !155, file: !123, line: 103, baseType: !106, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !152, file: !123, line: 106, baseType: !106, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !124, file: !123, line: 324, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !123, line: 155, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 148, size: 32, elements: !167)
!167 = !{!168, !173}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !166, file: !123, line: 153, baseType: !169, size: 32)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !123, line: 149, size: 32, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !169, file: !123, line: 150, baseType: !106, size: 16, flags: DIFlagBitField, extraData: i64 0)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !169, file: !123, line: 151, baseType: !106, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !166, file: !123, line: 154, baseType: !106, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !124, file: !123, line: 325, baseType: !175, size: 8, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !123, line: 194, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 187, size: 8, elements: !178)
!178 = !{!179, !184}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !177, file: !123, line: 192, baseType: !180, size: 8)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !123, line: 188, size: 8, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !180, file: !123, line: 189, baseType: !145, size: 1, flags: DIFlagBitField, extraData: i64 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !180, file: !123, line: 190, baseType: !145, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !177, file: !123, line: 193, baseType: !145, size: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !124, file: !123, line: 326, baseType: !186, size: 24, offset: 104)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 24, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 3)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !124, file: !123, line: 327, baseType: !190, size: 8, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !123, line: 215, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 208, size: 8, elements: !193)
!193 = !{!194, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !192, file: !123, line: 213, baseType: !195, size: 8)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !123, line: 209, size: 8, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !195, file: !123, line: 210, baseType: !145, size: 1, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !195, file: !123, line: 211, baseType: !145, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !192, file: !123, line: 214, baseType: !145, size: 8)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !124, file: !123, line: 328, baseType: !186, size: 24, offset: 136)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !124, file: !123, line: 329, baseType: !202, size: 8, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !123, line: 236, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 229, size: 8, elements: !205)
!205 = !{!206, !211}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !204, file: !123, line: 234, baseType: !207, size: 8)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !123, line: 230, size: 8, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !207, file: !123, line: 231, baseType: !143, size: 1, flags: DIFlagBitField, extraData: i64 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !207, file: !123, line: 232, baseType: !143, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !204, file: !123, line: 235, baseType: !145, size: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !124, file: !123, line: 330, baseType: !186, size: 24, offset: 168)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !124, file: !123, line: 331, baseType: !214, size: 16, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !123, line: 262, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 250, size: 16, elements: !217)
!217 = !{!218, !227}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !216, file: !123, line: 260, baseType: !219, size: 16)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !123, line: 251, size: 16, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !219, file: !123, line: 252, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !219, file: !123, line: 253, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !219, file: !123, line: 254, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !219, file: !123, line: 255, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !219, file: !123, line: 256, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !219, file: !123, line: 258, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !216, file: !123, line: 261, baseType: !135, size: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !124, file: !123, line: 332, baseType: !140, size: 16, offset: 208)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !124, file: !123, line: 333, baseType: !230, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !123, line: 290, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 284, size: 32, elements: !233)
!233 = !{!234, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !232, file: !123, line: 288, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !232, file: !123, line: 285, size: 32, elements: !236)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !235, file: !123, line: 286, baseType: !106, size: 22, flags: DIFlagBitField, extraData: i64 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !232, file: !123, line: 289, baseType: !106, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !124, file: !123, line: 334, baseType: !240, size: 16, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !123, line: 308, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 303, size: 16, elements: !243)
!243 = !{!244, !248}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !242, file: !123, line: 306, baseType: !245, size: 16)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !123, line: 304, size: 16, elements: !246)
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !245, file: !123, line: 305, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !242, file: !123, line: 307, baseType: !135, size: 16)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !251, line: 928, baseType: !252)
!251 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !251, line: 899, size: 672, elements: !253)
!253 = !{!254, !278, !302, !328, !353, !369, !370, !388, !389, !406, !417, !418, !433, !453, !454, !466, !478, !488, !489, !506, !510, !521, !522, !534, !546, !547, !558, !574}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !252, file: !251, line: 900, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !251, line: 64, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 43, size: 32, elements: !258)
!258 = !{!259, !277}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !257, file: !251, line: 62, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !251, line: 44, size: 32, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !260, file: !251, line: 45, baseType: !106, size: 1, flags: DIFlagBitField, extraData: i64 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !260, file: !251, line: 46, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !260, file: !251, line: 47, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !260, file: !251, line: 48, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !260, file: !251, line: 49, baseType: !106, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !260, file: !251, line: 50, baseType: !106, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !260, file: !251, line: 51, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !260, file: !251, line: 52, baseType: !106, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !260, file: !251, line: 53, baseType: !106, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !260, file: !251, line: 54, baseType: !106, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !260, file: !251, line: 55, baseType: !106, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !260, file: !251, line: 56, baseType: !106, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !260, file: !251, line: 58, baseType: !106, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !260, file: !251, line: 59, baseType: !106, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !260, file: !251, line: 60, baseType: !106, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !257, file: !251, line: 63, baseType: !106, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !252, file: !251, line: 901, baseType: !279, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !251, line: 125, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 104, size: 32, elements: !282)
!282 = !{!283, !301}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !281, file: !251, line: 123, baseType: !284, size: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !251, line: 105, size: 32, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !284, file: !251, line: 106, baseType: !106, size: 1, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !284, file: !251, line: 107, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !284, file: !251, line: 108, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !284, file: !251, line: 109, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !284, file: !251, line: 110, baseType: !106, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !284, file: !251, line: 111, baseType: !106, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !284, file: !251, line: 112, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !284, file: !251, line: 113, baseType: !106, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !284, file: !251, line: 114, baseType: !106, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !284, file: !251, line: 115, baseType: !106, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !284, file: !251, line: 116, baseType: !106, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !284, file: !251, line: 117, baseType: !106, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !284, file: !251, line: 119, baseType: !106, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !284, file: !251, line: 120, baseType: !106, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !284, file: !251, line: 121, baseType: !106, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !281, file: !251, line: 124, baseType: !106, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !252, file: !251, line: 902, baseType: !303, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !251, line: 186, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 165, size: 32, elements: !306)
!306 = !{!307, !327}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !305, file: !251, line: 184, baseType: !308, size: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !305, file: !251, line: 166, size: 32, elements: !309)
!309 = !{!310, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !308, file: !251, line: 167, baseType: !311, size: 1, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !106)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !308, file: !251, line: 168, baseType: !311, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !308, file: !251, line: 169, baseType: !311, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !308, file: !251, line: 170, baseType: !311, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !308, file: !251, line: 171, baseType: !311, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !308, file: !251, line: 172, baseType: !311, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !308, file: !251, line: 173, baseType: !311, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !308, file: !251, line: 174, baseType: !311, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !308, file: !251, line: 175, baseType: !311, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !308, file: !251, line: 176, baseType: !311, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !308, file: !251, line: 177, baseType: !311, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !308, file: !251, line: 178, baseType: !311, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !308, file: !251, line: 180, baseType: !311, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !308, file: !251, line: 181, baseType: !311, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !308, file: !251, line: 182, baseType: !311, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !305, file: !251, line: 185, baseType: !106, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !252, file: !251, line: 903, baseType: !329, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !251, line: 247, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 226, size: 32, elements: !333)
!333 = !{!334, !352}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !332, file: !251, line: 245, baseType: !335, size: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !251, line: 227, size: 32, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !335, file: !251, line: 228, baseType: !106, size: 1, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !335, file: !251, line: 229, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !335, file: !251, line: 230, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !335, file: !251, line: 231, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !335, file: !251, line: 232, baseType: !106, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !335, file: !251, line: 233, baseType: !106, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !335, file: !251, line: 234, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !335, file: !251, line: 235, baseType: !106, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !335, file: !251, line: 236, baseType: !106, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !335, file: !251, line: 237, baseType: !106, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !335, file: !251, line: 238, baseType: !106, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !335, file: !251, line: 239, baseType: !106, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !335, file: !251, line: 241, baseType: !106, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !335, file: !251, line: 242, baseType: !106, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !335, file: !251, line: 243, baseType: !106, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !332, file: !251, line: 246, baseType: !106, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !252, file: !251, line: 904, baseType: !354, size: 16, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !251, line: 300, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 287, size: 16, elements: !357)
!357 = !{!358, !368}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !356, file: !251, line: 298, baseType: !359, size: 16)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !356, file: !251, line: 288, size: 16, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !359, file: !251, line: 290, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !359, file: !251, line: 291, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !359, file: !251, line: 293, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !359, file: !251, line: 294, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !359, file: !251, line: 295, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !359, file: !251, line: 296, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !359, file: !251, line: 297, baseType: !135, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !356, file: !251, line: 299, baseType: !135, size: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !252, file: !251, line: 905, baseType: !140, size: 16, offset: 144)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !252, file: !251, line: 906, baseType: !371, size: 16, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !251, line: 352, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 336, size: 16, elements: !374)
!374 = !{!375, !387}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !373, file: !251, line: 350, baseType: !376, size: 16)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !373, file: !251, line: 337, size: 16, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !376, file: !251, line: 339, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !376, file: !251, line: 340, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !376, file: !251, line: 341, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !376, file: !251, line: 342, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !376, file: !251, line: 343, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !376, file: !251, line: 344, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !376, file: !251, line: 345, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !376, file: !251, line: 346, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !376, file: !251, line: 348, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !373, file: !251, line: 351, baseType: !135, size: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !252, file: !251, line: 907, baseType: !140, size: 16, offset: 176)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !252, file: !251, line: 908, baseType: !390, size: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !251, line: 398, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 381, size: 32, elements: !393)
!393 = !{!394, !405}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !392, file: !251, line: 396, baseType: !395, size: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !251, line: 382, size: 32, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !395, file: !251, line: 384, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !395, file: !251, line: 385, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !395, file: !251, line: 386, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !395, file: !251, line: 388, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !395, file: !251, line: 389, baseType: !106, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !395, file: !251, line: 390, baseType: !106, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !395, file: !251, line: 392, baseType: !106, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !395, file: !251, line: 394, baseType: !106, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !392, file: !251, line: 397, baseType: !106, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !252, file: !251, line: 909, baseType: !407, size: 8, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !251, line: 433, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 426, size: 8, elements: !410)
!410 = !{!411, !416}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !409, file: !251, line: 431, baseType: !412, size: 8)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !251, line: 427, size: 8, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !412, file: !251, line: 428, baseType: !145, size: 5, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !412, file: !251, line: 430, baseType: !145, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !409, file: !251, line: 432, baseType: !145, size: 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !252, file: !251, line: 910, baseType: !186, size: 24, offset: 232)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !252, file: !251, line: 911, baseType: !419, size: 32, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !251, line: 462, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 448, size: 32, elements: !422)
!422 = !{!423, !432}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !421, file: !251, line: 460, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !421, file: !251, line: 449, size: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !424, file: !251, line: 451, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !424, file: !251, line: 453, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !424, file: !251, line: 454, baseType: !106, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !424, file: !251, line: 455, baseType: !106, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !424, file: !251, line: 457, baseType: !106, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !424, file: !251, line: 459, baseType: !106, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !421, file: !251, line: 461, baseType: !106, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !252, file: !251, line: 912, baseType: !434, size: 16, offset: 288)
!434 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !251, line: 520, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 503, size: 16, elements: !437)
!437 = !{!438, !452}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !436, file: !251, line: 518, baseType: !439, size: 16)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !251, line: 504, size: 16, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !439, file: !251, line: 506, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !439, file: !251, line: 507, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !439, file: !251, line: 508, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !439, file: !251, line: 509, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !439, file: !251, line: 510, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !439, file: !251, line: 511, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !439, file: !251, line: 512, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !439, file: !251, line: 513, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !439, file: !251, line: 514, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !439, file: !251, line: 515, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !439, file: !251, line: 516, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !436, file: !251, line: 519, baseType: !135, size: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !252, file: !251, line: 913, baseType: !140, size: 16, offset: 304)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !252, file: !251, line: 914, baseType: !455, size: 32, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !251, line: 559, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 552, size: 32, elements: !458)
!458 = !{!459, !465}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !457, file: !251, line: 557, baseType: !460, size: 32)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !457, file: !251, line: 553, size: 32, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !460, file: !251, line: 554, baseType: !106, size: 10, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !460, file: !251, line: 555, baseType: !106, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !460, file: !251, line: 556, baseType: !106, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !457, file: !251, line: 558, baseType: !106, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !252, file: !251, line: 915, baseType: !467, size: 32, offset: 352)
!467 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !251, line: 585, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 578, size: 32, elements: !470)
!470 = !{!471, !477}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !469, file: !251, line: 583, baseType: !472, size: 32)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !251, line: 579, size: 32, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !472, file: !251, line: 580, baseType: !106, size: 16, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !472, file: !251, line: 581, baseType: !106, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !472, file: !251, line: 582, baseType: !106, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !469, file: !251, line: 584, baseType: !106, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !252, file: !251, line: 916, baseType: !479, size: 8, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !251, line: 610, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 604, size: 8, elements: !482)
!482 = !{!483, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !481, file: !251, line: 608, baseType: !484, size: 8)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !481, file: !251, line: 605, size: 8, elements: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !484, file: !251, line: 607, baseType: !145, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !481, file: !251, line: 609, baseType: !145, size: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !252, file: !251, line: 917, baseType: !186, size: 24, offset: 392)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !252, file: !251, line: 918, baseType: !490, size: 32, offset: 416)
!490 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !251, line: 639, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 622, size: 32, elements: !493)
!493 = !{!494, !505}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !492, file: !251, line: 637, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !492, file: !251, line: 623, size: 32, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !495, file: !251, line: 625, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !495, file: !251, line: 626, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !495, file: !251, line: 627, baseType: !106, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !495, file: !251, line: 629, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !495, file: !251, line: 631, baseType: !106, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !495, file: !251, line: 632, baseType: !106, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !495, file: !251, line: 634, baseType: !106, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !495, file: !251, line: 635, baseType: !106, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !492, file: !251, line: 638, baseType: !106, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !252, file: !251, line: 919, baseType: !507, size: 32, offset: 448)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 32, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 4)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !252, file: !251, line: 920, baseType: !511, size: 16, offset: 480)
!511 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !251, line: 715, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 706, size: 16, elements: !514)
!514 = !{!515, !520}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !513, file: !251, line: 713, baseType: !516, size: 16)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !513, file: !251, line: 707, size: 16, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !516, file: !251, line: 709, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !516, file: !251, line: 711, baseType: !135, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !513, file: !251, line: 714, baseType: !135, size: 16)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !252, file: !251, line: 921, baseType: !140, size: 16, offset: 496)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !252, file: !251, line: 922, baseType: !523, size: 32, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !251, line: 739, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 729, size: 32, elements: !526)
!526 = !{!527, !533}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !525, file: !251, line: 737, baseType: !528, size: 32)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !525, file: !251, line: 730, size: 32, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !528, file: !251, line: 732, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !528, file: !251, line: 733, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !528, file: !251, line: 735, baseType: !106, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !525, file: !251, line: 738, baseType: !106, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !252, file: !251, line: 923, baseType: !535, size: 8, offset: 544)
!535 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !251, line: 765, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 756, size: 8, elements: !538)
!538 = !{!539, !545}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !537, file: !251, line: 763, baseType: !540, size: 8)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !537, file: !251, line: 757, size: 8, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !540, file: !251, line: 759, baseType: !145, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !540, file: !251, line: 761, baseType: !145, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !540, file: !251, line: 762, baseType: !145, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !537, file: !251, line: 764, baseType: !145, size: 8)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !252, file: !251, line: 924, baseType: !186, size: 24, offset: 552)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !252, file: !251, line: 925, baseType: !548, size: 32, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !251, line: 789, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 781, size: 32, elements: !551)
!551 = !{!552, !557}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !550, file: !251, line: 787, baseType: !553, size: 32)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !550, file: !251, line: 782, size: 32, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !553, file: !251, line: 783, baseType: !106, size: 12, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !553, file: !251, line: 785, baseType: !106, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !550, file: !251, line: 788, baseType: !106, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !252, file: !251, line: 926, baseType: !559, size: 32, offset: 608)
!559 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !251, line: 820, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 805, size: 32, elements: !562)
!562 = !{!563, !573}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !561, file: !251, line: 818, baseType: !564, size: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !561, file: !251, line: 806, size: 32, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !564, file: !251, line: 807, baseType: !106, size: 2, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !564, file: !251, line: 808, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !564, file: !251, line: 809, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !564, file: !251, line: 810, baseType: !106, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !564, file: !251, line: 812, baseType: !106, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !564, file: !251, line: 814, baseType: !106, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !564, file: !251, line: 816, baseType: !106, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !561, file: !251, line: 819, baseType: !106, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !252, file: !251, line: 927, baseType: !575, size: 8, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !251, line: 881, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !251, line: 872, size: 8, elements: !579)
!579 = !{!580, !587}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !578, file: !251, line: 879, baseType: !581, size: 8)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !578, file: !251, line: 873, size: 8, elements: !582)
!582 = !{!583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !581, file: !251, line: 874, baseType: !145, size: 1, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !581, file: !251, line: 875, baseType: !145, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !581, file: !251, line: 876, baseType: !145, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !581, file: !251, line: 877, baseType: !145, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !578, file: !251, line: 880, baseType: !145, size: 8)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !591, line: 290, baseType: !592)
!591 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !591, line: 284, size: 96, elements: !593)
!593 = !{!594, !604, !615, !628, !645}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !592, file: !591, line: 285, baseType: !595, size: 8)
!595 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !591, line: 49, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !591, line: 43, size: 8, elements: !598)
!598 = !{!599, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !597, file: !591, line: 47, baseType: !600, size: 8)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !591, line: 44, size: 8, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !600, file: !591, line: 45, baseType: !145, size: 1, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !597, file: !591, line: 48, baseType: !145, size: 8)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !592, file: !591, line: 286, baseType: !605, size: 8, offset: 8)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !591, line: 67, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !591, line: 61, size: 8, elements: !609)
!609 = !{!610, !614}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !608, file: !591, line: 65, baseType: !611, size: 8)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !591, line: 62, size: 8, elements: !612)
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !611, file: !591, line: 64, baseType: !145, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !608, file: !591, line: 66, baseType: !145, size: 8)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !592, file: !591, line: 287, baseType: !616, size: 16, offset: 16)
!616 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !591, line: 89, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !591, line: 79, size: 16, elements: !619)
!619 = !{!620, !627}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !618, file: !591, line: 87, baseType: !621, size: 16)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !618, file: !591, line: 80, size: 16, elements: !622)
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !621, file: !591, line: 81, baseType: !135, size: 6, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !621, file: !591, line: 83, baseType: !135, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !621, file: !591, line: 85, baseType: !135, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !621, file: !591, line: 86, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !618, file: !591, line: 88, baseType: !135, size: 16)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !592, file: !591, line: 288, baseType: !629, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !591, line: 214, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !591, line: 199, size: 32, elements: !632)
!632 = !{!633, !644}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !631, file: !591, line: 212, baseType: !634, size: 32)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !631, file: !591, line: 200, size: 32, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !634, file: !591, line: 201, baseType: !106, size: 4, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !634, file: !591, line: 203, baseType: !106, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !634, file: !591, line: 205, baseType: !106, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !634, file: !591, line: 206, baseType: !106, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !634, file: !591, line: 207, baseType: !106, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !634, file: !591, line: 208, baseType: !106, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !634, file: !591, line: 209, baseType: !106, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !634, file: !591, line: 210, baseType: !106, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !631, file: !591, line: 213, baseType: !106, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !592, file: !591, line: 289, baseType: !646, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !591, line: 268, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !591, line: 260, size: 32, elements: !649)
!649 = !{!650, !655}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !648, file: !591, line: 266, baseType: !651, size: 32)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !648, file: !591, line: 261, size: 32, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !651, file: !591, line: 262, baseType: !106, size: 4, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !651, file: !591, line: 264, baseType: !106, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !648, file: !591, line: 267, baseType: !106, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !658, line: 513, baseType: !659)
!658 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !658, line: 494, size: 480, elements: !660)
!660 = !{!661, !667, !677, !681, !691, !701, !711, !721, !725, !741, !757, !773, !803, !807, !817, !827, !837, !841}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !659, file: !658, line: 495, baseType: !662, size: 8)
!662 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !658, line: 45, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 43, size: 8, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !664, file: !658, line: 44, baseType: !145, size: 8)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !659, file: !658, line: 496, baseType: !668, size: 8, offset: 8)
!668 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !658, line: 61, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 55, size: 8, elements: !671)
!671 = !{!672, !676}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !670, file: !658, line: 59, baseType: !673, size: 8)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !670, file: !658, line: 56, size: 8, elements: !674)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !673, file: !658, line: 57, baseType: !145, size: 2, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !670, file: !658, line: 60, baseType: !145, size: 8)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !659, file: !658, line: 497, baseType: !678, size: 48, offset: 16)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 48, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 6)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !659, file: !658, line: 498, baseType: !682, size: 8, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !658, line: 86, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 80, size: 8, elements: !685)
!685 = !{!686, !690}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !684, file: !658, line: 84, baseType: !687, size: 8)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !684, file: !658, line: 81, size: 8, elements: !688)
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !687, file: !658, line: 82, baseType: !145, size: 3, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !684, file: !658, line: 85, baseType: !145, size: 8)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !659, file: !658, line: 499, baseType: !692, size: 8, offset: 72)
!692 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !658, line: 121, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 115, size: 8, elements: !695)
!695 = !{!696, !700}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !694, file: !658, line: 119, baseType: !697, size: 8)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !694, file: !658, line: 116, size: 8, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !697, file: !658, line: 117, baseType: !145, size: 3, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !694, file: !658, line: 120, baseType: !145, size: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !659, file: !658, line: 500, baseType: !702, size: 8, offset: 80)
!702 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !658, line: 156, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 150, size: 8, elements: !705)
!705 = !{!706, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !704, file: !658, line: 154, baseType: !707, size: 8)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !658, line: 151, size: 8, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !707, file: !658, line: 152, baseType: !145, size: 3, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !704, file: !658, line: 155, baseType: !145, size: 8)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !659, file: !658, line: 501, baseType: !712, size: 8, offset: 88)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !658, line: 191, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 185, size: 8, elements: !715)
!715 = !{!716, !720}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !658, line: 189, baseType: !717, size: 8)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !658, line: 186, size: 8, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !717, file: !658, line: 187, baseType: !145, size: 3, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !658, line: 190, baseType: !145, size: 8)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !659, file: !658, line: 502, baseType: !722, size: 64, offset: 96)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 8)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !659, file: !658, line: 503, baseType: !726, size: 32, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !658, line: 232, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 220, size: 32, elements: !729)
!729 = !{!730, !740}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !728, file: !658, line: 230, baseType: !731, size: 32)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !728, file: !658, line: 221, size: 32, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !731, file: !658, line: 222, baseType: !106, size: 1, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !731, file: !658, line: 223, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !731, file: !658, line: 224, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !731, file: !658, line: 225, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !731, file: !658, line: 226, baseType: !106, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !731, file: !658, line: 227, baseType: !106, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !731, file: !658, line: 228, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !728, file: !658, line: 231, baseType: !106, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !659, file: !658, line: 504, baseType: !742, size: 32, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !658, line: 268, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 256, size: 32, elements: !745)
!745 = !{!746, !756}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !744, file: !658, line: 266, baseType: !747, size: 32)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !744, file: !658, line: 257, size: 32, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !747, file: !658, line: 258, baseType: !106, size: 1, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !747, file: !658, line: 259, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !747, file: !658, line: 260, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !747, file: !658, line: 261, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !747, file: !658, line: 262, baseType: !106, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !747, file: !658, line: 263, baseType: !106, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !747, file: !658, line: 264, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !744, file: !658, line: 267, baseType: !106, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !659, file: !658, line: 505, baseType: !758, size: 32, offset: 224)
!758 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !658, line: 304, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 292, size: 32, elements: !761)
!761 = !{!762, !772}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !760, file: !658, line: 302, baseType: !763, size: 32)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !760, file: !658, line: 293, size: 32, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !763, file: !658, line: 294, baseType: !106, size: 1, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !763, file: !658, line: 295, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !763, file: !658, line: 296, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !763, file: !658, line: 297, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !763, file: !658, line: 298, baseType: !106, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !763, file: !658, line: 299, baseType: !106, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !763, file: !658, line: 300, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !760, file: !658, line: 303, baseType: !106, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !659, file: !658, line: 506, baseType: !774, size: 32, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !658, line: 354, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 328, size: 32, elements: !777)
!777 = !{!778, !802}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !776, file: !658, line: 352, baseType: !779, size: 32)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !776, file: !658, line: 329, size: 32, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !779, file: !658, line: 330, baseType: !106, size: 1, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !779, file: !658, line: 331, baseType: !106, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !779, file: !658, line: 332, baseType: !106, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !779, file: !658, line: 333, baseType: !106, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !779, file: !658, line: 334, baseType: !106, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !779, file: !658, line: 335, baseType: !106, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !779, file: !658, line: 336, baseType: !106, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !779, file: !658, line: 337, baseType: !106, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !779, file: !658, line: 338, baseType: !106, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !779, file: !658, line: 339, baseType: !106, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !779, file: !658, line: 340, baseType: !106, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !779, file: !658, line: 341, baseType: !106, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !779, file: !658, line: 342, baseType: !106, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !779, file: !658, line: 343, baseType: !106, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !779, file: !658, line: 344, baseType: !106, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !779, file: !658, line: 345, baseType: !106, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !779, file: !658, line: 346, baseType: !106, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !779, file: !658, line: 347, baseType: !106, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !779, file: !658, line: 348, baseType: !106, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !779, file: !658, line: 349, baseType: !106, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !779, file: !658, line: 350, baseType: !106, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !776, file: !658, line: 353, baseType: !106, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !659, file: !658, line: 507, baseType: !804, size: 128, offset: 288)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 16)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !659, file: !658, line: 508, baseType: !808, size: 8, offset: 416)
!808 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !658, line: 412, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 406, size: 8, elements: !811)
!811 = !{!812, !816}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !810, file: !658, line: 410, baseType: !813, size: 8)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !658, line: 407, size: 8, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !813, file: !658, line: 408, baseType: !145, size: 1, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !810, file: !658, line: 411, baseType: !145, size: 8)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !659, file: !658, line: 509, baseType: !818, size: 8, offset: 424)
!818 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !658, line: 430, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 424, size: 8, elements: !821)
!821 = !{!822, !826}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !820, file: !658, line: 428, baseType: !823, size: 8)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !820, file: !658, line: 425, size: 8, elements: !824)
!824 = !{!825}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !823, file: !658, line: 426, baseType: !145, size: 1, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !820, file: !658, line: 429, baseType: !145, size: 8)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !659, file: !658, line: 510, baseType: !828, size: 8, offset: 432)
!828 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !658, line: 448, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 442, size: 8, elements: !831)
!831 = !{!832, !836}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !830, file: !658, line: 446, baseType: !833, size: 8)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !830, file: !658, line: 443, size: 8, elements: !834)
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !833, file: !658, line: 444, baseType: !143, size: 1, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !830, file: !658, line: 447, baseType: !145, size: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !659, file: !658, line: 511, baseType: !838, size: 8, offset: 440)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 8, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 1)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "RCAUSE", scope: !659, file: !658, line: 512, baseType: !842, size: 8, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_RCAUSE_Type", file: !658, line: 472, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !658, line: 460, size: 8, elements: !846)
!846 = !{!847, !856}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !845, file: !658, line: 470, baseType: !848, size: 8)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !845, file: !658, line: 461, size: 8, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "POR", scope: !848, file: !658, line: 462, baseType: !145, size: 1, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "BOD12", scope: !848, file: !658, line: 463, baseType: !145, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !848, file: !658, line: 464, baseType: !145, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "EXT", scope: !848, file: !658, line: 466, baseType: !145, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "WDT", scope: !848, file: !658, line: 467, baseType: !145, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "SYST", scope: !848, file: !658, line: 468, baseType: !145, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !845, file: !658, line: 471, baseType: !145, size: 8)
!857 = !{!116}
!858 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !861, line: 51, size: 64, elements: !862)
!861 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!862 = !{!863, !892}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !860, file: !861, line: 60, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{!103, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !870, line: 378, size: 192, elements: !871)
!870 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!871 = !{!872, !876, !877, !878, !885, !886}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !870, line: 380, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!875 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !869, file: !870, line: 382, baseType: !13, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !869, file: !870, line: 384, baseType: !13, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !869, file: !870, line: 386, baseType: !879, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !870, line: 351, size: 16, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !880, file: !870, line: 359, baseType: !145, size: 8)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !880, file: !870, line: 364, baseType: !884, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!884 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !869, file: !870, line: 388, baseType: !102, size: 32, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !869, file: !870, line: 396, baseType: !887, size: 32, offset: 160)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !870, line: 43, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !891)
