; ModuleID = 'build/adafruit_feather_nrf52840/subsys/testsuite/pytest/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.ztest_suite_stats, %struct.k_heap*, %struct._thread_arch }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_test_pytest", scope: !27, file: !111, line: 8, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_test_pytest", scope: !27, file: !111, line: 8, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__test_pytest__test_pytest", scope: !27, file: !111, line: 10, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_test_pytest_test_pytest", scope: !27, file: !111, line: 10, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !218, file: !257, line: 22, type: !290, isLocal: false, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220, retainedTypes: !232, globals: !254, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!220 = !{!221, !30}
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !222, line: 27, baseType: !32, size: 32, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231}
!224 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!225 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!226 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!227 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!228 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!229 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!230 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!231 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!232 = !{!106, !233, !107, !24, !236, !193, !152, !252}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !234, line: 46, baseType: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !191)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !238, line: 54, size: 96, elements: !239)
!238 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!239 = !{!240, !247, !251}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !237, file: !238, line: 55, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !242, line: 33, baseType: !243)
!242 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !242, line: 29, size: 32, elements: !244)
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !242, line: 30, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !237, file: !238, line: 60, baseType: !248, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !221}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !237, file: !238, line: 65, baseType: !248, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !253)
!253 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!254 = !{!216, !255, !263, !269, !271, !280, !282}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !218, file: !257, line: 27, type: !258, isLocal: true, isDefinition: true)
!257 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 32, elements: !261)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !260, line: 22, baseType: !189)
!260 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !{!262}
!262 = !DISubrange(count: 1)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !218, file: !257, line: 44, type: !265, isLocal: true, isDefinition: true)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !265, file: !266, line: 52, baseType: !22, size: 32)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !218, file: !257, line: 49, type: !265, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !218, file: !257, line: 36, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !261)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !222, line: 114, size: 128, elements: !275)
!275 = !{!276, !277, !278, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !274, file: !222, line: 115, baseType: !221, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !274, file: !222, line: 141, baseType: !195, size: 8, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !274, file: !222, line: 149, baseType: !152, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !274, file: !222, line: 156, baseType: !152, size: 32, offset: 96)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !218, file: !257, line: 40, type: !273, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !218, file: !257, line: 28, type: !284, isLocal: true, isDefinition: true)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !242, line: 40, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !242, line: 35, size: 64, elements: !286)
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !285, file: !242, line: 36, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !285, file: !242, line: 37, baseType: !288, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !203, line: 17, baseType: !118, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !291, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!295 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!296 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !299, file: !328, line: 50, type: !315, isLocal: true, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220, retainedTypes: !301, globals: !325, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!301 = !{!302, !233, !185, !107, !106, !152, !252, !304, !193, !315, !316}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !303)
!303 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !306, line: 45, size: 64, elements: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !{!308, !314}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !306, line: 46, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !242, line: 33, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !242, line: 29, size: 32, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !242, line: 30, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !306, line: 48, baseType: !152, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !306, line: 38, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !317, file: !306, line: 39, baseType: !309, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !317, file: !306, line: 41, baseType: !321, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !306, line: 35, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !315}
!325 = !{!326, !332, !340, !297, !342, !352}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "latency_lock", scope: !299, file: !328, line: 44, type: !329, isLocal: true, isDefinition: true)
!328 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !329, file: !266, line: 52, baseType: !22, size: 32)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !299, file: !328, line: 46, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !242, line: 40, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !242, line: 35, size: 64, elements: !336)
!336 = !{!337, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !335, file: !242, line: 36, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !335, file: !242, line: 37, baseType: !338, size: 32, offset: 32)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "latency_subs", scope: !299, file: !328, line: 52, type: !334, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !299, file: !328, line: 39, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, elements: !350)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 35, size: 96, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !345, file: !328, line: 36, baseType: !221, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !345, file: !328, line: 37, baseType: !195, size: 8, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !345, file: !328, line: 38, baseType: !259, size: 32, offset: 64)
!350 = !{!351}
!351 = !DISubrange(count: 0)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !299, file: !328, line: 48, type: !315, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !356, file: !363, line: 47, type: !377, isLocal: true, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !358, retainedTypes: !359, globals: !360, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!358 = !{!221}
!359 = !{!185, !107}
!360 = !{!361, !354, !373}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "cpus_states", scope: !356, file: !363, line: 50, type: !364, isLocal: true, isDefinition: true)
!363 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 32, elements: !261)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !222, line: 114, size: 128, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !222, line: 115, baseType: !221, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !367, file: !222, line: 141, baseType: !195, size: 8, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !367, file: !222, line: 149, baseType: !152, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !367, file: !222, line: 156, baseType: !152, size: 32, offset: 96)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !356, file: !363, line: 55, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 8, elements: !261)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, elements: !350)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !380, file: !387, line: 17, type: !530, isLocal: false, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !382, globals: !383, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!382 = !{!185, !107, !152, !106}
!383 = !{!378, !384, !526}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !386, file: !387, line: 198, type: !514, isLocal: true, isDefinition: true)
!386 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !387, file: !387, line: 175, type: !388, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !509)
!387 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !DISubroutineType(types: !389)
!389 = !{null, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !392, line: 245, size: 1280, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394, !459, !472, !473, !474, !478, !479, !485, !504}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !391, file: !392, line: 247, baseType: !395, size: 384)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !392, line: 57, size: 384, elements: !396)
!396 = !{!397, !425, !433, !434, !435, !446, !447, !448}
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !392, line: 60, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !392, line: 60, size: 64, elements: !399)
!399 = !{!400, !416}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !398, file: !392, line: 61, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !402, line: 49, baseType: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !402, line: 37, size: 64, elements: !404)
!404 = !{!405, !411}
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !402, line: 38, baseType: !406, size: 32)
!406 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !403, file: !402, line: 38, size: 32, elements: !407)
!407 = !{!408, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !406, file: !402, line: 39, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !402, line: 40, baseType: !409, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !402, line: 42, baseType: !412, size: 32, offset: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !403, file: !402, line: 42, size: 32, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !412, file: !402, line: 43, baseType: !409, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !412, file: !402, line: 44, baseType: !409, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !398, file: !392, line: 62, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !418, line: 49, size: 64, elements: !419)
!418 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !417, file: !418, line: 50, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 64, elements: !423)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!423 = !{!424}
!424 = !DISubrange(count: 2)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !395, file: !392, line: 68, baseType: !426, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !428, line: 233, baseType: !429)
!428 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 231, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !429, file: !428, line: 232, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !402, line: 48, baseType: !403)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !395, file: !392, line: 71, baseType: !195, size: 8, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !395, file: !392, line: 74, baseType: !195, size: 8, offset: 104)
!435 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !392, line: 90, baseType: !436, size: 16, offset: 112)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !392, line: 90, size: 16, elements: !437)
!437 = !{!438, !445}
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !436, file: !392, line: 91, baseType: !439, size: 16)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !392, line: 91, size: 16, elements: !440)
!440 = !{!441, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !439, file: !392, line: 96, baseType: !442, size: 8)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !443)
!443 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !439, file: !392, line: 97, baseType: !195, size: 8, offset: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !436, file: !392, line: 100, baseType: !197, size: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !395, file: !392, line: 107, baseType: !152, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !395, file: !392, line: 127, baseType: !106, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !395, file: !392, line: 131, baseType: !449, size: 192, offset: 192)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !428, line: 244, size: 192, elements: !450)
!450 = !{!451, !452, !458}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !449, file: !428, line: 245, baseType: !401, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !449, file: !428, line: 246, baseType: !453, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !428, line: 242, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !449, file: !428, line: 249, baseType: !235, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !391, file: !392, line: 250, baseType: !460, size: 288, offset: 384)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !461, line: 25, size: 288, elements: !462)
!461 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !460, file: !461, line: 26, baseType: !152, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !460, file: !461, line: 27, baseType: !152, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !460, file: !461, line: 28, baseType: !152, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !460, file: !461, line: 29, baseType: !152, size: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !460, file: !461, line: 30, baseType: !152, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !460, file: !461, line: 31, baseType: !152, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !460, file: !461, line: 32, baseType: !152, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !460, file: !461, line: 33, baseType: !152, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !460, file: !461, line: 34, baseType: !152, size: 32, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !391, file: !392, line: 253, baseType: !106, size: 32, offset: 672)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !391, file: !392, line: 256, baseType: !427, size: 64, offset: 704)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !392, line: 279, baseType: !475, size: 256, offset: 768)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !391, file: !392, line: 294, baseType: !107, size: 32, offset: 1024)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !391, file: !392, line: 300, baseType: !480, size: 96, offset: 1056)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !392, line: 149, size: 96, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !480, file: !392, line: 153, baseType: !22, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !480, file: !392, line: 162, baseType: !185, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !480, file: !392, line: 168, baseType: !185, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !391, file: !392, line: 325, baseType: !486, size: 32, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !488, line: 5073, size: 192, elements: !489)
!488 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!489 = !{!490, !499, !500}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !487, file: !488, line: 5074, baseType: !491, size: 96)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !493)
!492 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = !{!494, !497, !498}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !491, file: !492, line: 57, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !492, line: 57, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !491, file: !492, line: 58, baseType: !106, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !491, file: !492, line: 59, baseType: !185, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !487, file: !488, line: 5075, baseType: !427, size: 64, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !487, file: !488, line: 5076, baseType: !501, size: 32, offset: 160)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !501, file: !266, line: 52, baseType: !22, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !391, file: !392, line: 343, baseType: !505, size: 64, offset: 1184)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !461, line: 60, size: 64, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !505, file: !461, line: 63, baseType: !152, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !505, file: !461, line: 66, baseType: !152, size: 32, offset: 32)
!509 = !{!510, !511, !512, !513}
!510 = !DILocalVariable(name: "thread", arg: 1, scope: !386, file: !387, line: 175, type: !390)
!511 = !DILocalVariable(name: "region_num", scope: !386, file: !387, line: 200, type: !195)
!512 = !DILocalVariable(name: "guard_start", scope: !386, file: !387, line: 265, type: !22)
!513 = !DILocalVariable(name: "guard_size", scope: !386, file: !387, line: 266, type: !185)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 96, elements: !261)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !516, line: 52, size: 96, elements: !517)
!516 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !515, file: !516, line: 53, baseType: !22, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !515, file: !516, line: 54, baseType: !185, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !515, file: !516, line: 55, baseType: !521, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !522, line: 151, baseType: !523)
!522 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 149, size: 32, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !523, file: !522, line: 150, baseType: !152, size: 32)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "static_regions", scope: !380, file: !387, line: 62, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 96, elements: !261)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !203, line: 17, baseType: !118, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !531, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !537, file: !571, line: 39, type: !195, isLocal: true, isDefinition: true)
!537 = distinct !DICompileUnit(language: DW_LANG_C99, file: !538, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !539, globals: !570, splitDebugInlining: false, nameTableKind: None)
!538 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!539 = !{!540, !106, !107, !558, !195}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !542, line: 1226, baseType: !543)
!542 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 1213, size: 352, elements: !544)
!544 = !{!545, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !543, file: !542, line: 1215, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !543, file: !542, line: 1216, baseType: !547, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !543, file: !542, line: 1217, baseType: !547, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !543, file: !542, line: 1218, baseType: !547, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !543, file: !542, line: 1219, baseType: !547, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !543, file: !542, line: 1220, baseType: !547, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !543, file: !542, line: 1221, baseType: !547, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !543, file: !542, line: 1222, baseType: !547, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !543, file: !542, line: 1223, baseType: !547, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !543, file: !542, line: 1224, baseType: !547, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !543, file: !542, line: 1225, baseType: !547, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !561, line: 27, size: 96, elements: !562)
!561 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !560, file: !561, line: 29, baseType: !152, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !561, line: 31, baseType: !118, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !560, file: !561, line: 37, baseType: !566, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !522, line: 146, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !522, line: 141, size: 32, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !567, file: !522, line: 143, baseType: !152, size: 32)
!570 = !{!535}
!571 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !574, file: !581, line: 21, type: !213, isLocal: true, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !576, globals: !580, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!576 = !{!577, !107, !106}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !579, line: 22, baseType: !107)
!579 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!580 = !{!572}
!581 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !584, file: !589, line: 13, type: !606, isLocal: true, isDefinition: true)
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !586, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!586 = !{!587, !582}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "mpu_config", scope: !584, file: !589, line: 37, type: !590, isLocal: false, isDefinition: true)
!589 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !561, line: 41, size: 64, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !591, file: !561, line: 43, baseType: !152, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !591, file: !561, line: 45, baseType: !595, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !561, line: 27, size: 96, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !597, file: !561, line: 29, baseType: !152, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !597, file: !561, line: 31, baseType: !118, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !597, file: !561, line: 37, baseType: !602, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !522, line: 146, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !522, line: 141, size: 32, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !603, file: !522, line: 143, baseType: !152, size: 32)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 192, elements: !423)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !609, file: !777, line: 48, type: !794, isLocal: false, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !611, globals: !774, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!611 = !{!612, !195, !106, !107, !692, !152, !693, !729, !740}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !614, line: 1071, baseType: !615)
!614 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 1035, size: 19584, elements: !616)
!616 = !{!617, !621, !622, !623, !627, !628, !630, !631, !632, !633, !634, !635, !639, !640, !641, !645, !646, !650, !651, !655, !656, !660, !661, !662, !663, !664, !665, !666, !670, !671, !672, !673, !677, !678, !682}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !615, file: !614, line: 1036, baseType: !618, size: 960)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 960, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 30)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !615, file: !614, line: 1037, baseType: !547, size: 32, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !615, file: !614, line: 1038, baseType: !547, size: 32, offset: 992)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !615, file: !614, line: 1039, baseType: !624, size: 1088, offset: 1024)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1088, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 34)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !615, file: !614, line: 1040, baseType: !547, size: 32, offset: 2112)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !615, file: !614, line: 1041, baseType: !629, size: 64, offset: 2144)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 64, elements: !423)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !615, file: !614, line: 1042, baseType: !547, size: 32, offset: 2208)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !615, file: !614, line: 1043, baseType: !547, size: 32, offset: 2240)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !615, file: !614, line: 1044, baseType: !547, size: 32, offset: 2272)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !615, file: !614, line: 1045, baseType: !547, size: 32, offset: 2304)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !615, file: !614, line: 1046, baseType: !547, size: 32, offset: 2336)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !615, file: !614, line: 1047, baseType: !636, size: 3808, offset: 2368)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 3808, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 119)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !615, file: !614, line: 1048, baseType: !547, size: 32, offset: 6176)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !615, file: !614, line: 1049, baseType: !547, size: 32, offset: 6208)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !615, file: !614, line: 1050, baseType: !642, size: 1952, offset: 6240)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1952, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 61)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !615, file: !614, line: 1051, baseType: !547, size: 32, offset: 8192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !615, file: !614, line: 1052, baseType: !647, size: 288, offset: 8224)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 288, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 9)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !615, file: !614, line: 1053, baseType: !546, size: 32, offset: 8512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !615, file: !614, line: 1054, baseType: !652, size: 96, offset: 8544)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 96, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 3)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !615, file: !614, line: 1055, baseType: !546, size: 32, offset: 8640)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !615, file: !614, line: 1056, baseType: !657, size: 1568, offset: 8672)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1568, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 49)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !615, file: !614, line: 1057, baseType: !547, size: 32, offset: 10240)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !615, file: !614, line: 1058, baseType: !652, size: 96, offset: 10272)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !615, file: !614, line: 1059, baseType: !547, size: 32, offset: 10368)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !615, file: !614, line: 1060, baseType: !629, size: 64, offset: 10400)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !615, file: !614, line: 1061, baseType: !547, size: 32, offset: 10464)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !615, file: !614, line: 1062, baseType: !547, size: 32, offset: 10496)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !615, file: !614, line: 1063, baseType: !667, size: 672, offset: 10528)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 672, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 21)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !615, file: !614, line: 1064, baseType: !547, size: 32, offset: 11200)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !615, file: !614, line: 1065, baseType: !546, size: 32, offset: 11232)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !615, file: !614, line: 1066, baseType: !547, size: 32, offset: 11264)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !615, file: !614, line: 1067, baseType: !674, size: 1504, offset: 11296)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1504, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 47)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !615, file: !614, line: 1068, baseType: !546, size: 32, offset: 12800)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !615, file: !614, line: 1069, baseType: !679, size: 5600, offset: 12832)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 5600, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 175)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !615, file: !614, line: 1070, baseType: !683, size: 1152, offset: 18432)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 1152, elements: !648)
!684 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !614, line: 278, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 272, size: 128, elements: !687)
!687 = !{!688, !689, !690, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !686, file: !614, line: 273, baseType: !547, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !686, file: !614, line: 274, baseType: !547, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !686, file: !614, line: 275, baseType: !547, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !686, file: !614, line: 277, baseType: !546, size: 32, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !542, line: 468, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 445, size: 1120, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !722, !726, !728}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !695, file: !542, line: 447, baseType: !546, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !695, file: !542, line: 448, baseType: !547, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !695, file: !542, line: 449, baseType: !547, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !695, file: !542, line: 450, baseType: !547, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !695, file: !542, line: 451, baseType: !547, size: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !695, file: !542, line: 452, baseType: !547, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !695, file: !542, line: 453, baseType: !704, size: 96, offset: 192)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 96, elements: !706)
!705 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !195)
!706 = !{!707}
!707 = !DISubrange(count: 12)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !695, file: !542, line: 454, baseType: !547, size: 32, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !695, file: !542, line: 455, baseType: !547, size: 32, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !695, file: !542, line: 456, baseType: !547, size: 32, offset: 352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !695, file: !542, line: 457, baseType: !547, size: 32, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !695, file: !542, line: 458, baseType: !547, size: 32, offset: 416)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !695, file: !542, line: 459, baseType: !547, size: 32, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !695, file: !542, line: 460, baseType: !547, size: 32, offset: 480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !695, file: !542, line: 461, baseType: !629, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !695, file: !542, line: 462, baseType: !546, size: 32, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !695, file: !542, line: 463, baseType: !546, size: 32, offset: 608)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !695, file: !542, line: 464, baseType: !719, size: 128, offset: 640)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 128, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 4)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !695, file: !542, line: 465, baseType: !723, size: 160, offset: 768)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 160, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 5)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !695, file: !542, line: 466, baseType: !727, size: 160, offset: 928)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 160, elements: !724)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !695, file: !542, line: 467, baseType: !547, size: 32, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !731, file: !730, line: 167, baseType: !739)
!730 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !730, file: !730, line: 134, type: !732, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !609, retainedNodes: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !152}
!734 = !{!735, !736, !738}
!735 = !DILocalVariable(name: "time_us", arg: 1, scope: !731, file: !730, line: 134, type: !152)
!736 = !DILocalVariable(name: "delay_cycles", scope: !731, file: !730, line: 168, type: !737)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!738 = !DILocalVariable(name: "cycles", scope: !731, file: !730, line: 171, type: !152)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !614, line: 2399, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 2373, size: 10880, elements: !743)
!743 = !{!744, !748, !749, !750, !751, !755, !756, !761, !762, !763, !764, !765, !766, !770, !771, !772, !773}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !742, file: !614, line: 2374, baseType: !745, size: 8192)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 8192, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !742, file: !614, line: 2375, baseType: !546, size: 32, offset: 8192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !742, file: !614, line: 2376, baseType: !546, size: 32, offset: 8224)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !742, file: !614, line: 2377, baseType: !546, size: 32, offset: 8256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !742, file: !614, line: 2378, baseType: !752, size: 1984, offset: 8288)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1984, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 62)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !742, file: !614, line: 2379, baseType: !547, size: 32, offset: 10272)
!756 = !DIDerivedType(tag: DW_TAG_member, scope: !742, file: !614, line: 2381, baseType: !757, size: 32, offset: 10304)
!757 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !742, file: !614, line: 2381, size: 32, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !757, file: !614, line: 2382, baseType: !547, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !757, file: !614, line: 2383, baseType: !547, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !742, file: !614, line: 2386, baseType: !547, size: 32, offset: 10336)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !742, file: !614, line: 2387, baseType: !547, size: 32, offset: 10368)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !742, file: !614, line: 2389, baseType: !547, size: 32, offset: 10400)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !742, file: !614, line: 2391, baseType: !547, size: 32, offset: 10432)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !742, file: !614, line: 2393, baseType: !547, size: 32, offset: 10464)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !742, file: !614, line: 2394, baseType: !767, size: 256, offset: 10496)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 256, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 8)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !742, file: !614, line: 2395, baseType: !547, size: 32, offset: 10752)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !742, file: !614, line: 2396, baseType: !546, size: 32, offset: 10784)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !742, file: !614, line: 2397, baseType: !547, size: 32, offset: 10816)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !742, file: !614, line: 2398, baseType: !547, size: 32, offset: 10848)
!774 = !{!607, !775, !790}
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !609, file: !777, line: 93, type: !778, isLocal: true, isDefinition: true, align: 32)
!777 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !780, line: 51, size: 64, elements: !781)
!780 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!781 = !{!782, !789}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !779, file: !780, line: 60, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DISubroutineType(types: !785)
!785 = !{!107, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !780, line: 48, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !779, file: !780, line: 65, baseType: !786, size: 32, offset: 32)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !731, file: !730, line: 161, type: !792, isLocal: true, isDefinition: true, align: 128)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 48, elements: !653)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !203, line: 17, baseType: !118, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !795, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "phase", scope: !801, file: !805, line: 61, type: !804, isLocal: false, isDefinition: true)
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !803, retainedTypes: !830, globals: !836, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!803 = !{!804, !813, !821, !30, !826}
!804 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_phase", file: !805, line: 40, baseType: !32, size: 32, elements: !806)
!805 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!806 = !{!807, !808, !809, !810, !811, !812}
!807 = !DIEnumerator(name: "TEST_PHASE_SETUP", value: 0)
!808 = !DIEnumerator(name: "TEST_PHASE_BEFORE", value: 1)
!809 = !DIEnumerator(name: "TEST_PHASE_TEST", value: 2)
!810 = !DIEnumerator(name: "TEST_PHASE_AFTER", value: 3)
!811 = !DIEnumerator(name: "TEST_PHASE_TEARDOWN", value: 4)
!812 = !DIEnumerator(name: "TEST_PHASE_FRAMEWORK", value: 5)
!813 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_result", file: !805, line: 226, baseType: !32, size: 32, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820}
!815 = !DIEnumerator(name: "ZTEST_RESULT_PENDING", value: 0)
!816 = !DIEnumerator(name: "ZTEST_RESULT_PASS", value: 1)
!817 = !DIEnumerator(name: "ZTEST_RESULT_FAIL", value: 2)
!818 = !DIEnumerator(name: "ZTEST_RESULT_SKIP", value: 3)
!819 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_SKIP", value: 4)
!820 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_FAIL", value: 5)
!821 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_status", file: !805, line: 52, baseType: !32, size: 32, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIEnumerator(name: "ZTEST_STATUS_OK", value: 0)
!824 = !DIEnumerator(name: "ZTEST_STATUS_HAS_FAILURE", value: 1)
!825 = !DIEnumerator(name: "ZTEST_STATUS_CRITICAL_ERROR", value: 2)
!826 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_expected_result", file: !114, line: 36, baseType: !32, size: 32, elements: !827)
!827 = !{!828, !829}
!828 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_FAIL", value: 0)
!829 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_SKIP", value: 1)
!830 = !{!106, !107, !185, !831, !233, !152, !252}
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !832, line: 46, baseType: !833)
!832 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !106, !106, !106}
!836 = !{!799, !837, !839, !841, !850, !852, !956, !959}
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "test_result", scope: !801, file: !805, line: 234, type: !813, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "current_test_failed_assumption", scope: !801, file: !805, line: 294, type: !145, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "ztest_thread_stack", scope: !801, file: !805, line: 430, type: !843, isLocal: false, isDefinition: true, align: 512)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 8704, elements: !848)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !845, line: 47, size: 8, elements: !846)
!845 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !844, file: !845, line: 48, baseType: !120, size: 8)
!848 = !{!849}
!849 = !DISubrange(count: 1088)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "test_status", scope: !801, file: !805, line: 63, type: !821, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "ztest_thread", scope: !801, file: !805, line: 17, type: !854, isLocal: true, isDefinition: true)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !392, line: 245, size: 1280, elements: !855)
!855 = !{!856, !914, !926, !927, !928, !929, !930, !936, !951}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !854, file: !392, line: 247, baseType: !857, size: 384)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !392, line: 57, size: 384, elements: !858)
!858 = !{!859, !883, !890, !891, !892, !901, !902, !903}
!859 = !DIDerivedType(tag: DW_TAG_member, scope: !857, file: !392, line: 60, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !857, file: !392, line: 60, size: 64, elements: !861)
!861 = !{!862, !877}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !860, file: !392, line: 61, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !402, line: 49, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !402, line: 37, size: 64, elements: !865)
!865 = !{!866, !872}
!866 = !DIDerivedType(tag: DW_TAG_member, scope: !864, file: !402, line: 38, baseType: !867, size: 32)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !864, file: !402, line: 38, size: 32, elements: !868)
!868 = !{!869, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !867, file: !402, line: 39, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !402, line: 40, baseType: !870, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, scope: !864, file: !402, line: 42, baseType: !873, size: 32, offset: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !864, file: !402, line: 42, size: 32, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !873, file: !402, line: 43, baseType: !870, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !873, file: !402, line: 44, baseType: !870, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !860, file: !392, line: 62, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !418, line: 49, size: 64, elements: !879)
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !878, file: !418, line: 50, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 64, elements: !423)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !857, file: !392, line: 68, baseType: !884, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !428, line: 233, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 231, size: 64, elements: !887)
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !886, file: !428, line: 232, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !402, line: 48, baseType: !864)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !857, file: !392, line: 71, baseType: !195, size: 8, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !857, file: !392, line: 74, baseType: !195, size: 8, offset: 104)
!892 = !DIDerivedType(tag: DW_TAG_member, scope: !857, file: !392, line: 90, baseType: !893, size: 16, offset: 112)
!893 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !857, file: !392, line: 90, size: 16, elements: !894)
!894 = !{!895, !900}
!895 = !DIDerivedType(tag: DW_TAG_member, scope: !893, file: !392, line: 91, baseType: !896, size: 16)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !893, file: !392, line: 91, size: 16, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !896, file: !392, line: 96, baseType: !442, size: 8)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !896, file: !392, line: 97, baseType: !195, size: 8, offset: 8)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !893, file: !392, line: 100, baseType: !197, size: 16)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !857, file: !392, line: 107, baseType: !152, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !857, file: !392, line: 127, baseType: !106, size: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !857, file: !392, line: 131, baseType: !904, size: 192, offset: 192)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !428, line: 244, size: 192, elements: !905)
!905 = !{!906, !907, !913}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !904, file: !428, line: 245, baseType: !863, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !904, file: !428, line: 246, baseType: !908, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !428, line: 242, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !912}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !904, file: !428, line: 249, baseType: !235, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !854, file: !392, line: 250, baseType: !915, size: 288, offset: 384)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !461, line: 25, size: 288, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !915, file: !461, line: 26, baseType: !152, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !915, file: !461, line: 27, baseType: !152, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !915, file: !461, line: 28, baseType: !152, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !915, file: !461, line: 29, baseType: !152, size: 32, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !915, file: !461, line: 30, baseType: !152, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !915, file: !461, line: 31, baseType: !152, size: 32, offset: 160)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !915, file: !461, line: 32, baseType: !152, size: 32, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !915, file: !461, line: 33, baseType: !152, size: 32, offset: 224)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !915, file: !461, line: 34, baseType: !152, size: 32, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !854, file: !392, line: 253, baseType: !106, size: 32, offset: 672)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !854, file: !392, line: 256, baseType: !885, size: 64, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !854, file: !392, line: 279, baseType: !475, size: 256, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !854, file: !392, line: 294, baseType: !107, size: 32, offset: 1024)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !854, file: !392, line: 300, baseType: !931, size: 96, offset: 1056)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !392, line: 149, size: 96, elements: !932)
!932 = !{!933, !934, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !931, file: !392, line: 153, baseType: !22, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !931, file: !392, line: 162, baseType: !185, size: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !931, file: !392, line: 168, baseType: !185, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !854, file: !392, line: 325, baseType: !937, size: 32, offset: 1152)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !488, line: 5073, size: 192, elements: !939)
!939 = !{!940, !946, !947}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !938, file: !488, line: 5074, baseType: !941, size: 96)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !941, file: !492, line: 57, baseType: !495, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !941, file: !492, line: 58, baseType: !106, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !941, file: !492, line: 59, baseType: !185, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !938, file: !488, line: 5075, baseType: !885, size: 64, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !938, file: !488, line: 5076, baseType: !948, size: 32, offset: 160)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !949)
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !948, file: !266, line: 52, baseType: !22, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !854, file: !392, line: 343, baseType: !952, size: 64, offset: 1184)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !461, line: 60, size: 64, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !952, file: !461, line: 63, baseType: !152, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !952, file: !461, line: 66, baseType: !152, size: 32, offset: 32)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "tc_start_time", scope: !801, file: !958, line: 95, type: !152, isLocal: true, isDefinition: true)
!958 = !DIFile(filename: "zephyr/subsys/testsuite/include/zephyr/tc_util.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "tc_spend_time", scope: !801, file: !958, line: 96, type: !152, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "ztest_api", scope: !964, file: !967, line: 70, type: !968, isLocal: false, isDefinition: true)
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !966, splitDebugInlining: false, nameTableKind: None)
!965 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!966 = !{!962}
!967 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_arch_api", file: !114, line: 499, size: 96, elements: !970)
!970 = !{!971, !972, !993}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "run_all", scope: !969, file: !114, line: 500, baseType: !16, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "should_suite_run", scope: !969, file: !114, line: 501, baseType: !973, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{!145, !13, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !985}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !114, line: 179, baseType: !117, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !977, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !977, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !977, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !977, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !977, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !977, file: !114, line: 197, baseType: !986, size: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !988, file: !114, line: 116, baseType: !152, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !988, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !988, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "should_test_run", scope: !969, file: !114, line: 502, baseType: !994, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DISubroutineType(types: !996)
!996 = !{!145, !118, !118}
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !999, file: !1233, line: 18, type: !1467, isLocal: false, isDefinition: true)
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1001, retainedTypes: !1144, globals: !1229, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/subsys/testsuite/pytest")
!1001 = !{!1002, !1008, !30, !1013, !1018, !1025, !1033, !1041, !1050, !1054, !1109, !1116, !1135}
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !1003, line: 23, baseType: !32, size: 32, elements: !1004)
!1003 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1004 = !{!1005, !1006, !1007}
!1005 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!1006 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!1007 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
