; ModuleID = 'build/96b_nitrogen/system_off/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "__init_disable_ds_1", scope: !27, file: !193, line: 36, type: !194, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !154, globals: !192, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/nrf/system_off/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!29 = !{!30, !38, !44, !50, !55, !66, !136, !140, !144}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!35 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!36 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!37 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !31, line: 75, baseType: !32, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!41 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!42 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!43 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 102, baseType: !32, size: 32, elements: !46)
!45 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "NRF_GPIO_PIN_NOPULL", value: 0)
!48 = !DIEnumerator(name: "NRF_GPIO_PIN_PULLDOWN", value: 1)
!49 = !DIEnumerator(name: "NRF_GPIO_PIN_PULLUP", value: 3)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 144, baseType: !32, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "NRF_GPIO_PIN_NOSENSE", value: 0)
!53 = !DIEnumerator(name: "NRF_GPIO_PIN_SENSE_LOW", value: 3)
!54 = !DIEnumerator(name: "NRF_GPIO_PIN_SENSE_HIGH", value: 2)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !56, line: 27, baseType: !32, size: 32, elements: !57)
!56 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65}
!58 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!59 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!60 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!61 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!62 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!63 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!64 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!65 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !67, line: 27, baseType: !32, size: 32, elements: !68)
!67 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!69 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!70 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!71 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!72 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!73 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!74 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!75 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!76 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!77 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!78 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!79 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!80 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!81 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!82 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!83 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!84 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!85 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!125 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!126 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!127 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!128 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!129 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!130 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!131 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!132 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!133 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!134 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!135 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 85, baseType: !32, size: 32, elements: !137)
!137 = !{!138, !139}
!138 = !DIEnumerator(name: "NRF_GPIO_PIN_DIR_INPUT", value: 0)
!139 = !DIEnumerator(name: "NRF_GPIO_PIN_DIR_OUTPUT", value: 1)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 92, baseType: !32, size: 32, elements: !141)
!141 = !{!142, !143}
!142 = !DIEnumerator(name: "NRF_GPIO_PIN_INPUT_CONNECT", value: 0)
!143 = !DIEnumerator(name: "NRF_GPIO_PIN_INPUT_DISCONNECT", value: 1)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 110, baseType: !32, size: 32, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153}
!146 = !DIEnumerator(name: "NRF_GPIO_PIN_S0S1", value: 0)
!147 = !DIEnumerator(name: "NRF_GPIO_PIN_H0S1", value: 1)
!148 = !DIEnumerator(name: "NRF_GPIO_PIN_S0H1", value: 2)
!149 = !DIEnumerator(name: "NRF_GPIO_PIN_H0H1", value: 3)
!150 = !DIEnumerator(name: "NRF_GPIO_PIN_D0S1", value: 4)
!151 = !DIEnumerator(name: "NRF_GPIO_PIN_D0H1", value: 5)
!152 = !DIEnumerator(name: "NRF_GPIO_PIN_S0D1", value: 6)
!153 = !DIEnumerator(name: "NRF_GPIO_PIN_H0D1", value: 7)
!154 = !{!155, !159, !160, !161, !162, !190}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !156, line: 46, baseType: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !158)
!158 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!160 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_GPIO_Type", file: !164, line: 912, baseType: !165)
!164 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 895, size: 15360, elements: !166)
!166 = !{!167, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !186}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !165, file: !164, line: 896, baseType: !168, size: 10272)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 10272, elements: !171)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!171 = !{!172}
!172 = !DISubrange(count: 321)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "OUT", scope: !165, file: !164, line: 897, baseType: !170, size: 32, offset: 10272)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "OUTSET", scope: !165, file: !164, line: 898, baseType: !170, size: 32, offset: 10304)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "OUTCLR", scope: !165, file: !164, line: 899, baseType: !170, size: 32, offset: 10336)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "IN", scope: !165, file: !164, line: 900, baseType: !169, size: 32, offset: 10368)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "DIR", scope: !165, file: !164, line: 901, baseType: !170, size: 32, offset: 10400)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "DIRSET", scope: !165, file: !164, line: 902, baseType: !170, size: 32, offset: 10432)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "DIRCLR", scope: !165, file: !164, line: 903, baseType: !170, size: 32, offset: 10464)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "LATCH", scope: !165, file: !164, line: 904, baseType: !170, size: 32, offset: 10496)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "DETECTMODE", scope: !165, file: !164, line: 907, baseType: !170, size: 32, offset: 10528)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !165, file: !164, line: 909, baseType: !183, size: 3776, offset: 10560)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 3776, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 118)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "PIN_CNF", scope: !165, file: !164, line: 910, baseType: !187, size: 1024, offset: 14336)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 1024, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !191)
!191 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!192 = !{!25}
!193 = !DIFile(filename: "zephyr/samples/boards/nrf/system_off/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !196, line: 51, size: 64, elements: !197)
!196 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!197 = !{!198, !244}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !195, file: !196, line: 60, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!160, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !205, line: 378, size: 224, elements: !206)
!205 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!206 = !{!207, !211, !212, !213, !222, !223, !229}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !204, file: !205, line: 380, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !204, file: !205, line: 382, baseType: !13, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !204, file: !205, line: 384, baseType: !13, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !204, file: !205, line: 386, baseType: !214, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !205, line: 351, size: 16, elements: !216)
!216 = !{!217, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !215, file: !205, line: 359, baseType: !218, size: 8)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !219)
!219 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !215, file: !205, line: 364, baseType: !221, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!221 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !204, file: !205, line: 388, baseType: !159, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !204, file: !205, line: 396, baseType: !224, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !205, line: 43, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !228)
!228 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !204, file: !205, line: 403, baseType: !230, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 128, elements: !232)
!232 = !{!233, !234, !238, !239}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !231, file: !31, line: 136, baseType: !202, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !231, file: !31, line: 139, baseType: !235, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !236, line: 22, baseType: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !231, file: !31, line: 141, baseType: !30, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !231, file: !31, line: 143, baseType: !240, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{!160, !202, !38}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !195, file: !196, line: 65, baseType: !202, size: 32, offset: 32)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "_char_out", scope: !247, file: !252, line: 54, type: !253, isLocal: false, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !250, globals: !251, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!249 = !{!66}
!250 = !{!159, !160}
!251 = !{!245}
!252 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DISubroutineType(types: !255)
!255 = !{!160, !160}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !258, file: !282, line: 27, type: !315, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !261, globals: !279, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!260 = !{!55, !30, !38, !66}
!261 = !{!159, !155, !160, !24, !262, !278, !161, !190}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !264, line: 54, size: 96, elements: !265)
!264 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!265 = !{!266, !273, !277}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !263, file: !264, line: 55, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !268, line: 33, baseType: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !268, line: 29, size: 32, elements: !270)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !268, line: 30, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !263, file: !264, line: 60, baseType: !274, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !55}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !263, file: !264, line: 65, baseType: !274, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!279 = !{!256, !280, !286, !288, !299, !301, !303, !307}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !258, file: !282, line: 44, type: !283, isLocal: true, isDefinition: true)
!282 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !284, line: 43, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !258, file: !282, line: 49, type: !283, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !258, file: !282, line: 36, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 128, elements: !297)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !56, line: 114, size: 128, elements: !292)
!292 = !{!293, !294, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !291, file: !56, line: 115, baseType: !55, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !291, file: !56, line: 141, baseType: !218, size: 8, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !291, file: !56, line: 149, baseType: !161, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !291, file: !56, line: 156, baseType: !161, size: 32, offset: 96)
!297 = !{!298}
!298 = !DISubrange(count: 1)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !258, file: !282, line: 40, type: !290, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "z_cpus_active", scope: !258, file: !282, line: 47, type: !235, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "num_susp", scope: !258, file: !282, line: 57, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !306, line: 214, baseType: !32)
!306 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !258, file: !282, line: 28, type: !309, isLocal: true, isDefinition: true)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !268, line: 40, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !268, line: 35, size: 64, elements: !311)
!311 = !{!312, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !310, file: !268, line: 36, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !310, file: !268, line: 37, baseType: !313, size: 32, offset: 32)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 32, elements: !297)
!316 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!317 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !320, file: !348, line: 50, type: !335, isLocal: true, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !322, retainedTypes: !323, globals: !345, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!322 = !{!55, !66}
!323 = !{!227, !155, !305, !160, !159, !161, !190, !324, !278, !335, !336}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !326, line: 45, size: 64, elements: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !{!328, !334}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !325, file: !326, line: 46, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !268, line: 33, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !268, line: 29, size: 32, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !268, line: 30, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !325, file: !326, line: 48, baseType: !161, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !160)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !326, line: 38, size: 64, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !337, file: !326, line: 39, baseType: !329, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !337, file: !326, line: 41, baseType: !341, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !326, line: 35, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !335}
!345 = !{!346, !350, !358, !318, !360, !370}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "latency_lock", scope: !320, file: !348, line: 44, type: !349, isLocal: true, isDefinition: true)
!348 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !284, line: 43, elements: !285)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !320, file: !348, line: 46, type: !352, isLocal: true, isDefinition: true)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !268, line: 40, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !268, line: 35, size: 64, elements: !354)
!354 = !{!355, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !353, file: !268, line: 36, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !353, file: !268, line: 37, baseType: !356, size: 32, offset: 32)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "latency_subs", scope: !320, file: !348, line: 52, type: !352, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !320, file: !348, line: 39, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, elements: !368)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 35, size: 96, elements: !364)
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !363, file: !348, line: 36, baseType: !55, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !363, file: !348, line: 37, baseType: !218, size: 8, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !363, file: !348, line: 38, baseType: !235, size: 32, offset: 64)
!368 = !{!369}
!369 = !DISubrange(count: 0)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !320, file: !348, line: 48, type: !335, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !374, file: !381, line: 47, type: !395, isLocal: true, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !376, retainedTypes: !377, globals: !378, splitDebugInlining: false, nameTableKind: None)
!375 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!376 = !{!55}
!377 = !{!305, !160}
!378 = !{!379, !372, !391}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "cpus_states", scope: !374, file: !381, line: 50, type: !382, isLocal: true, isDefinition: true)
!381 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 32, elements: !297)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !56, line: 114, size: 128, elements: !386)
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !385, file: !56, line: 115, baseType: !55, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !385, file: !56, line: 141, baseType: !218, size: 8, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !385, file: !56, line: 149, baseType: !161, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !385, file: !56, line: 156, baseType: !161, size: 32, offset: 96)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !374, file: !381, line: 55, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 8, elements: !297)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, elements: !368)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "action_target_state", scope: !398, file: !414, line: 14, type: !415, isLocal: true, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !400, retainedTypes: !410, globals: !411, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!400 = !{!30, !38, !401, !66}
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_flag", file: !31, line: 30, baseType: !32, size: 32, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409}
!403 = !DIEnumerator(name: "PM_DEVICE_FLAG_BUSY", value: 0)
!404 = !DIEnumerator(name: "PM_DEVICE_FLAG_TURN_ON_FAILED", value: 1)
!405 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_CAPABLE", value: 2)
!406 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_ENABLED", value: 3)
!407 = !DIEnumerator(name: "PM_DEVICE_FLAG_RUNTIME_ENABLED", value: 4)
!408 = !DIEnumerator(name: "PM_DEVICE_FLAG_STATE_LOCKED", value: 5)
!409 = !DIEnumerator(name: "PM_DEVICE_FLAG_PD", value: 6)
!410 = !{!159, !160, !24, !305}
!411 = !{!396, !412}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "action_expected_state", scope: !398, file: !414, line: 20, type: !415, isLocal: true, isDefinition: true)
!414 = !DIFile(filename: "zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 128, elements: !417)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!417 = !{!418}
!418 = !DISubrange(count: 4)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "static_regions", scope: !421, file: !428, line: 62, type: !561, isLocal: true, isDefinition: true)
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !423, globals: !424, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!423 = !{!305, !160, !161, !159}
!424 = !{!425, !419}
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !427, file: !428, line: 198, type: !549, isLocal: true, isDefinition: true)
!427 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !428, file: !428, line: 175, type: !429, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !421, retainedNodes: !546)
!428 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = !DISubroutineType(types: !430)
!430 = !{null, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !433, line: 245, size: 1024, elements: !434)
!433 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !{!435, !502, !515, !516, !517, !518, !524, !541}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !432, file: !433, line: 247, baseType: !436, size: 384)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !433, line: 57, size: 384, elements: !437)
!437 = !{!438, !466, !474, !475, !476, !489, !490, !491}
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !436, file: !433, line: 60, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !436, file: !433, line: 60, size: 64, elements: !440)
!440 = !{!441, !457}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !439, file: !433, line: 61, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !443, line: 49, baseType: !444)
!443 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !443, line: 37, size: 64, elements: !445)
!445 = !{!446, !452}
!446 = !DIDerivedType(tag: DW_TAG_member, scope: !444, file: !443, line: 38, baseType: !447, size: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !444, file: !443, line: 38, size: 32, elements: !448)
!448 = !{!449, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !447, file: !443, line: 39, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !443, line: 40, baseType: !450, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, scope: !444, file: !443, line: 42, baseType: !453, size: 32, offset: 32)
!453 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !444, file: !443, line: 42, size: 32, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !453, file: !443, line: 43, baseType: !450, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !443, line: 44, baseType: !450, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !439, file: !433, line: 62, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !459, line: 49, size: 64, elements: !460)
!459 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !458, file: !459, line: 50, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 64, elements: !464)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!464 = !{!465}
!465 = !DISubrange(count: 2)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !436, file: !433, line: 68, baseType: !467, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !469, line: 233, baseType: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !469, line: 231, size: 64, elements: !471)
!471 = !{!472}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !470, file: !469, line: 232, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !443, line: 48, baseType: !444)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !436, file: !433, line: 71, baseType: !218, size: 8, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !436, file: !433, line: 74, baseType: !218, size: 8, offset: 104)
!476 = !DIDerivedType(tag: DW_TAG_member, scope: !436, file: !433, line: 90, baseType: !477, size: 16, offset: 112)
!477 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !436, file: !433, line: 90, size: 16, elements: !478)
!478 = !{!479, !486}
!479 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !433, line: 91, baseType: !480, size: 16)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !477, file: !433, line: 91, size: 16, elements: !481)
!481 = !{!482, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !480, file: !433, line: 96, baseType: !483, size: 8)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !484)
!484 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !480, file: !433, line: 97, baseType: !218, size: 8, offset: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !477, file: !433, line: 100, baseType: !487, size: 16)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !488)
!488 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !436, file: !433, line: 107, baseType: !161, size: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !436, file: !433, line: 127, baseType: !159, size: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !436, file: !433, line: 131, baseType: !492, size: 192, offset: 192)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !469, line: 244, size: 192, elements: !493)
!493 = !{!494, !495, !501}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !492, file: !469, line: 245, baseType: !442, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !492, file: !469, line: 246, baseType: !496, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !469, line: 242, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !492, file: !469, line: 249, baseType: !157, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !432, file: !433, line: 250, baseType: !503, size: 288, offset: 384)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !504, line: 25, size: 288, elements: !505)
!504 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !503, file: !504, line: 26, baseType: !161, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !503, file: !504, line: 27, baseType: !161, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !503, file: !504, line: 28, baseType: !161, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !503, file: !504, line: 29, baseType: !161, size: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !503, file: !504, line: 30, baseType: !161, size: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !503, file: !504, line: 31, baseType: !161, size: 32, offset: 160)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !503, file: !504, line: 32, baseType: !161, size: 32, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !503, file: !504, line: 33, baseType: !161, size: 32, offset: 224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !503, file: !504, line: 34, baseType: !161, size: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !432, file: !433, line: 253, baseType: !159, size: 32, offset: 672)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !432, file: !433, line: 256, baseType: !468, size: 64, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !432, file: !433, line: 294, baseType: !160, size: 32, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !432, file: !433, line: 300, baseType: !519, size: 96, offset: 800)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !433, line: 149, size: 96, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !519, file: !433, line: 153, baseType: !22, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !433, line: 162, baseType: !305, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !519, file: !433, line: 168, baseType: !305, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !432, file: !433, line: 325, baseType: !525, size: 32, offset: 896)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !527, line: 5073, size: 160, elements: !528)
!527 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!528 = !{!529, !538, !539}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !526, file: !527, line: 5074, baseType: !530, size: 96)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !531, line: 56, size: 96, elements: !532)
!531 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!532 = !{!533, !536, !537}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !530, file: !531, line: 57, baseType: !534, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !531, line: 57, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !530, file: !531, line: 58, baseType: !159, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !530, file: !531, line: 59, baseType: !305, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !526, file: !527, line: 5075, baseType: !468, size: 64, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !526, file: !527, line: 5076, baseType: !540, offset: 160)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !284, line: 43, elements: !285)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !432, file: !433, line: 343, baseType: !542, size: 64, offset: 928)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !504, line: 60, size: 64, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !542, file: !504, line: 63, baseType: !161, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !542, file: !504, line: 66, baseType: !161, size: 32, offset: 32)
!546 = !{!547, !548}
!547 = !DILocalVariable(name: "thread", arg: 1, scope: !427, file: !428, line: 175, type: !431)
!548 = !DILocalVariable(name: "region_num", scope: !427, file: !428, line: 200, type: !218)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, elements: !368)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !551, line: 52, size: 96, elements: !552)
!551 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = !{!553, !554, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !550, file: !551, line: 53, baseType: !22, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !550, file: !551, line: 54, baseType: !305, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !550, file: !551, line: 55, baseType: !556, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !557, line: 151, baseType: !558)
!557 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 149, size: 32, elements: !559)
!559 = !{!560}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !558, file: !557, line: 150, baseType: !161, size: 32)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 96, elements: !297)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !565, file: !597, line: 39, type: !218, isLocal: true, isDefinition: true)
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !567, globals: !596, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!567 = !{!568, !159, !160, !584, !218}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !570, line: 1226, baseType: !571)
!570 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 1213, size: 352, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !571, file: !570, line: 1215, baseType: !169, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !571, file: !570, line: 1216, baseType: !170, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !571, file: !570, line: 1217, baseType: !170, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !571, file: !570, line: 1218, baseType: !170, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !571, file: !570, line: 1219, baseType: !170, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !571, file: !570, line: 1220, baseType: !170, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !571, file: !570, line: 1221, baseType: !170, size: 32, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !571, file: !570, line: 1222, baseType: !170, size: 32, offset: 224)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !571, file: !570, line: 1223, baseType: !170, size: 32, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !571, file: !570, line: 1224, baseType: !170, size: 32, offset: 288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !571, file: !570, line: 1225, baseType: !170, size: 32, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !587, line: 27, size: 96, elements: !588)
!587 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !586, file: !587, line: 29, baseType: !161, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !586, file: !587, line: 31, baseType: !208, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !586, file: !587, line: 37, baseType: !592, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !557, line: 146, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !557, line: 141, size: 32, elements: !594)
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !593, file: !557, line: 143, baseType: !161, size: 32)
!596 = !{!563}
!597 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !600, file: !607, line: 21, type: !253, isLocal: true, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !602, globals: !606, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!602 = !{!603, !160, !159}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !605, line: 22, baseType: !160)
!605 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!606 = !{!598}
!607 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !610, file: !615, line: 13, type: !632, isLocal: true, isDefinition: true)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !612, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!612 = !{!613, !608}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "mpu_config", scope: !610, file: !615, line: 37, type: !616, isLocal: false, isDefinition: true)
!615 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !587, line: 41, size: 64, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !617, file: !587, line: 43, baseType: !161, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !617, file: !587, line: 45, baseType: !621, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !587, line: 27, size: 96, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !623, file: !587, line: 29, baseType: !161, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !587, line: 31, baseType: !208, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !623, file: !587, line: 37, baseType: !628, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !557, line: 146, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !557, line: 141, size: 32, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !629, file: !557, line: 143, baseType: !161, size: 32)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 192, elements: !464)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !635, file: !792, line: 93, type: !793, isLocal: true, isDefinition: true, align: 32)
!635 = distinct !DICompileUnit(language: DW_LANG_C99, file: !636, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !637, globals: !787, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!637 = !{!638, !218, !159, !160, !711, !161, !712, !746, !757}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !164, line: 882, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 850, size: 19456, elements: !641)
!641 = !{!642, !646, !647, !648, !652, !653, !655, !656, !657, !661, !662, !663, !667, !668, !672, !673, !677, !678, !682, !683, !684, !685, !686, !687, !691, !692, !696, !697, !701}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !640, file: !164, line: 851, baseType: !643, size: 960)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 960, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 30)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !640, file: !164, line: 852, baseType: !170, size: 32, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !640, file: !164, line: 853, baseType: !170, size: 32, offset: 992)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !640, file: !164, line: 854, baseType: !649, size: 1088, offset: 1024)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 1088, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 34)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !640, file: !164, line: 855, baseType: !170, size: 32, offset: 2112)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !640, file: !164, line: 856, baseType: !654, size: 64, offset: 2144)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 64, elements: !464)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !640, file: !164, line: 857, baseType: !170, size: 32, offset: 2208)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !640, file: !164, line: 858, baseType: !170, size: 32, offset: 2240)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !640, file: !164, line: 859, baseType: !658, size: 3904, offset: 2272)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 3904, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 122)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !640, file: !164, line: 860, baseType: !170, size: 32, offset: 6176)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !640, file: !164, line: 861, baseType: !170, size: 32, offset: 6208)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !640, file: !164, line: 862, baseType: !664, size: 1952, offset: 6240)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 1952, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 61)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !640, file: !164, line: 863, baseType: !170, size: 32, offset: 8192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !640, file: !164, line: 864, baseType: !669, size: 288, offset: 8224)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 288, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 9)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !640, file: !164, line: 865, baseType: !169, size: 32, offset: 8512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !640, file: !164, line: 866, baseType: !674, size: 1696, offset: 8544)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 1696, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 53)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !640, file: !164, line: 867, baseType: !170, size: 32, offset: 10240)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !640, file: !164, line: 868, baseType: !679, size: 96, offset: 10272)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 96, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 3)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !640, file: !164, line: 869, baseType: !170, size: 32, offset: 10368)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !640, file: !164, line: 870, baseType: !654, size: 64, offset: 10400)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !640, file: !164, line: 871, baseType: !170, size: 32, offset: 10464)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !640, file: !164, line: 872, baseType: !170, size: 32, offset: 10496)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !640, file: !164, line: 873, baseType: !170, size: 32, offset: 10528)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !640, file: !164, line: 875, baseType: !688, size: 352, offset: 10560)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 352, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 11)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !640, file: !164, line: 876, baseType: !170, size: 32, offset: 10912)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !640, file: !164, line: 878, baseType: !693, size: 256, offset: 10944)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 256, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 8)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !640, file: !164, line: 879, baseType: !170, size: 32, offset: 11200)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !640, file: !164, line: 880, baseType: !698, size: 7200, offset: 11232)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 7200, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 225)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !640, file: !164, line: 881, baseType: !702, size: 1024, offset: 18432)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 1024, elements: !694)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !164, line: 258, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 252, size: 128, elements: !706)
!706 = !{!707, !708, !709, !710}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !705, file: !164, line: 253, baseType: !170, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !705, file: !164, line: 254, baseType: !170, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !705, file: !164, line: 255, baseType: !170, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !705, file: !164, line: 257, baseType: !169, size: 32, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !570, line: 468, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 445, size: 1120, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !739, !743, !745}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !714, file: !570, line: 447, baseType: !169, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !714, file: !570, line: 448, baseType: !170, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !714, file: !570, line: 449, baseType: !170, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !714, file: !570, line: 450, baseType: !170, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !714, file: !570, line: 451, baseType: !170, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !714, file: !570, line: 452, baseType: !170, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !714, file: !570, line: 453, baseType: !723, size: 96, offset: 192)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 96, elements: !725)
!724 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !218)
!725 = !{!726}
!726 = !DISubrange(count: 12)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !714, file: !570, line: 454, baseType: !170, size: 32, offset: 288)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !714, file: !570, line: 455, baseType: !170, size: 32, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !714, file: !570, line: 456, baseType: !170, size: 32, offset: 352)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !714, file: !570, line: 457, baseType: !170, size: 32, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !714, file: !570, line: 458, baseType: !170, size: 32, offset: 416)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !714, file: !570, line: 459, baseType: !170, size: 32, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !714, file: !570, line: 460, baseType: !170, size: 32, offset: 480)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !714, file: !570, line: 461, baseType: !654, size: 64, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !714, file: !570, line: 462, baseType: !169, size: 32, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !714, file: !570, line: 463, baseType: !169, size: 32, offset: 608)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !714, file: !570, line: 464, baseType: !738, size: 128, offset: 640)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, elements: !417)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !714, file: !570, line: 465, baseType: !740, size: 160, offset: 768)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 160, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 5)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !714, file: !570, line: 466, baseType: !744, size: 160, offset: 928)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 160, elements: !741)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !714, file: !570, line: 467, baseType: !170, size: 32, offset: 1088)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !748, file: !747, line: 167, baseType: !756)
!747 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!748 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !747, file: !747, line: 134, type: !749, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !635, retainedNodes: !751)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !161}
!751 = !{!752, !753, !755}
!752 = !DILocalVariable(name: "time_us", arg: 1, scope: !748, file: !747, line: 134, type: !161)
!753 = !DILocalVariable(name: "delay_cycles", scope: !748, file: !747, line: 168, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!755 = !DILocalVariable(name: "cycles", scope: !748, file: !747, line: 171, type: !161)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !164, line: 2140, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 2119, size: 10880, elements: !760)
!760 = !{!761, !765, !766, !770, !771, !776, !777, !778, !779, !783, !784, !785, !786}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !759, file: !164, line: 2120, baseType: !762, size: 8192)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 8192, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !759, file: !164, line: 2121, baseType: !169, size: 32, offset: 8192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !759, file: !164, line: 2122, baseType: !767, size: 2048, offset: 8224)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 2048, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !759, file: !164, line: 2123, baseType: !170, size: 32, offset: 10272)
!771 = !DIDerivedType(tag: DW_TAG_member, scope: !759, file: !164, line: 2125, baseType: !772, size: 32, offset: 10304)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !759, file: !164, line: 2125, size: 32, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !772, file: !164, line: 2126, baseType: !170, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !772, file: !164, line: 2127, baseType: !170, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !759, file: !164, line: 2130, baseType: !170, size: 32, offset: 10336)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !759, file: !164, line: 2131, baseType: !170, size: 32, offset: 10368)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !759, file: !164, line: 2133, baseType: !170, size: 32, offset: 10400)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !759, file: !164, line: 2135, baseType: !780, size: 320, offset: 10432)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 320, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 10)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !759, file: !164, line: 2136, baseType: !170, size: 32, offset: 10752)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !759, file: !164, line: 2137, baseType: !169, size: 32, offset: 10784)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !759, file: !164, line: 2138, baseType: !170, size: 32, offset: 10816)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !759, file: !164, line: 2139, baseType: !170, size: 32, offset: 10848)
!787 = !{!633, !788}
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !748, file: !747, line: 161, type: !790, isLocal: true, isDefinition: true, align: 128)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 48, elements: !680)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!792 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !196, line: 51, size: 64, elements: !795)
!795 = !{!796, !803}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !794, file: !196, line: 60, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{!160, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 48, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !794, file: !196, line: 65, baseType: !800, size: 32, offset: 32)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "__device_dts_ord_34", scope: !806, file: !1030, line: 733, type: !1131, isLocal: false, isDefinition: true, align: 32)
!806 = distinct !DICompileUnit(language: DW_LANG_C99, file: !807, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !808, retainedTypes: !941, globals: !1026, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/system_off")
!808 = !{!809, !815, !66, !820, !825, !832, !838, !844, !853, !857, !906, !913, !932}
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !810, line: 23, baseType: !32, size: 32, elements: !811)
!810 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!811 = !{!812, !813, !814}
!812 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!813 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!814 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!815 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !810, line: 48, baseType: !32, size: 32, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!818 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!819 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!820 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !821, line: 167, baseType: !32, size: 32, elements: !822)
!821 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !{!823, !824}
!823 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!824 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!825 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !821, line: 107, baseType: !32, size: 32, elements: !826)
!826 = !{!827, !828, !829, !830, !831}
!827 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!828 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!829 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!830 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!831 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!832 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !821, line: 208, baseType: !32, size: 32, elements: !833)
!833 = !{!834, !835, !836, !837}
!834 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!835 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!836 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!837 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !821, line: 261, baseType: !32, size: 32, elements: !839)
!839 = !{!840, !841, !842, !843}
!840 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!841 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!842 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!843 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !821, line: 237, baseType: !32, size: 32, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852}
!846 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!847 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!848 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!849 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!850 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!851 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!852 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!853 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !821, line: 152, baseType: !32, size: 32, elements: !854)
!854 = !{!855, !856}
!855 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!856 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 71, baseType: !160, size: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905}
!859 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!860 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!861 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!862 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!863 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!864 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!865 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!866 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!867 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!868 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!869 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!870 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!871 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!872 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!873 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!874 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!875 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!876 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!877 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!878 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!879 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!880 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!881 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!882 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!883 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!884 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!885 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!886 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!887 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!888 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!889 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!890 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!891 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!892 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!893 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!894 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!895 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!896 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!897 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!898 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!899 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!900 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!901 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!902 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!903 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!904 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!905 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !907, line: 44, baseType: !32, size: 32, elements: !908)
!907 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!908 = !{!909, !910, !911, !912}
!909 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!910 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!911 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!912 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !914, line: 54, baseType: !32, size: 32, elements: !915)
!914 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!915 = !{!916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!916 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!917 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!918 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!919 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!920 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!921 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!922 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!923 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!924 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!925 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!926 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!927 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!928 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!929 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!930 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!931 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 53, baseType: !32, size: 32, elements: !934)
!933 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!934 = !{!935, !936, !937, !938, !939, !940}
!935 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!936 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!937 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!938 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!939 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!940 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!941 = !{!809, !159, !160, !942, !990, !991, !992, !993, !155, !161, !190, !221, !711, !994, !335, !995, !1025, !305}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !164, line: 837, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 804, size: 11008, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953, !957, !958, !959, !960, !961, !962, !966, !967, !968, !972, !973, !974, !975, !976, !977, !978, !982, !983, !987, !988, !989}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !944, file: !164, line: 805, baseType: !170, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !944, file: !164, line: 806, baseType: !170, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !944, file: !164, line: 807, baseType: !170, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !944, file: !164, line: 808, baseType: !170, size: 32, offset: 96)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !944, file: !164, line: 809, baseType: !170, size: 32, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !944, file: !164, line: 810, baseType: !170, size: 32, offset: 160)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !944, file: !164, line: 811, baseType: !170, size: 32, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !944, file: !164, line: 812, baseType: !954, size: 1824, offset: 224)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 1824, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 57)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !944, file: !164, line: 813, baseType: !170, size: 32, offset: 2048)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !944, file: !164, line: 814, baseType: !170, size: 32, offset: 2080)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !944, file: !164, line: 815, baseType: !169, size: 32, offset: 2112)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !944, file: !164, line: 816, baseType: !170, size: 32, offset: 2144)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !944, file: !164, line: 817, baseType: !170, size: 32, offset: 2176)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !944, file: !164, line: 818, baseType: !963, size: 3968, offset: 2208)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 3968, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 124)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !944, file: !164, line: 819, baseType: !170, size: 32, offset: 6176)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !944, file: !164, line: 820, baseType: !170, size: 32, offset: 6208)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !944, file: !164, line: 821, baseType: !969, size: 2016, offset: 6240)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 2016, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 63)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !944, file: !164, line: 822, baseType: !169, size: 32, offset: 8256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !944, file: !164, line: 824, baseType: !169, size: 32, offset: 8288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !944, file: !164, line: 825, baseType: !169, size: 32, offset: 8320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !944, file: !164, line: 826, baseType: !169, size: 32, offset: 8352)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !944, file: !164, line: 828, baseType: !169, size: 32, offset: 8384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !944, file: !164, line: 829, baseType: !169, size: 32, offset: 8416)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !944, file: !164, line: 831, baseType: !979, size: 1984, offset: 8448)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 1984, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 62)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !944, file: !164, line: 832, baseType: !170, size: 32, offset: 10432)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !944, file: !164, line: 833, baseType: !984, size: 224, offset: 10464)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 224, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 7)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !944, file: !164, line: 834, baseType: !170, size: 32, offset: 10688)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !944, file: !164, line: 835, baseType: !693, size: 256, offset: 10720)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !944, file: !164, line: 836, baseType: !170, size: 32, offset: 10976)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !821, line: 146, baseType: !825)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !821, line: 164, baseType: !853)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !570, line: 426, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 411, size: 28704, elements: !998)
!998 = !{!999, !1001, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1016, !1020, !1024}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !997, file: !570, line: 413, baseType: !1000, size: 256)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 256, elements: !694)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !997, file: !570, line: 414, baseType: !1002, size: 768, offset: 256)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 768, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 24)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !997, file: !570, line: 415, baseType: !1000, size: 256, offset: 1024)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !997, file: !570, line: 416, baseType: !1002, size: 768, offset: 1280)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !997, file: !570, line: 417, baseType: !1000, size: 256, offset: 2048)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !997, file: !570, line: 418, baseType: !1002, size: 768, offset: 2304)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !997, file: !570, line: 419, baseType: !1000, size: 256, offset: 3072)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !997, file: !570, line: 420, baseType: !1002, size: 768, offset: 3328)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !997, file: !570, line: 421, baseType: !1000, size: 256, offset: 4096)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !997, file: !570, line: 422, baseType: !1013, size: 1792, offset: 4352)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1792, elements: !1014)
!1014 = !{!1015}
!1015 = !DISubrange(count: 56)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !997, file: !570, line: 423, baseType: !1017, size: 1920, offset: 6144)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 1920, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 240)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !997, file: !570, line: 424, baseType: !1021, size: 20608, offset: 8064)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 20608, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 644)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !997, file: !570, line: 425, baseType: !170, size: 32, offset: 28672)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !907, line: 56, baseType: !159)
!1026 = !{!1027, !1077, !1118, !804, !1121, !1149, !1151, !1168, !1170, !1180, !1183, !1198, !1201, !1239, !1253}
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "on", scope: !1029, file: !1030, line: 549, type: !235, isLocal: true, isDefinition: true)
!1029 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !1030, file: !1030, line: 547, type: !1031, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !806, retainedNodes: !1033)
!1030 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1031 = !DISubroutineType(types: !1032)
!1032 = !{null, !815}
!1033 = !{!1034, !1035, !1038}
!1034 = !DILocalVariable(name: "start_mode", arg: 1, scope: !1029, file: !1030, line: 547, type: !815)
!1035 = !DILocalVariable(name: "err", scope: !1036, file: !1030, line: 553, type: !160)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !1030, line: 552, column: 31)
!1037 = distinct !DILexicalBlock(scope: !1029, file: !1030, line: 552, column: 6)
!1038 = !DILocalVariable(name: "mgr", scope: !1036, file: !1030, line: 554, type: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !1041, line: 154, size: 224, elements: !1042)
!1041 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1042 = !{!1043, !1055, !1056, !1072, !1074, !1075, !1076}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !1040, file: !1041, line: 158, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !268, line: 40, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !268, line: 35, size: 64, elements: !1046)
!1046 = !{!1047, !1054}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1045, file: !268, line: 36, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !268, line: 33, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !268, line: 29, size: 32, elements: !1051)
!1051 = !{!1052}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1050, file: !268, line: 30, baseType: !1053, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1045, file: !268, line: 37, baseType: !1048, size: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !1040, file: !1041, line: 163, baseType: !1044, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !1040, file: !1041, line: 166, baseType: !1057, size: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !1041, line: 133, size: 96, elements: !1060)
!1060 = !{!1061, !1070, !1071}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1059, file: !1041, line: 135, baseType: !1062, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !1041, line: 129, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 32)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !1039, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !1041, line: 101, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 32)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !1039, !160}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1059, file: !1041, line: 138, baseType: !1062, size: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1059, file: !1041, line: 143, baseType: !1062, size: 32, offset: 64)
