; ModuleID = 'build/96b_meerkat96/device_pm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "parent", scope: !27, file: !338, line: 13, type: !126, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !114, globals: !335, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!29 = !{!30, !38, !44}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!35 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!36 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!37 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !31, line: 75, baseType: !32, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!41 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!42 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!43 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !45, line: 27, baseType: !32, size: 32, elements: !46)
!45 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!47 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!48 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!49 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!50 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!51 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!52 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!53 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!54 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!55 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!56 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!57 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!58 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!59 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!60 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!61 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!62 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!63 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!113 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !120)
!119 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !118, file: !119, line: 18, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DISubroutineType(types: !125)
!125 = !{!116, !126, !223, !334}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !130)
!129 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !{!131, !135, !136, !137, !146, !147, !153}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 380, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !128, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !128, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 386, baseType: !138, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !140)
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !139, file: !129, line: 359, baseType: !142, size: 8)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !143)
!143 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !139, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !128, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !129, line: 43, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !128, file: !129, line: 403, baseType: !154, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !156)
!156 = !{!157, !158, !281, !282, !319, !323, !324, !328, !329}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !155, file: !31, line: 124, baseType: !126, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !155, file: !31, line: 126, baseType: !159, size: 160, offset: 32)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162, !183, !279, !280}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !159, file: !160, line: 2722, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !165)
!164 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !165, file: !164, line: 232, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !171)
!171 = !{!172, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 38, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 38, size: 32, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !173, file: !169, line: 39, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 40, baseType: !176, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 42, baseType: !179, size: 32, offset: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 42, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !169, line: 43, baseType: !176, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !169, line: 44, baseType: !176, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !159, file: !160, line: 2724, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 896, elements: !187)
!186 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !{!188, !238, !251, !252, !253, !254, !274}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !185, file: !186, line: 247, baseType: !189, size: 384)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !190)
!190 = !{!191, !205, !207, !208, !209, !222, !224, !225}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 60, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 60, size: 64, elements: !193)
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !192, file: !186, line: 61, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !170)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !192, file: !186, line: 62, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !197, file: !198, line: 50, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !203)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !189, file: !186, line: 68, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !189, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !189, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 90, baseType: !210, size: 16, offset: 112)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 90, size: 16, elements: !211)
!211 = !{!212, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, scope: !210, file: !186, line: 91, baseType: !213, size: 16)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !186, line: 91, size: 16, elements: !214)
!214 = !{!215, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !213, file: !186, line: 96, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !217)
!217 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !213, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !210, file: !186, line: 100, baseType: !220, size: 16)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !221)
!221 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !189, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !189, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !189, file: !186, line: 131, baseType: !226, size: 192, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !227)
!227 = !{!228, !229, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !226, file: !164, line: 245, baseType: !195, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !226, file: !164, line: 246, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !226, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !237)
!237 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !185, file: !186, line: 250, baseType: !239, size: 288, offset: 384)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !239, file: !240, line: 26, baseType: !223, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !239, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !239, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !239, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !239, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !239, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !239, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !239, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !239, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !185, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !185, file: !186, line: 256, baseType: !163, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !185, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !185, file: !186, line: 325, baseType: !255, size: 32, offset: 800)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !257)
!257 = !{!258, !269, !270}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !256, file: !160, line: 5074, baseType: !259, size: 96)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !260, line: 56, size: 96, elements: !261)
!260 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !{!262, !265, !266}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !259, file: !260, line: 57, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !260, line: 57, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !259, file: !260, line: 58, baseType: !115, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !259, file: !260, line: 59, baseType: !267, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !268, line: 214, baseType: !32)
!268 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !256, file: !160, line: 5075, baseType: !163, size: 64, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !256, file: !160, line: 5076, baseType: !271, offset: 160)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !272, line: 43, elements: !273)
!272 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !{}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !185, file: !186, line: 343, baseType: !275, size: 64, offset: 832)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !275, file: !240, line: 63, baseType: !223, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !275, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !159, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !159, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !155, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !155, file: !31, line: 130, baseType: !283, size: 384, offset: 256)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !284)
!284 = !{!285, !317, !318}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !283, file: !160, line: 3693, baseType: !286, size: 128)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !287)
!287 = !{!288, !295, !301, !316}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !286, file: !160, line: 3669, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !290, line: 33, baseType: !291)
!290 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !290, line: 29, size: 32, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !290, line: 30, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !286, file: !160, line: 3672, baseType: !296, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !286, file: !160, line: 3675, baseType: !302, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1152, elements: !304)
!304 = !{!305, !306, !313, !314, !315}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !303, file: !160, line: 3812, baseType: !185, size: 896)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !303, file: !160, line: 3819, baseType: !307, size: 64, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !290, line: 40, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !290, line: 35, size: 64, elements: !309)
!309 = !{!310, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !308, file: !290, line: 36, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !308, file: !290, line: 37, baseType: !311, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !303, file: !160, line: 3822, baseType: !163, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !303, file: !160, line: 3825, baseType: !163, size: 64, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !160, line: 3828, baseType: !223, size: 32, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !283, file: !160, line: 3696, baseType: !226, size: 192, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !283, file: !160, line: 3699, baseType: !302, size: 32, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !155, file: !31, line: 132, baseType: !320, size: 64, offset: 640)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !320, file: !160, line: 2829, baseType: !163, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !155, file: !31, line: 136, baseType: !126, size: 32, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !31, line: 139, baseType: !325, size: 32, offset: 736)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !326, line: 22, baseType: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !155, file: !31, line: 143, baseType: !330, size: 32, offset: 800)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{!116, !126, !38}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!335 = !{!336, !342, !344, !25, !355, !357, !359, !379}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !27, file: !338, line: 117, type: !339, isLocal: false, isDefinition: true, align: 16)
!338 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 48, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 3)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "__device_dummy_driver", scope: !27, file: !338, line: 117, type: !127, isLocal: true, isDefinition: true, align: 32)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "__init___device_dummy_driver", scope: !27, file: !338, line: 117, type: !346, isLocal: true, isDefinition: true, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !348, line: 51, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !347, file: !348, line: 60, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DISubroutineType(types: !353)
!353 = !{!116, !126}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !347, file: !348, line: 65, baseType: !126, size: 32, offset: 32)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_driver", scope: !27, file: !338, line: 115, type: !126, isLocal: true, isDefinition: true, align: 32)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "__devstate_dummy_driver", scope: !27, file: !338, line: 117, type: !139, isLocal: true, isDefinition: true, align: 8)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "funcs", scope: !27, file: !338, line: 98, type: !361, isLocal: true, isDefinition: true)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_driver_api", file: !363, line: 19, size: 128, elements: !364)
!363 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !367, !372, !377}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !362, file: !363, line: 20, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_open_t", file: !363, line: 11, baseType: !351)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !362, file: !363, line: 21, baseType: !368, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_read_t", file: !363, line: 13, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DISubroutineType(types: !371)
!371 = !{!116, !126, !334}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !362, file: !363, line: 22, baseType: !373, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_write_t", file: !363, line: 15, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{!116, !126, !223}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !362, file: !363, line: 23, baseType: !378, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_close_t", file: !363, line: 17, baseType: !351)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "__pm_device_dummy_driver", scope: !27, file: !338, line: 115, type: !155, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !383, file: !388, line: 22, type: !339, isLocal: false, isDefinition: true, align: 16)
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !385, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!385 = !{!386, !389, !391, !381}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !383, file: !388, line: 7, type: !339, isLocal: false, isDefinition: true, align: 16)
!388 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_198", scope: !383, file: !388, line: 12, type: !339, isLocal: false, isDefinition: true, align: 16)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !383, file: !388, line: 17, type: !339, isLocal: false, isDefinition: true, align: 16)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "funcs", scope: !395, file: !401, line: 43, type: !592, isLocal: true, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !397, globals: !398, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!397 = !{!115, !116}
!398 = !{!399, !402, !574, !584, !586, !393, !588, !590}
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !395, file: !401, line: 54, type: !339, isLocal: false, isDefinition: true, align: 16)
!401 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "__device_dummy_parent", scope: !395, file: !401, line: 54, type: !404, isLocal: true, isDefinition: true, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !406)
!406 = !{!407, !408, !409, !410, !416, !417, !418}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !129, line: 380, baseType: !132, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !405, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !405, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !405, file: !129, line: 386, baseType: !411, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !412, file: !129, line: 359, baseType: !142, size: 8)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !412, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !405, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !405, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !405, file: !129, line: 403, baseType: !419, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !421)
!421 = !{!422, !424, !525, !526, !562, !566, !567, !568, !569}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !420, file: !31, line: 124, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !420, file: !31, line: 126, baseType: !425, size: 160, offset: 32)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !426)
!426 = !{!427, !446, !523, !524}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !425, file: !160, line: 2722, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !429, file: !164, line: 232, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !434)
!434 = !{!435, !441}
!435 = !DIDerivedType(tag: DW_TAG_member, scope: !433, file: !169, line: 38, baseType: !436, size: 32)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !433, file: !169, line: 38, size: 32, elements: !437)
!437 = !{!438, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !436, file: !169, line: 39, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !169, line: 40, baseType: !439, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, scope: !433, file: !169, line: 42, baseType: !442, size: 32, offset: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !433, file: !169, line: 42, size: 32, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !442, file: !169, line: 43, baseType: !439, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !442, file: !169, line: 44, baseType: !439, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !425, file: !160, line: 2724, baseType: !447, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 896, elements: !449)
!449 = !{!450, !490, !502, !503, !504, !505, !518}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !448, file: !186, line: 247, baseType: !451, size: 384)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !452)
!452 = !{!453, !464, !466, !467, !468, !477, !478, !479}
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !451, file: !186, line: 60, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !451, file: !186, line: 60, size: 64, elements: !455)
!455 = !{!456, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !454, file: !186, line: 61, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !433)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !454, file: !186, line: 62, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !459, file: !198, line: 50, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 64, elements: !203)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !451, file: !186, line: 68, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !451, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !451, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !451, file: !186, line: 90, baseType: !469, size: 16, offset: 112)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !451, file: !186, line: 90, size: 16, elements: !470)
!470 = !{!471, !476}
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !469, file: !186, line: 91, baseType: !472, size: 16)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !186, line: 91, size: 16, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !472, file: !186, line: 96, baseType: !216, size: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !472, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !469, file: !186, line: 100, baseType: !220, size: 16)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !451, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !451, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !451, file: !186, line: 131, baseType: !480, size: 192, offset: 192)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !481)
!481 = !{!482, !483, !489}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !480, file: !164, line: 245, baseType: !457, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !480, file: !164, line: 246, baseType: !484, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !480, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !448, file: !186, line: 250, baseType: !491, size: 288, offset: 384)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !491, file: !240, line: 26, baseType: !223, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !491, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !491, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !491, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !491, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !491, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !491, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !491, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !491, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !448, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !448, file: !186, line: 256, baseType: !428, size: 64, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !448, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !448, file: !186, line: 325, baseType: !506, size: 32, offset: 800)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !508)
!508 = !{!509, !515, !516}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !507, file: !160, line: 5074, baseType: !510, size: 96)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !260, line: 56, size: 96, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !510, file: !260, line: 57, baseType: !263, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !510, file: !260, line: 58, baseType: !115, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !510, file: !260, line: 59, baseType: !267, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !507, file: !160, line: 5075, baseType: !428, size: 64, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !507, file: !160, line: 5076, baseType: !517, offset: 160)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !272, line: 43, elements: !273)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !448, file: !186, line: 343, baseType: !519, size: 64, offset: 832)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !519, file: !240, line: 63, baseType: !223, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !519, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !425, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !425, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !420, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !420, file: !31, line: 130, baseType: !527, size: 384, offset: 256)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !528)
!528 = !{!529, !560, !561}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !527, file: !160, line: 3693, baseType: !530, size: 128)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !531)
!531 = !{!532, !538, !544, !559}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !530, file: !160, line: 3669, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !290, line: 33, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !290, line: 29, size: 32, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !534, file: !290, line: 30, baseType: !537, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !530, file: !160, line: 3672, baseType: !539, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !530, file: !160, line: 3675, baseType: !545, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1152, elements: !547)
!547 = !{!548, !549, !556, !557, !558}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !546, file: !160, line: 3812, baseType: !448, size: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !546, file: !160, line: 3819, baseType: !550, size: 64, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !290, line: 40, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !290, line: 35, size: 64, elements: !552)
!552 = !{!553, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !551, file: !290, line: 36, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !551, file: !290, line: 37, baseType: !554, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !546, file: !160, line: 3822, baseType: !428, size: 64, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !546, file: !160, line: 3825, baseType: !428, size: 64, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !160, line: 3828, baseType: !223, size: 32, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !527, file: !160, line: 3696, baseType: !480, size: 192, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !527, file: !160, line: 3699, baseType: !545, size: 32, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !420, file: !31, line: 132, baseType: !563, size: 64, offset: 640)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !564)
!564 = !{!565}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !563, file: !160, line: 2829, baseType: !428, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !420, file: !31, line: 136, baseType: !423, size: 32, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !420, file: !31, line: 139, baseType: !325, size: 32, offset: 736)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !420, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !420, file: !31, line: 143, baseType: !570, size: 32, offset: 800)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DISubroutineType(types: !573)
!573 = !{!116, !423, !38}
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "__init___device_dummy_parent", scope: !395, file: !401, line: 54, type: !576, isLocal: true, isDefinition: true, align: 32)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !348, line: 51, size: 64, elements: !578)
!578 = !{!579, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !577, file: !348, line: 60, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{!116, !423}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !577, file: !348, line: 65, baseType: !423, size: 32, offset: 32)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_parent", scope: !395, file: !401, line: 52, type: !423, isLocal: true, isDefinition: true, align: 32)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "__devstate_dummy_parent", scope: !395, file: !401, line: 54, type: !412, isLocal: true, isDefinition: true, align: 8)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "store_value", scope: !395, file: !401, line: 12, type: !223, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "__pm_device_dummy_parent", scope: !395, file: !401, line: 52, type: !420, isLocal: true, isDefinition: true)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !594)
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !593, file: !119, line: 18, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!116, !423, !223, !334}
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "_char_out", scope: !602, file: !606, line: 54, type: !607, isLocal: false, isDefinition: true)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !604, retainedTypes: !397, globals: !605, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!604 = !{!44}
!605 = !{!600}
!606 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!116, !116}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !612, file: !1026, line: 258, type: !1027, isLocal: true, isDefinition: true, align: 32)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !614, retainedTypes: !897, globals: !1025, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!614 = !{!615, !647, !657, !706, !712, !833, !868}
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !616, line: 54, baseType: !32, size: 32, elements: !617)
!616 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!618 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!619 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!620 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!621 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!622 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!623 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!624 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!625 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!626 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!627 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!628 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!629 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!630 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!631 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!632 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!633 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!634 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!635 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!636 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!637 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!638 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!639 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!640 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!641 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!642 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!643 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!644 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!645 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!646 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !616, line: 224, baseType: !32, size: 32, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656}
!649 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!650 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!651 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!652 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!653 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!654 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!655 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!656 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !616, line: 275, baseType: !32, size: 32, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!659 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!660 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!661 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!662 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!663 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!664 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!665 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!666 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!667 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!668 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!669 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!670 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!671 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!672 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!673 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!674 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!675 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!676 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!677 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!678 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!679 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!680 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!681 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!682 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!683 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!684 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!685 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!686 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!687 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!688 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!689 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!690 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!691 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!692 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!693 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!694 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!695 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!696 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!697 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!698 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!699 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!700 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!701 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!702 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!703 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!704 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!705 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !616, line: 327, baseType: !32, size: 32, elements: !707)
!707 = !{!708, !709, !710, !711}
!708 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!709 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!710 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!711 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !713, line: 76, baseType: !32, size: 32, elements: !714)
!713 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!715 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!716 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!717 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!718 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!719 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!720 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!721 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!722 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!723 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!724 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!725 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!726 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!727 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!728 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!729 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!730 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!731 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!732 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!733 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!734 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!735 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!736 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!737 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!738 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!739 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!740 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!741 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!742 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!743 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!744 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!745 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!746 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!747 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!748 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!749 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!750 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!751 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!752 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!753 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!754 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!755 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!756 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!757 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!758 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!759 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!760 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!761 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!762 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!763 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!764 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!765 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!766 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!767 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!768 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!769 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!770 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!771 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!772 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!773 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!774 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!775 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!776 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!777 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!778 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!779 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!780 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!781 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!782 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!783 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!784 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!785 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!786 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!787 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!788 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!789 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!790 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!791 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!792 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!793 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!794 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!795 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!796 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!797 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!798 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!799 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!800 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!801 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!802 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!803 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!804 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!805 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!806 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!807 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!808 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!809 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!810 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!811 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!812 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!813 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!814 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!815 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!816 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!817 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!818 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!819 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!820 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!821 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!822 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!823 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!824 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!825 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!826 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!827 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!828 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!829 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!830 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!831 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!832 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !616, line: 237, baseType: !32, size: 32, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!835 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!836 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!837 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!838 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!839 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!840 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!841 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!842 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!843 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!844 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!845 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!846 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!847 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!848 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!849 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!850 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!851 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!852 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!853 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!854 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!855 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!856 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!857 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!858 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!859 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!860 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!861 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!862 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!863 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!864 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!865 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!866 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!867 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!868 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !713, line: 44, baseType: !32, size: 32, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!870 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!871 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!872 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!873 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!874 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!875 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!876 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!877 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!878 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!879 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!880 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!881 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!882 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!883 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!884 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!885 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!886 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!887 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!888 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!889 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!890 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!891 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!892 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!893 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!894 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!895 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!896 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!897 = !{!898, !970, !1013, !1024, !223}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !900, line: 4575, baseType: !901)
!900 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !900, line: 4532, size: 390144, elements: !902)
!902 = !{!903, !905, !906, !907, !908, !912, !922, !926, !936, !940}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !901, file: !900, line: 4533, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !223)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !901, file: !900, line: 4534, baseType: !904, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !901, file: !900, line: 4535, baseType: !904, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !901, file: !900, line: 4536, baseType: !904, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !901, file: !900, line: 4537, baseType: !909, size: 16256, offset: 128)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 16256, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 2032)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !901, file: !900, line: 4543, baseType: !913, size: 4224, offset: 16384)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 4224, elements: !920)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !901, file: !900, line: 4538, size: 128, elements: !915)
!915 = !{!916, !917, !918, !919}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !914, file: !900, line: 4539, baseType: !904, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !914, file: !900, line: 4540, baseType: !904, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !914, file: !900, line: 4541, baseType: !904, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !914, file: !900, line: 4542, baseType: !904, size: 32, offset: 96)
!920 = !{!921}
!921 = !DISubrange(count: 33)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !901, file: !900, line: 4544, baseType: !923, size: 110464, offset: 20608)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 110464, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 13808)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !901, file: !900, line: 4550, baseType: !927, size: 24448, offset: 131072)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 24448, elements: !934)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !901, file: !900, line: 4545, size: 128, elements: !929)
!929 = !{!930, !931, !932, !933}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !928, file: !900, line: 4546, baseType: !904, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !928, file: !900, line: 4547, baseType: !904, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !928, file: !900, line: 4548, baseType: !904, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !928, file: !900, line: 4549, baseType: !904, size: 32, offset: 96)
!934 = !{!935}
!935 = !DISubrange(count: 191)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !901, file: !900, line: 4551, baseType: !937, size: 106624, offset: 155520)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 106624, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 13328)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !901, file: !900, line: 4574, baseType: !941, size: 128000, offset: 262144)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 128000, elements: !968)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !901, file: !900, line: 4552, size: 1024, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !964, !965, !966, !967}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !942, file: !900, line: 4553, baseType: !904, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !942, file: !900, line: 4554, baseType: !904, size: 32, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !942, file: !900, line: 4555, baseType: !904, size: 32, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !942, file: !900, line: 4556, baseType: !904, size: 32, offset: 96)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !942, file: !900, line: 4557, baseType: !904, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !942, file: !900, line: 4558, baseType: !904, size: 32, offset: 160)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !942, file: !900, line: 4559, baseType: !904, size: 32, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !942, file: !900, line: 4560, baseType: !904, size: 32, offset: 224)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !942, file: !900, line: 4561, baseType: !904, size: 32, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !942, file: !900, line: 4562, baseType: !904, size: 32, offset: 288)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !942, file: !900, line: 4563, baseType: !904, size: 32, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !942, file: !900, line: 4564, baseType: !904, size: 32, offset: 352)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !942, file: !900, line: 4565, baseType: !904, size: 32, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !942, file: !900, line: 4566, baseType: !904, size: 32, offset: 416)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !942, file: !900, line: 4567, baseType: !904, size: 32, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !942, file: !900, line: 4568, baseType: !904, size: 32, offset: 480)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !942, file: !900, line: 4569, baseType: !961, size: 384, offset: 512)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 384, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 48)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !942, file: !900, line: 4570, baseType: !904, size: 32, offset: 896)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !942, file: !900, line: 4571, baseType: !904, size: 32, offset: 928)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !942, file: !900, line: 4572, baseType: !904, size: 32, offset: 960)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !942, file: !900, line: 4573, baseType: !904, size: 32, offset: 992)
!968 = !{!969}
!969 = !DISubrange(count: 125)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !900, line: 38320, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !900, line: 38303, size: 23040, elements: !973)
!973 = !{!974, !976, !980, !981, !982, !983, !987, !991, !995, !999, !1003}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !972, file: !900, line: 38304, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !972, file: !900, line: 38305, baseType: !977, size: 256, offset: 32)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 256, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !972, file: !900, line: 38306, baseType: !904, size: 32, offset: 288)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !972, file: !900, line: 38307, baseType: !904, size: 32, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !972, file: !900, line: 38308, baseType: !904, size: 32, offset: 352)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !972, file: !900, line: 38309, baseType: !984, size: 3712, offset: 384)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 3712, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 464)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !972, file: !900, line: 38310, baseType: !988, size: 864, offset: 4096)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 864, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 27)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !972, file: !900, line: 38311, baseType: !992, size: 3232, offset: 4960)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 3232, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 404)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !972, file: !900, line: 38312, baseType: !996, size: 3776, offset: 8192)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 3776, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 118)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !972, file: !900, line: 38313, baseType: !1000, size: 4416, offset: 11968)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 4416, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 552)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !972, file: !900, line: 38319, baseType: !1004, size: 6656, offset: 16384)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 6656, elements: !1011)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !972, file: !900, line: 38314, size: 128, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !1005, file: !900, line: 38315, baseType: !904, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !1005, file: !900, line: 38316, baseType: !904, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !1005, file: !900, line: 38317, baseType: !904, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !1005, file: !900, line: 38318, baseType: !904, size: 32, offset: 96)
!1011 = !{!1012}
!1012 = !DISubrange(count: 52)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !900, line: 43319, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !900, line: 43313, size: 80, elements: !1016)
!1016 = !{!1017, !1019, !1020, !1022, !1023}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !1015, file: !900, line: 43314, baseType: !1018, size: 16)
!1018 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !220)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !1015, file: !900, line: 43315, baseType: !1018, size: 16, offset: 16)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !1015, file: !900, line: 43316, baseType: !1021, size: 16, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !1015, file: !900, line: 43317, baseType: !1018, size: 16, offset: 48)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !1015, file: !900, line: 43318, baseType: !1018, size: 16, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!1025 = !{!610}
!1026 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !348, line: 51, size: 64, elements: !1029)
!1029 = !{!1030, !1037}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1028, file: !348, line: 60, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!116, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !348, line: 48, flags: DIFlagFwdDecl)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1028, file: !348, line: 65, baseType: !1034, size: 32, offset: 32)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !1040, file: !1078, line: 27, type: !1103, isLocal: true, isDefinition: true)
!1040 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1041, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1042, retainedTypes: !1054, globals: !1075, splitDebugInlining: false, nameTableKind: None)
!1041 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!1042 = !{!1043, !30, !38, !44}
!1043 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !1044, line: 27, baseType: !32, size: 32, elements: !1045)
!1044 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1046 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!1047 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!1048 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!1049 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!1050 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!1051 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!1052 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!1053 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!1054 = !{!115, !1055, !116, !24, !1057, !1072, !223, !1073}
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !1056, line: 46, baseType: !236)
!1056 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 32)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !1059, line: 54, size: 96, elements: !1060)
!1059 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1060 = !{!1061, !1067, !1071}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !1058, file: !1059, line: 55, baseType: !1062, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !290, line: 33, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !290, line: 29, size: 32, elements: !1064)
!1064 = !{!1065}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1063, file: !290, line: 30, baseType: !1066, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !1058, file: !1059, line: 60, baseType: !1068, size: 32, offset: 32)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 32)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !1043}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !1058, file: !1059, line: 65, baseType: !1068, size: 32, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !1074)
!1074 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1075 = !{!1038, !1076, !1080, !1082, !1093, !1095}
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !1040, file: !1078, line: 44, type: !1079, isLocal: true, isDefinition: true)
!1078 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !272, line: 43, elements: !273)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !1040, file: !1078, line: 49, type: !1079, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !1040, file: !1078, line: 36, type: !1084, isLocal: true, isDefinition: true)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1085, size: 128, elements: !1091)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !1044, line: 114, size: 128, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1085, file: !1044, line: 115, baseType: !1043, size: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !1085, file: !1044, line: 141, baseType: !142, size: 8, offset: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !1085, file: !1044, line: 149, baseType: !223, size: 32, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !1085, file: !1044, line: 156, baseType: !223, size: 32, offset: 96)
!1091 = !{!1092}
!1092 = !DISubrange(count: 1)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !1040, file: !1078, line: 40, type: !1084, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !1040, file: !1078, line: 28, type: !1097, isLocal: true, isDefinition: true)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !290, line: 40, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !290, line: 35, size: 64, elements: !1099)
!1099 = !{!1100, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1098, file: !290, line: 36, baseType: !1101, size: 32)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1098, file: !290, line: 37, baseType: !1101, size: 32, offset: 32)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 32, elements: !1091)
!1104 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!1105 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !1108, file: !1136, line: 50, type: !1123, isLocal: true, isDefinition: true)
!1108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1109, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1110, retainedTypes: !1111, globals: !1133, splitDebugInlining: false, nameTableKind: None)
!1109 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/device_pm")
!1110 = !{!1043, !44}
!1111 = !{!151, !1055, !267, !116, !115, !223, !1073, !1112, !1072, !1123, !1124}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 32)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !1114, line: 45, size: 64, elements: !1115)
