; ModuleID = 'build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.gpio_driver_data }
%struct.gpio_driver_data = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.gpio_driver_data }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %union.anon, %struct.k_thread*, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !167, line: 27, type: !196, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !138, globals: !164, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!113 = !{!114, !125, !132, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !126, line: 53, baseType: !32, size: 32, elements: !127)
!126 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!127 = !{!128, !129, !130, !131}
!128 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!129 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!130 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!131 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !126, line: 75, baseType: !32, size: 32, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!135 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!136 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!137 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!138 = !{!102, !139, !103, !24, !143, !159, !161, !162}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !140, line: 46, baseType: !141)
!140 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !142)
!142 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !145, line: 54, size: 96, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !154, !158}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !144, file: !145, line: 55, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !149, line: 33, baseType: !150)
!149 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !149, line: 29, size: 32, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !149, line: 30, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !144, file: !145, line: 60, baseType: !155, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !114}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !144, file: !145, line: 65, baseType: !155, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !163)
!163 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!164 = !{!109, !165, !171, !173, !186, !188}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !167, line: 44, type: !168, isLocal: true, isDefinition: true)
!167 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !169, line: 43, elements: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = !{}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !167, line: 49, type: !168, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !167, line: 36, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !184)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !177)
!177 = !{!178, !179, !182, !183}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !115, line: 115, baseType: !114, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !176, file: !115, line: 141, baseType: !180, size: 8, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !181)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !176, file: !115, line: 149, baseType: !161, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !176, file: !115, line: 156, baseType: !161, size: 32, offset: 96)
!184 = !{!185}
!185 = !DISubrange(count: 1)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !167, line: 40, type: !175, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !167, line: 28, type: !190, isLocal: true, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !149, line: 40, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !149, line: 35, size: 64, elements: !192)
!192 = !{!193, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !191, file: !149, line: 36, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !191, file: !149, line: 37, baseType: !194, size: 32, offset: 32)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 32, elements: !184)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !198, line: 22, baseType: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!200 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!201 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !204, file: !236, line: 50, type: !223, isLocal: true, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !207, globals: !233, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!206 = !{!114, !30}
!207 = !{!208, !139, !210, !103, !102, !161, !162, !212, !159, !223, !224}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !209)
!209 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !211, line: 214, baseType: !32)
!211 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !214, line: 45, size: 64, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !222}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !213, file: !214, line: 46, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !149, line: 33, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !149, line: 29, size: 32, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !218, file: !149, line: 30, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !214, line: 48, baseType: !161, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !214, line: 38, size: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !225, file: !214, line: 39, baseType: !217, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !225, file: !214, line: 41, baseType: !229, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !214, line: 35, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !223}
!233 = !{!234, !238, !246, !202, !248, !258}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "latency_lock", scope: !204, file: !236, line: 44, type: !237, isLocal: true, isDefinition: true)
!236 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !169, line: 43, elements: !170)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !204, file: !236, line: 46, type: !240, isLocal: true, isDefinition: true)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !149, line: 40, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !149, line: 35, size: 64, elements: !242)
!242 = !{!243, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !241, file: !149, line: 36, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !241, file: !149, line: 37, baseType: !244, size: 32, offset: 32)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "latency_subs", scope: !204, file: !236, line: 52, type: !240, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !204, file: !236, line: 39, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, elements: !256)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 35, size: 96, elements: !252)
!252 = !{!253, !254, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !251, file: !236, line: 36, baseType: !114, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !251, file: !236, line: 37, baseType: !180, size: 8, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !251, file: !236, line: 38, baseType: !197, size: 32, offset: 64)
!256 = !{!257}
!257 = !DISubrange(count: 0)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !204, file: !236, line: 48, type: !223, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !262, file: !269, line: 47, type: !283, isLocal: true, isDefinition: true)
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !263, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !264, retainedTypes: !265, globals: !266, splitDebugInlining: false, nameTableKind: None)
!263 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!264 = !{!114}
!265 = !{!210, !103}
!266 = !{!267, !260, !279}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "cpus_states", scope: !262, file: !269, line: 50, type: !270, isLocal: true, isDefinition: true)
!269 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 32, elements: !184)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !274)
!274 = !{!275, !276, !277, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !273, file: !115, line: 115, baseType: !114, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !273, file: !115, line: 141, baseType: !180, size: 8, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !273, file: !115, line: 149, baseType: !161, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !273, file: !115, line: 156, baseType: !161, size: 32, offset: 96)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !262, file: !269, line: 55, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 8, elements: !184)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, elements: !256)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "static_regions", scope: !286, file: !293, line: 62, type: !426, isLocal: true, isDefinition: true)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !288, globals: !289, splitDebugInlining: false, nameTableKind: None)
!287 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!288 = !{!210, !103, !161, !102}
!289 = !{!290, !284}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !292, file: !293, line: 198, type: !414, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !293, file: !293, line: 175, type: !294, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !286, retainedNodes: !411)
!293 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !298, line: 245, size: 1024, elements: !299)
!298 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !{!300, !367, !380, !381, !382, !383, !389, !406}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !297, file: !298, line: 247, baseType: !301, size: 384)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !298, line: 57, size: 384, elements: !302)
!302 = !{!303, !331, !339, !340, !341, !354, !355, !356}
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !298, line: 60, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !298, line: 60, size: 64, elements: !305)
!305 = !{!306, !322}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !304, file: !298, line: 61, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !308, line: 49, baseType: !309)
!308 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !308, line: 37, size: 64, elements: !310)
!310 = !{!311, !317}
!311 = !DIDerivedType(tag: DW_TAG_member, scope: !309, file: !308, line: 38, baseType: !312, size: 32)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !308, line: 38, size: 32, elements: !313)
!313 = !{!314, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !312, file: !308, line: 39, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !308, line: 40, baseType: !315, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, scope: !309, file: !308, line: 42, baseType: !318, size: 32, offset: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !308, line: 42, size: 32, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !318, file: !308, line: 43, baseType: !315, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !308, line: 44, baseType: !315, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !304, file: !298, line: 62, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !324, line: 49, size: 64, elements: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !323, file: !324, line: 50, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, elements: !329)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!329 = !{!330}
!330 = !DISubrange(count: 2)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !301, file: !298, line: 68, baseType: !332, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !334, line: 233, baseType: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 231, size: 64, elements: !336)
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !335, file: !334, line: 232, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !308, line: 48, baseType: !309)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !301, file: !298, line: 71, baseType: !180, size: 8, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !301, file: !298, line: 74, baseType: !180, size: 8, offset: 104)
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !298, line: 90, baseType: !342, size: 16, offset: 112)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !298, line: 90, size: 16, elements: !343)
!343 = !{!344, !351}
!344 = !DIDerivedType(tag: DW_TAG_member, scope: !342, file: !298, line: 91, baseType: !345, size: 16)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !342, file: !298, line: 91, size: 16, elements: !346)
!346 = !{!347, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !345, file: !298, line: 96, baseType: !348, size: 8)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !349)
!349 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !345, file: !298, line: 97, baseType: !180, size: 8, offset: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !342, file: !298, line: 100, baseType: !352, size: 16)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !353)
!353 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !301, file: !298, line: 107, baseType: !161, size: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !301, file: !298, line: 127, baseType: !102, size: 32, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !301, file: !298, line: 131, baseType: !357, size: 192, offset: 192)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !334, line: 244, size: 192, elements: !358)
!358 = !{!359, !360, !366}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !357, file: !334, line: 245, baseType: !307, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !357, file: !334, line: 246, baseType: !361, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !334, line: 242, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !357, file: !334, line: 249, baseType: !141, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !297, file: !298, line: 250, baseType: !368, size: 288, offset: 384)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !369, line: 25, size: 288, elements: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !368, file: !369, line: 26, baseType: !161, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !368, file: !369, line: 27, baseType: !161, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !368, file: !369, line: 28, baseType: !161, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !368, file: !369, line: 29, baseType: !161, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !368, file: !369, line: 30, baseType: !161, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !368, file: !369, line: 31, baseType: !161, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !368, file: !369, line: 32, baseType: !161, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !368, file: !369, line: 33, baseType: !161, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !368, file: !369, line: 34, baseType: !161, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !297, file: !298, line: 253, baseType: !102, size: 32, offset: 672)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !297, file: !298, line: 256, baseType: !333, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !297, file: !298, line: 294, baseType: !103, size: 32, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !297, file: !298, line: 300, baseType: !384, size: 96, offset: 800)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !298, line: 149, size: 96, elements: !385)
!385 = !{!386, !387, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !384, file: !298, line: 153, baseType: !22, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !384, file: !298, line: 162, baseType: !210, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !384, file: !298, line: 168, baseType: !210, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !297, file: !298, line: 325, baseType: !390, size: 32, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !392, line: 5073, size: 160, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394, !403, !404}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !391, file: !392, line: 5074, baseType: !395, size: 96)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !396, line: 56, size: 96, elements: !397)
!396 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!397 = !{!398, !401, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !395, file: !396, line: 57, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !396, line: 57, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !395, file: !396, line: 58, baseType: !102, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !395, file: !396, line: 59, baseType: !210, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !391, file: !392, line: 5075, baseType: !333, size: 64, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !391, file: !392, line: 5076, baseType: !405, offset: 160)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !169, line: 43, elements: !170)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !297, file: !298, line: 343, baseType: !407, size: 64, offset: 928)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !369, line: 60, size: 64, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !407, file: !369, line: 63, baseType: !161, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !407, file: !369, line: 66, baseType: !161, size: 32, offset: 32)
!411 = !{!412, !413}
!412 = !DILocalVariable(name: "thread", arg: 1, scope: !292, file: !293, line: 175, type: !296)
!413 = !DILocalVariable(name: "region_num", scope: !292, file: !293, line: 200, type: !180)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, elements: !256)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !416, line: 52, size: 96, elements: !417)
!416 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !415, file: !416, line: 53, baseType: !22, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !415, file: !416, line: 54, baseType: !210, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !415, file: !416, line: 55, baseType: !421, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !422, line: 151, baseType: !423)
!422 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 149, size: 32, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !423, file: !422, line: 150, baseType: !161, size: 32)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 96, elements: !184)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !430, file: !466, line: 39, type: !180, isLocal: true, isDefinition: true)
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !432, globals: !465, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!432 = !{!433, !102, !103, !451, !180}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !435, line: 1226, baseType: !436)
!435 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 1213, size: 352, elements: !437)
!437 = !{!438, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !436, file: !435, line: 1215, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !436, file: !435, line: 1216, baseType: !440, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !436, file: !435, line: 1217, baseType: !440, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !436, file: !435, line: 1218, baseType: !440, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !436, file: !435, line: 1219, baseType: !440, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !436, file: !435, line: 1220, baseType: !440, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !436, file: !435, line: 1221, baseType: !440, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !436, file: !435, line: 1222, baseType: !440, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !436, file: !435, line: 1223, baseType: !440, size: 32, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !436, file: !435, line: 1224, baseType: !440, size: 32, offset: 288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !436, file: !435, line: 1225, baseType: !440, size: 32, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !454, line: 27, size: 96, elements: !455)
!454 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!455 = !{!456, !457, !460}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !453, file: !454, line: 29, baseType: !161, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !453, file: !454, line: 31, baseType: !458, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !453, file: !454, line: 37, baseType: !461, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !422, line: 146, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !422, line: 141, size: 32, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !462, file: !422, line: 143, baseType: !161, size: 32)
!465 = !{!428}
!466 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !469, file: !476, line: 21, type: !106, isLocal: true, isDefinition: true)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !471, globals: !475, splitDebugInlining: false, nameTableKind: None)
!470 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!471 = !{!472, !103, !102}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !474, line: 22, baseType: !103)
!474 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!475 = !{!467}
!476 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !479, file: !484, line: 13, type: !501, isLocal: true, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !481, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!481 = !{!482, !477}
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "mpu_config", scope: !479, file: !484, line: 37, type: !485, isLocal: false, isDefinition: true)
!484 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !454, line: 41, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !486, file: !454, line: 43, baseType: !161, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !486, file: !454, line: 45, baseType: !490, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !454, line: 27, size: 96, elements: !493)
!493 = !{!494, !495, !496}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !492, file: !454, line: 29, baseType: !161, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !492, file: !454, line: 31, baseType: !458, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !492, file: !454, line: 37, baseType: !497, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !422, line: 146, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !422, line: 141, size: 32, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !498, file: !422, line: 143, baseType: !161, size: 32)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 192, elements: !329)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !504, file: !674, line: 93, type: !675, isLocal: true, isDefinition: true, align: 32)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !506, globals: !669, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!506 = !{!507, !180, !102, !103, !587, !161, !588, !624, !635}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !509, line: 1071, baseType: !510)
!509 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 1035, size: 19584, elements: !511)
!511 = !{!512, !516, !517, !518, !522, !523, !525, !526, !527, !528, !529, !530, !534, !535, !536, !540, !541, !545, !546, !550, !551, !555, !556, !557, !558, !559, !560, !561, !565, !566, !567, !568, !572, !573, !577}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !510, file: !509, line: 1036, baseType: !513, size: 960)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 960, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 30)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !510, file: !509, line: 1037, baseType: !440, size: 32, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !510, file: !509, line: 1038, baseType: !440, size: 32, offset: 992)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !510, file: !509, line: 1039, baseType: !519, size: 1088, offset: 1024)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1088, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 34)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !510, file: !509, line: 1040, baseType: !440, size: 32, offset: 2112)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !510, file: !509, line: 1041, baseType: !524, size: 64, offset: 2144)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 64, elements: !329)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !510, file: !509, line: 1042, baseType: !440, size: 32, offset: 2208)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !510, file: !509, line: 1043, baseType: !440, size: 32, offset: 2240)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !510, file: !509, line: 1044, baseType: !440, size: 32, offset: 2272)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !510, file: !509, line: 1045, baseType: !440, size: 32, offset: 2304)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !510, file: !509, line: 1046, baseType: !440, size: 32, offset: 2336)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !510, file: !509, line: 1047, baseType: !531, size: 3808, offset: 2368)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 3808, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 119)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !510, file: !509, line: 1048, baseType: !440, size: 32, offset: 6176)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !510, file: !509, line: 1049, baseType: !440, size: 32, offset: 6208)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !510, file: !509, line: 1050, baseType: !537, size: 1952, offset: 6240)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1952, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 61)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !510, file: !509, line: 1051, baseType: !440, size: 32, offset: 8192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !510, file: !509, line: 1052, baseType: !542, size: 288, offset: 8224)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 288, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 9)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !510, file: !509, line: 1053, baseType: !439, size: 32, offset: 8512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !510, file: !509, line: 1054, baseType: !547, size: 96, offset: 8544)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 96, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 3)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !510, file: !509, line: 1055, baseType: !439, size: 32, offset: 8640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !510, file: !509, line: 1056, baseType: !552, size: 1568, offset: 8672)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1568, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 49)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !510, file: !509, line: 1057, baseType: !440, size: 32, offset: 10240)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !510, file: !509, line: 1058, baseType: !547, size: 96, offset: 10272)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !510, file: !509, line: 1059, baseType: !440, size: 32, offset: 10368)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !510, file: !509, line: 1060, baseType: !524, size: 64, offset: 10400)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !510, file: !509, line: 1061, baseType: !440, size: 32, offset: 10464)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !510, file: !509, line: 1062, baseType: !440, size: 32, offset: 10496)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !510, file: !509, line: 1063, baseType: !562, size: 672, offset: 10528)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 672, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 21)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !510, file: !509, line: 1064, baseType: !440, size: 32, offset: 11200)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !510, file: !509, line: 1065, baseType: !439, size: 32, offset: 11232)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !510, file: !509, line: 1066, baseType: !440, size: 32, offset: 11264)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !510, file: !509, line: 1067, baseType: !569, size: 1504, offset: 11296)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1504, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 47)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !510, file: !509, line: 1068, baseType: !439, size: 32, offset: 12800)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !510, file: !509, line: 1069, baseType: !574, size: 5600, offset: 12832)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 5600, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 175)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !510, file: !509, line: 1070, baseType: !578, size: 1152, offset: 18432)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 1152, elements: !543)
!579 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !509, line: 278, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 272, size: 128, elements: !582)
!582 = !{!583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !581, file: !509, line: 273, baseType: !440, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !581, file: !509, line: 274, baseType: !440, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !581, file: !509, line: 275, baseType: !440, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !581, file: !509, line: 277, baseType: !439, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !435, line: 468, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 445, size: 1120, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !617, !621, !623}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !590, file: !435, line: 447, baseType: !439, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !590, file: !435, line: 448, baseType: !440, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !590, file: !435, line: 449, baseType: !440, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !590, file: !435, line: 450, baseType: !440, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !590, file: !435, line: 451, baseType: !440, size: 32, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !590, file: !435, line: 452, baseType: !440, size: 32, offset: 160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !590, file: !435, line: 453, baseType: !599, size: 96, offset: 192)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 96, elements: !601)
!600 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !180)
!601 = !{!602}
!602 = !DISubrange(count: 12)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !590, file: !435, line: 454, baseType: !440, size: 32, offset: 288)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !590, file: !435, line: 455, baseType: !440, size: 32, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !590, file: !435, line: 456, baseType: !440, size: 32, offset: 352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !590, file: !435, line: 457, baseType: !440, size: 32, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !590, file: !435, line: 458, baseType: !440, size: 32, offset: 416)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !590, file: !435, line: 459, baseType: !440, size: 32, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !590, file: !435, line: 460, baseType: !440, size: 32, offset: 480)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !590, file: !435, line: 461, baseType: !524, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !590, file: !435, line: 462, baseType: !439, size: 32, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !590, file: !435, line: 463, baseType: !439, size: 32, offset: 608)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !590, file: !435, line: 464, baseType: !614, size: 128, offset: 640)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 128, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 4)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !590, file: !435, line: 465, baseType: !618, size: 160, offset: 768)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 160, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 5)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !590, file: !435, line: 466, baseType: !622, size: 160, offset: 928)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 160, elements: !619)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !590, file: !435, line: 467, baseType: !440, size: 32, offset: 1088)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !626, file: !625, line: 167, baseType: !634)
!625 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!626 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !625, file: !625, line: 134, type: !627, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !504, retainedNodes: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !161}
!629 = !{!630, !631, !633}
!630 = !DILocalVariable(name: "time_us", arg: 1, scope: !626, file: !625, line: 134, type: !161)
!631 = !DILocalVariable(name: "delay_cycles", scope: !626, file: !625, line: 168, type: !632)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!633 = !DILocalVariable(name: "cycles", scope: !626, file: !625, line: 171, type: !161)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !509, line: 2399, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 2373, size: 10880, elements: !638)
!638 = !{!639, !643, !644, !645, !646, !650, !651, !656, !657, !658, !659, !660, !661, !665, !666, !667, !668}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !637, file: !509, line: 2374, baseType: !640, size: 8192)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 8192, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !637, file: !509, line: 2375, baseType: !439, size: 32, offset: 8192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !637, file: !509, line: 2376, baseType: !439, size: 32, offset: 8224)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !637, file: !509, line: 2377, baseType: !439, size: 32, offset: 8256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !637, file: !509, line: 2378, baseType: !647, size: 1984, offset: 8288)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1984, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 62)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !637, file: !509, line: 2379, baseType: !440, size: 32, offset: 10272)
!651 = !DIDerivedType(tag: DW_TAG_member, scope: !637, file: !509, line: 2381, baseType: !652, size: 32, offset: 10304)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !637, file: !509, line: 2381, size: 32, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !652, file: !509, line: 2382, baseType: !440, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !652, file: !509, line: 2383, baseType: !440, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !637, file: !509, line: 2386, baseType: !440, size: 32, offset: 10336)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !637, file: !509, line: 2387, baseType: !440, size: 32, offset: 10368)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !637, file: !509, line: 2389, baseType: !440, size: 32, offset: 10400)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !637, file: !509, line: 2391, baseType: !440, size: 32, offset: 10432)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !637, file: !509, line: 2393, baseType: !440, size: 32, offset: 10464)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !637, file: !509, line: 2394, baseType: !662, size: 256, offset: 10496)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 256, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 8)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !637, file: !509, line: 2395, baseType: !440, size: 32, offset: 10752)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !637, file: !509, line: 2396, baseType: !439, size: 32, offset: 10784)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !637, file: !509, line: 2397, baseType: !440, size: 32, offset: 10816)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !637, file: !509, line: 2398, baseType: !440, size: 32, offset: 10848)
!669 = !{!502, !670}
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !626, file: !625, line: 161, type: !672, isLocal: true, isDefinition: true, align: 128)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 48, elements: !548)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!674 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !677, line: 51, size: 64, elements: !678)
!677 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!678 = !{!679, !686}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !676, file: !677, line: 60, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DISubroutineType(types: !682)
!682 = !{!103, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !677, line: 48, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !676, file: !677, line: 65, baseType: !683, size: 32, offset: 32)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !689, file: !925, line: 733, type: !1029, isLocal: false, isDefinition: true, align: 32)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !691, retainedTypes: !834, globals: !921, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/power_mgmt/blinky")
!691 = !{!692, !698, !30, !703, !708, !715, !723, !731, !740, !744, !799, !806, !825}
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !693, line: 23, baseType: !32, size: 32, elements: !694)
!693 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !{!695, !696, !697}
!695 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!696 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!697 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !693, line: 48, baseType: !32, size: 32, elements: !699)
!699 = !{!700, !701, !702}
!700 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!701 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!702 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !704, line: 167, baseType: !32, size: 32, elements: !705)
!704 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = !{!706, !707}
!706 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!707 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !704, line: 107, baseType: !32, size: 32, elements: !709)
!709 = !{!710, !711, !712, !713, !714}
!710 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!711 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!712 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!713 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!714 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !704, line: 208, baseType: !32, size: 32, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722}
!717 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!718 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!719 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!720 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!721 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!722 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !704, line: 261, baseType: !32, size: 32, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730}
!725 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!726 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!727 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!728 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!729 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!730 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !704, line: 237, baseType: !32, size: 32, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739}
!733 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!734 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!735 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!736 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!737 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!738 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!739 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!740 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !704, line: 152, baseType: !32, size: 32, elements: !741)
!741 = !{!742, !743}
!742 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!743 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 71, baseType: !103, size: 32, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!746 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!747 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!748 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!749 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!750 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!751 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!752 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!753 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!754 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!755 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!756 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!757 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!758 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!759 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!760 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!761 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!762 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!763 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!764 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!765 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!766 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!767 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!768 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!769 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!770 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!771 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!772 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!773 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!774 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!775 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!776 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!777 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!778 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!779 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!780 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!781 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!782 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!783 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!784 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!785 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!786 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!787 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!788 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!789 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!790 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!791 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!792 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!793 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!794 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!795 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!796 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!797 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!798 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!799 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !800, line: 44, baseType: !32, size: 32, elements: !801)
!800 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!801 = !{!802, !803, !804, !805}
!802 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!803 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!804 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!805 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!806 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !807, line: 54, baseType: !32, size: 32, elements: !808)
!807 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!809 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!810 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!811 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!812 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!813 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!814 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!815 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!816 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!817 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!818 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!819 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!820 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!821 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!822 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!823 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!824 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!825 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !826, line: 53, baseType: !32, size: 32, elements: !827)
!826 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = !{!828, !829, !830, !831, !832, !833}
!828 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!829 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!830 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!831 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!832 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!833 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!834 = !{!692, !102, !103, !835, !884, !885, !886, !887, !139, !161, !162, !888, !587, !889, !223, !890, !920, !210}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !509, line: 1022, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 979, size: 11712, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !850, !851, !852, !853, !854, !855, !856, !857, !858, !862, !863, !864, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !837, file: !509, line: 980, baseType: !440, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !837, file: !509, line: 981, baseType: !440, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !837, file: !509, line: 982, baseType: !440, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !837, file: !509, line: 983, baseType: !440, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !837, file: !509, line: 984, baseType: !440, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !837, file: !509, line: 985, baseType: !440, size: 32, offset: 160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !837, file: !509, line: 986, baseType: !440, size: 32, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !837, file: !509, line: 987, baseType: !847, size: 1824, offset: 224)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1824, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 57)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !837, file: !509, line: 988, baseType: !440, size: 32, offset: 2048)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !837, file: !509, line: 989, baseType: !440, size: 32, offset: 2080)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !837, file: !509, line: 990, baseType: !439, size: 32, offset: 2112)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !837, file: !509, line: 991, baseType: !440, size: 32, offset: 2144)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !837, file: !509, line: 992, baseType: !440, size: 32, offset: 2176)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !837, file: !509, line: 993, baseType: !618, size: 160, offset: 2208)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !837, file: !509, line: 994, baseType: !440, size: 32, offset: 2368)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !837, file: !509, line: 996, baseType: !440, size: 32, offset: 2400)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !837, file: !509, line: 998, baseType: !859, size: 3744, offset: 2432)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 3744, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 117)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !837, file: !509, line: 999, baseType: !440, size: 32, offset: 6176)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !837, file: !509, line: 1000, baseType: !440, size: 32, offset: 6208)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !837, file: !509, line: 1001, baseType: !865, size: 2016, offset: 6240)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 2016, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 63)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !837, file: !509, line: 1002, baseType: !439, size: 32, offset: 8256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !837, file: !509, line: 1004, baseType: !439, size: 32, offset: 8288)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !837, file: !509, line: 1005, baseType: !439, size: 32, offset: 8320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !837, file: !509, line: 1006, baseType: !439, size: 32, offset: 8352)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !837, file: !509, line: 1008, baseType: !439, size: 32, offset: 8384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !837, file: !509, line: 1009, baseType: !439, size: 32, offset: 8416)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !837, file: !509, line: 1011, baseType: !647, size: 1984, offset: 8448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !837, file: !509, line: 1012, baseType: !440, size: 32, offset: 10432)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !837, file: !509, line: 1013, baseType: !547, size: 96, offset: 10464)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !837, file: !509, line: 1014, baseType: !440, size: 32, offset: 10560)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !837, file: !509, line: 1016, baseType: !547, size: 96, offset: 10592)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !837, file: !509, line: 1017, baseType: !440, size: 32, offset: 10688)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !837, file: !509, line: 1018, baseType: !662, size: 256, offset: 10720)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !837, file: !509, line: 1019, baseType: !440, size: 32, offset: 10976)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !837, file: !509, line: 1020, baseType: !562, size: 672, offset: 11008)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !837, file: !509, line: 1021, baseType: !440, size: 32, offset: 11680)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !704, line: 146, baseType: !708)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !704, line: 164, baseType: !740)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!888 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !435, line: 426, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 411, size: 28704, elements: !893)
!893 = !{!894, !896, !900, !901, !902, !903, !904, !905, !906, !907, !911, !915, !919}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !892, file: !435, line: 413, baseType: !895, size: 256)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 256, elements: !663)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !892, file: !435, line: 414, baseType: !897, size: 768, offset: 256)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 768, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 24)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !892, file: !435, line: 415, baseType: !895, size: 256, offset: 1024)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !892, file: !435, line: 416, baseType: !897, size: 768, offset: 1280)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !892, file: !435, line: 417, baseType: !895, size: 256, offset: 2048)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !892, file: !435, line: 418, baseType: !897, size: 768, offset: 2304)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !892, file: !435, line: 419, baseType: !895, size: 256, offset: 3072)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !892, file: !435, line: 420, baseType: !897, size: 768, offset: 3328)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !892, file: !435, line: 421, baseType: !895, size: 256, offset: 4096)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !892, file: !435, line: 422, baseType: !908, size: 1792, offset: 4352)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1792, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 56)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !892, file: !435, line: 423, baseType: !912, size: 1920, offset: 6144)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 1920, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 240)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !892, file: !435, line: 424, baseType: !916, size: 20608, offset: 8064)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 20608, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 644)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !892, file: !435, line: 425, baseType: !440, size: 32, offset: 28672)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !800, line: 56, baseType: !102)
!921 = !{!922, !972, !1013, !687, !1019, !1048, !1050, !1067, !1069, !1079, !1082, !1097, !1135, !1149}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "on", scope: !924, file: !925, line: 549, type: !197, isLocal: true, isDefinition: true)
!924 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !925, file: !925, line: 547, type: !926, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !928)
!925 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = !DISubroutineType(types: !927)
!927 = !{null, !698}
!928 = !{!929, !930, !933}
!929 = !DILocalVariable(name: "start_mode", arg: 1, scope: !924, file: !925, line: 547, type: !698)
!930 = !DILocalVariable(name: "err", scope: !931, file: !925, line: 553, type: !103)
!931 = distinct !DILexicalBlock(scope: !932, file: !925, line: 552, column: 31)
!932 = distinct !DILexicalBlock(scope: !924, file: !925, line: 552, column: 6)
!933 = !DILocalVariable(name: "mgr", scope: !931, file: !925, line: 554, type: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !936, line: 154, size: 224, elements: !937)
!936 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!937 = !{!938, !950, !951, !967, !969, !970, !971}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !935, file: !936, line: 158, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !149, line: 40, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !149, line: 35, size: 64, elements: !941)
!941 = !{!942, !949}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !940, file: !149, line: 36, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !149, line: 33, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !149, line: 29, size: 32, elements: !946)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !945, file: !149, line: 30, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !940, file: !149, line: 37, baseType: !943, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !935, file: !936, line: 163, baseType: !939, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !935, file: !936, line: 166, baseType: !952, size: 32, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !936, line: 133, size: 96, elements: !955)
!955 = !{!956, !965, !966}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !954, file: !936, line: 135, baseType: !957, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !936, line: 129, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !934, !961}
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !936, line: 101, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !934, !103}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !954, file: !936, line: 138, baseType: !957, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !954, file: !936, line: 143, baseType: !957, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !935, file: !936, line: 169, baseType: !968, offset: 160)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !169, line: 43, elements: !170)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !935, file: !936, line: 172, baseType: !103, size: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !935, file: !936, line: 175, baseType: !352, size: 16, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !935, file: !936, line: 178, baseType: !352, size: 16, offset: 208)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "cli", scope: !924, file: !925, line: 550, type: !974, isLocal: true, isDefinition: true)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !936, line: 273, size: 128, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !974, file: !936, line: 280, baseType: !944, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !974, file: !936, line: 283, baseType: !978, size: 96, offset: 32)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !979, line: 138, size: 96, elements: !980)
!979 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!980 = !{!981, !1010, !1011}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !978, file: !979, line: 149, baseType: !982, size: 32)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !979, line: 139, size: 32, elements: !983)
!983 = !{!984, !1005}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !982, file: !979, line: 145, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !392, line: 5397, size: 128, elements: !987)
!987 = !{!988, !1003, !1004}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !986, file: !392, line: 5399, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !308, line: 48, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !308, line: 37, size: 64, elements: !991)
!991 = !{!992, !998}
!992 = !DIDerivedType(tag: DW_TAG_member, scope: !990, file: !308, line: 38, baseType: !993, size: 32)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !990, file: !308, line: 38, size: 32, elements: !994)
!994 = !{!995, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !993, file: !308, line: 39, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !993, file: !308, line: 40, baseType: !996, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, scope: !990, file: !308, line: 42, baseType: !999, size: 32, offset: 32)
!999 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !990, file: !308, line: 42, size: 32, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !999, file: !308, line: 43, baseType: !996, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !999, file: !308, line: 44, baseType: !996, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !986, file: !392, line: 5405, baseType: !32, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !986, file: !392, line: 5408, baseType: !103, size: 32, offset: 96)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !982, file: !979, line: 148, baseType: !1006, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !979, line: 98, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, null}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !978, file: !979, line: 165, baseType: !440, size: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !978, file: !979, line: 174, baseType: !1012, size: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_38", scope: !689, file: !925, line: 733, type: !1015, isLocal: false, isDefinition: true, align: 16)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 80, elements: !619)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !1018, line: 43, baseType: !208)
!1018 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_38", scope: !689, file: !925, line: 733, type: !1021, isLocal: true, isDefinition: true, align: 32)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !677, line: 51, size: 64, elements: !1023)
!1023 = !{!1024, !1047}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1022, file: !677, line: 60, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!103, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !1018, line: 378, size: 224, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1041, !1042, !1044}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1030, file: !1018, line: 380, baseType: !458, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1030, file: !1018, line: 382, baseType: !13, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1030, file: !1018, line: 384, baseType: !13, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1030, file: !1018, line: 386, baseType: !1036, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !1018, line: 351, size: 16, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1037, file: !1018, line: 359, baseType: !180, size: 8)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1037, file: !1018, line: 364, baseType: !888, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1030, file: !1018, line: 388, baseType: !102, size: 32, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1030, file: !1018, line: 396, baseType: !1043, size: 32, offset: 160)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !1030, file: !1018, line: 403, baseType: !1045, size: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !1018, line: 367, flags: DIFlagFwdDecl)
