; ModuleID = 'build/adafruit_feather_m0_lora/drivers/led_lp5562/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.18 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.19 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.18*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/drivers/led_lp5562/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/drivers/led_lp5562")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/drivers/led_lp5562")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !230, line: 15, type: !232, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !227, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/led_lp5562/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/drivers/led_lp5562")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_driver_api", file: !157, line: 113, size: 224, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/drivers/led.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159, !189, !191, !196, !212, !217, !222}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !156, file: !157, line: 115, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_on", file: !157, line: 89, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!123, !164, !135}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = !{!169, !173, !174, !175, !182, !183}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !167, line: 380, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !166, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !166, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !166, file: !167, line: 386, baseType: !176, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !177, file: !167, line: 359, baseType: !117, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !177, file: !167, line: 364, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!181 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 388, baseType: !108, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !166, file: !167, line: 396, baseType: !184, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !167, line: 43, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !188)
!188 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !156, file: !157, line: 116, baseType: !190, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_off", file: !157, line: 97, baseType: !161)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !156, file: !157, line: 118, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_blink", file: !157, line: 54, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!123, !164, !135, !135, !135}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !156, file: !157, line: 119, baseType: !197, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_get_info", file: !157, line: 63, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!123, !164, !135, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_info", file: !157, line: 41, size: 128, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !204, file: !157, line: 42, baseType: !170, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !204, file: !157, line: 43, baseType: !135, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_colors", scope: !204, file: !157, line: 44, baseType: !117, size: 8, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "color_mapping", scope: !204, file: !157, line: 45, baseType: !210, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "set_brightness", scope: !156, file: !157, line: 120, baseType: !213, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_brightness", file: !157, line: 72, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{!123, !164, !135, !117}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "set_color", scope: !156, file: !157, line: 121, baseType: !218, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_color", file: !157, line: 80, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{!123, !164, !135, !117, !210}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "write_channels", scope: !156, file: !157, line: 122, baseType: !223, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_write_channels", file: !157, line: 105, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{!123, !164, !135, !135, !210}
!227 = !{!25, !228}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !230, line: 15, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/samples/drivers/led_lp5562/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 17, baseType: !170, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !233, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !240, file: !296, line: 18, type: !298, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, globals: !293, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/drivers/led_lp5562")
!242 = !{!30}
!243 = !{!22, !108, !24, !244, !246, !248, !249, !123, !251, !252, !254, !256, !257, !258, !259, !261, !124, !117, !272, !135, !170}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 214, baseType: !32)
!250 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !260)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !263)
!263 = !{!264, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !262, file: !111, line: 80, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !111, line: 47, baseType: !117, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !265, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !265, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !265, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !262, file: !111, line: 82, baseType: !108, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !274)
!274 = !{!275, !291, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !273, file: !31, line: 89, baseType: !276, size: 96)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !277)
!277 = !{!278, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !276, file: !31, line: 67, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !279, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !279, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !279, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !279, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !279, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !279, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !276, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !276, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !273, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !31, line: 94, baseType: !151, offset: 128)
!293 = !{!238, !294}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !240, file: !296, line: 18, type: !297, isLocal: true, isDefinition: true)
!296 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !234, line: 17, baseType: !170, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !299, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "_char_out", scope: !305, file: !310, line: 54, type: !311, isLocal: false, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !308, globals: !309, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/drivers/led_lp5562")
!307 = !{!37}
!308 = !{!108, !123}
!309 = !{!303}
!310 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !123}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !316, file: !1050, line: 202, type: !1051, isLocal: true, isDefinition: true, align: 32)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !318, globals: !1049, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/drivers/led_lp5562")
!318 = !{!108, !123, !319, !443, !780, !781, !848}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !321, line: 335, baseType: !322)
!321 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 320, size: 288, elements: !323)
!323 = !{!324, !335, !343, !357, !368, !379, !383, !394, !395, !406, !407, !422, !423, !433}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !322, file: !321, line: 321, baseType: !325, size: 16)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !321, line: 50, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 43, size: 16, elements: !328)
!328 = !{!329, !334}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !327, file: !321, line: 48, baseType: !330, size: 16)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !321, line: 44, size: 16, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !330, file: !321, line: 45, baseType: !259, size: 7, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !330, file: !321, line: 47, baseType: !259, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !327, file: !321, line: 49, baseType: !259, size: 16)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !322, file: !321, line: 322, baseType: !336, size: 16, offset: 16)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 16, elements: !341)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !338, line: 52, baseType: !339)
!338 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!341 = !{!342}
!342 = !DISubrange(count: 2)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !322, file: !321, line: 323, baseType: !344, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !321, line: 107, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 94, size: 32, elements: !347)
!347 = !{!348, !356}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !346, file: !321, line: 105, baseType: !349, size: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !346, file: !321, line: 95, size: 32, elements: !350)
!350 = !{!351, !352, !353, !354, !355}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !349, file: !321, line: 97, baseType: !135, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !349, file: !321, line: 99, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !349, file: !321, line: 100, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !349, file: !321, line: 102, baseType: !135, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !349, file: !321, line: 103, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !346, file: !321, line: 106, baseType: !135, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !322, file: !321, line: 324, baseType: !358, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !321, line: 155, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 148, size: 32, elements: !361)
!361 = !{!362, !367}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !360, file: !321, line: 153, baseType: !363, size: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !321, line: 149, size: 32, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !363, file: !321, line: 150, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !363, file: !321, line: 151, baseType: !135, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !360, file: !321, line: 154, baseType: !135, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !322, file: !321, line: 325, baseType: !369, size: 8, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !321, line: 194, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 187, size: 8, elements: !372)
!372 = !{!373, !378}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !371, file: !321, line: 192, baseType: !374, size: 8)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !321, line: 188, size: 8, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !374, file: !321, line: 189, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !374, file: !321, line: 190, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !371, file: !321, line: 193, baseType: !117, size: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !322, file: !321, line: 326, baseType: !380, size: 24, offset: 104)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 24, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 3)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !322, file: !321, line: 327, baseType: !384, size: 8, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !321, line: 215, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 208, size: 8, elements: !387)
!387 = !{!388, !393}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !386, file: !321, line: 213, baseType: !389, size: 8)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !321, line: 209, size: 8, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !389, file: !321, line: 210, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !389, file: !321, line: 211, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !386, file: !321, line: 214, baseType: !117, size: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !322, file: !321, line: 328, baseType: !380, size: 24, offset: 136)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !322, file: !321, line: 329, baseType: !396, size: 8, offset: 160)
!396 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !321, line: 236, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 229, size: 8, elements: !399)
!399 = !{!400, !405}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !398, file: !321, line: 234, baseType: !401, size: 8)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !398, file: !321, line: 230, size: 8, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !401, file: !321, line: 231, baseType: !339, size: 1, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !401, file: !321, line: 232, baseType: !339, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !398, file: !321, line: 235, baseType: !117, size: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !322, file: !321, line: 330, baseType: !380, size: 24, offset: 168)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !322, file: !321, line: 331, baseType: !408, size: 16, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !321, line: 262, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 250, size: 16, elements: !411)
!411 = !{!412, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !410, file: !321, line: 260, baseType: !413, size: 16)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !321, line: 251, size: 16, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !413, file: !321, line: 252, baseType: !259, size: 1, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !413, file: !321, line: 253, baseType: !259, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !413, file: !321, line: 254, baseType: !259, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !413, file: !321, line: 255, baseType: !259, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !413, file: !321, line: 256, baseType: !259, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !413, file: !321, line: 258, baseType: !259, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !410, file: !321, line: 261, baseType: !259, size: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !322, file: !321, line: 332, baseType: !336, size: 16, offset: 208)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !322, file: !321, line: 333, baseType: !424, size: 32, offset: 224)
!424 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !321, line: 290, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 284, size: 32, elements: !427)
!427 = !{!428, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !426, file: !321, line: 288, baseType: !429, size: 32)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !426, file: !321, line: 285, size: 32, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !429, file: !321, line: 286, baseType: !135, size: 22, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !426, file: !321, line: 289, baseType: !135, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !322, file: !321, line: 334, baseType: !434, size: 16, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !321, line: 308, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 303, size: 16, elements: !437)
!437 = !{!438, !442}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !436, file: !321, line: 306, baseType: !439, size: 16)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !321, line: 304, size: 16, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !439, file: !321, line: 305, baseType: !259, size: 16, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !436, file: !321, line: 307, baseType: !259, size: 16)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !445, line: 928, baseType: !446)
!445 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 899, size: 672, elements: !447)
!447 = !{!448, !472, !496, !522, !547, !563, !564, !582, !583, !600, !611, !612, !627, !647, !648, !660, !672, !682, !683, !700, !702, !713, !714, !726, !738, !739, !750, !766}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !446, file: !445, line: 900, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !445, line: 64, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 43, size: 32, elements: !452)
!452 = !{!453, !471}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !451, file: !445, line: 62, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !451, file: !445, line: 44, size: 32, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !454, file: !445, line: 45, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !454, file: !445, line: 46, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !454, file: !445, line: 47, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !454, file: !445, line: 48, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !454, file: !445, line: 49, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !454, file: !445, line: 50, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !454, file: !445, line: 51, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !454, file: !445, line: 52, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !454, file: !445, line: 53, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !454, file: !445, line: 54, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !454, file: !445, line: 55, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !454, file: !445, line: 56, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !454, file: !445, line: 58, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !454, file: !445, line: 59, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !454, file: !445, line: 60, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !451, file: !445, line: 63, baseType: !135, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !446, file: !445, line: 901, baseType: !473, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !445, line: 125, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 104, size: 32, elements: !476)
!476 = !{!477, !495}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !475, file: !445, line: 123, baseType: !478, size: 32)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !445, line: 105, size: 32, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !478, file: !445, line: 106, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !478, file: !445, line: 107, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !478, file: !445, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !478, file: !445, line: 109, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !478, file: !445, line: 110, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !478, file: !445, line: 111, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !478, file: !445, line: 112, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !478, file: !445, line: 113, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !478, file: !445, line: 114, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !478, file: !445, line: 115, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !478, file: !445, line: 116, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !478, file: !445, line: 117, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !478, file: !445, line: 119, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !478, file: !445, line: 120, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !478, file: !445, line: 121, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !475, file: !445, line: 124, baseType: !135, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !446, file: !445, line: 902, baseType: !497, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !445, line: 186, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 165, size: 32, elements: !500)
!500 = !{!501, !521}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !499, file: !445, line: 184, baseType: !502, size: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !499, file: !445, line: 166, size: 32, elements: !503)
!503 = !{!504, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !502, file: !445, line: 167, baseType: !505, size: 1, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !502, file: !445, line: 168, baseType: !505, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !502, file: !445, line: 169, baseType: !505, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !502, file: !445, line: 170, baseType: !505, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !502, file: !445, line: 171, baseType: !505, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !502, file: !445, line: 172, baseType: !505, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !502, file: !445, line: 173, baseType: !505, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !502, file: !445, line: 174, baseType: !505, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !502, file: !445, line: 175, baseType: !505, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !502, file: !445, line: 176, baseType: !505, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !502, file: !445, line: 177, baseType: !505, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !502, file: !445, line: 178, baseType: !505, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !502, file: !445, line: 180, baseType: !505, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !502, file: !445, line: 181, baseType: !505, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !502, file: !445, line: 182, baseType: !505, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !499, file: !445, line: 185, baseType: !135, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !446, file: !445, line: 903, baseType: !523, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !445, line: 247, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 226, size: 32, elements: !527)
!527 = !{!528, !546}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !526, file: !445, line: 245, baseType: !529, size: 32)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !445, line: 227, size: 32, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !529, file: !445, line: 228, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !529, file: !445, line: 229, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !529, file: !445, line: 230, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !529, file: !445, line: 231, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !529, file: !445, line: 232, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !529, file: !445, line: 233, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !529, file: !445, line: 234, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !529, file: !445, line: 235, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !529, file: !445, line: 236, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !529, file: !445, line: 237, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !529, file: !445, line: 238, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !529, file: !445, line: 239, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !529, file: !445, line: 241, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !529, file: !445, line: 242, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !529, file: !445, line: 243, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !526, file: !445, line: 246, baseType: !135, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !446, file: !445, line: 904, baseType: !548, size: 16, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !445, line: 300, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 287, size: 16, elements: !551)
!551 = !{!552, !562}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !550, file: !445, line: 298, baseType: !553, size: 16)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !550, file: !445, line: 288, size: 16, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !553, file: !445, line: 290, baseType: !259, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !553, file: !445, line: 291, baseType: !259, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !553, file: !445, line: 293, baseType: !259, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !553, file: !445, line: 294, baseType: !259, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !553, file: !445, line: 295, baseType: !259, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !553, file: !445, line: 296, baseType: !259, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !553, file: !445, line: 297, baseType: !259, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !550, file: !445, line: 299, baseType: !259, size: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !446, file: !445, line: 905, baseType: !336, size: 16, offset: 144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !446, file: !445, line: 906, baseType: !565, size: 16, offset: 160)
!565 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !445, line: 352, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 336, size: 16, elements: !568)
!568 = !{!569, !581}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !567, file: !445, line: 350, baseType: !570, size: 16)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !567, file: !445, line: 337, size: 16, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !570, file: !445, line: 339, baseType: !259, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !570, file: !445, line: 340, baseType: !259, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !570, file: !445, line: 341, baseType: !259, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !570, file: !445, line: 342, baseType: !259, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !570, file: !445, line: 343, baseType: !259, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !570, file: !445, line: 344, baseType: !259, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !570, file: !445, line: 345, baseType: !259, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !570, file: !445, line: 346, baseType: !259, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !570, file: !445, line: 348, baseType: !259, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !567, file: !445, line: 351, baseType: !259, size: 16)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !446, file: !445, line: 907, baseType: !336, size: 16, offset: 176)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !446, file: !445, line: 908, baseType: !584, size: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !445, line: 398, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 381, size: 32, elements: !587)
!587 = !{!588, !599}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !586, file: !445, line: 396, baseType: !589, size: 32)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !586, file: !445, line: 382, size: 32, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !589, file: !445, line: 384, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !589, file: !445, line: 385, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !589, file: !445, line: 386, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !589, file: !445, line: 388, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !589, file: !445, line: 389, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !589, file: !445, line: 390, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !589, file: !445, line: 392, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !589, file: !445, line: 394, baseType: !135, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !586, file: !445, line: 397, baseType: !135, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !446, file: !445, line: 909, baseType: !601, size: 8, offset: 224)
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !445, line: 433, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 426, size: 8, elements: !604)
!604 = !{!605, !610}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !603, file: !445, line: 431, baseType: !606, size: 8)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !445, line: 427, size: 8, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !606, file: !445, line: 428, baseType: !117, size: 5, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !606, file: !445, line: 430, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !603, file: !445, line: 432, baseType: !117, size: 8)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !446, file: !445, line: 910, baseType: !380, size: 24, offset: 232)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !446, file: !445, line: 911, baseType: !613, size: 32, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !445, line: 462, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 448, size: 32, elements: !616)
!616 = !{!617, !626}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !615, file: !445, line: 460, baseType: !618, size: 32)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !445, line: 449, size: 32, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !618, file: !445, line: 451, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !618, file: !445, line: 453, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !618, file: !445, line: 454, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !618, file: !445, line: 455, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !618, file: !445, line: 457, baseType: !135, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !618, file: !445, line: 459, baseType: !135, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !615, file: !445, line: 461, baseType: !135, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !446, file: !445, line: 912, baseType: !628, size: 16, offset: 288)
!628 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !445, line: 520, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 503, size: 16, elements: !631)
!631 = !{!632, !646}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !630, file: !445, line: 518, baseType: !633, size: 16)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !630, file: !445, line: 504, size: 16, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !633, file: !445, line: 506, baseType: !259, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !633, file: !445, line: 507, baseType: !259, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !633, file: !445, line: 508, baseType: !259, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !633, file: !445, line: 509, baseType: !259, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !633, file: !445, line: 510, baseType: !259, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !633, file: !445, line: 511, baseType: !259, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !633, file: !445, line: 512, baseType: !259, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !633, file: !445, line: 513, baseType: !259, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !633, file: !445, line: 514, baseType: !259, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !633, file: !445, line: 515, baseType: !259, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !633, file: !445, line: 516, baseType: !259, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !630, file: !445, line: 519, baseType: !259, size: 16)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !446, file: !445, line: 913, baseType: !336, size: 16, offset: 304)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !446, file: !445, line: 914, baseType: !649, size: 32, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !445, line: 559, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 552, size: 32, elements: !652)
!652 = !{!653, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !651, file: !445, line: 557, baseType: !654, size: 32)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !651, file: !445, line: 553, size: 32, elements: !655)
!655 = !{!656, !657, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !654, file: !445, line: 554, baseType: !135, size: 10, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !654, file: !445, line: 555, baseType: !135, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !654, file: !445, line: 556, baseType: !135, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !651, file: !445, line: 558, baseType: !135, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !446, file: !445, line: 915, baseType: !661, size: 32, offset: 352)
!661 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !445, line: 585, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 578, size: 32, elements: !664)
!664 = !{!665, !671}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !663, file: !445, line: 583, baseType: !666, size: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !663, file: !445, line: 579, size: 32, elements: !667)
!667 = !{!668, !669, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !666, file: !445, line: 580, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !666, file: !445, line: 581, baseType: !135, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !666, file: !445, line: 582, baseType: !135, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !663, file: !445, line: 584, baseType: !135, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !446, file: !445, line: 916, baseType: !673, size: 8, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !445, line: 610, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 604, size: 8, elements: !676)
!676 = !{!677, !681}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !675, file: !445, line: 608, baseType: !678, size: 8)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !675, file: !445, line: 605, size: 8, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !678, file: !445, line: 607, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !675, file: !445, line: 609, baseType: !117, size: 8)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !446, file: !445, line: 917, baseType: !380, size: 24, offset: 392)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !446, file: !445, line: 918, baseType: !684, size: 32, offset: 416)
!684 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !445, line: 639, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 622, size: 32, elements: !687)
!687 = !{!688, !699}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !686, file: !445, line: 637, baseType: !689, size: 32)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !686, file: !445, line: 623, size: 32, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !689, file: !445, line: 625, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !689, file: !445, line: 626, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !689, file: !445, line: 627, baseType: !135, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !689, file: !445, line: 629, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !689, file: !445, line: 631, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !689, file: !445, line: 632, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !689, file: !445, line: 634, baseType: !135, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !689, file: !445, line: 635, baseType: !135, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !686, file: !445, line: 638, baseType: !135, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !446, file: !445, line: 919, baseType: !701, size: 32, offset: 448)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 32, elements: !148)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !446, file: !445, line: 920, baseType: !703, size: 16, offset: 480)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !445, line: 715, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 706, size: 16, elements: !706)
!706 = !{!707, !712}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !705, file: !445, line: 713, baseType: !708, size: 16)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !445, line: 707, size: 16, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !708, file: !445, line: 709, baseType: !259, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !708, file: !445, line: 711, baseType: !259, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !705, file: !445, line: 714, baseType: !259, size: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !446, file: !445, line: 921, baseType: !336, size: 16, offset: 496)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !446, file: !445, line: 922, baseType: !715, size: 32, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !445, line: 739, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 729, size: 32, elements: !718)
!718 = !{!719, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !717, file: !445, line: 737, baseType: !720, size: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !717, file: !445, line: 730, size: 32, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !720, file: !445, line: 732, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !720, file: !445, line: 733, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !720, file: !445, line: 735, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !717, file: !445, line: 738, baseType: !135, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !446, file: !445, line: 923, baseType: !727, size: 8, offset: 544)
!727 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !445, line: 765, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 756, size: 8, elements: !730)
!730 = !{!731, !737}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !729, file: !445, line: 763, baseType: !732, size: 8)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !729, file: !445, line: 757, size: 8, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !732, file: !445, line: 759, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !732, file: !445, line: 761, baseType: !117, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !732, file: !445, line: 762, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !729, file: !445, line: 764, baseType: !117, size: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !446, file: !445, line: 924, baseType: !380, size: 24, offset: 552)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !446, file: !445, line: 925, baseType: !740, size: 32, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !445, line: 789, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 781, size: 32, elements: !743)
!743 = !{!744, !749}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !742, file: !445, line: 787, baseType: !745, size: 32)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !445, line: 782, size: 32, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !745, file: !445, line: 783, baseType: !135, size: 12, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !745, file: !445, line: 785, baseType: !135, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !742, file: !445, line: 788, baseType: !135, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !446, file: !445, line: 926, baseType: !751, size: 32, offset: 608)
!751 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !445, line: 820, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 805, size: 32, elements: !754)
!754 = !{!755, !765}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !753, file: !445, line: 818, baseType: !756, size: 32)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !753, file: !445, line: 806, size: 32, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !756, file: !445, line: 807, baseType: !135, size: 2, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !756, file: !445, line: 808, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !756, file: !445, line: 809, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !756, file: !445, line: 810, baseType: !135, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !756, file: !445, line: 812, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !756, file: !445, line: 814, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !756, file: !445, line: 816, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !753, file: !445, line: 819, baseType: !135, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !446, file: !445, line: 927, baseType: !767, size: 8, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !445, line: 881, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !445, line: 872, size: 8, elements: !771)
!771 = !{!772, !779}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !770, file: !445, line: 879, baseType: !773, size: 8)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !770, file: !445, line: 873, size: 8, elements: !774)
!774 = !{!775, !776, !777, !778}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !773, file: !445, line: 874, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !773, file: !445, line: 875, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !773, file: !445, line: 876, baseType: !117, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !773, file: !445, line: 877, baseType: !117, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !770, file: !445, line: 880, baseType: !117, size: 8)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !783, line: 290, baseType: !784)
!783 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !783, line: 284, size: 96, elements: !785)
!785 = !{!786, !796, !807, !820, !837}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !784, file: !783, line: 285, baseType: !787, size: 8)
!787 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !783, line: 49, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !783, line: 43, size: 8, elements: !790)
!790 = !{!791, !795}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !789, file: !783, line: 47, baseType: !792, size: 8)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !789, file: !783, line: 44, size: 8, elements: !793)
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !792, file: !783, line: 45, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !789, file: !783, line: 48, baseType: !117, size: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !784, file: !783, line: 286, baseType: !797, size: 8, offset: 8)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !783, line: 67, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !783, line: 61, size: 8, elements: !801)
!801 = !{!802, !806}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !800, file: !783, line: 65, baseType: !803, size: 8)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !783, line: 62, size: 8, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !803, file: !783, line: 64, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !800, file: !783, line: 66, baseType: !117, size: 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !784, file: !783, line: 287, baseType: !808, size: 16, offset: 16)
!808 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !783, line: 89, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !783, line: 79, size: 16, elements: !811)
!811 = !{!812, !819}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !810, file: !783, line: 87, baseType: !813, size: 16)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !783, line: 80, size: 16, elements: !814)
!814 = !{!815, !816, !817, !818}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !813, file: !783, line: 81, baseType: !259, size: 6, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !813, file: !783, line: 83, baseType: !259, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !813, file: !783, line: 85, baseType: !259, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !813, file: !783, line: 86, baseType: !259, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !810, file: !783, line: 88, baseType: !259, size: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !784, file: !783, line: 288, baseType: !821, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !783, line: 214, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !783, line: 199, size: 32, elements: !824)
!824 = !{!825, !836}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !823, file: !783, line: 212, baseType: !826, size: 32)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !783, line: 200, size: 32, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !826, file: !783, line: 201, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !826, file: !783, line: 203, baseType: !135, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !826, file: !783, line: 205, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !826, file: !783, line: 206, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !826, file: !783, line: 207, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !826, file: !783, line: 208, baseType: !135, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !826, file: !783, line: 209, baseType: !135, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !826, file: !783, line: 210, baseType: !135, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !823, file: !783, line: 213, baseType: !135, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !784, file: !783, line: 289, baseType: !838, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !783, line: 268, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !783, line: 260, size: 32, elements: !841)
!841 = !{!842, !847}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !840, file: !783, line: 266, baseType: !843, size: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !783, line: 261, size: 32, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !843, file: !783, line: 262, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !843, file: !783, line: 264, baseType: !135, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !840, file: !783, line: 267, baseType: !135, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !850, line: 513, baseType: !851)
!850 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !850, line: 494, size: 480, elements: !852)
!852 = !{!853, !859, !869, !873, !883, !893, !903, !913, !917, !933, !949, !965, !995, !999, !1009, !1019, !1029, !1033}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !851, file: !850, line: 495, baseType: !854, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !850, line: 45, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !850, line: 43, size: 8, elements: !857)
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !856, file: !850, line: 44, baseType: !117, size: 8)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !851, file: !850, line: 496, baseType: !860, size: 8, offset: 8)
!860 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !850, line: 61, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !850, line: 55, size: 8, elements: !863)
!863 = !{!864, !868}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !862, file: !850, line: 59, baseType: !865, size: 8)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !862, file: !850, line: 56, size: 8, elements: !866)
!866 = !{!867}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !865, file: !850, line: 57, baseType: !117, size: 2, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !862, file: !850, line: 60, baseType: !117, size: 8)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !851, file: !850, line: 497, baseType: !870, size: 48, offset: 16)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 48, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 6)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !851, file: !850, line: 498, baseType: !874, size: 8, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !850, line: 86, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !850, line: 80, size: 8, elements: !877)
!877 = !{!878, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !876, file: !850, line: 84, baseType: !879, size: 8)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !876, file: !850, line: 81, size: 8, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !879, file: !850, line: 82, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !876, file: !850, line: 85, baseType: !117, size: 8)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !851, file: !850, line: 499, baseType: !884, size: 8, offset: 72)
!884 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !850, line: 121, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !850, line: 115, size: 8, elements: !887)
!887 = !{!888, !892}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !886, file: !850, line: 119, baseType: !889, size: 8)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !886, file: !850, line: 116, size: 8, elements: !890)
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !889, file: !850, line: 117, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !886, file: !850, line: 120, baseType: !117, size: 8)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !851, file: !850, line: 500, baseType: !894, size: 8, offset: 80)
!894 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !850, line: 156, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !850, line: 150, size: 8, elements: !897)
!897 = !{!898, !902}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !896, file: !850, line: 154, baseType: !899, size: 8)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !896, file: !850, line: 151, size: 8, elements: !900)
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !899, file: !850, line: 152, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !896, file: !850, line: 155, baseType: !117, size: 8)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !851, file: !850, line: 501, baseType: !904, size: 8, offset: 88)
!904 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !850, line: 191, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !850, line: 185, size: 8, elements: !907)
!907 = !{!908, !912}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !906, file: !850, line: 189, baseType: !909, size: 8)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !906, file: !850, line: 186, size: 8, elements: !910)
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !909, file: !850, line: 187, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !906, file: !850, line: 190, baseType: !117, size: 8)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !851, file: !850, line: 502, baseType: !914, size: 64, offset: 96)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 64, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 8)
